
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.64
 Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 00:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl aes_lib.vhd dual_mem.vhd aes_enc.vhd aes_fsm_enc.vhd

yosys> verific -vhdl aes_lib.vhd dual_mem.vhd aes_enc.vhd aes_fsm_enc.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 00:39:28 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'aes_lib.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_1164' from file '/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_1164.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.textio' from file '/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/textio.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_arith' from file '/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_arith.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_unsigned' from file '/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_unsigned.vdb'
VERIFIC-INFO [VHDL-1014] aes_lib.vhd:11: analyzing package 'aes_lib'
VERIFIC-INFO [VHDL-1013] aes_lib.vhd:25: analyzing package body 'aes_lib'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'dual_mem.vhd'
VERIFIC-INFO [VHDL-1012] dual_mem.vhd:20: analyzing entity 'dual_mem'
VERIFIC-INFO [VHDL-1010] dual_mem.vhd:33: analyzing architecture 'rtl'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'aes_enc.vhd'
VERIFIC-INFO [VHDL-1012] aes_enc.vhd:24: analyzing entity 'aes_enc'
VERIFIC-INFO [VHDL-1010] aes_enc.vhd:32: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'aes_fsm_enc.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.numeric_std' from file '/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/numeric_std.vdb'
VERIFIC-INFO [VHDL-1012] aes_fsm_enc.vhd:25: analyzing entity 'aes_fsm_enc'
VERIFIC-INFO [VHDL-1010] aes_fsm_enc.vhd:35: analyzing architecture 'behavioral'

yosys> synth_rs -top aes_fsm_enc -tech genesis -goal area -de -verilog synthesized.v

3. Executing synth_rs pass: v0.4.65

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top aes_fsm_enc

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] aes_fsm_enc.vhd:25: processing 'aes_fsm_enc(Behavioral)'
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:102: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:109: 'tmp' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:110: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:114: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:115: 'tmp' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:119: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:121: 'tmp' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:123: 'count' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:126: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:127: 'tmp' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1613] aes_fsm_enc.vhd:140: incomplete sensitivity list specified; assuming completeness
VERIFIC-INFO [VHDL-1067] aes_enc.vhd:24: processing 'aes_enc(Behavioral)'
VERIFIC-INFO [VHDL-1067] dual_mem.vhd:20: processing 'dual_mem(rtl)'
VERIFIC-INFO [VHDL-1754] dual_mem.vhd:36: extracting RAM for identifier 'RAM'
VERIFIC-INFO [VHDL-1067] dual_mem.vhd:20: processing 'dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl)'
VERIFIC-INFO [VHDL-1754] dual_mem.vhd:36: extracting RAM for identifier 'RAM'
Importing module aes_fsm_enc.
Importing module aes_enc(Behavioral).
Importing module dual_mem(rtl).
Importing module dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl).

3.4.1. Analyzing design hierarchy..
Top module:  \aes_fsm_enc
Used module:     \dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl)
Used module:     \aes_enc(Behavioral)
Used module:         \dual_mem(rtl)

3.4.2. Analyzing design hierarchy..
Top module:  \aes_fsm_enc
Used module:     \dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl)
Used module:     \aes_enc(Behavioral)
Used module:         \dual_mem(rtl)
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl).
Optimizing module dual_mem(rtl).
Optimizing module aes_enc(Behavioral).
Optimizing module aes_fsm_enc.
<suppressed ~6 debug messages>

yosys> demuxmap

3.6. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.7. Executing FLATTEN pass (flatten design).
Deleting now unused module aes_enc(Behavioral).
Deleting now unused module dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl).
Deleting now unused module dual_mem(rtl).
<suppressed ~26 debug messages>

yosys> demuxmap

3.8. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.9. Executing TRIBUF pass.

yosys> deminout

3.10. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~25 debug messages>

yosys> opt_clean

3.12. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 3 unused cells and 500 unused wires.
<suppressed ~182 debug messages>

yosys> check

3.13. Executing CHECK pass (checking for obvious problems).
Checking module aes_fsm_enc...
Found and reported 0 problems.

yosys> opt_expr

3.14. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~3 debug messages>

yosys> opt_merge -nomux

3.15. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~54 debug messages>
Removed a total of 18 cells.

yosys> opt_muxtree

3.16. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce

3.17. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.18. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.19. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.20. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$tmp_reg$aes_fsm_enc.vhd:148$97 ($aldff) from module aes_fsm_enc.
Changing const-value async load to async reset on $verific$state_reg$aes_fsm_enc.vhd:69$68 ($aldff) from module aes_fsm_enc.
Changing const-value async load to async reset on $verific$pos_cnt_reg$aes_fsm_enc.vhd:194$125 ($aldff) from module aes_fsm_enc.
Changing const-value async load to async reset on $verific$neg_cnt_reg$aes_fsm_enc.vhd:205$131 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $verific$count_reg$aes_fsm_enc.vhd:163$104 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\SUB_KEYS_DRAM.$verific$read_a_reg$dual_mem.vhd:52$468 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_8.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_8.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_7.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_7.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_6.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_6.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_5.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_5.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_4.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_4.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_3.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_3.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_2.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_2.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_1.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_1.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_8.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_8.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_7.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_7.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_6.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_6.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_5.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_5.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_4.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_4.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_3.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_3.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_2.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_2.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_1.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_1.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 1 unused cells and 3 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_muxtree

3.23. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce

3.24. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.25. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.26. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 2

yosys> fsm -encoding binary

3.30. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.30.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.30.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.30.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.30.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> fsm_opt

3.30.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.30.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.30.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.30.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.31. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.32. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.33. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce

3.34. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.35. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.36. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.37. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$tmp_reg$aes_fsm_enc.vhd:148$97 ($dff) from module aes_fsm_enc (D = \block_out, Q = \tmp).
Adding EN signal on $verific$count_reg$aes_fsm_enc.vhd:163$104 ($dff) from module aes_fsm_enc (D = $verific$n2772$53, Q = \count).

yosys> opt_clean

3.38. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 1 unused cells and 1 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.39. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~1 debug messages>
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.40. Executing WREDUCE pass (reducing word size of cells).
Removed top 2 bits (of 3) from port A of cell aes_fsm_enc.$verific$equal_66$aes_fsm_enc.vhd:145$94 ($eq).
Removed top 3 bits (of 4) from port B of cell aes_fsm_enc.$verific$add_74$aes_fsm_enc.vhd:160$100 ($add).
Removed top 1 bits (of 2) from port B of cell aes_fsm_enc.$verific$add_85$aes_fsm_enc.vhd:190$121 ($add).
Removed top 1 bits (of 2) from port B of cell aes_fsm_enc.$verific$add_94$aes_fsm_enc.vhd:201$128 ($add).

yosys> peepopt

3.41. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.42. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> demuxmap

3.43. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> stat

3.44. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                353
   Number of wire bits:           4165
   Number of public wires:         285
   Number of public wire bits:    3614
   Number of memories:              25
   Number of memory bits:        50432
   Number of processes:              0
   Number of cells:                188
     $add                            3
     $adff                           3
     $and                            1
     $bmux                           6
     $dff                           33
     $dffe                           2
     $eq                             4
     $memrd_v2                      49
     $memwr_v2                      25
     $mux                            9
     $ne                             2
     $reduce_bool                    1
     $xor                           50


yosys> wreduce t:$mul

3.45. Executing WREDUCE pass (reducing word size of cells).

yosys> rs_dsp_macc

3.46. Executing RS_DSP_MACC pass.

yosys> techmap -map +/mul2dsp.v -D DSP_A_MAXWIDTH=20 -D DSP_B_MAXWIDTH=18 -D DSP_A_MINWIDTH=11 -D DSP_B_MINWIDTH=10 -D DSP_NAME=$__RS_MUL20X18

3.47. Executing TECHMAP pass (map to technology primitives).

3.47.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

3.47.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/mul2dsp.v -D DSP_A_MAXWIDTH=10 -D DSP_B_MAXWIDTH=9 -D DSP_A_MINWIDTH=4 -D DSP_B_MINWIDTH=4 -D DSP_NAME=$__RS_MUL10X9

3.48. Executing TECHMAP pass (map to technology primitives).

3.48.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

3.48.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/rapidsilicon/genesis/dsp_map.v -D USE_DSP_CFG_PARAMS=0

3.49. Executing TECHMAP pass (map to technology primitives).

3.49.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_MUL20X18'.
Generating RTLIL representation for module `\$__RS_MUL10X9'.
Successfully finished Verilog frontend.

3.49.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> rs_dsp_simd

3.50. Executing RS_DSP_SIMD pass.

yosys> techmap -map +/rapidsilicon/genesis/dsp_final_map.v

3.51. Executing TECHMAP pass (map to technology primitives).

3.51.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_final_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_final_map.v' to AST representation.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Successfully finished Verilog frontend.

3.51.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~6 debug messages>

yosys> rs_dsp_io_regs

3.52. Executing RS_DSP_IO_REGS pass.

yosys> alumacc

3.53. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module aes_fsm_enc:
  creating $macc model for $verific$add_74$aes_fsm_enc.vhd:160$100 ($add).
  creating $macc model for $verific$add_85$aes_fsm_enc.vhd:190$121 ($add).
  creating $macc model for $verific$add_94$aes_fsm_enc.vhd:201$128 ($add).
  creating $alu model for $macc $verific$add_94$aes_fsm_enc.vhd:201$128.
  creating $alu model for $macc $verific$add_85$aes_fsm_enc.vhd:190$121.
  creating $alu model for $macc $verific$add_74$aes_fsm_enc.vhd:160$100.
  creating $alu cell for $verific$add_74$aes_fsm_enc.vhd:160$100: $auto$alumacc.cc:485:replace_alu$480
  creating $alu cell for $verific$add_85$aes_fsm_enc.vhd:190$121: $auto$alumacc.cc:485:replace_alu$483
  creating $alu cell for $verific$add_94$aes_fsm_enc.vhd:201$128: $auto$alumacc.cc:485:replace_alu$486
  created 3 $alu and 0 $macc cells.

yosys> opt_expr

3.54. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.55. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.56. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~7 debug messages>

yosys> opt_reduce

3.57. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.58. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.59. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.60. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.61. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.62. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 1

yosys> stat

3.63. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                359
   Number of wire bits:           4181
   Number of public wires:         285
   Number of public wire bits:    3614
   Number of memories:              25
   Number of memory bits:        50432
   Number of processes:              0
   Number of cells:                188
     $adff                           3
     $alu                            3
     $and                            1
     $bmux                           6
     $dff                           33
     $dffe                           2
     $eq                             4
     $memrd_v2                      49
     $memwr_v2                      25
     $mux                            9
     $ne                             2
     $reduce_bool                    1
     $xor                           50


yosys> memory -nomap

3.64. Executing MEMORY pass.

yosys> opt_mem

3.64.1. Executing OPT_MEM pass (optimize memories).
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 7
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 0
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 1
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 2
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 3
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 4
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 5
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 6
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 7
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 8
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 9
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 10
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 11
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 12
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 13
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 14
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 15
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 16
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 17
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 18
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 19
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 20
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 21
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 22
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 23
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 24
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 25
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 26
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 27
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 28
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 29
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 30
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 31
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 32
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 33
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 34
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 35
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 36
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 37
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 38
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 39
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 40
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 41
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 42
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 43
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 44
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 45
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 46
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 47
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 48
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 49
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 50
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 51
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 52
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 53
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 54
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 55
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 56
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 57
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 58
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 59
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 60
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 61
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 62
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 63
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 64
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 65
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 66
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 67
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 68
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 69
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 70
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 71
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 72
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 73
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 74
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 75
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 76
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 77
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 78
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 79
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 80
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 81
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 82
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 83
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 84
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 85
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 86
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 87
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 88
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 89
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 90
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 91
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 92
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 93
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 94
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 95
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 96
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 97
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 98
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 99
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 100
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 101
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 102
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 103
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 104
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 105
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 106
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 107
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 108
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 109
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 110
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 111
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 112
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 113
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 114
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 115
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 116
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 117
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 118
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 119
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 120
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 121
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 122
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 123
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 124
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 125
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 126
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 127
Performed a total of 50 transformations.

yosys> opt_mem_priority

3.64.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.64.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.64.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.64.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `$auto$memory_bmux2rom.cc:63:execute$492'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$489'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$492'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$489'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.

yosys> opt_clean

3.64.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 37 unused cells and 70 unused wires.
<suppressed ~106 debug messages>

yosys> memory_share

3.64.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.64.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.64.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> memory_collect

3.64.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.65. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                289
   Number of wire bits:           3152
   Number of public wires:         217
   Number of public wire bits:    2714
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 77
     $adff                           3
     $alu                            3
     $and                            1
     $bmux                           3
     $dffe                           1
     $eq                             3
     $mem_v2                         2
     $mux                            9
     $ne                             2
     $reduce_bool                    1
     $xor                           49


yosys> muxpack

3.66. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~9 debug messages>

yosys> opt_clean

3.67. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> memory_bram -rules +/rapidsilicon/genesis/brams.txt

3.68. Executing MEMORY_BRAM pass (mapping $mem cells to block memories).
Processing aes_fsm_enc.$auto$memory_bmux2rom.cc:63:execute$489:
  Properties: ports=1 bits=8 rports=1 wports=0 dbits=1 abits=3 words=8
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 1):
    Bram geometry: abits=10 dbits=36 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=1016 dwaste=35 bwaste=36856 waste=36856 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 1) rejected: requirement 'min bits 128' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 2):
    Bram geometry: abits=11 dbits=18 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=2040 dwaste=17 bwaste=36856 waste=36856 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 2) rejected: requirement 'min bits 128' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 3):
    Bram geometry: abits=12 dbits=9 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=4088 dwaste=8 bwaste=36856 waste=36856 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 3) rejected: requirement 'min bits 128' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 4):
    Bram geometry: abits=13 dbits=4 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=8184 dwaste=3 bwaste=32760 waste=32760 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 4) rejected: requirement 'min bits 128' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 5):
    Bram geometry: abits=14 dbits=2 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=16376 dwaste=1 bwaste=32760 waste=32760 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 5) rejected: requirement 'min bits 128' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 6):
    Bram geometry: abits=15 dbits=1 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=32760 dwaste=0 bwaste=32760 waste=32760 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 6) rejected: requirement 'min bits 128' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 1):
    Bram geometry: abits=10 dbits=36 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=1016 dwaste=35 bwaste=36856 waste=36856 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 1) rejected: requirement 'min bits 128' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 2):
    Bram geometry: abits=11 dbits=18 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=2040 dwaste=17 bwaste=36856 waste=36856 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 2) rejected: requirement 'min bits 128' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 3):
    Bram geometry: abits=12 dbits=9 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=4088 dwaste=8 bwaste=36856 waste=36856 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 3) rejected: requirement 'min bits 128' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 4):
    Bram geometry: abits=13 dbits=4 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=8184 dwaste=3 bwaste=32760 waste=32760 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 4) rejected: requirement 'min bits 128' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 5):
    Bram geometry: abits=14 dbits=2 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=16376 dwaste=1 bwaste=32760 waste=32760 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 5) rejected: requirement 'min bits 128' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 6):
    Bram geometry: abits=15 dbits=1 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=32760 dwaste=0 bwaste=32760 waste=32760 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 6) rejected: requirement 'min bits 128' not met.
  No acceptable bram resources found.
Processing aes_fsm_enc.$auto$memory_bmux2rom.cc:63:execute$492:
  Properties: ports=1 bits=8 rports=1 wports=0 dbits=1 abits=3 words=8
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 1):
    Bram geometry: abits=10 dbits=36 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=1016 dwaste=35 bwaste=36856 waste=36856 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 1) rejected: requirement 'min bits 128' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 2):
    Bram geometry: abits=11 dbits=18 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=2040 dwaste=17 bwaste=36856 waste=36856 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 2) rejected: requirement 'min bits 128' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 3):
    Bram geometry: abits=12 dbits=9 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=4088 dwaste=8 bwaste=36856 waste=36856 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 3) rejected: requirement 'min bits 128' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 4):
    Bram geometry: abits=13 dbits=4 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=8184 dwaste=3 bwaste=32760 waste=32760 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 4) rejected: requirement 'min bits 128' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 5):
    Bram geometry: abits=14 dbits=2 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=16376 dwaste=1 bwaste=32760 waste=32760 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 5) rejected: requirement 'min bits 128' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 6):
    Bram geometry: abits=15 dbits=1 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=32760 dwaste=0 bwaste=32760 waste=32760 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 6) rejected: requirement 'min bits 128' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 1):
    Bram geometry: abits=10 dbits=36 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=1016 dwaste=35 bwaste=36856 waste=36856 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 1) rejected: requirement 'min bits 128' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 2):
    Bram geometry: abits=11 dbits=18 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=2040 dwaste=17 bwaste=36856 waste=36856 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 2) rejected: requirement 'min bits 128' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 3):
    Bram geometry: abits=12 dbits=9 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=4088 dwaste=8 bwaste=36856 waste=36856 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 3) rejected: requirement 'min bits 128' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 4):
    Bram geometry: abits=13 dbits=4 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=8184 dwaste=3 bwaste=32760 waste=32760 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 4) rejected: requirement 'min bits 128' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 5):
    Bram geometry: abits=14 dbits=2 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=16376 dwaste=1 bwaste=32760 waste=32760 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 5) rejected: requirement 'min bits 128' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 6):
    Bram geometry: abits=15 dbits=1 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=32760 dwaste=0 bwaste=32760 waste=32760 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 6) rejected: requirement 'min bits 128' not met.
  No acceptable bram resources found.

yosys> techmap -map +/rapidsilicon/genesis/brams_map.v

3.69. Executing TECHMAP pass (map to technology primitives).

3.69.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/brams_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/brams_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_TDP'.
/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/brams_map.v:236: Warning: Range [2:0] select out of bounds on signal `\DOP': Setting 1 MSB bits to undef.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_SDP'.
Successfully finished Verilog frontend.

3.69.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~5 debug messages>

yosys> pmuxtree

3.70. Executing PMUXTREE pass.

yosys> muxpack

3.71. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~9 debug messages>

yosys> memory_map

3.72. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory $auto$memory_bmux2rom.cc:63:execute$489 in module \aes_fsm_enc:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$492 in module \aes_fsm_enc:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.

yosys> stat

3.73. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                349
   Number of wire bits:           3212
   Number of public wires:         217
   Number of public wire bits:    2714
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                105
     $adff                           3
     $alu                            3
     $and                            1
     $bmux                           3
     $dff                           16
     $dffe                           1
     $eq                             3
     $mux                           23
     $ne                             2
     $reduce_bool                    1
     $xor                           49


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.74. Executing TECHMAP pass (map to technology primitives).

3.74.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.74.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.74.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $bmux.
Using template $paramod$32a7b7b86c07519b7537abc18e96f0331f97914d\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $dffe.
Using template $paramod$175e67c02b86e96b1288b9dc100122520d7240d8\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $pos.
Using extmapper simplemap for cells of type $not.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~643 debug messages>

yosys> stat

3.75. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                459
   Number of wire bits:           7593
   Number of public wires:         217
   Number of public wire bits:    2714
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1714
     $_AND_                         19
     $_DFFE_NP_                      4
     $_DFF_NP0_                      2
     $_DFF_PP0_                      5
     $_DFF_P_                       16
     $_MUX_                       1097
     $_NOT_                         11
     $_OR_                          17
     $_XOR_                        543


yosys> opt_expr

3.76. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~721 debug messages>

yosys> opt_merge -nomux

3.77. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~2718 debug messages>
Removed a total of 906 cells.

yosys> opt_muxtree

3.78. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.79. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.80. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.81. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.82. Executing OPT_DFF pass (perform DFF optimizations).
Handling const CLK on $auto$ff.cc:262:slice$1741 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1733 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1730 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1729 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1726 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1720 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1717 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1716 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1715 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1731 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1728 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1727 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1719 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1718 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1734 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1735 ($_DFF_P_) from module aes_fsm_enc (removing D path).

yosys> opt_clean

3.83. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 8 unused cells and 211 unused wires.
<suppressed ~9 debug messages>

yosys> opt_expr

3.84. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~8 debug messages>

yosys> opt_muxtree

3.85. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.86. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.87. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_share

3.88. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.89. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.90. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 10 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.91. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_muxtree

3.92. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.93. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.94. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.95. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.96. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.97. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.98. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 3

yosys> opt_expr -full

3.99. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~26 debug messages>

yosys> techmap -map +/techmap.v

3.100. Executing TECHMAP pass (map to technology primitives).

3.100.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.100.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.101. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.102. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.103. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.104. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.105. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.106. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.107. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.108. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 1

yosys> abc -dff

3.109. Executing ABC pass (technology mapping using ABC).

3.109.1. Summary of detected clock domains:
  24 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  8 cells in clk=!\clk, en={ }, arst=\rst_cnt, srst={ }
  8 cells in clk=\clk, en={ }, arst=\rst_cnt, srst={ }
  23 cells in clk=!$verific$n3875$14, en=$auto$opt_dff.cc:194:make_patterns_logic$478, arst={ }, srst={ }

3.109.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 24 gates and 29 wires to a netlist network with 3 inputs and 4 outputs.

3.109.2.1. Executing ABC.

3.109.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \clk, asynchronously reset by $abc$2560$rst_cnt
Extracted 8 gates and 8 wires to a netlist network with 0 inputs and 1 outputs.

3.109.3.1. Executing ABC.

3.109.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$2560$rst_cnt
Extracted 8 gates and 8 wires to a netlist network with 0 inputs and 1 outputs.

3.109.4.1. Executing ABC.

3.109.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: $verific$n3875$14, enabled by $auto$opt_dff.cc:194:make_patterns_logic$478
Extracted 23 gates and 29 wires to a netlist network with 5 inputs and 4 outputs.

3.109.5.1. Executing ABC.

yosys> abc -dff

3.110. Executing ABC pass (technology mapping using ABC).

3.110.1. Summary of detected clock domains:
  5 cells in clk=!\clk, en={ }, arst=$abc$2560$rst_cnt, srst={ }
  4 cells in clk=\clk, en={ }, arst=$abc$2560$rst_cnt, srst={ }
  20 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  21 cells in clk=!$verific$n3875$14, en=$abc$2595$auto$opt_dff.cc:194:make_patterns_logic$478, arst={ }, srst={ }

3.110.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \clk, asynchronously reset by $abc$2560$rst_cnt
Extracted 5 gates and 7 wires to a netlist network with 2 inputs and 2 outputs.

3.110.2.1. Executing ABC.

3.110.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$2616$abc$2560$rst_cnt
Extracted 4 gates and 4 wires to a netlist network with 0 inputs and 1 outputs.

3.110.3.1. Executing ABC.

3.110.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 20 gates and 24 wires to a netlist network with 4 inputs and 5 outputs.

3.110.4.1. Executing ABC.

3.110.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: $abc$2595$verific$n3875$14, enabled by $abc$2595$auto$opt_dff.cc:194:make_patterns_logic$478
Extracted 21 gates and 26 wires to a netlist network with 5 inputs and 4 outputs.

3.110.5.1. Executing ABC.

yosys> abc -dff

3.111. Executing ABC pass (technology mapping using ABC).

3.111.1. Summary of detected clock domains:
  4 cells in clk=\clk, en={ }, arst=$abc$2616$abc$2560$rst_cnt, srst={ }
  4 cells in clk=!\clk, en={ }, arst=$abc$2616$abc$2560$rst_cnt, srst={ }
  20 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  21 cells in clk=!$abc$2595$verific$n3875$14, en=$abc$2651$abc$2595$auto$opt_dff.cc:194:make_patterns_logic$478, arst={ }, srst={ }

3.111.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$2616$abc$2560$rst_cnt
Extracted 4 gates and 4 wires to a netlist network with 0 inputs and 1 outputs.

3.111.2.1. Executing ABC.

3.111.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \clk, asynchronously reset by $abc$2616$abc$2560$rst_cnt
Extracted 4 gates and 4 wires to a netlist network with 0 inputs and 1 outputs.

3.111.3.1. Executing ABC.

3.111.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 20 gates and 23 wires to a netlist network with 3 inputs and 4 outputs.

3.111.4.1. Executing ABC.

3.111.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: $abc$2651$abc$2595$verific$n3875$14, enabled by $abc$2651$abc$2595$auto$opt_dff.cc:194:make_patterns_logic$478
Extracted 21 gates and 26 wires to a netlist network with 5 inputs and 4 outputs.

3.111.5.1. Executing ABC.

yosys> abc -dff

3.112. Executing ABC pass (technology mapping using ABC).

3.112.1. Summary of detected clock domains:
  20 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  4 cells in clk=\clk, en={ }, arst=$abc$2684$abc$2616$abc$2560$rst_cnt, srst={ }
  5 cells in clk=!\clk, en={ }, arst=$abc$2684$abc$2616$abc$2560$rst_cnt, srst={ }
  20 cells in clk=!$abc$2651$abc$2595$verific$n3875$14, en=$abc$2706$abc$2651$abc$2595$auto$opt_dff.cc:194:make_patterns_logic$478, arst={ }, srst={ }

3.112.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 20 gates and 24 wires to a netlist network with 4 inputs and 5 outputs.

3.112.2.1. Executing ABC.

3.112.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$2684$abc$2616$abc$2560$rst_cnt
Extracted 4 gates and 4 wires to a netlist network with 0 inputs and 1 outputs.

3.112.3.1. Executing ABC.

3.112.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \clk, asynchronously reset by $abc$2684$abc$2616$abc$2560$rst_cnt
Extracted 5 gates and 7 wires to a netlist network with 2 inputs and 2 outputs.

3.112.4.1. Executing ABC.

3.112.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: $abc$2706$abc$2651$abc$2595$verific$n3875$14, enabled by $abc$2706$abc$2651$abc$2595$auto$opt_dff.cc:194:make_patterns_logic$478
Extracted 20 gates and 25 wires to a netlist network with 5 inputs and 4 outputs.

3.112.5.1. Executing ABC.

yosys> opt_ffinv

3.113. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.115. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.116. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.117. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.118. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.119. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.120. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.121. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 241 unused wires.
<suppressed ~11 debug messages>

yosys> opt_expr

3.122. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.123. Executing BMUXMAP pass.

yosys> demuxmap

3.124. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_84DXEd/abc_tmp_1.scr

3.125. Executing ABC pass (technology mapping using ABC).

3.125.1. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Extracted 38 gates and 50 wires to a netlist network with 12 inputs and 13 outputs.

3.125.1.1. Executing ABC.
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.54  [   0.16 sec. at Pass 0]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.54  [   0.14 sec. at Pass 1]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.54  [   0.26 sec. at Pass 2]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.54  [   0.57 sec. at Pass 3]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.54  [   0.30 sec. at Pass 4]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.54  [   0.80 sec. at Pass 5]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.54  [   0.92 sec. at Pass 6]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.54  [   0.45 sec. at Pass 7]

yosys> opt_expr

3.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.127. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.128. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.129. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.130. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.131. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.132. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.133. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 50 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.134. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.135. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.136. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                230
   Number of wire bits:           2706
   Number of public wires:         207
   Number of public wire bits:    2683
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 25
     $_DFFE_NP_                      4
     $_DFF_NP0_                      2
     $_DFF_PP0_                      5
     $lut                           14


yosys> shregmap -minlen 8 -maxlen 20

3.137. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.138. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.139. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                230
   Number of wire bits:           2706
   Number of public wires:         207
   Number of public wire bits:    2683
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 25
     $_DFFE_NP0P_                    4
     $_DFF_NP0_                      2
     $_DFF_PP0_                      5
     $lut                           14


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.140. Executing TECHMAP pass (map to technology primitives).

3.140.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.140.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.140.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template $paramod\$_DFFE_NP0P_\_TECHMAP_WIREINIT_Q_=1'x for cells of type $_DFFE_NP0P_.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using template $paramod\$_DFF_NP0_\_TECHMAP_WIREINIT_Q_=1'x for cells of type $_DFF_NP0_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~194 debug messages>

yosys> opt_expr -mux_undef

3.141. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~155 debug messages>

yosys> simplemap

3.142. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.143. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge

3.144. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~42 debug messages>
Removed a total of 14 cells.

yosys> opt_dff -nodffe -nosdff

3.145. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.146. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 81 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.147. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.148. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.149. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.150. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.151. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.152. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.153. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.154. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.155. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_84DXEd/abc_tmp_2.scr

3.156. Executing ABC pass (technology mapping using ABC).

3.156.1. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Extracted 55 gates and 70 wires to a netlist network with 13 inputs and 14 outputs.

3.156.1.1. Executing ABC.
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.43  [   0.05 sec. at Pass 0]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.43  [   0.22 sec. at Pass 1]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.43  [   0.24 sec. at Pass 2]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.43  [   0.09 sec. at Pass 3]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.43  [   0.25 sec. at Pass 4]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.43  [   0.17 sec. at Pass 5]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.43  [   0.60 sec. at Pass 6]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.43  [   0.42 sec. at Pass 7]

yosys> opt_expr

3.157. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.158. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.159. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.160. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.161. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.162. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.163. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.164. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 56 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.165. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.166. Executing HIERARCHY pass (managing design hierarchy).

3.166.1. Analyzing design hierarchy..
Top module:  \aes_fsm_enc

3.166.2. Analyzing design hierarchy..
Top module:  \aes_fsm_enc
Removed 0 unused modules.

yosys> stat

3.167. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                230
   Number of wire bits:           2706
   Number of public wires:         205
   Number of public wire bits:    2681
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 26
     $lut                           15
     dffnsre                         6
     dffsre                          5


yosys> opt_clean -purge

3.168. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 198 unused wires.
<suppressed ~198 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.169. Executing Verilog backend.
Dumping module `\aes_fsm_enc'.

Warnings: 12 unique messages, 12 total
End of script. Logfile hash: 1befea0830, CPU: user 0.97s system 0.05s, MEM: 40.00 MB peak
Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)
Time spent: 96% 6x abc (24 sec), 0% 30x opt_expr (0 sec), ...
real 14.08
user 18.67
sys 6.99
