
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.47
 Yosys 0.18+10 (git sha1 8217e4c48, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl aes_lib.vhd dual_mem.vhd aes_enc.vhd aes_fsm_enc.vhd

yosys> verific -vhdl aes_lib.vhd dual_mem.vhd aes_enc.vhd aes_fsm_enc.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'aes_lib.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_1164' from file '/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_1164.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.textio' from file '/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/textio.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_arith' from file '/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_arith.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_unsigned' from file '/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_unsigned.vdb'
VERIFIC-INFO [VHDL-1014] aes_lib.vhd:11: analyzing package 'aes_lib'
VERIFIC-INFO [VHDL-1013] aes_lib.vhd:25: analyzing package body 'aes_lib'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'dual_mem.vhd'
VERIFIC-INFO [VHDL-1012] dual_mem.vhd:20: analyzing entity 'dual_mem'
VERIFIC-INFO [VHDL-1010] dual_mem.vhd:33: analyzing architecture 'rtl'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'aes_enc.vhd'
VERIFIC-INFO [VHDL-1012] aes_enc.vhd:24: analyzing entity 'aes_enc'
VERIFIC-INFO [VHDL-1010] aes_enc.vhd:32: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'aes_fsm_enc.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.numeric_std' from file '/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/numeric_std.vdb'
VERIFIC-INFO [VHDL-1012] aes_fsm_enc.vhd:25: analyzing entity 'aes_fsm_enc'
VERIFIC-INFO [VHDL-1010] aes_fsm_enc.vhd:35: analyzing architecture 'behavioral'

yosys> synth_rs -top aes_fsm_enc -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.57

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top aes_fsm_enc

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] aes_fsm_enc.vhd:25: processing 'aes_fsm_enc(Behavioral)'
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:102: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:109: 'tmp' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:110: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:114: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:115: 'tmp' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:119: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:121: 'tmp' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:123: 'count' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:126: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:127: 'tmp' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1613] aes_fsm_enc.vhd:140: incomplete sensitivity list specified; assuming completeness
VERIFIC-INFO [VHDL-1067] aes_enc.vhd:24: processing 'aes_enc(Behavioral)'
VERIFIC-INFO [VHDL-1067] dual_mem.vhd:20: processing 'dual_mem(rtl)'
VERIFIC-INFO [VHDL-1754] dual_mem.vhd:36: extracting RAM for identifier 'RAM'
VERIFIC-INFO [VHDL-1067] dual_mem.vhd:20: processing 'dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl)'
VERIFIC-INFO [VHDL-1754] dual_mem.vhd:36: extracting RAM for identifier 'RAM'
Importing module aes_fsm_enc.
Importing module aes_enc(Behavioral).
Importing module dual_mem(rtl).
Importing module dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl).

3.3.1. Analyzing design hierarchy..
Top module:  \aes_fsm_enc
Used module:     \dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl)
Used module:     \aes_enc(Behavioral)
Used module:         \dual_mem(rtl)

3.3.2. Analyzing design hierarchy..
Top module:  \aes_fsm_enc
Used module:     \dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl)
Used module:     \aes_enc(Behavioral)
Used module:         \dual_mem(rtl)
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl).
Optimizing module dual_mem(rtl).
Optimizing module aes_enc(Behavioral).
Optimizing module aes_fsm_enc.
<suppressed ~6 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl).
Deleting now unused module dual_mem(rtl).
Deleting now unused module aes_enc(Behavioral).
<suppressed ~26 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~25 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 3 unused cells and 500 unused wires.
<suppressed ~182 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module aes_fsm_enc...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~3 debug messages>

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~54 debug messages>
Removed a total of 18 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$tmp_reg$aes_fsm_enc.vhd:148$97 ($aldff) from module aes_fsm_enc.
Changing const-value async load to async reset on $verific$state_reg$aes_fsm_enc.vhd:69$68 ($aldff) from module aes_fsm_enc.
Changing const-value async load to async reset on $verific$pos_cnt_reg$aes_fsm_enc.vhd:194$125 ($aldff) from module aes_fsm_enc.
Changing const-value async load to async reset on $verific$neg_cnt_reg$aes_fsm_enc.vhd:205$131 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $verific$count_reg$aes_fsm_enc.vhd:163$104 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\SUB_KEYS_DRAM.$verific$read_a_reg$dual_mem.vhd:52$468 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_8.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_8.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_7.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_7.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_6.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_6.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_5.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_5.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_4.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_4.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_3.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_3.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_2.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_2.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_1.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_1.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_8.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_8.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_7.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_7.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_6.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_6.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_5.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_5.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_4.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_4.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_3.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_3.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_2.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_2.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_1.$verific$read_dpra_reg$dual_mem.vhd:52$444 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\GF_MULT_2_1.$verific$read_a_reg$dual_mem.vhd:52$443 ($aldff) from module aes_fsm_enc.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 1 unused cells and 3 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$tmp_reg$aes_fsm_enc.vhd:148$97 ($dff) from module aes_fsm_enc (D = \block_out, Q = \tmp).
Adding SRST signal on $verific$count_reg$aes_fsm_enc.vhd:163$104 ($dff) from module aes_fsm_enc (D = $verific$n2773$52, Q = \count, rval = 4'0000).
Adding EN signal on $auto$ff.cc:262:slice$477 ($sdff) from module aes_fsm_enc (D = $verific$n2768$51, Q = \count).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 3 unused cells and 3 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~7 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.13.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 2 bits (of 3) from port A of cell aes_fsm_enc.$verific$equal_70$aes_fsm_enc.vhd:145$94 ($eq).
Removed top 3 bits (of 4) from port B of cell aes_fsm_enc.$verific$add_80$aes_fsm_enc.vhd:160$100 ($add).
Removed top 1 bits (of 2) from port B of cell aes_fsm_enc.$verific$add_93$aes_fsm_enc.vhd:190$121 ($add).
Removed top 1 bits (of 2) from port B of cell aes_fsm_enc.$verific$add_103$aes_fsm_enc.vhd:201$128 ($add).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module aes_fsm_enc:
  creating $macc model for $verific$add_103$aes_fsm_enc.vhd:201$128 ($add).
  creating $macc model for $verific$add_80$aes_fsm_enc.vhd:160$100 ($add).
  creating $macc model for $verific$add_93$aes_fsm_enc.vhd:190$121 ($add).
  creating $alu model for $macc $verific$add_93$aes_fsm_enc.vhd:190$121.
  creating $alu model for $macc $verific$add_80$aes_fsm_enc.vhd:160$100.
  creating $alu model for $macc $verific$add_103$aes_fsm_enc.vhd:201$128.
  creating $alu cell for $verific$add_103$aes_fsm_enc.vhd:201$128: $auto$alumacc.cc:485:replace_alu$479
  creating $alu cell for $verific$add_80$aes_fsm_enc.vhd:160$100: $auto$alumacc.cc:485:replace_alu$482
  creating $alu cell for $verific$add_93$aes_fsm_enc.vhd:190$121: $auto$alumacc.cc:485:replace_alu$485
  created 3 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~7 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                356
   Number of wire bits:           4172
   Number of public wires:         285
   Number of public wire bits:    3614
   Number of memories:              25
   Number of memory bits:        50432
   Number of processes:              0
   Number of cells:                185
     $adff                           3
     $alu                            3
     $and                            1
     $bmux                           6
     $dff                           33
     $dffe                           1
     $eq                             4
     $memrd                         49
     $memwr                         25
     $mux                            7
     $ne                             2
     $sdffe                          1
     $xor                           50


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_1.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_2.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_3.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_4.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_5.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_6.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_7.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_2_8.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_1.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_2.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_3.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_4.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_5.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_6.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_7.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.GF_MULT_3_8.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_3.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_4.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_5.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_6.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_7.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_8.RAM: removing const-x lane 7
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 0
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 1
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 2
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 3
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 4
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 5
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 6
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 7
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 8
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 9
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 10
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 11
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 12
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 13
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 14
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 15
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 16
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 17
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 18
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 19
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 20
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 21
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 22
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 23
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 24
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 25
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 26
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 27
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 28
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 29
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 30
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 31
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 32
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 33
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 34
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 35
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 36
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 37
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 38
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 39
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 40
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 41
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 42
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 43
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 44
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 45
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 46
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 47
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 48
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 49
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 50
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 51
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 52
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 53
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 54
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 55
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 56
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 57
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 58
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 59
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 60
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 61
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 62
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 63
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 64
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 65
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 66
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 67
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 68
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 69
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 70
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 71
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 72
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 73
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 74
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 75
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 76
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 77
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 78
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 79
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 80
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 81
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 82
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 83
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 84
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 85
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 86
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 87
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 88
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 89
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 90
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 91
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 92
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 93
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 94
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 95
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 96
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 97
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 98
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 99
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 100
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 101
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 102
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 103
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 104
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 105
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 106
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 107
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 108
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 109
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 110
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 111
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 112
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 113
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 114
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 115
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 116
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 117
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 118
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 119
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 120
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 121
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 122
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 123
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 124
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 125
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 126
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 127
Performed a total of 50 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.21.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.21.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `$auto$memory_bmux2rom.cc:63:execute$491'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$488'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$491'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$488'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.

yosys> opt_clean

3.21.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 37 unused cells and 70 unused wires.
<suppressed ~106 debug messages>

yosys> memory_share

3.21.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> memory_collect

3.21.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                286
   Number of wire bits:           3143
   Number of public wires:         217
   Number of public wire bits:    2714
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 74
     $adff                           3
     $alu                            3
     $and                            1
     $bmux                           3
     $eq                             3
     $mem_v2                         2
     $mux                            7
     $ne                             2
     $sdffe                          1
     $xor                           49


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> stat

3.24. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                286
   Number of wire bits:           3143
   Number of public wires:         217
   Number of public wire bits:    2714
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 74
     $adff                           3
     $alu                            3
     $and                            1
     $bmux                           3
     $eq                             3
     $mem_v2                         2
     $mux                            7
     $ne                             2
     $sdffe                          1
     $xor                           49


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using template $paramod$175e67c02b86e96b1288b9dc100122520d7240d8\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $sdffe.
Using template $paramod$32a7b7b86c07519b7537abc18e96f0331f97914d\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~610 debug messages>

yosys> stat

3.26. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                395
   Number of wire bits:           7523
   Number of public wires:         217
   Number of public wire bits:    2714
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1677
     $_AND_                         19
     $_DFF_NP0_                      2
     $_DFF_PP0_                      5
     $_MUX_                       1075
     $_NOT_                         11
     $_OR_                          16
     $_SDFFE_NP0P_                   4
     $_XOR_                        543
     $mem_v2                         2


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~721 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~2718 debug messages>
Removed a total of 906 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 8 unused cells and 162 unused wires.
<suppressed ~9 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.27.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~20 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 2 unused wires.
<suppressed ~1 debug messages>

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory $auto$memory_bmux2rom.cc:63:execute$488 in module \aes_fsm_enc:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$491 in module \aes_fsm_enc:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$488[0]$2356 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$488[1]$2358 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$488[2]$2360 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$488[3]$2362 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$488[4]$2364 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$488[5]$2366 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$488[6]$2368 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$488[7]$2370 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$491[0]$2393 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$491[1]$2395 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$491[2]$2397 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$491[3]$2399 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$491[4]$2401 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$491[5]$2403 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$491[6]$2405 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$491[7]$2407 ($dff) from module aes_fsm_enc (removing D path).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 48 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~9 debug messages>

3.30.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce -full

3.30.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.30.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.30.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 8 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~3 debug messages>

3.30.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1 debug messages>

yosys> opt_reduce -full

3.30.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.30.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.30.22. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr -full

3.30.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.30.26. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $mux.
No more expansions possible.
<suppressed ~77 debug messages>

yosys> opt -sat

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 2 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.32.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.32.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.32.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.32.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.32.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  23 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  8 cells in clk=!\clk, en={ }, arst=\rst_cnt, srst={ }
  8 cells in clk=\clk, en={ }, arst=\rst_cnt, srst={ }
  19 cells in clk=!$verific$n3884$14, en=\en_cnt, arst={ }, srst=\rst_cnt

3.33.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 23 gates and 27 wires to a netlist network with 2 inputs and 3 outputs.

3.33.2.1. Executing ABC.

3.33.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \clk, asynchronously reset by $abc$2513$rst_cnt
Extracted 8 gates and 8 wires to a netlist network with 0 inputs and 1 outputs.

3.33.3.1. Executing ABC.

3.33.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$2513$rst_cnt
Extracted 8 gates and 8 wires to a netlist network with 0 inputs and 1 outputs.

3.33.4.1. Executing ABC.

3.33.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: $verific$n3884$14, enabled by $abc$2513$en_cnt, synchronously reset by $abc$2513$rst_cnt
Extracted 19 gates and 21 wires to a netlist network with 2 inputs and 2 outputs.

3.33.5.1. Executing ABC.

yosys> abc -dff

3.34. Executing ABC pass (technology mapping using ABC).

3.34.1. Summary of detected clock domains:
  4 cells in clk=!\clk, en={ }, arst=$abc$2513$rst_cnt, srst={ }
  5 cells in clk=\clk, en={ }, arst=$abc$2513$rst_cnt, srst={ }
  20 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  18 cells in clk=!$verific$n3884$14, en=$abc$2513$en_cnt, arst={ }, srst=$abc$2513$rst_cnt

3.34.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \clk, asynchronously reset by $abc$2513$rst_cnt
Extracted 4 gates and 4 wires to a netlist network with 0 inputs and 1 outputs.

3.34.2.1. Executing ABC.

3.34.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$2513$rst_cnt
Extracted 5 gates and 6 wires to a netlist network with 1 inputs and 2 outputs.

3.34.3.1. Executing ABC.

3.34.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 20 gates and 22 wires to a netlist network with 2 inputs and 3 outputs.

3.34.4.1. Executing ABC.

3.34.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: $abc$2548$verific$n3884$14, enabled by $abc$2513$en_cnt, synchronously reset by $abc$2572$abc$2513$rst_cnt
Extracted 18 gates and 22 wires to a netlist network with 4 inputs and 3 outputs.

3.34.5.1. Executing ABC.

yosys> abc -dff

3.35. Executing ABC pass (technology mapping using ABC).

3.35.1. Summary of detected clock domains:
  20 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  4 cells in clk=\clk, en={ }, arst=$abc$2572$abc$2513$rst_cnt, srst={ }
  5 cells in clk=!\clk, en={ }, arst=$abc$2572$abc$2513$rst_cnt, srst={ }
  18 cells in clk=!$abc$2548$verific$n3884$14, en=$abc$2600$abc$2513$en_cnt, arst={ }, srst=$abc$2572$abc$2513$rst_cnt

3.35.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 20 gates and 22 wires to a netlist network with 2 inputs and 3 outputs.

3.35.2.1. Executing ABC.

3.35.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$2572$abc$2513$rst_cnt
Extracted 4 gates and 4 wires to a netlist network with 0 inputs and 1 outputs.

3.35.3.1. Executing ABC.

3.35.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \clk, asynchronously reset by $abc$2572$abc$2513$rst_cnt
Extracted 5 gates and 6 wires to a netlist network with 1 inputs and 2 outputs.

3.35.4.1. Executing ABC.

3.35.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: $abc$2600$abc$2548$verific$n3884$14, enabled by $abc$2600$abc$2513$en_cnt, synchronously reset by $abc$2646$abc$2572$abc$2513$rst_cnt
Extracted 18 gates and 22 wires to a netlist network with 4 inputs and 3 outputs.

3.35.5.1. Executing ABC.

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  4 cells in clk=!\clk, en={ }, arst=$abc$2646$abc$2572$abc$2513$rst_cnt, srst={ }
  20 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  5 cells in clk=\clk, en={ }, arst=$abc$2646$abc$2572$abc$2513$rst_cnt, srst={ }
  18 cells in clk=!$abc$2600$abc$2548$verific$n3884$14, en=$abc$2653$abc$2600$abc$2513$en_cnt, arst={ }, srst=$abc$2646$abc$2572$abc$2513$rst_cnt

3.36.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \clk, asynchronously reset by $abc$2646$abc$2572$abc$2513$rst_cnt
Extracted 4 gates and 4 wires to a netlist network with 0 inputs and 1 outputs.

3.36.2.1. Executing ABC.

3.36.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 20 gates and 22 wires to a netlist network with 2 inputs and 3 outputs.

3.36.3.1. Executing ABC.

3.36.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$2646$abc$2572$abc$2513$rst_cnt
Extracted 5 gates and 6 wires to a netlist network with 1 inputs and 2 outputs.

3.36.4.1. Executing ABC.

3.36.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: $abc$2653$abc$2600$abc$2548$verific$n3884$14, enabled by $abc$2653$abc$2600$abc$2513$en_cnt, synchronously reset by $abc$2699$abc$2646$abc$2572$abc$2513$rst_cnt
Extracted 18 gates and 22 wires to a netlist network with 4 inputs and 3 outputs.

3.36.5.1. Executing ABC.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~8 debug messages>

yosys> opt_merge -nomux

3.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 1 unused cells and 218 unused wires.
<suppressed ~13 debug messages>

yosys> opt_expr

3.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.38.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_B0wc7B/abc_tmp_1.scr

3.39. Executing ABC pass (technology mapping using ABC).

3.39.1. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Extracted 35 gates and 47 wires to a netlist network with 12 inputs and 13 outputs.

3.39.1.1. Executing ABC.
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.23  [   0.08 sec. at Pass 0]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.23  [   0.31 sec. at Pass 1]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.23  [   0.13 sec. at Pass 2]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.23  [   0.16 sec. at Pass 3]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.23  [   0.08 sec. at Pass 4]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.23  [   0.20 sec. at Pass 5]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.23  [   1.02 sec. at Pass 6]
DE:   #PIs =  12  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.23  [   1.53 sec. at Pass 7]

yosys> opt

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 47 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.42. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                229
   Number of wire bits:           2705
   Number of public wires:         206
   Number of public wire bits:    2682
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 25
     $_DFF_NN0_                      2
     $_DFF_PN0_                      2
     $_DFF_PP0_                      3
     $_SDFFE_NN0P_                   4
     $lut                           14


yosys> shregmap -minlen 8 -maxlen 20

3.43. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.45. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                237
   Number of wire bits:           2713
   Number of public wires:         206
   Number of public wire bits:    2682
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 33
     $_DFF_NN0_                      2
     $_DFF_N_                        4
     $_DFF_PN0_                      2
     $_DFF_PP0_                      3
     $_MUX_                          8
     $lut                           14


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.46. Executing TECHMAP pass (map to technology primitives).

3.46.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.46.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.46.3. Continuing TECHMAP pass.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using extmapper simplemap for cells of type $lut.
Using template $paramod\$_DFF_N_\_TECHMAP_WIREINIT_Q_=1'x for cells of type $_DFF_N_.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using template $paramod\$_DFF_NN0_\_TECHMAP_WIREINIT_Q_=1'x for cells of type $_DFF_NN0_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~186 debug messages>

yosys> opt_expr -mux_undef

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~102 debug messages>

yosys> simplemap

3.48. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge

3.50. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~39 debug messages>
Removed a total of 13 cells.

yosys> opt_dff -nodffe -nosdff

3.51. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 65 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.53. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.53.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.53.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.53.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.53.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.53.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.53.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.53.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.53.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.53.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.53.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_B0wc7B/abc_tmp_2.scr

3.54. Executing ABC pass (technology mapping using ABC).

3.54.1. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Extracted 55 gates and 70 wires to a netlist network with 13 inputs and 13 outputs.

3.54.1.1. Executing ABC.
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.04 sec. at Pass 0]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.20 sec. at Pass 1]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.06 sec. at Pass 2]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.17 sec. at Pass 3]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.09 sec. at Pass 4]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.18 sec. at Pass 5]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.86 sec. at Pass 6]
DE:   #PIs =  13  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.73 sec. at Pass 7]

yosys> opt

3.55. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.55.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.55.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.55.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.55.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 57 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.55.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.55.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.55.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.55.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.55.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.55.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.56. Executing HIERARCHY pass (managing design hierarchy).

3.56.1. Analyzing design hierarchy..
Top module:  \aes_fsm_enc

3.56.2. Analyzing design hierarchy..
Top module:  \aes_fsm_enc
Removed 0 unused modules.

yosys> stat

3.57. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                230
   Number of wire bits:           2706
   Number of public wires:         205
   Number of public wire bits:    2681
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 26
     $lut                           15
     dffnsre                         6
     dffsre                          5


yosys> opt_clean -purge

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 198 unused wires.
<suppressed ~198 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.59. Executing Verilog backend.
Dumping module `\aes_fsm_enc'.

Warnings: 11 unique messages, 11 total
End of script. Logfile hash: 4529847c05, CPU: user 2.01s system 0.15s, MEM: 30.84 MB peak
Yosys 0.18+10 (git sha1 8217e4c48, gcc 9.1.0 -fPIC -Os)
Time spent: 97% 6x abc (74 sec), 0% 31x opt_clean (0 sec), ...
real 18.29
user 50.87
sys 25.23
