
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.14+36 (git sha1 4cd3e3b51, gcc 7.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl b17.vhd

yosys> verific -vhdl b17.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'b17.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-INFO [VHDL-1012] b17.vhd:1: analyzing entity 'b15'
VERIFIC-INFO [VHDL-1010] b17.vhd:17: analyzing architecture 'behav'
VERIFIC-INFO [VHDL-1012] b17.vhd:673: analyzing entity 'b17'
VERIFIC-INFO [VHDL-1010] b17.vhd:685: analyzing architecture 'behav'

yosys> synth_rs -top b17 -tech genesis -goal area -de -no_dsp -no_bram -verilog b17.verilog

3. Executing synth_rs pass.

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dff'.
Generating RTLIL representation for module `\dffn'.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top b17

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] b17.vhd:673: processing 'b17(BEHAV)'
VERIFIC-INFO [VHDL-1067] b17.vhd:1: processing 'b15(BEHAV)'
Importing module b17.
Importing module standard.
Importing module b15(BEHAV).

3.3.1. Analyzing design hierarchy..
Top module:  \b17
Used module:     \b15(BEHAV)

3.3.2. Analyzing design hierarchy..
Top module:  \b17
Used module:     \b15(BEHAV)
Removing unused module `\standard'.
Removed 1 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15(BEHAV).
<suppressed ~17 debug messages>
Optimizing module b17.
<suppressed ~4 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module b15(BEHAV).
<suppressed ~3 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~15 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 21 unused cells and 481 unused wires.
<suppressed ~211 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module b17...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~6 debug messages>

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~18 debug messages>
Removed a total of 6 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~279 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
    New ctrl vector for $pmux cell $flatten\P1.$verific$Select_723$b17.vhd:562$1097: { $flatten\P1.$verific$n7981$278 $flatten\P1.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1268 $auto$opt_reduce.cc:134:opt_pmux$1266 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$Select_725$b17.vhd:562$1099: { $flatten\P1.$verific$n7981$278 $auto$opt_reduce.cc:134:opt_pmux$1274 $auto$opt_reduce.cc:134:opt_pmux$1272 $auto$opt_reduce.cc:134:opt_pmux$1270 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$Select_731$b17.vhd:562$1105: { $flatten\P1.$verific$n8173$299 $flatten\P1.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1276 $flatten\P1.$verific$n7990$287 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$Select_733$b17.vhd:562$1106: { $flatten\P1.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1280 $auto$opt_reduce.cc:134:opt_pmux$1278 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$Select_735$b17.vhd:562$1107: { $flatten\P1.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1284 $auto$opt_reduce.cc:134:opt_pmux$1282 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$Select_737$b17.vhd:562$1108: { $flatten\P1.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1286 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_720$b17.vhd:562$1094: { $flatten\P1.$verific$n7981$278 $flatten\P1.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1296 $auto$opt_reduce.cc:134:opt_pmux$1294 $auto$opt_reduce.cc:134:opt_pmux$1292 $auto$opt_reduce.cc:134:opt_pmux$1290 $auto$opt_reduce.cc:134:opt_pmux$1288 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_721$b17.vhd:562$1095: { $auto$opt_reduce.cc:134:opt_pmux$1306 $auto$opt_reduce.cc:134:opt_pmux$1304 $flatten\P1.$verific$n7987$284 $flatten\P1.$verific$n7989$286 $auto$opt_reduce.cc:134:opt_pmux$1302 $auto$opt_reduce.cc:134:opt_pmux$1300 $auto$opt_reduce.cc:134:opt_pmux$1298 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_726$b17.vhd:562$1100: { $flatten\P1.$verific$n7981$278 $flatten\P1.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1308 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_727$b17.vhd:562$1101: { $flatten\P1.$verific$n7985$282 $flatten\P1.$verific$n7987$284 $flatten\P1.$verific$n7989$286 $flatten\P1.$verific$n7995$292 $auto$opt_reduce.cc:134:opt_pmux$1310 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_728$b17.vhd:562$1102: { $flatten\P1.$verific$n7986$283 $flatten\P1.$verific$n7996$293 $auto$opt_reduce.cc:134:opt_pmux$1312 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_729$b17.vhd:562$1103: { $flatten\P1.$verific$n7987$284 $flatten\P1.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1316 $auto$opt_reduce.cc:134:opt_pmux$1314 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_738$b17.vhd:562$1109: { $flatten\P1.$verific$n7987$284 $flatten\P1.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1318 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_739$b17.vhd:562$1110: { $flatten\P1.$verific$n7987$284 $flatten\P1.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1320 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_740$b17.vhd:562$1111: { $flatten\P1.$verific$n7988$285 $flatten\P1.$verific$n7990$287 $auto$opt_reduce.cc:134:opt_pmux$1322 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_741$b17.vhd:562$1112: { $flatten\P1.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1324 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$Select_723$b17.vhd:562$1097: { $flatten\P2.$verific$n7981$278 $flatten\P2.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1328 $auto$opt_reduce.cc:134:opt_pmux$1326 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$Select_725$b17.vhd:562$1099: { $flatten\P2.$verific$n7981$278 $auto$opt_reduce.cc:134:opt_pmux$1334 $auto$opt_reduce.cc:134:opt_pmux$1332 $auto$opt_reduce.cc:134:opt_pmux$1330 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$Select_731$b17.vhd:562$1105: { $flatten\P2.$verific$n8173$299 $flatten\P2.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1336 $flatten\P2.$verific$n7990$287 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$Select_733$b17.vhd:562$1106: { $flatten\P2.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1340 $auto$opt_reduce.cc:134:opt_pmux$1338 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$Select_735$b17.vhd:562$1107: { $flatten\P2.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1344 $auto$opt_reduce.cc:134:opt_pmux$1342 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$Select_737$b17.vhd:562$1108: { $flatten\P2.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1346 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_720$b17.vhd:562$1094: { $flatten\P2.$verific$n7981$278 $flatten\P2.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1356 $auto$opt_reduce.cc:134:opt_pmux$1354 $auto$opt_reduce.cc:134:opt_pmux$1352 $auto$opt_reduce.cc:134:opt_pmux$1350 $auto$opt_reduce.cc:134:opt_pmux$1348 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_721$b17.vhd:562$1095: { $auto$opt_reduce.cc:134:opt_pmux$1366 $auto$opt_reduce.cc:134:opt_pmux$1364 $flatten\P2.$verific$n7987$284 $flatten\P2.$verific$n7989$286 $auto$opt_reduce.cc:134:opt_pmux$1362 $auto$opt_reduce.cc:134:opt_pmux$1360 $auto$opt_reduce.cc:134:opt_pmux$1358 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_726$b17.vhd:562$1100: { $flatten\P2.$verific$n7981$278 $flatten\P2.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1368 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_727$b17.vhd:562$1101: { $flatten\P2.$verific$n7985$282 $flatten\P2.$verific$n7987$284 $flatten\P2.$verific$n7989$286 $flatten\P2.$verific$n7995$292 $auto$opt_reduce.cc:134:opt_pmux$1370 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_728$b17.vhd:562$1102: { $flatten\P2.$verific$n7986$283 $flatten\P2.$verific$n7996$293 $auto$opt_reduce.cc:134:opt_pmux$1372 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_729$b17.vhd:562$1103: { $flatten\P2.$verific$n7987$284 $flatten\P2.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1376 $auto$opt_reduce.cc:134:opt_pmux$1374 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_738$b17.vhd:562$1109: { $flatten\P2.$verific$n7987$284 $flatten\P2.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1378 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_739$b17.vhd:562$1110: { $flatten\P2.$verific$n7987$284 $flatten\P2.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1380 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_740$b17.vhd:562$1111: { $flatten\P2.$verific$n7988$285 $flatten\P2.$verific$n7990$287 $auto$opt_reduce.cc:134:opt_pmux$1382 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_741$b17.vhd:562$1112: { $flatten\P2.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1384 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$Select_723$b17.vhd:562$1097: { $flatten\P3.$verific$n7981$278 $flatten\P3.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1388 $auto$opt_reduce.cc:134:opt_pmux$1386 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$Select_725$b17.vhd:562$1099: { $flatten\P3.$verific$n7981$278 $auto$opt_reduce.cc:134:opt_pmux$1394 $auto$opt_reduce.cc:134:opt_pmux$1392 $auto$opt_reduce.cc:134:opt_pmux$1390 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$Select_731$b17.vhd:562$1105: { $flatten\P3.$verific$n8173$299 $flatten\P3.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1396 $flatten\P3.$verific$n7990$287 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$Select_733$b17.vhd:562$1106: { $flatten\P3.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1400 $auto$opt_reduce.cc:134:opt_pmux$1398 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$Select_735$b17.vhd:562$1107: { $flatten\P3.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1404 $auto$opt_reduce.cc:134:opt_pmux$1402 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$Select_737$b17.vhd:562$1108: { $flatten\P3.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1406 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_720$b17.vhd:562$1094: { $flatten\P3.$verific$n7981$278 $flatten\P3.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1416 $auto$opt_reduce.cc:134:opt_pmux$1414 $auto$opt_reduce.cc:134:opt_pmux$1412 $auto$opt_reduce.cc:134:opt_pmux$1410 $auto$opt_reduce.cc:134:opt_pmux$1408 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_721$b17.vhd:562$1095: { $auto$opt_reduce.cc:134:opt_pmux$1426 $auto$opt_reduce.cc:134:opt_pmux$1424 $flatten\P3.$verific$n7987$284 $flatten\P3.$verific$n7989$286 $auto$opt_reduce.cc:134:opt_pmux$1422 $auto$opt_reduce.cc:134:opt_pmux$1420 $auto$opt_reduce.cc:134:opt_pmux$1418 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_726$b17.vhd:562$1100: { $flatten\P3.$verific$n7981$278 $flatten\P3.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1428 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_727$b17.vhd:562$1101: { $flatten\P3.$verific$n7985$282 $flatten\P3.$verific$n7987$284 $flatten\P3.$verific$n7989$286 $flatten\P3.$verific$n7995$292 $auto$opt_reduce.cc:134:opt_pmux$1430 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_728$b17.vhd:562$1102: { $flatten\P3.$verific$n7986$283 $flatten\P3.$verific$n7996$293 $auto$opt_reduce.cc:134:opt_pmux$1432 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_729$b17.vhd:562$1103: { $flatten\P3.$verific$n7987$284 $flatten\P3.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1436 $auto$opt_reduce.cc:134:opt_pmux$1434 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_738$b17.vhd:562$1109: { $flatten\P3.$verific$n7987$284 $flatten\P3.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1438 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_739$b17.vhd:562$1110: { $flatten\P3.$verific$n7987$284 $flatten\P3.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1440 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_740$b17.vhd:562$1111: { $flatten\P3.$verific$n7988$285 $flatten\P3.$verific$n7990$287 $auto$opt_reduce.cc:134:opt_pmux$1442 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_741$b17.vhd:562$1112: { $flatten\P3.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1444 }
  Optimizing cells in module \b17.
Performed a total of 48 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~153 debug messages>
Removed a total of 51 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$ready22_reg$b17.vhd:759$116 ($aldff) from module b17.
Changing const-value async load to async reset on $verific$ready21_reg$b17.vhd:759$115 ($aldff) from module b17.
Changing const-value async load to async reset on $verific$ready12_reg$b17.vhd:738$95 ($aldff) from module b17.
Changing const-value async load to async reset on $verific$ready11_reg$b17.vhd:738$94 ($aldff) from module b17.
Changing const-value async load to async reset on $verific$buf2_reg$b17.vhd:759$114 ($aldff) from module b17.
Changing const-value async load to async reset on $verific$buf1_reg$b17.vhd:738$93 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$rEIP_reg$b17.vhd:612$1240 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$D_C_n_reg$b17.vhd:231$821 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$CodeFetch_reg$b17.vhd:612$1235 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$W_R_n_reg$b17.vhd:231$820 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$State_reg$b17.vhd:231$824 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$StateBS16_reg$b17.vhd:231$826 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$RequestPending_reg$b17.vhd:612$1244 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$ReadRequest_reg$b17.vhd:612$1242 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.uWord_reg$b17.vhd:612$1234 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.lWord_reg$b17.vhd:612$1233 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.State2_reg$b17.vhd:612$1210 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.PhyAddrPointer_reg$b17.vhd:612$1230 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.More_reg$b17.vhd:612$1231 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_9$b17.vhd:612$1218 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_8$b17.vhd:612$1217 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_7$b17.vhd:612$1216 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_6$b17.vhd:612$1215 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_5$b17.vhd:612$1214 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_4$b17.vhd:612$1213 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_3$b17.vhd:612$1212 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_2$b17.vhd:612$1211 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_16$b17.vhd:612$1225 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_15$b17.vhd:612$1224 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_14$b17.vhd:612$1223 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_13$b17.vhd:612$1222 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_12$b17.vhd:612$1221 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_11$b17.vhd:612$1220 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_10$b17.vhd:612$1219 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg$b17.vhd:612$1226 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueueWr_Addr_reg$b17.vhd:612$1228 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueueRd_Addr_reg$b17.vhd:612$1227 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstAddrPointer_reg$b17.vhd:612$1229 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.Flush_reg$b17.vhd:612$1232 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$MemoryFetch_reg$b17.vhd:612$1243 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$M_IO_n_reg$b17.vhd:231$822 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$EBX_reg$b17.vhd:612$1239 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$EAX_reg$b17.vhd:612$1238 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$Datao_reg$b17.vhd:612$1236 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$D_C_n_reg$b17.vhd:231$821 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$CodeFetch_reg$b17.vhd:612$1235 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$ByteEnable_reg$b17.vhd:668$1262 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$BE_n_reg$b17.vhd:231$818 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$Address_reg$b17.vhd:231$819 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$ADS_n_reg$b17.vhd:231$823 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$rEIP_reg$b17.vhd:612$1240 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$ByteEnable_reg$b17.vhd:668$1262 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$BE_n_reg$b17.vhd:231$818 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$Datao_reg$b17.vhd:612$1236 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$W_R_n_reg$b17.vhd:231$820 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$State_reg$b17.vhd:231$824 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$StateBS16_reg$b17.vhd:231$826 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$RequestPending_reg$b17.vhd:612$1244 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$ReadRequest_reg$b17.vhd:612$1242 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.uWord_reg$b17.vhd:612$1234 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.lWord_reg$b17.vhd:612$1233 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.State2_reg$b17.vhd:612$1210 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.PhyAddrPointer_reg$b17.vhd:612$1230 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.More_reg$b17.vhd:612$1231 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_9$b17.vhd:612$1218 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_8$b17.vhd:612$1217 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_7$b17.vhd:612$1216 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_6$b17.vhd:612$1215 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_5$b17.vhd:612$1214 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_4$b17.vhd:612$1213 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_3$b17.vhd:612$1212 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_2$b17.vhd:612$1211 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_16$b17.vhd:612$1225 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_15$b17.vhd:612$1224 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_14$b17.vhd:612$1223 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_13$b17.vhd:612$1222 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_12$b17.vhd:612$1221 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_11$b17.vhd:612$1220 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_10$b17.vhd:612$1219 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg$b17.vhd:612$1226 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueueWr_Addr_reg$b17.vhd:612$1228 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueueRd_Addr_reg$b17.vhd:612$1227 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstAddrPointer_reg$b17.vhd:612$1229 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.Flush_reg$b17.vhd:612$1232 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$MemoryFetch_reg$b17.vhd:612$1243 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$M_IO_n_reg$b17.vhd:231$822 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$EBX_reg$b17.vhd:612$1239 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$EAX_reg$b17.vhd:612$1238 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$Datao_reg$b17.vhd:612$1236 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$D_C_n_reg$b17.vhd:231$821 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$CodeFetch_reg$b17.vhd:612$1235 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$ByteEnable_reg$b17.vhd:668$1262 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$BE_n_reg$b17.vhd:231$818 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$Address_reg$b17.vhd:231$819 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$ADS_n_reg$b17.vhd:231$823 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$rEIP_reg$b17.vhd:612$1240 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$Address_reg$b17.vhd:231$819 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$ADS_n_reg$b17.vhd:231$823 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$W_R_n_reg$b17.vhd:231$820 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$State_reg$b17.vhd:231$824 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$StateBS16_reg$b17.vhd:231$826 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$RequestPending_reg$b17.vhd:612$1244 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$ReadRequest_reg$b17.vhd:612$1242 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.uWord_reg$b17.vhd:612$1234 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.lWord_reg$b17.vhd:612$1233 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.State2_reg$b17.vhd:612$1210 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.PhyAddrPointer_reg$b17.vhd:612$1230 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.More_reg$b17.vhd:612$1231 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_9$b17.vhd:612$1218 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_8$b17.vhd:612$1217 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_7$b17.vhd:612$1216 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_6$b17.vhd:612$1215 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_5$b17.vhd:612$1214 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_4$b17.vhd:612$1213 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_3$b17.vhd:612$1212 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_2$b17.vhd:612$1211 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_16$b17.vhd:612$1225 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_15$b17.vhd:612$1224 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_14$b17.vhd:612$1223 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_13$b17.vhd:612$1222 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_12$b17.vhd:612$1221 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_11$b17.vhd:612$1220 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_10$b17.vhd:612$1219 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg$b17.vhd:612$1226 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueueWr_Addr_reg$b17.vhd:612$1228 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueueRd_Addr_reg$b17.vhd:612$1227 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstAddrPointer_reg$b17.vhd:612$1229 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.Flush_reg$b17.vhd:612$1232 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$MemoryFetch_reg$b17.vhd:612$1243 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$M_IO_n_reg$b17.vhd:231$822 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$EBX_reg$b17.vhd:612$1239 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$EAX_reg$b17.vhd:612$1238 ($aldff) from module b17.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 6 unused cells and 69 unused wires.
<suppressed ~7 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~282 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~282 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$buf2_reg$b17.vhd:759$114 ($adff) from module b17 (D = \P2.Datao, Q = \buf2).
Adding EN signal on $verific$buf1_reg$b17.vhd:738$93 ($adff) from module b17 (D = $verific$n162$55, Q = \buf1).
Adding EN signal on $flatten\P3.$verific$ByteEnable_reg$b17.vhd:668$1262 ($adff) from module b17 (D = $flatten\P3.$verific$n9780$727, Q = \P3.ByteEnable).
Adding EN signal on $flatten\P2.$verific$ByteEnable_reg$b17.vhd:668$1262 ($adff) from module b17 (D = $flatten\P2.$verific$n9780$727, Q = \P2.ByteEnable).
Adding EN signal on $flatten\P1.$verific$ByteEnable_reg$b17.vhd:668$1262 ($adff) from module b17 (D = $flatten\P1.$verific$n9780$727, Q = \P1.ByteEnable).
Setting constant 0-bit at position 2 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 3 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 5 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 6 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 7 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 8 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 9 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 10 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 11 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 12 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 13 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 14 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 15 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 16 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 17 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 18 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 19 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 20 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 21 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 22 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 23 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 24 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 25 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 26 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 27 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 28 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 29 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 30 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 31 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 31 on $flatten\P1.$verific$Datao_reg$b17.vhd:612$1236 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P1.$verific$P1.InstQueueWr_Addr_reg$b17.vhd:612$1228 ($adff) from module b17.
Setting constant 0-bit at position 2 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 3 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 5 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 6 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 7 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 8 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 9 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 10 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 11 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 12 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 13 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 14 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 15 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 16 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 17 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 18 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 19 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 20 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 21 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 22 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 23 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 24 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 25 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 26 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 27 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 28 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 29 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 30 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 31 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 31 on $flatten\P2.$verific$Datao_reg$b17.vhd:612$1236 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P2.$verific$P1.InstQueueWr_Addr_reg$b17.vhd:612$1228 ($adff) from module b17.
Setting constant 0-bit at position 2 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 3 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 5 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 6 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 7 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 8 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 9 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 10 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 11 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 12 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 13 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 14 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 15 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 16 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 17 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 18 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 19 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 20 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 21 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 22 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 23 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 24 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 25 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 26 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 27 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 28 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 29 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 30 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 31 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 31 on $flatten\P3.$verific$Datao_reg$b17.vhd:612$1236 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P3.$verific$P1.InstQueueWr_Addr_reg$b17.vhd:612$1228 ($adff) from module b17.

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 1 unused cells and 1 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~11 debug messages>

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~281 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$1458 ($adff) from module b17.
Setting constant 0-bit at position 31 on $auto$ff.cc:262:slice$1459 ($adff) from module b17.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$1461 ($adff) from module b17.
Setting constant 0-bit at position 31 on $auto$ff.cc:262:slice$1462 ($adff) from module b17.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$1464 ($adff) from module b17.
Setting constant 0-bit at position 31 on $auto$ff.cc:262:slice$1465 ($adff) from module b17.
Setting constant 0-bit at position 31 on $auto$ff.cc:262:slice$1445 ($adffe) from module b17.
Setting constant 0-bit at position 31 on $auto$ff.cc:262:slice$1446 ($adffe) from module b17.
Setting constant 0-bit at position 4 on $flatten\P1.$verific$P1.InstQueueRd_Addr_reg$b17.vhd:612$1227 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P2.$verific$P1.InstQueueRd_Addr_reg$b17.vhd:612$1227 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P3.$verific$P1.InstQueueRd_Addr_reg$b17.vhd:612$1227 ($adff) from module b17.

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 9 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~4 debug messages>

3.13.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~281 debug messages>

yosys> opt_reduce

3.13.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.13.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 2 unused cells and 7 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.13.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.13.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~281 debug messages>

yosys> opt_reduce

3.13.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.13.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr

3.13.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.13.30. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 32) from mux cell b17.$verific$mux_33$b17.vhd:737$89 ($mux).
Removed top 1 bits (of 32) from mux cell b17.$verific$mux_83$b17.vhd:777$119 ($mux).
Removed top 1 bits (of 32) from port A of cell b17.$verific$LessThan_84$b17.vhd:782$120 ($lt).
Removed top 1 bits (of 32) from port B of cell b17.$verific$LessThan_84$b17.vhd:782$120 ($lt).
Removed top 1 bits (of 32) from port A of cell b17.$verific$LessThan_85$b17.vhd:782$121 ($lt).
Removed top 1 bits (of 32) from port B of cell b17.$verific$LessThan_85$b17.vhd:782$121 ($lt).
Removed top 1 bits (of 32) from port A of cell b17.$verific$LessThan_86$b17.vhd:782$122 ($lt).
Removed top 1 bits (of 32) from port B of cell b17.$verific$LessThan_86$b17.vhd:782$122 ($lt).
Removed top 1 bits (of 33) from FF cell b17.$flatten\P1.$verific$rEIP_reg$b17.vhd:612$1240 ($adff).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P1.$verific$mux_812$b17.vhd:605$1175 ($mux).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P1.$verific$LessThan_771$b17.vhd:597$1139 ($le).
Removed top 1 bits (of 5) from port B of cell b17.$flatten\P1.$verific$LessThan_771$b17.vhd:597$1139 ($le).
Removed top 1 bits (of 6) from port A of cell b17.$flatten\P1.$verific$LessThan_768$b17.vhd:589$1137 ($lt).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P1.$verific$sub_767$b17.vhd:589$1136 ($sub).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P1.$verific$sub_767$b17.vhd:589$1136 ($sub).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P1.$verific$mux_766$b17.vhd:588$1135 ($mux).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P1.$verific$mux_765$b17.vhd:588$1134 ($mux).
Removed top 1 bits (of 4) from mux cell b17.$flatten\P1.$verific$mux_764$b17.vhd:587$1133 ($mux).
Removed top 1 bits (of 2) from port A of cell b17.$flatten\P1.$verific$add_760$b17.vhd:586$1131 ($add).
Removed top 30 bits (of 32) from mux cell b17.$flatten\P1.$verific$mux_759$b17.vhd:585$1129 ($mux).
Removed top 31 bits (of 33) from port Y of cell b17.$flatten\P1.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
Removed top 31 bits (of 33) from port A of cell b17.$flatten\P1.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P1.$verific$LessThan_755$b17.vhd:579$1124 ($lt).
Removed top 1 bits (of 6) from port A of cell b17.$flatten\P1.$verific$LessThan_745$b17.vhd:563$1116 ($lt).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P1.$verific$sub_744$b17.vhd:563$1115 ($sub).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P1.$verific$sub_744$b17.vhd:563$1115 ($sub).
Removed top 1 bits (of 5) from port B of cell b17.$flatten\P1.$verific$LessThan_742$b17.vhd:563$1113 ($lt).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P1.$verific$equal_718$b17.vhd:551$1090 ($eq).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P1.$verific$equal_717$b17.vhd:545$1089 ($eq).
Removed top 5 bits (of 8) from port A of cell b17.$flatten\P1.$verific$equal_714$b17.vhd:530$1086 ($eq).
Removed top 5 bits (of 8) from port A of cell b17.$flatten\P1.$verific$equal_713$b17.vhd:525$1085 ($eq).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P1.$verific$equal_702$b17.vhd:348$1074 ($eq).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P1.$verific$add_689$b17.vhd:552$1071 ($add).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P1.$verific$add_681$b17.vhd:546$1069 ($add).
Removed top 1 bits (of 64) from mux cell b17.$flatten\P1.$verific$mux_950$b17.vhd:479$1060 ($mux).
Removed top 1 bits (of 3) from port A of cell b17.$flatten\P1.$verific$equal_528$b17.vhd:462$1040 ($eq).
Removed top 1 bits (of 16) from port Y of cell b17.$flatten\P1.$verific$add_522$b17.vhd:457$1035 ($add).
Removed top 1 bits (of 16) from port A of cell b17.$flatten\P1.$verific$add_522$b17.vhd:457$1035 ($add).
Removed top 1 bits (of 10) from mux cell b17.$flatten\P1.$verific$mux_958$b17.vhd:444$1030 ($mux).
Removed top 1 bits (of 15) from mux cell b17.$flatten\P1.$verific$mux_957$b17.vhd:448$1019 ($mux).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P1.$verific$add_477$b17.vhd:430$1002 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P1.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P1.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P1.$verific$LessThan_463$b17.vhd:413$996 ($lt).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P1.$verific$LessThan_462$b17.vhd:412$995 ($le).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P1.$verific$mux_440$b17.vhd:399$992 ($mux).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P1.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 2 bits (of 5) from port B of cell b17.$flatten\P1.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P1.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 1 bits (of 4) from port A of cell b17.$flatten\P1.$verific$add_427$b17.vhd:391$984 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P1.$verific$add_427$b17.vhd:391$984 ($add).
Removed top 7 bits (of 8) from port B of cell b17.$flatten\P1.$verific$add_426$b17.vhd:391$983 ($add).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P1.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 3 bits (of 5) from port B of cell b17.$flatten\P1.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P1.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 1 bits (of 3) from port A of cell b17.$flatten\P1.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 2 bits (of 3) from port B of cell b17.$flatten\P1.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 1 bits (of 3) from port Y of cell b17.$flatten\P1.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 24 bits (of 32) from port B of cell b17.$flatten\P1.$verific$add_403$b17.vhd:371$972 ($add).
Removed top 29 bits (of 32) from port B of cell b17.$flatten\P1.$verific$add_399$b17.vhd:371$971 ($add).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P1.$verific$LessThan_397$b17.vhd:370$970 ($le).
Removed top 24 bits (of 32) from port B of cell b17.$flatten\P1.$verific$add_387$b17.vhd:360$963 ($add).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P1.$verific$add_383$b17.vhd:360$962 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P1.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P1.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 33) from port B of cell b17.$flatten\P1.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 9) from port A of cell b17.$flatten\P1.$verific$sub_378$b17.vhd:357$959 ($sub).
Removed top 1 bits (of 9) from port B of cell b17.$flatten\P1.$verific$sub_378$b17.vhd:357$959 ($sub).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P1.$verific$LessThan_373$b17.vhd:356$958 ($lt).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P1.$verific$LessThan_370$b17.vhd:355$956 ($le).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P1.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 2 bits (of 6) from port B of cell b17.$flatten\P1.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 1 bits (of 6) from port Y of cell b17.$flatten\P1.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P1.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 4 bits (of 5) from port B of cell b17.$flatten\P1.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 1 bits (of 6) from port Y of cell b17.$flatten\P1.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P1.$verific$add_360$b17.vhd:344$951 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P1.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P1.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P1.$verific$LessThan_286$b17.vhd:319$925 ($lt).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P1.$verific$add_284$b17.vhd:318$923 ($add).
Removed top 29 bits (of 30) from port B of cell b17.$flatten\P1.$verific$add_281$b17.vhd:315$921 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P1.$verific$add_278$b17.vhd:314$920 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P1.$verific$Decoder_261$b17.vhd:313$903 ($shl).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P1.$verific$add_254$b17.vhd:312$895 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P1.$verific$Decoder_237$b17.vhd:311$878 ($shl).
Removed top 8 bits (of 16) from port Y of cell b17.$flatten\P1.$verific$add_235$b17.vhd:311$873 ($add).
Removed top 8 bits (of 16) from port A of cell b17.$flatten\P1.$verific$add_235$b17.vhd:311$873 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P1.$verific$add_230$b17.vhd:309$869 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P1.$verific$Decoder_213$b17.vhd:308$852 ($shl).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P1.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 4 bits (of 5) from port B of cell b17.$flatten\P1.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P1.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P1.$verific$Decoder_193$b17.vhd:305$832 ($shl).
Removed top 1 bits (of 3) from mux cell b17.$flatten\P1.$verific$mux_127$b17.vhd:215$797 ($mux).
Removed top 1 bits (of 31) from port Y of cell b17.$flatten\P1.$verific$add_113$b17.vhd:197$791 ($add).
Removed top 1 bits (of 31) from port A of cell b17.$flatten\P1.$verific$add_113$b17.vhd:197$791 ($add).
Removed top 30 bits (of 32) from mux cell b17.$flatten\P1.$verific$mux_98$b17.vhd:181$787 ($mux).
Removed top 1 bits (of 2) from port A of cell b17.$flatten\P1.$verific$equal_909$b17.vhd:634$1254 ($eq).
Removed top 1 bits (of 33) from FF cell b17.$flatten\P2.$verific$rEIP_reg$b17.vhd:612$1240 ($adff).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P2.$verific$mux_812$b17.vhd:605$1175 ($mux).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P2.$verific$LessThan_771$b17.vhd:597$1139 ($le).
Removed top 1 bits (of 5) from port B of cell b17.$flatten\P2.$verific$LessThan_771$b17.vhd:597$1139 ($le).
Removed top 1 bits (of 6) from port A of cell b17.$flatten\P2.$verific$LessThan_768$b17.vhd:589$1137 ($lt).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P2.$verific$sub_767$b17.vhd:589$1136 ($sub).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P2.$verific$sub_767$b17.vhd:589$1136 ($sub).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P2.$verific$mux_766$b17.vhd:588$1135 ($mux).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P2.$verific$mux_765$b17.vhd:588$1134 ($mux).
Removed top 1 bits (of 4) from mux cell b17.$flatten\P2.$verific$mux_764$b17.vhd:587$1133 ($mux).
Removed top 1 bits (of 2) from port A of cell b17.$flatten\P2.$verific$add_760$b17.vhd:586$1131 ($add).
Removed top 30 bits (of 32) from mux cell b17.$flatten\P2.$verific$mux_759$b17.vhd:585$1129 ($mux).
Removed top 31 bits (of 33) from port Y of cell b17.$flatten\P2.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
Removed top 31 bits (of 33) from port A of cell b17.$flatten\P2.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P2.$verific$LessThan_755$b17.vhd:579$1124 ($lt).
Removed top 1 bits (of 6) from port A of cell b17.$flatten\P2.$verific$LessThan_745$b17.vhd:563$1116 ($lt).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P2.$verific$sub_744$b17.vhd:563$1115 ($sub).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P2.$verific$sub_744$b17.vhd:563$1115 ($sub).
Removed top 1 bits (of 5) from port B of cell b17.$flatten\P2.$verific$LessThan_742$b17.vhd:563$1113 ($lt).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P2.$verific$equal_718$b17.vhd:551$1090 ($eq).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P2.$verific$equal_717$b17.vhd:545$1089 ($eq).
Removed top 5 bits (of 8) from port A of cell b17.$flatten\P2.$verific$equal_714$b17.vhd:530$1086 ($eq).
Removed top 5 bits (of 8) from port A of cell b17.$flatten\P2.$verific$equal_713$b17.vhd:525$1085 ($eq).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P2.$verific$equal_702$b17.vhd:348$1074 ($eq).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P2.$verific$add_689$b17.vhd:552$1071 ($add).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P2.$verific$add_681$b17.vhd:546$1069 ($add).
Removed top 1 bits (of 64) from mux cell b17.$flatten\P2.$verific$mux_950$b17.vhd:479$1060 ($mux).
Removed top 1 bits (of 3) from port A of cell b17.$flatten\P2.$verific$equal_528$b17.vhd:462$1040 ($eq).
Removed top 1 bits (of 16) from port Y of cell b17.$flatten\P2.$verific$add_522$b17.vhd:457$1035 ($add).
Removed top 1 bits (of 16) from port A of cell b17.$flatten\P2.$verific$add_522$b17.vhd:457$1035 ($add).
Removed top 1 bits (of 10) from mux cell b17.$flatten\P2.$verific$mux_958$b17.vhd:444$1030 ($mux).
Removed top 1 bits (of 15) from mux cell b17.$flatten\P2.$verific$mux_957$b17.vhd:448$1019 ($mux).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P2.$verific$add_477$b17.vhd:430$1002 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P2.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P2.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P2.$verific$LessThan_463$b17.vhd:413$996 ($lt).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P2.$verific$LessThan_462$b17.vhd:412$995 ($le).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P2.$verific$mux_440$b17.vhd:399$992 ($mux).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P2.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 2 bits (of 5) from port B of cell b17.$flatten\P2.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P2.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 1 bits (of 4) from port A of cell b17.$flatten\P2.$verific$add_427$b17.vhd:391$984 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P2.$verific$add_427$b17.vhd:391$984 ($add).
Removed top 7 bits (of 8) from port B of cell b17.$flatten\P2.$verific$add_426$b17.vhd:391$983 ($add).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P2.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 3 bits (of 5) from port B of cell b17.$flatten\P2.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P2.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 1 bits (of 3) from port A of cell b17.$flatten\P2.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 2 bits (of 3) from port B of cell b17.$flatten\P2.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 1 bits (of 3) from port Y of cell b17.$flatten\P2.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 24 bits (of 32) from port B of cell b17.$flatten\P2.$verific$add_403$b17.vhd:371$972 ($add).
Removed top 29 bits (of 32) from port B of cell b17.$flatten\P2.$verific$add_399$b17.vhd:371$971 ($add).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P2.$verific$LessThan_397$b17.vhd:370$970 ($le).
Removed top 24 bits (of 32) from port B of cell b17.$flatten\P2.$verific$add_387$b17.vhd:360$963 ($add).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P2.$verific$add_383$b17.vhd:360$962 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P2.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P2.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 33) from port B of cell b17.$flatten\P2.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 9) from port A of cell b17.$flatten\P2.$verific$sub_378$b17.vhd:357$959 ($sub).
Removed top 1 bits (of 9) from port B of cell b17.$flatten\P2.$verific$sub_378$b17.vhd:357$959 ($sub).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P2.$verific$LessThan_373$b17.vhd:356$958 ($lt).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P2.$verific$LessThan_370$b17.vhd:355$956 ($le).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P2.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 2 bits (of 6) from port B of cell b17.$flatten\P2.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 1 bits (of 6) from port Y of cell b17.$flatten\P2.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P2.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 4 bits (of 5) from port B of cell b17.$flatten\P2.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 1 bits (of 6) from port Y of cell b17.$flatten\P2.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P2.$verific$add_360$b17.vhd:344$951 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P2.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P2.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P2.$verific$LessThan_286$b17.vhd:319$925 ($lt).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P2.$verific$add_284$b17.vhd:318$923 ($add).
Removed top 29 bits (of 30) from port B of cell b17.$flatten\P2.$verific$add_281$b17.vhd:315$921 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P2.$verific$add_278$b17.vhd:314$920 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P2.$verific$Decoder_261$b17.vhd:313$903 ($shl).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P2.$verific$add_259$b17.vhd:313$899 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P2.$verific$add_254$b17.vhd:312$895 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P2.$verific$Decoder_237$b17.vhd:311$878 ($shl).
Removed top 1 bits (of 16) from port A of cell b17.$flatten\P2.$verific$add_235$b17.vhd:311$873 ($add).
Removed top 8 bits (of 16) from port Y of cell b17.$flatten\P2.$verific$add_235$b17.vhd:311$873 ($add).
Removed top 7 bits (of 15) from port A of cell b17.$flatten\P2.$verific$add_235$b17.vhd:311$873 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P2.$verific$add_230$b17.vhd:309$869 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P2.$verific$Decoder_213$b17.vhd:308$852 ($shl).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P2.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 4 bits (of 5) from port B of cell b17.$flatten\P2.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P2.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P2.$verific$Decoder_193$b17.vhd:305$832 ($shl).
Removed top 1 bits (of 3) from mux cell b17.$flatten\P2.$verific$mux_127$b17.vhd:215$797 ($mux).
Removed top 1 bits (of 31) from port Y of cell b17.$flatten\P2.$verific$add_113$b17.vhd:197$791 ($add).
Removed top 1 bits (of 31) from port A of cell b17.$flatten\P2.$verific$add_113$b17.vhd:197$791 ($add).
Removed top 1 bits (of 2) from port A of cell b17.$flatten\P2.$verific$equal_909$b17.vhd:634$1254 ($eq).
Removed top 1 bits (of 33) from FF cell b17.$flatten\P3.$verific$rEIP_reg$b17.vhd:612$1240 ($adff).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P3.$verific$mux_812$b17.vhd:605$1175 ($mux).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P3.$verific$LessThan_771$b17.vhd:597$1139 ($le).
Removed top 1 bits (of 5) from port B of cell b17.$flatten\P3.$verific$LessThan_771$b17.vhd:597$1139 ($le).
Removed top 1 bits (of 6) from port A of cell b17.$flatten\P3.$verific$LessThan_768$b17.vhd:589$1137 ($lt).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P3.$verific$sub_767$b17.vhd:589$1136 ($sub).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P3.$verific$sub_767$b17.vhd:589$1136 ($sub).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P3.$verific$mux_766$b17.vhd:588$1135 ($mux).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P3.$verific$mux_765$b17.vhd:588$1134 ($mux).
Removed top 1 bits (of 4) from mux cell b17.$flatten\P3.$verific$mux_764$b17.vhd:587$1133 ($mux).
Removed top 1 bits (of 2) from port A of cell b17.$flatten\P3.$verific$add_760$b17.vhd:586$1131 ($add).
Removed top 30 bits (of 32) from mux cell b17.$flatten\P3.$verific$mux_759$b17.vhd:585$1129 ($mux).
Removed top 31 bits (of 33) from port Y of cell b17.$flatten\P3.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
Removed top 31 bits (of 33) from port A of cell b17.$flatten\P3.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P3.$verific$LessThan_755$b17.vhd:579$1124 ($lt).
Removed top 1 bits (of 6) from port A of cell b17.$flatten\P3.$verific$LessThan_745$b17.vhd:563$1116 ($lt).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P3.$verific$sub_744$b17.vhd:563$1115 ($sub).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P3.$verific$sub_744$b17.vhd:563$1115 ($sub).
Removed top 1 bits (of 5) from port B of cell b17.$flatten\P3.$verific$LessThan_742$b17.vhd:563$1113 ($lt).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P3.$verific$equal_718$b17.vhd:551$1090 ($eq).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P3.$verific$equal_717$b17.vhd:545$1089 ($eq).
Removed top 5 bits (of 8) from port A of cell b17.$flatten\P3.$verific$equal_714$b17.vhd:530$1086 ($eq).
Removed top 5 bits (of 8) from port A of cell b17.$flatten\P3.$verific$equal_713$b17.vhd:525$1085 ($eq).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P3.$verific$equal_702$b17.vhd:348$1074 ($eq).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P3.$verific$add_689$b17.vhd:552$1071 ($add).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P3.$verific$add_681$b17.vhd:546$1069 ($add).
Removed top 1 bits (of 64) from mux cell b17.$flatten\P3.$verific$mux_950$b17.vhd:479$1060 ($mux).
Removed top 1 bits (of 3) from port A of cell b17.$flatten\P3.$verific$equal_528$b17.vhd:462$1040 ($eq).
Removed top 1 bits (of 16) from port Y of cell b17.$flatten\P3.$verific$add_522$b17.vhd:457$1035 ($add).
Removed top 1 bits (of 16) from port A of cell b17.$flatten\P3.$verific$add_522$b17.vhd:457$1035 ($add).
Removed top 1 bits (of 10) from mux cell b17.$flatten\P3.$verific$mux_958$b17.vhd:444$1030 ($mux).
Removed top 1 bits (of 15) from mux cell b17.$flatten\P3.$verific$mux_957$b17.vhd:448$1019 ($mux).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P3.$verific$add_477$b17.vhd:430$1002 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P3.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P3.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P3.$verific$LessThan_463$b17.vhd:413$996 ($lt).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P3.$verific$LessThan_462$b17.vhd:412$995 ($le).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P3.$verific$mux_440$b17.vhd:399$992 ($mux).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P3.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 2 bits (of 5) from port B of cell b17.$flatten\P3.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P3.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 1 bits (of 4) from port A of cell b17.$flatten\P3.$verific$add_427$b17.vhd:391$984 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P3.$verific$add_427$b17.vhd:391$984 ($add).
Removed top 7 bits (of 8) from port B of cell b17.$flatten\P3.$verific$add_426$b17.vhd:391$983 ($add).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P3.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 3 bits (of 5) from port B of cell b17.$flatten\P3.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P3.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 1 bits (of 3) from port A of cell b17.$flatten\P3.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 2 bits (of 3) from port B of cell b17.$flatten\P3.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 1 bits (of 3) from port Y of cell b17.$flatten\P3.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 24 bits (of 32) from port B of cell b17.$flatten\P3.$verific$add_403$b17.vhd:371$972 ($add).
Removed top 29 bits (of 32) from port B of cell b17.$flatten\P3.$verific$add_399$b17.vhd:371$971 ($add).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P3.$verific$LessThan_397$b17.vhd:370$970 ($le).
Removed top 24 bits (of 32) from port B of cell b17.$flatten\P3.$verific$add_387$b17.vhd:360$963 ($add).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P3.$verific$add_383$b17.vhd:360$962 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P3.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P3.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 33) from port B of cell b17.$flatten\P3.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 9) from port A of cell b17.$flatten\P3.$verific$sub_378$b17.vhd:357$959 ($sub).
Removed top 1 bits (of 9) from port B of cell b17.$flatten\P3.$verific$sub_378$b17.vhd:357$959 ($sub).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P3.$verific$LessThan_373$b17.vhd:356$958 ($lt).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P3.$verific$LessThan_370$b17.vhd:355$956 ($le).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P3.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 2 bits (of 6) from port B of cell b17.$flatten\P3.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 1 bits (of 6) from port Y of cell b17.$flatten\P3.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P3.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 4 bits (of 5) from port B of cell b17.$flatten\P3.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 1 bits (of 6) from port Y of cell b17.$flatten\P3.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P3.$verific$add_360$b17.vhd:344$951 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P3.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P3.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P3.$verific$LessThan_286$b17.vhd:319$925 ($lt).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P3.$verific$add_284$b17.vhd:318$923 ($add).
Removed top 29 bits (of 30) from port B of cell b17.$flatten\P3.$verific$add_281$b17.vhd:315$921 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P3.$verific$add_278$b17.vhd:314$920 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P3.$verific$Decoder_261$b17.vhd:313$903 ($shl).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P3.$verific$add_254$b17.vhd:312$895 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P3.$verific$Decoder_237$b17.vhd:311$878 ($shl).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P3.$verific$add_230$b17.vhd:309$869 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P3.$verific$Decoder_213$b17.vhd:308$852 ($shl).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P3.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 4 bits (of 5) from port B of cell b17.$flatten\P3.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P3.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P3.$verific$Decoder_193$b17.vhd:305$832 ($shl).
Removed top 1 bits (of 3) from mux cell b17.$flatten\P3.$verific$mux_127$b17.vhd:215$797 ($mux).
Removed top 1 bits (of 31) from port Y of cell b17.$flatten\P3.$verific$add_113$b17.vhd:197$791 ($add).
Removed top 1 bits (of 31) from port A of cell b17.$flatten\P3.$verific$add_113$b17.vhd:197$791 ($add).
Removed top 1 bits (of 2) from port A of cell b17.$flatten\P3.$verific$equal_909$b17.vhd:634$1254 ($eq).
Removed top 1 bits (of 32) from mux cell b17.$verific$mux_32$b17.vhd:737$88 ($mux).
Removed top 30 bits (of 32) from wire b17.$flatten\P1.$verific$n1001$360.
Removed top 1 bits (of 31) from wire b17.$flatten\P1.$verific$n1151$365.
Removed top 1 bits (of 3) from wire b17.$flatten\P1.$verific$n1294$370.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n2071$403.
Removed top 8 bits (of 16) from wire b17.$flatten\P1.$verific$n2267$424.
Removed top 1 bits (of 33) from wire b17.$flatten\P1.$verific$n2793$470.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n3660$497.
Removed top 1 bits (of 33) from wire b17.$flatten\P1.$verific$n3837$504.
Removed top 1 bits (of 3) from wire b17.$flatten\P1.$verific$n4619$525.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n4633$527.
Removed top 1 bits (of 4) from wire b17.$flatten\P1.$verific$n4659$530.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n4791$534.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n4869$538.
Removed top 1 bits (of 33) from wire b17.$flatten\P1.$verific$n5140$541.
Removed top 11 bits (of 32) from wire b17.$flatten\P1.$verific$n5240$544.
Removed top 11 bits (of 31) from wire b17.$flatten\P1.$verific$n5314$547.
Removed top 3 bits (of 32) from wire b17.$flatten\P1.$verific$n5415$551.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n5695$560.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n5839$566.
Removed top 1 bits (of 16) from wire b17.$flatten\P1.$verific$n5974$571.
Removed top 1 bits (of 32) from wire b17.$flatten\P1.$verific$n6324$578.
Removed top 31 bits (of 33) from wire b17.$flatten\P1.$verific$n8312$636.
Removed top 30 bits (of 32) from wire b17.$flatten\P1.$verific$n8412$639.
Removed top 1 bits (of 4) from wire b17.$flatten\P1.$verific$n8452$641.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n8457$642.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n8463$643.
Removed top 3 bits (of 4) from wire b17.$flatten\P1.$verific$n8477$645.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n8841$682.
Removed top 3 bits (of 4) from wire b17.$flatten\P1.$verific$n8847$683.
Removed top 1 bits (of 31) from wire b17.$flatten\P2.$verific$n1151$365.
Removed top 1 bits (of 3) from wire b17.$flatten\P2.$verific$n1294$370.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n2071$403.
Removed top 8 bits (of 16) from wire b17.$flatten\P2.$verific$n2267$424.
Removed top 1 bits (of 33) from wire b17.$flatten\P2.$verific$n2793$470.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n3660$497.
Removed top 1 bits (of 33) from wire b17.$flatten\P2.$verific$n3837$504.
Removed top 1 bits (of 3) from wire b17.$flatten\P2.$verific$n4619$525.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n4633$527.
Removed top 1 bits (of 4) from wire b17.$flatten\P2.$verific$n4659$530.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n4791$534.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n4869$538.
Removed top 1 bits (of 33) from wire b17.$flatten\P2.$verific$n5140$541.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n5695$560.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n5839$566.
Removed top 1 bits (of 16) from wire b17.$flatten\P2.$verific$n5974$571.
Removed top 1 bits (of 32) from wire b17.$flatten\P2.$verific$n6324$578.
Removed top 31 bits (of 33) from wire b17.$flatten\P2.$verific$n8312$636.
Removed top 30 bits (of 32) from wire b17.$flatten\P2.$verific$n8412$639.
Removed top 1 bits (of 4) from wire b17.$flatten\P2.$verific$n8452$641.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n8457$642.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n8463$643.
Removed top 3 bits (of 4) from wire b17.$flatten\P2.$verific$n8477$645.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n8841$682.
Removed top 3 bits (of 4) from wire b17.$flatten\P2.$verific$n8847$683.
Removed top 1 bits (of 31) from wire b17.$flatten\P3.$verific$n1151$365.
Removed top 1 bits (of 3) from wire b17.$flatten\P3.$verific$n1294$370.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n2071$403.
Removed top 1 bits (of 33) from wire b17.$flatten\P3.$verific$n2793$470.
Removed top 11 bits (of 32) from wire b17.$flatten\P3.$verific$n2893$473.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n2926$474.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n2935$475.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n2944$476.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n2953$477.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n2962$478.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n2971$479.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n2980$480.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n2989$481.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n2998$482.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n3007$483.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n3016$484.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n3025$485.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n3034$486.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n3043$487.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n3052$488.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n3061$489.
Removed top 1 bits (of 4) from wire b17.$flatten\P3.$verific$n3070$490.
Removed top 1 bits (of 32) from wire b17.$flatten\P3.$verific$n3075$491.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n3660$497.
Removed top 1 bits (of 33) from wire b17.$flatten\P3.$verific$n3837$504.
Removed top 7 bits (of 31) from wire b17.$flatten\P3.$verific$n3939$507.
Removed top 1 bits (of 3) from wire b17.$flatten\P3.$verific$n4619$525.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n4633$527.
Removed top 1 bits (of 4) from wire b17.$flatten\P3.$verific$n4659$530.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n4791$534.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n4869$538.
Removed top 1 bits (of 33) from wire b17.$flatten\P3.$verific$n5140$541.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n5695$560.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n5839$566.
Removed top 1 bits (of 16) from wire b17.$flatten\P3.$verific$n5974$571.
Removed top 1 bits (of 32) from wire b17.$flatten\P3.$verific$n6324$578.
Removed top 31 bits (of 33) from wire b17.$flatten\P3.$verific$n8312$636.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n8841$682.
Removed top 3 bits (of 4) from wire b17.$flatten\P3.$verific$n8847$683.
Removed top 1 bits (of 32) from wire b17.$verific$n129$54.
Removed top 1 bits (of 32) from wire b17.$verific$n162$55.
Removed top 1 bits (of 32) from wire b17.buf1.
Removed top 1 bits (of 32) from wire b17.buf2.
Removed top 1 bits (of 32) from wire b17.di2.
Removed top 1 bits (of 32) from wire b17.do1.
Removed top 1 bits (of 32) from wire b17.do2.
Removed top 1 bits (of 32) from wire b17.do3.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 102 unused cells and 295 unused wires.
<suppressed ~103 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module b17:
  creating $macc model for $flatten\P1.$verific$add_113$b17.vhd:197$791 ($add).
  creating $macc model for $flatten\P1.$verific$add_210$b17.vhd:306$849 ($add).
  creating $macc model for $flatten\P1.$verific$add_230$b17.vhd:309$869 ($add).
  creating $macc model for $flatten\P1.$verific$add_235$b17.vhd:311$873 ($add).
  creating $macc model for $flatten\P1.$verific$add_254$b17.vhd:312$895 ($add).
  creating $macc model for $flatten\P1.$verific$add_259$b17.vhd:313$899 ($add).
  creating $macc model for $flatten\P1.$verific$add_278$b17.vhd:314$920 ($add).
  creating $macc model for $flatten\P1.$verific$add_28$b17.vhd:125$741 ($add).
  creating $macc model for $flatten\P1.$verific$add_281$b17.vhd:315$921 ($add).
  creating $macc model for $flatten\P1.$verific$add_284$b17.vhd:318$923 ($add).
  creating $macc model for $flatten\P1.$verific$add_360$b17.vhd:344$951 ($add).
  creating $macc model for $flatten\P1.$verific$add_362$b17.vhd:345$953 ($add).
  creating $macc model for $flatten\P1.$verific$add_383$b17.vhd:360$962 ($add).
  creating $macc model for $flatten\P1.$verific$add_387$b17.vhd:360$963 ($add).
  creating $macc model for $flatten\P1.$verific$add_399$b17.vhd:371$971 ($add).
  creating $macc model for $flatten\P1.$verific$add_403$b17.vhd:371$972 ($add).
  creating $macc model for $flatten\P1.$verific$add_422$b17.vhd:391$977 ($add).
  creating $macc model for $flatten\P1.$verific$add_424$b17.vhd:391$980 ($add).
  creating $macc model for $flatten\P1.$verific$add_426$b17.vhd:391$983 ($add).
  creating $macc model for $flatten\P1.$verific$add_427$b17.vhd:391$984 ($add).
  creating $macc model for $flatten\P1.$verific$add_435$b17.vhd:395$987 ($add).
  creating $macc model for $flatten\P1.$verific$add_477$b17.vhd:430$1002 ($add).
  creating $macc model for $flatten\P1.$verific$add_522$b17.vhd:457$1035 ($add).
  creating $macc model for $flatten\P1.$verific$add_681$b17.vhd:546$1069 ($add).
  creating $macc model for $flatten\P1.$verific$add_689$b17.vhd:552$1071 ($add).
  creating $macc model for $flatten\P1.$verific$add_760$b17.vhd:586$1131 ($add).
  creating $macc model for $flatten\P1.$verific$sub_369$b17.vhd:355$955 ($sub).
  creating $macc model for $flatten\P1.$verific$sub_378$b17.vhd:357$959 ($sub).
  creating $macc model for $flatten\P1.$verific$sub_379$b17.vhd:357$960 ($sub).
  creating $macc model for $flatten\P1.$verific$sub_744$b17.vhd:563$1115 ($sub).
  creating $macc model for $flatten\P1.$verific$sub_767$b17.vhd:589$1136 ($sub).
  creating $macc model for $flatten\P1.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
  creating $macc model for $flatten\P1.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
  creating $macc model for $flatten\P1.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
  creating $macc model for $flatten\P2.$verific$add_113$b17.vhd:197$791 ($add).
  creating $macc model for $flatten\P2.$verific$add_210$b17.vhd:306$849 ($add).
  creating $macc model for $flatten\P2.$verific$add_230$b17.vhd:309$869 ($add).
  creating $macc model for $flatten\P2.$verific$add_235$b17.vhd:311$873 ($add).
  creating $macc model for $flatten\P2.$verific$add_254$b17.vhd:312$895 ($add).
  creating $macc model for $flatten\P2.$verific$add_259$b17.vhd:313$899 ($add).
  creating $macc model for $flatten\P2.$verific$add_278$b17.vhd:314$920 ($add).
  creating $macc model for $flatten\P2.$verific$add_28$b17.vhd:125$741 ($add).
  creating $macc model for $flatten\P2.$verific$add_281$b17.vhd:315$921 ($add).
  creating $macc model for $flatten\P2.$verific$add_284$b17.vhd:318$923 ($add).
  creating $macc model for $flatten\P2.$verific$add_360$b17.vhd:344$951 ($add).
  creating $macc model for $flatten\P2.$verific$add_362$b17.vhd:345$953 ($add).
  creating $macc model for $flatten\P2.$verific$add_383$b17.vhd:360$962 ($add).
  creating $macc model for $flatten\P2.$verific$add_387$b17.vhd:360$963 ($add).
  creating $macc model for $flatten\P2.$verific$add_399$b17.vhd:371$971 ($add).
  creating $macc model for $flatten\P2.$verific$add_403$b17.vhd:371$972 ($add).
  creating $macc model for $flatten\P2.$verific$add_422$b17.vhd:391$977 ($add).
  creating $macc model for $flatten\P2.$verific$add_424$b17.vhd:391$980 ($add).
  creating $macc model for $flatten\P2.$verific$add_426$b17.vhd:391$983 ($add).
  creating $macc model for $flatten\P2.$verific$add_427$b17.vhd:391$984 ($add).
  creating $macc model for $flatten\P2.$verific$add_435$b17.vhd:395$987 ($add).
  creating $macc model for $flatten\P2.$verific$add_477$b17.vhd:430$1002 ($add).
  creating $macc model for $flatten\P2.$verific$add_522$b17.vhd:457$1035 ($add).
  creating $macc model for $flatten\P2.$verific$add_681$b17.vhd:546$1069 ($add).
  creating $macc model for $flatten\P2.$verific$add_689$b17.vhd:552$1071 ($add).
  creating $macc model for $flatten\P2.$verific$add_760$b17.vhd:586$1131 ($add).
  creating $macc model for $flatten\P2.$verific$sub_369$b17.vhd:355$955 ($sub).
  creating $macc model for $flatten\P2.$verific$sub_378$b17.vhd:357$959 ($sub).
  creating $macc model for $flatten\P2.$verific$sub_379$b17.vhd:357$960 ($sub).
  creating $macc model for $flatten\P2.$verific$sub_744$b17.vhd:563$1115 ($sub).
  creating $macc model for $flatten\P2.$verific$sub_767$b17.vhd:589$1136 ($sub).
  creating $macc model for $flatten\P2.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
  creating $macc model for $flatten\P2.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
  creating $macc model for $flatten\P2.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
  creating $macc model for $flatten\P3.$verific$add_113$b17.vhd:197$791 ($add).
  creating $macc model for $flatten\P3.$verific$add_210$b17.vhd:306$849 ($add).
  creating $macc model for $flatten\P3.$verific$add_230$b17.vhd:309$869 ($add).
  creating $macc model for $flatten\P3.$verific$add_254$b17.vhd:312$895 ($add).
  creating $macc model for $flatten\P3.$verific$add_278$b17.vhd:314$920 ($add).
  creating $macc model for $flatten\P3.$verific$add_28$b17.vhd:125$741 ($add).
  creating $macc model for $flatten\P3.$verific$add_281$b17.vhd:315$921 ($add).
  creating $macc model for $flatten\P3.$verific$add_284$b17.vhd:318$923 ($add).
  creating $macc model for $flatten\P3.$verific$add_360$b17.vhd:344$951 ($add).
  creating $macc model for $flatten\P3.$verific$add_362$b17.vhd:345$953 ($add).
  creating $macc model for $flatten\P3.$verific$add_383$b17.vhd:360$962 ($add).
  creating $macc model for $flatten\P3.$verific$add_387$b17.vhd:360$963 ($add).
  creating $macc model for $flatten\P3.$verific$add_399$b17.vhd:371$971 ($add).
  creating $macc model for $flatten\P3.$verific$add_403$b17.vhd:371$972 ($add).
  creating $macc model for $flatten\P3.$verific$add_422$b17.vhd:391$977 ($add).
  creating $macc model for $flatten\P3.$verific$add_424$b17.vhd:391$980 ($add).
  creating $macc model for $flatten\P3.$verific$add_426$b17.vhd:391$983 ($add).
  creating $macc model for $flatten\P3.$verific$add_427$b17.vhd:391$984 ($add).
  creating $macc model for $flatten\P3.$verific$add_435$b17.vhd:395$987 ($add).
  creating $macc model for $flatten\P3.$verific$add_477$b17.vhd:430$1002 ($add).
  creating $macc model for $flatten\P3.$verific$add_522$b17.vhd:457$1035 ($add).
  creating $macc model for $flatten\P3.$verific$add_681$b17.vhd:546$1069 ($add).
  creating $macc model for $flatten\P3.$verific$add_689$b17.vhd:552$1071 ($add).
  creating $macc model for $flatten\P3.$verific$add_760$b17.vhd:586$1131 ($add).
  creating $macc model for $flatten\P3.$verific$sub_369$b17.vhd:355$955 ($sub).
  creating $macc model for $flatten\P3.$verific$sub_378$b17.vhd:357$959 ($sub).
  creating $macc model for $flatten\P3.$verific$sub_379$b17.vhd:357$960 ($sub).
  creating $macc model for $flatten\P3.$verific$sub_744$b17.vhd:563$1115 ($sub).
  creating $macc model for $flatten\P3.$verific$sub_767$b17.vhd:589$1136 ($sub).
  creating $macc model for $flatten\P3.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
  creating $macc model for $flatten\P3.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
  creating $macc model for $flatten\P3.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
  creating $alu model for $macc $flatten\P3.$verific$unary_minus_756$b17.vhd:580$1125.
  creating $alu model for $macc $flatten\P3.$verific$unary_minus_464$b17.vhd:414$997.
  creating $alu model for $macc $flatten\P3.$verific$unary_minus_287$b17.vhd:320$926.
  creating $alu model for $macc $flatten\P3.$verific$sub_767$b17.vhd:589$1136.
  creating $alu model for $macc $flatten\P3.$verific$sub_744$b17.vhd:563$1115.
  creating $alu model for $macc $flatten\P3.$verific$sub_379$b17.vhd:357$960.
  creating $alu model for $macc $flatten\P3.$verific$sub_378$b17.vhd:357$959.
  creating $alu model for $macc $flatten\P3.$verific$sub_369$b17.vhd:355$955.
  creating $alu model for $macc $flatten\P3.$verific$add_760$b17.vhd:586$1131.
  creating $alu model for $macc $flatten\P3.$verific$add_689$b17.vhd:552$1071.
  creating $alu model for $macc $flatten\P3.$verific$add_681$b17.vhd:546$1069.
  creating $alu model for $macc $flatten\P3.$verific$add_522$b17.vhd:457$1035.
  creating $alu model for $macc $flatten\P3.$verific$add_477$b17.vhd:430$1002.
  creating $alu model for $macc $flatten\P3.$verific$add_435$b17.vhd:395$987.
  creating $alu model for $macc $flatten\P3.$verific$add_427$b17.vhd:391$984.
  creating $alu model for $macc $flatten\P3.$verific$add_426$b17.vhd:391$983.
  creating $alu model for $macc $flatten\P3.$verific$add_424$b17.vhd:391$980.
  creating $alu model for $macc $flatten\P3.$verific$add_422$b17.vhd:391$977.
  creating $alu model for $macc $flatten\P3.$verific$add_403$b17.vhd:371$972.
  creating $alu model for $macc $flatten\P3.$verific$add_399$b17.vhd:371$971.
  creating $alu model for $macc $flatten\P3.$verific$add_387$b17.vhd:360$963.
  creating $alu model for $macc $flatten\P3.$verific$add_383$b17.vhd:360$962.
  creating $alu model for $macc $flatten\P3.$verific$add_362$b17.vhd:345$953.
  creating $alu model for $macc $flatten\P3.$verific$add_360$b17.vhd:344$951.
  creating $alu model for $macc $flatten\P3.$verific$add_284$b17.vhd:318$923.
  creating $alu model for $macc $flatten\P3.$verific$add_281$b17.vhd:315$921.
  creating $alu model for $macc $flatten\P3.$verific$add_28$b17.vhd:125$741.
  creating $alu model for $macc $flatten\P3.$verific$add_278$b17.vhd:314$920.
  creating $alu model for $macc $flatten\P3.$verific$add_254$b17.vhd:312$895.
  creating $alu model for $macc $flatten\P3.$verific$add_230$b17.vhd:309$869.
  creating $alu model for $macc $flatten\P3.$verific$add_210$b17.vhd:306$849.
  creating $alu model for $macc $flatten\P3.$verific$add_113$b17.vhd:197$791.
  creating $alu model for $macc $flatten\P2.$verific$unary_minus_756$b17.vhd:580$1125.
  creating $alu model for $macc $flatten\P2.$verific$unary_minus_464$b17.vhd:414$997.
  creating $alu model for $macc $flatten\P2.$verific$unary_minus_287$b17.vhd:320$926.
  creating $alu model for $macc $flatten\P2.$verific$sub_767$b17.vhd:589$1136.
  creating $alu model for $macc $flatten\P2.$verific$sub_744$b17.vhd:563$1115.
  creating $alu model for $macc $flatten\P2.$verific$sub_379$b17.vhd:357$960.
  creating $alu model for $macc $flatten\P2.$verific$sub_378$b17.vhd:357$959.
  creating $alu model for $macc $flatten\P2.$verific$sub_369$b17.vhd:355$955.
  creating $alu model for $macc $flatten\P2.$verific$add_760$b17.vhd:586$1131.
  creating $alu model for $macc $flatten\P2.$verific$add_689$b17.vhd:552$1071.
  creating $alu model for $macc $flatten\P2.$verific$add_681$b17.vhd:546$1069.
  creating $alu model for $macc $flatten\P2.$verific$add_522$b17.vhd:457$1035.
  creating $alu model for $macc $flatten\P2.$verific$add_477$b17.vhd:430$1002.
  creating $alu model for $macc $flatten\P2.$verific$add_435$b17.vhd:395$987.
  creating $alu model for $macc $flatten\P2.$verific$add_427$b17.vhd:391$984.
  creating $alu model for $macc $flatten\P2.$verific$add_426$b17.vhd:391$983.
  creating $alu model for $macc $flatten\P2.$verific$add_424$b17.vhd:391$980.
  creating $alu model for $macc $flatten\P2.$verific$add_422$b17.vhd:391$977.
  creating $alu model for $macc $flatten\P2.$verific$add_403$b17.vhd:371$972.
  creating $alu model for $macc $flatten\P2.$verific$add_399$b17.vhd:371$971.
  creating $alu model for $macc $flatten\P2.$verific$add_387$b17.vhd:360$963.
  creating $alu model for $macc $flatten\P2.$verific$add_383$b17.vhd:360$962.
  creating $alu model for $macc $flatten\P2.$verific$add_362$b17.vhd:345$953.
  creating $alu model for $macc $flatten\P2.$verific$add_360$b17.vhd:344$951.
  creating $alu model for $macc $flatten\P2.$verific$add_284$b17.vhd:318$923.
  creating $alu model for $macc $flatten\P2.$verific$add_281$b17.vhd:315$921.
  creating $alu model for $macc $flatten\P2.$verific$add_28$b17.vhd:125$741.
  creating $alu model for $macc $flatten\P2.$verific$add_278$b17.vhd:314$920.
  creating $alu model for $macc $flatten\P2.$verific$add_259$b17.vhd:313$899.
  creating $alu model for $macc $flatten\P2.$verific$add_254$b17.vhd:312$895.
  creating $alu model for $macc $flatten\P2.$verific$add_235$b17.vhd:311$873.
  creating $alu model for $macc $flatten\P2.$verific$add_230$b17.vhd:309$869.
  creating $alu model for $macc $flatten\P2.$verific$add_210$b17.vhd:306$849.
  creating $alu model for $macc $flatten\P2.$verific$add_113$b17.vhd:197$791.
  creating $alu model for $macc $flatten\P1.$verific$unary_minus_756$b17.vhd:580$1125.
  creating $alu model for $macc $flatten\P1.$verific$unary_minus_464$b17.vhd:414$997.
  creating $alu model for $macc $flatten\P1.$verific$unary_minus_287$b17.vhd:320$926.
  creating $alu model for $macc $flatten\P1.$verific$sub_767$b17.vhd:589$1136.
  creating $alu model for $macc $flatten\P1.$verific$sub_744$b17.vhd:563$1115.
  creating $alu model for $macc $flatten\P1.$verific$sub_379$b17.vhd:357$960.
  creating $alu model for $macc $flatten\P1.$verific$sub_378$b17.vhd:357$959.
  creating $alu model for $macc $flatten\P1.$verific$sub_369$b17.vhd:355$955.
  creating $alu model for $macc $flatten\P1.$verific$add_760$b17.vhd:586$1131.
  creating $alu model for $macc $flatten\P1.$verific$add_689$b17.vhd:552$1071.
  creating $alu model for $macc $flatten\P1.$verific$add_681$b17.vhd:546$1069.
  creating $alu model for $macc $flatten\P1.$verific$add_522$b17.vhd:457$1035.
  creating $alu model for $macc $flatten\P1.$verific$add_477$b17.vhd:430$1002.
  creating $alu model for $macc $flatten\P1.$verific$add_435$b17.vhd:395$987.
  creating $alu model for $macc $flatten\P1.$verific$add_427$b17.vhd:391$984.
  creating $alu model for $macc $flatten\P1.$verific$add_426$b17.vhd:391$983.
  creating $alu model for $macc $flatten\P1.$verific$add_424$b17.vhd:391$980.
  creating $alu model for $macc $flatten\P1.$verific$add_422$b17.vhd:391$977.
  creating $alu model for $macc $flatten\P1.$verific$add_403$b17.vhd:371$972.
  creating $alu model for $macc $flatten\P1.$verific$add_399$b17.vhd:371$971.
  creating $alu model for $macc $flatten\P1.$verific$add_387$b17.vhd:360$963.
  creating $alu model for $macc $flatten\P1.$verific$add_383$b17.vhd:360$962.
  creating $alu model for $macc $flatten\P1.$verific$add_362$b17.vhd:345$953.
  creating $alu model for $macc $flatten\P1.$verific$add_360$b17.vhd:344$951.
  creating $alu model for $macc $flatten\P1.$verific$add_284$b17.vhd:318$923.
  creating $alu model for $macc $flatten\P1.$verific$add_281$b17.vhd:315$921.
  creating $alu model for $macc $flatten\P1.$verific$add_28$b17.vhd:125$741.
  creating $alu model for $macc $flatten\P1.$verific$add_278$b17.vhd:314$920.
  creating $alu model for $macc $flatten\P1.$verific$add_259$b17.vhd:313$899.
  creating $alu model for $macc $flatten\P1.$verific$add_254$b17.vhd:312$895.
  creating $alu model for $macc $flatten\P1.$verific$add_235$b17.vhd:311$873.
  creating $alu model for $macc $flatten\P1.$verific$add_230$b17.vhd:309$869.
  creating $alu model for $macc $flatten\P1.$verific$add_210$b17.vhd:306$849.
  creating $alu model for $macc $flatten\P1.$verific$add_113$b17.vhd:197$791.
  creating $alu model for $flatten\P1.$verific$LessThan_286$b17.vhd:319$925 ($lt): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_370$b17.vhd:355$956 ($le): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_373$b17.vhd:356$958 ($lt): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_397$b17.vhd:370$970 ($le): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_462$b17.vhd:412$995 ($le): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_463$b17.vhd:413$996 ($lt): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_742$b17.vhd:563$1113 ($lt): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_745$b17.vhd:563$1116 ($lt): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_755$b17.vhd:579$1124 ($lt): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_768$b17.vhd:589$1137 ($lt): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_771$b17.vhd:597$1139 ($le): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_286$b17.vhd:319$925 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_370$b17.vhd:355$956 ($le): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_373$b17.vhd:356$958 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_397$b17.vhd:370$970 ($le): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_462$b17.vhd:412$995 ($le): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_463$b17.vhd:413$996 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_742$b17.vhd:563$1113 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_745$b17.vhd:563$1116 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_755$b17.vhd:579$1124 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_768$b17.vhd:589$1137 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_771$b17.vhd:597$1139 ($le): new $alu
  creating $alu model for $flatten\P3.$verific$LessThan_286$b17.vhd:319$925 ($lt): new $alu
  creating $alu model for $flatten\P3.$verific$LessThan_370$b17.vhd:355$956 ($le): new $alu
  creating $alu model for $flatten\P3.$verific$LessThan_373$b17.vhd:356$958 ($lt): new $alu
  creating $alu model for $flatten\P3.$verific$LessThan_397$b17.vhd:370$970 ($le): new $alu
  creating $alu model for $flatten\P3.$verific$LessThan_462$b17.vhd:412$995 ($le): new $alu
  creating $alu model for $flatten\P3.$verific$LessThan_463$b17.vhd:413$996 ($lt): new $alu
  creating $alu model for $flatten\P3.$verific$LessThan_742$b17.vhd:563$1113 ($lt): new $alu
  creating $alu model for $flatten\P3.$verific$LessThan_745$b17.vhd:563$1116 ($lt): new $alu
  creating $alu model for $flatten\P3.$verific$LessThan_755$b17.vhd:579$1124 ($lt): new $alu
  creating $alu model for $flatten\P3.$verific$LessThan_768$b17.vhd:589$1137 ($lt): new $alu
  creating $alu model for $flatten\P3.$verific$LessThan_771$b17.vhd:597$1139 ($le): new $alu
  creating $alu model for $verific$LessThan_18$b17.vhd:730$78 ($lt): new $alu
  creating $alu model for $verific$LessThan_44$b17.vhd:748$96 ($lt): merged with $verific$LessThan_18$b17.vhd:730$78.
  creating $alu model for $verific$LessThan_6$b17.vhd:726$67 ($lt): new $alu
  creating $alu model for $verific$LessThan_84$b17.vhd:782$120 ($lt): new $alu
  creating $alu model for $verific$LessThan_85$b17.vhd:782$121 ($lt): new $alu
  creating $alu model for $verific$LessThan_86$b17.vhd:782$122 ($lt): new $alu
  creating $alu cell for $verific$LessThan_86$b17.vhd:782$122: $auto$alumacc.cc:485:replace_alu$2319
  creating $alu cell for $verific$LessThan_85$b17.vhd:782$121: $auto$alumacc.cc:485:replace_alu$2324
  creating $alu cell for $verific$LessThan_84$b17.vhd:782$120: $auto$alumacc.cc:485:replace_alu$2329
  creating $alu cell for $verific$LessThan_6$b17.vhd:726$67: $auto$alumacc.cc:485:replace_alu$2334
  creating $alu cell for $verific$LessThan_18$b17.vhd:730$78, $verific$LessThan_44$b17.vhd:748$96: $auto$alumacc.cc:485:replace_alu$2345
  creating $alu cell for $flatten\P3.$verific$LessThan_771$b17.vhd:597$1139: $auto$alumacc.cc:485:replace_alu$2356
  creating $alu cell for $flatten\P3.$verific$LessThan_768$b17.vhd:589$1137: $auto$alumacc.cc:485:replace_alu$2365
  creating $alu cell for $flatten\P3.$verific$LessThan_755$b17.vhd:579$1124: $auto$alumacc.cc:485:replace_alu$2370
  creating $alu cell for $flatten\P3.$verific$LessThan_745$b17.vhd:563$1116: $auto$alumacc.cc:485:replace_alu$2375
  creating $alu cell for $flatten\P3.$verific$LessThan_742$b17.vhd:563$1113: $auto$alumacc.cc:485:replace_alu$2380
  creating $alu cell for $flatten\P3.$verific$LessThan_463$b17.vhd:413$996: $auto$alumacc.cc:485:replace_alu$2391
  creating $alu cell for $flatten\P3.$verific$LessThan_462$b17.vhd:412$995: $auto$alumacc.cc:485:replace_alu$2396
  creating $alu cell for $flatten\P3.$verific$LessThan_397$b17.vhd:370$970: $auto$alumacc.cc:485:replace_alu$2409
  creating $alu cell for $flatten\P3.$verific$LessThan_373$b17.vhd:356$958: $auto$alumacc.cc:485:replace_alu$2422
  creating $alu cell for $flatten\P3.$verific$LessThan_370$b17.vhd:355$956: $auto$alumacc.cc:485:replace_alu$2427
  creating $alu cell for $flatten\P3.$verific$LessThan_286$b17.vhd:319$925: $auto$alumacc.cc:485:replace_alu$2440
  creating $alu cell for $flatten\P2.$verific$LessThan_771$b17.vhd:597$1139: $auto$alumacc.cc:485:replace_alu$2445
  creating $alu cell for $flatten\P2.$verific$LessThan_768$b17.vhd:589$1137: $auto$alumacc.cc:485:replace_alu$2454
  creating $alu cell for $flatten\P2.$verific$LessThan_755$b17.vhd:579$1124: $auto$alumacc.cc:485:replace_alu$2459
  creating $alu cell for $flatten\P2.$verific$LessThan_745$b17.vhd:563$1116: $auto$alumacc.cc:485:replace_alu$2464
  creating $alu cell for $flatten\P2.$verific$LessThan_742$b17.vhd:563$1113: $auto$alumacc.cc:485:replace_alu$2469
  creating $alu cell for $flatten\P2.$verific$LessThan_463$b17.vhd:413$996: $auto$alumacc.cc:485:replace_alu$2480
  creating $alu cell for $flatten\P2.$verific$LessThan_462$b17.vhd:412$995: $auto$alumacc.cc:485:replace_alu$2485
  creating $alu cell for $flatten\P2.$verific$LessThan_397$b17.vhd:370$970: $auto$alumacc.cc:485:replace_alu$2498
  creating $alu cell for $flatten\P2.$verific$LessThan_373$b17.vhd:356$958: $auto$alumacc.cc:485:replace_alu$2511
  creating $alu cell for $flatten\P2.$verific$LessThan_370$b17.vhd:355$956: $auto$alumacc.cc:485:replace_alu$2516
  creating $alu cell for $flatten\P2.$verific$LessThan_286$b17.vhd:319$925: $auto$alumacc.cc:485:replace_alu$2529
  creating $alu cell for $flatten\P1.$verific$LessThan_771$b17.vhd:597$1139: $auto$alumacc.cc:485:replace_alu$2534
  creating $alu cell for $flatten\P1.$verific$LessThan_768$b17.vhd:589$1137: $auto$alumacc.cc:485:replace_alu$2543
  creating $alu cell for $flatten\P1.$verific$LessThan_755$b17.vhd:579$1124: $auto$alumacc.cc:485:replace_alu$2548
  creating $alu cell for $flatten\P1.$verific$LessThan_745$b17.vhd:563$1116: $auto$alumacc.cc:485:replace_alu$2553
  creating $alu cell for $flatten\P1.$verific$LessThan_742$b17.vhd:563$1113: $auto$alumacc.cc:485:replace_alu$2558
  creating $alu cell for $flatten\P1.$verific$LessThan_463$b17.vhd:413$996: $auto$alumacc.cc:485:replace_alu$2569
  creating $alu cell for $flatten\P1.$verific$LessThan_462$b17.vhd:412$995: $auto$alumacc.cc:485:replace_alu$2574
  creating $alu cell for $flatten\P1.$verific$LessThan_397$b17.vhd:370$970: $auto$alumacc.cc:485:replace_alu$2587
  creating $alu cell for $flatten\P1.$verific$LessThan_373$b17.vhd:356$958: $auto$alumacc.cc:485:replace_alu$2600
  creating $alu cell for $flatten\P1.$verific$LessThan_370$b17.vhd:355$956: $auto$alumacc.cc:485:replace_alu$2605
  creating $alu cell for $flatten\P1.$verific$LessThan_286$b17.vhd:319$925: $auto$alumacc.cc:485:replace_alu$2618
  creating $alu cell for $flatten\P1.$verific$add_113$b17.vhd:197$791: $auto$alumacc.cc:485:replace_alu$2623
  creating $alu cell for $flatten\P1.$verific$add_210$b17.vhd:306$849: $auto$alumacc.cc:485:replace_alu$2626
  creating $alu cell for $flatten\P1.$verific$add_230$b17.vhd:309$869: $auto$alumacc.cc:485:replace_alu$2629
  creating $alu cell for $flatten\P1.$verific$add_235$b17.vhd:311$873: $auto$alumacc.cc:485:replace_alu$2632
  creating $alu cell for $flatten\P1.$verific$add_254$b17.vhd:312$895: $auto$alumacc.cc:485:replace_alu$2635
  creating $alu cell for $flatten\P1.$verific$add_259$b17.vhd:313$899: $auto$alumacc.cc:485:replace_alu$2638
  creating $alu cell for $flatten\P1.$verific$add_278$b17.vhd:314$920: $auto$alumacc.cc:485:replace_alu$2641
  creating $alu cell for $flatten\P1.$verific$add_28$b17.vhd:125$741: $auto$alumacc.cc:485:replace_alu$2644
  creating $alu cell for $flatten\P1.$verific$add_281$b17.vhd:315$921: $auto$alumacc.cc:485:replace_alu$2647
  creating $alu cell for $flatten\P1.$verific$add_284$b17.vhd:318$923: $auto$alumacc.cc:485:replace_alu$2650
  creating $alu cell for $flatten\P1.$verific$add_360$b17.vhd:344$951: $auto$alumacc.cc:485:replace_alu$2653
  creating $alu cell for $flatten\P1.$verific$add_362$b17.vhd:345$953: $auto$alumacc.cc:485:replace_alu$2656
  creating $alu cell for $flatten\P1.$verific$add_383$b17.vhd:360$962: $auto$alumacc.cc:485:replace_alu$2659
  creating $alu cell for $flatten\P1.$verific$add_387$b17.vhd:360$963: $auto$alumacc.cc:485:replace_alu$2662
  creating $alu cell for $flatten\P1.$verific$add_399$b17.vhd:371$971: $auto$alumacc.cc:485:replace_alu$2665
  creating $alu cell for $flatten\P1.$verific$add_403$b17.vhd:371$972: $auto$alumacc.cc:485:replace_alu$2668
  creating $alu cell for $flatten\P1.$verific$add_422$b17.vhd:391$977: $auto$alumacc.cc:485:replace_alu$2671
  creating $alu cell for $flatten\P1.$verific$add_424$b17.vhd:391$980: $auto$alumacc.cc:485:replace_alu$2674
  creating $alu cell for $flatten\P1.$verific$add_426$b17.vhd:391$983: $auto$alumacc.cc:485:replace_alu$2677
  creating $alu cell for $flatten\P1.$verific$add_427$b17.vhd:391$984: $auto$alumacc.cc:485:replace_alu$2680
  creating $alu cell for $flatten\P1.$verific$add_435$b17.vhd:395$987: $auto$alumacc.cc:485:replace_alu$2683
  creating $alu cell for $flatten\P1.$verific$add_477$b17.vhd:430$1002: $auto$alumacc.cc:485:replace_alu$2686
  creating $alu cell for $flatten\P1.$verific$add_522$b17.vhd:457$1035: $auto$alumacc.cc:485:replace_alu$2689
  creating $alu cell for $flatten\P1.$verific$add_681$b17.vhd:546$1069: $auto$alumacc.cc:485:replace_alu$2692
  creating $alu cell for $flatten\P1.$verific$add_689$b17.vhd:552$1071: $auto$alumacc.cc:485:replace_alu$2695
  creating $alu cell for $flatten\P1.$verific$add_760$b17.vhd:586$1131: $auto$alumacc.cc:485:replace_alu$2698
  creating $alu cell for $flatten\P1.$verific$sub_369$b17.vhd:355$955: $auto$alumacc.cc:485:replace_alu$2701
  creating $alu cell for $flatten\P1.$verific$sub_378$b17.vhd:357$959: $auto$alumacc.cc:485:replace_alu$2704
  creating $alu cell for $flatten\P1.$verific$sub_379$b17.vhd:357$960: $auto$alumacc.cc:485:replace_alu$2707
  creating $alu cell for $flatten\P1.$verific$sub_744$b17.vhd:563$1115: $auto$alumacc.cc:485:replace_alu$2710
  creating $alu cell for $flatten\P1.$verific$sub_767$b17.vhd:589$1136: $auto$alumacc.cc:485:replace_alu$2713
  creating $alu cell for $flatten\P1.$verific$unary_minus_287$b17.vhd:320$926: $auto$alumacc.cc:485:replace_alu$2716
  creating $alu cell for $flatten\P1.$verific$unary_minus_464$b17.vhd:414$997: $auto$alumacc.cc:485:replace_alu$2719
  creating $alu cell for $flatten\P1.$verific$unary_minus_756$b17.vhd:580$1125: $auto$alumacc.cc:485:replace_alu$2722
  creating $alu cell for $flatten\P2.$verific$add_113$b17.vhd:197$791: $auto$alumacc.cc:485:replace_alu$2725
  creating $alu cell for $flatten\P2.$verific$add_210$b17.vhd:306$849: $auto$alumacc.cc:485:replace_alu$2728
  creating $alu cell for $flatten\P2.$verific$add_230$b17.vhd:309$869: $auto$alumacc.cc:485:replace_alu$2731
  creating $alu cell for $flatten\P2.$verific$add_235$b17.vhd:311$873: $auto$alumacc.cc:485:replace_alu$2734
  creating $alu cell for $flatten\P2.$verific$add_254$b17.vhd:312$895: $auto$alumacc.cc:485:replace_alu$2737
  creating $alu cell for $flatten\P2.$verific$add_259$b17.vhd:313$899: $auto$alumacc.cc:485:replace_alu$2740
  creating $alu cell for $flatten\P2.$verific$add_278$b17.vhd:314$920: $auto$alumacc.cc:485:replace_alu$2743
  creating $alu cell for $flatten\P2.$verific$add_28$b17.vhd:125$741: $auto$alumacc.cc:485:replace_alu$2746
  creating $alu cell for $flatten\P2.$verific$add_281$b17.vhd:315$921: $auto$alumacc.cc:485:replace_alu$2749
  creating $alu cell for $flatten\P2.$verific$add_284$b17.vhd:318$923: $auto$alumacc.cc:485:replace_alu$2752
  creating $alu cell for $flatten\P2.$verific$add_360$b17.vhd:344$951: $auto$alumacc.cc:485:replace_alu$2755
  creating $alu cell for $flatten\P2.$verific$add_362$b17.vhd:345$953: $auto$alumacc.cc:485:replace_alu$2758
  creating $alu cell for $flatten\P2.$verific$add_383$b17.vhd:360$962: $auto$alumacc.cc:485:replace_alu$2761
  creating $alu cell for $flatten\P2.$verific$add_387$b17.vhd:360$963: $auto$alumacc.cc:485:replace_alu$2764
  creating $alu cell for $flatten\P2.$verific$add_399$b17.vhd:371$971: $auto$alumacc.cc:485:replace_alu$2767
  creating $alu cell for $flatten\P2.$verific$add_403$b17.vhd:371$972: $auto$alumacc.cc:485:replace_alu$2770
  creating $alu cell for $flatten\P2.$verific$add_422$b17.vhd:391$977: $auto$alumacc.cc:485:replace_alu$2773
  creating $alu cell for $flatten\P2.$verific$add_424$b17.vhd:391$980: $auto$alumacc.cc:485:replace_alu$2776
  creating $alu cell for $flatten\P2.$verific$add_426$b17.vhd:391$983: $auto$alumacc.cc:485:replace_alu$2779
  creating $alu cell for $flatten\P2.$verific$add_427$b17.vhd:391$984: $auto$alumacc.cc:485:replace_alu$2782
  creating $alu cell for $flatten\P2.$verific$add_435$b17.vhd:395$987: $auto$alumacc.cc:485:replace_alu$2785
  creating $alu cell for $flatten\P2.$verific$add_477$b17.vhd:430$1002: $auto$alumacc.cc:485:replace_alu$2788
  creating $alu cell for $flatten\P2.$verific$add_522$b17.vhd:457$1035: $auto$alumacc.cc:485:replace_alu$2791
  creating $alu cell for $flatten\P2.$verific$add_681$b17.vhd:546$1069: $auto$alumacc.cc:485:replace_alu$2794
  creating $alu cell for $flatten\P2.$verific$add_689$b17.vhd:552$1071: $auto$alumacc.cc:485:replace_alu$2797
  creating $alu cell for $flatten\P2.$verific$add_760$b17.vhd:586$1131: $auto$alumacc.cc:485:replace_alu$2800
  creating $alu cell for $flatten\P2.$verific$sub_369$b17.vhd:355$955: $auto$alumacc.cc:485:replace_alu$2803
  creating $alu cell for $flatten\P2.$verific$sub_378$b17.vhd:357$959: $auto$alumacc.cc:485:replace_alu$2806
  creating $alu cell for $flatten\P2.$verific$sub_379$b17.vhd:357$960: $auto$alumacc.cc:485:replace_alu$2809
  creating $alu cell for $flatten\P2.$verific$sub_744$b17.vhd:563$1115: $auto$alumacc.cc:485:replace_alu$2812
  creating $alu cell for $flatten\P2.$verific$sub_767$b17.vhd:589$1136: $auto$alumacc.cc:485:replace_alu$2815
  creating $alu cell for $flatten\P2.$verific$unary_minus_287$b17.vhd:320$926: $auto$alumacc.cc:485:replace_alu$2818
  creating $alu cell for $flatten\P2.$verific$unary_minus_464$b17.vhd:414$997: $auto$alumacc.cc:485:replace_alu$2821
  creating $alu cell for $flatten\P2.$verific$unary_minus_756$b17.vhd:580$1125: $auto$alumacc.cc:485:replace_alu$2824
  creating $alu cell for $flatten\P3.$verific$add_113$b17.vhd:197$791: $auto$alumacc.cc:485:replace_alu$2827
  creating $alu cell for $flatten\P3.$verific$add_210$b17.vhd:306$849: $auto$alumacc.cc:485:replace_alu$2830
  creating $alu cell for $flatten\P3.$verific$add_230$b17.vhd:309$869: $auto$alumacc.cc:485:replace_alu$2833
  creating $alu cell for $flatten\P3.$verific$add_254$b17.vhd:312$895: $auto$alumacc.cc:485:replace_alu$2836
  creating $alu cell for $flatten\P3.$verific$add_278$b17.vhd:314$920: $auto$alumacc.cc:485:replace_alu$2839
  creating $alu cell for $flatten\P3.$verific$add_28$b17.vhd:125$741: $auto$alumacc.cc:485:replace_alu$2842
  creating $alu cell for $flatten\P3.$verific$add_281$b17.vhd:315$921: $auto$alumacc.cc:485:replace_alu$2845
  creating $alu cell for $flatten\P3.$verific$add_284$b17.vhd:318$923: $auto$alumacc.cc:485:replace_alu$2848
  creating $alu cell for $flatten\P3.$verific$add_360$b17.vhd:344$951: $auto$alumacc.cc:485:replace_alu$2851
  creating $alu cell for $flatten\P3.$verific$add_362$b17.vhd:345$953: $auto$alumacc.cc:485:replace_alu$2854
  creating $alu cell for $flatten\P3.$verific$add_383$b17.vhd:360$962: $auto$alumacc.cc:485:replace_alu$2857
  creating $alu cell for $flatten\P3.$verific$add_387$b17.vhd:360$963: $auto$alumacc.cc:485:replace_alu$2860
  creating $alu cell for $flatten\P3.$verific$add_399$b17.vhd:371$971: $auto$alumacc.cc:485:replace_alu$2863
  creating $alu cell for $flatten\P3.$verific$add_403$b17.vhd:371$972: $auto$alumacc.cc:485:replace_alu$2866
  creating $alu cell for $flatten\P3.$verific$add_422$b17.vhd:391$977: $auto$alumacc.cc:485:replace_alu$2869
  creating $alu cell for $flatten\P3.$verific$add_424$b17.vhd:391$980: $auto$alumacc.cc:485:replace_alu$2872
  creating $alu cell for $flatten\P3.$verific$add_426$b17.vhd:391$983: $auto$alumacc.cc:485:replace_alu$2875
  creating $alu cell for $flatten\P3.$verific$add_427$b17.vhd:391$984: $auto$alumacc.cc:485:replace_alu$2878
  creating $alu cell for $flatten\P3.$verific$add_435$b17.vhd:395$987: $auto$alumacc.cc:485:replace_alu$2881
  creating $alu cell for $flatten\P3.$verific$add_477$b17.vhd:430$1002: $auto$alumacc.cc:485:replace_alu$2884
  creating $alu cell for $flatten\P3.$verific$add_522$b17.vhd:457$1035: $auto$alumacc.cc:485:replace_alu$2887
  creating $alu cell for $flatten\P3.$verific$add_681$b17.vhd:546$1069: $auto$alumacc.cc:485:replace_alu$2890
  creating $alu cell for $flatten\P3.$verific$add_689$b17.vhd:552$1071: $auto$alumacc.cc:485:replace_alu$2893
  creating $alu cell for $flatten\P3.$verific$add_760$b17.vhd:586$1131: $auto$alumacc.cc:485:replace_alu$2896
  creating $alu cell for $flatten\P3.$verific$sub_369$b17.vhd:355$955: $auto$alumacc.cc:485:replace_alu$2899
  creating $alu cell for $flatten\P3.$verific$sub_378$b17.vhd:357$959: $auto$alumacc.cc:485:replace_alu$2902
  creating $alu cell for $flatten\P3.$verific$sub_379$b17.vhd:357$960: $auto$alumacc.cc:485:replace_alu$2905
  creating $alu cell for $flatten\P3.$verific$sub_744$b17.vhd:563$1115: $auto$alumacc.cc:485:replace_alu$2908
  creating $alu cell for $flatten\P3.$verific$sub_767$b17.vhd:589$1136: $auto$alumacc.cc:485:replace_alu$2911
  creating $alu cell for $flatten\P3.$verific$unary_minus_287$b17.vhd:320$926: $auto$alumacc.cc:485:replace_alu$2914
  creating $alu cell for $flatten\P3.$verific$unary_minus_464$b17.vhd:414$997: $auto$alumacc.cc:485:replace_alu$2917
  creating $alu cell for $flatten\P3.$verific$unary_minus_756$b17.vhd:580$1125: $auto$alumacc.cc:485:replace_alu$2920
  created 138 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~27 debug messages>

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~36 debug messages>
Removed a total of 12 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~299 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$2193: { $flatten\P3.$verific$n7979$276 $flatten\P3.$verific$n7980$277 $flatten\P3.$verific$n7981$278 $flatten\P3.$verific$n7982$279 $flatten\P3.$verific$n7983$280 $flatten\P3.$verific$n7984$281 $flatten\P3.$verific$n7986$283 $flatten\P3.$verific$n7988$285 $flatten\P3.$verific$n7989$286 $flatten\P3.$verific$n7990$287 $flatten\P3.$verific$n7991$288 $flatten\P3.$verific$n7992$289 $flatten\P3.$verific$n7993$290 $flatten\P3.$verific$n7994$291 $flatten\P3.$verific$n7995$292 $flatten\P3.$verific$n7996$293 $flatten\P3.$verific$n7997$294 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$2141: { $auto$rtlil.cc:2393:Or$2130 $flatten\P3.$verific$n7987$284 $flatten\P3.$verific$n7988$285 $flatten\P3.$verific$n7989$286 $flatten\P3.$verific$n7990$287 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1907: { $flatten\P2.$verific$n7987$284 $flatten\P2.$verific$n7988$285 $flatten\P2.$verific$n7989$286 $flatten\P2.$verific$n7990$287 $auto$rtlil.cc:2393:Or$1896 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1673: { $auto$rtlil.cc:2393:Or$1662 $flatten\P1.$verific$n7987$284 $flatten\P1.$verific$n7988$285 $flatten\P1.$verific$n7989$286 $flatten\P1.$verific$n7990$287 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$2165: { $auto$rtlil.cc:2393:Or$2130 $flatten\P3.$verific$n7988$285 $flatten\P3.$verific$n7989$286 $flatten\P3.$verific$n7990$287 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1931: { $flatten\P2.$verific$n7988$285 $flatten\P2.$verific$n7989$286 $flatten\P2.$verific$n7990$287 $auto$rtlil.cc:2393:Or$1896 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1959: { $flatten\P2.$verific$n7979$276 $flatten\P2.$verific$n7980$277 $flatten\P2.$verific$n7981$278 $flatten\P2.$verific$n7982$279 $flatten\P2.$verific$n7983$280 $flatten\P2.$verific$n7984$281 $flatten\P2.$verific$n7986$283 $flatten\P2.$verific$n7988$285 $flatten\P2.$verific$n7989$286 $flatten\P2.$verific$n7990$287 $flatten\P2.$verific$n7991$288 $flatten\P2.$verific$n7992$289 $flatten\P2.$verific$n7993$290 $flatten\P2.$verific$n7994$291 $flatten\P2.$verific$n7995$292 $flatten\P2.$verific$n7996$293 $flatten\P2.$verific$n7997$294 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1697: { $auto$rtlil.cc:2393:Or$1662 $flatten\P1.$verific$n7988$285 $flatten\P1.$verific$n7989$286 $flatten\P1.$verific$n7990$287 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1725: { $flatten\P1.$verific$n7979$276 $flatten\P1.$verific$n7980$277 $flatten\P1.$verific$n7981$278 $flatten\P1.$verific$n7982$279 $flatten\P1.$verific$n7983$280 $flatten\P1.$verific$n7984$281 $flatten\P1.$verific$n7986$283 $flatten\P1.$verific$n7988$285 $flatten\P1.$verific$n7989$286 $flatten\P1.$verific$n7990$287 $flatten\P1.$verific$n7991$288 $flatten\P1.$verific$n7992$289 $flatten\P1.$verific$n7993$290 $flatten\P1.$verific$n7994$291 $flatten\P1.$verific$n7995$292 $flatten\P1.$verific$n7996$293 $flatten\P1.$verific$n7997$294 }
  Optimizing cells in module \b17.
Performed a total of 9 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 17 unused cells and 79 unused wires.
<suppressed ~20 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~299 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> techmap

3.22. Executing TECHMAP pass (map to technology primitives).

3.22.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.22.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $not.
Using template $paramod$403d07c18de10cda2ac652a859c56aea81aaf9b5\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $adff.
Using template $paramod$740b056ede97228d3eae64ea2fdc81f0a33e0fe7\_90_alu for cells of type $alu.
Using template $paramod$ebf89ea36a793f0f77858f212141d47c833068ad\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $bmux.
Using template $paramod$653d0dc5a667330298513325d0bd1def0e6c1128\_90_alu for cells of type $alu.
Using template $paramod$e04283ca12514baf3d204c6994bec8f178dd89f8\_90_alu for cells of type $alu.
Using template $paramod$e891e6b399cf52748460a311fafe476815d24bd7\_90_alu for cells of type $alu.
Using template $paramod$788c3d57e5abb3a3f89aea6d4acd665be37f4e9b\_90_alu for cells of type $alu.
Using template $paramod$c6baa65225090ac0a120feab1b920965244aa496\_90_alu for cells of type $alu.
Using template $paramod$b85fbb3374a1d9ba7ee4f4d6323c30f939df3ada\_90_alu for cells of type $alu.
Using template $paramod$44a13d10af618e7fbe7b9aad2f6151ffcee1e2fa\_90_alu for cells of type $alu.
Using template $paramod$83dd457849c736323edf2edb15923eb27f99c683\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $eq.
Using template $paramod$b3c20b05d9b1fc2c940ef2f6c917486aead042e8\_90_alu for cells of type $alu.
Using template $paramod$6a42b6fefed750f8a1c58eab59479d960557103c\_90_alu for cells of type $alu.
Using template $paramod$3b7577489eb4433b1d5620cab7f3794743dee5ea\_90_alu for cells of type $alu.
Using template $paramod$d1615bf4e5e328245ffd1550e5fe105901cda77b\_90_alu for cells of type $alu.
Using template $paramod$1a3a0c35c4a4896fbfd612699525c057298e72d2\_90_alu for cells of type $alu.
Using template $paramod$bfceb922395790c0ce92e9f9b5b428d4fc72cc30\_90_alu for cells of type $alu.
Using template $paramod$a2af9b43308e3114c3b5dd3f4dc3329b2387395d\_90_alu for cells of type $alu.
Using template $paramod$f85408ed1aa3d09e465edae8a7bf590332ae9f7b\_90_alu for cells of type $alu.
Using template $paramod$175e67c02b86e96b1288b9dc100122520d7240d8\_90_alu for cells of type $alu.
Using template $paramod$076c9a7a3f037230073fe14dd4865d470cb48917\_90_alu for cells of type $alu.
Using template $paramod$91f82ead1edc61e0a1452110f15ef747116b421b\_90_alu for cells of type $alu.
Using template $paramod$dfca81329cbbac01700318224209a5f2318c7128\_90_alu for cells of type $alu.
Using template $paramod$4ccbe221165818e15f326ddee3d1183c7924e12f\_90_alu for cells of type $alu.
Using template $paramod$fbc7873bff55778c0b3173955b7e4bce1d9d6834\_90_alu for cells of type $alu.
Using template $paramod$943564b9366bbc392bf4bbc801aa0a2d7742a4e0\_90_alu for cells of type $alu.
Using template $paramod$32a7b7b86c07519b7537abc18e96f0331f97914d\_90_alu for cells of type $alu.
Using template $paramod$constmap:0c58e37f7f9ab9c08bb604a660a738f4cdfdf6a8$paramod$0c53878c2ab6a84f047b5c15f705bf752551700e\_90_shift_ops_shr_shl_sshl_sshr for cells of type $shl.
Using template $paramod$c3cd1564c35d873179656addd6052d7ea8b6d991\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011110 for cells of type $lcu.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011111 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000011 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001111 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001000 for cells of type $lcu.
No more expansions possible.
<suppressed ~14727 debug messages>

yosys> opt

3.23. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.23.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~23579 debug messages>

yosys> opt_merge -nomux

3.23.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~10344 debug messages>
Removed a total of 3448 cells.

yosys> opt_muxtree

3.23.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.23.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.23.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.23.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 1949 unused cells and 9787 unused wires.
<suppressed ~1950 debug messages>

yosys> opt_expr

3.23.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~438 debug messages>

3.23.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.23.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.23.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.23.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$17023 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20541 [7], Q = \P2.P1.InstQueue[10] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16896 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [27], Q = \P2.P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$16769 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [2], Q = \P2.EAX [2]).
Adding EN signal on $auto$ff.cc:262:slice$17031 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20665 [7], Q = \P2.P1.InstQueue[11] [7]).
Adding EN signal on $auto$ff.cc:262:slice$17030 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20665 [6], Q = \P2.P1.InstQueue[11] [6]).
Adding EN signal on $auto$ff.cc:262:slice$17029 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20665 [5], Q = \P2.P1.InstQueue[11] [5]).
Adding EN signal on $auto$ff.cc:262:slice$17028 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20665 [4], Q = \P2.P1.InstQueue[11] [4]).
Adding EN signal on $auto$ff.cc:262:slice$17027 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20665 [3], Q = \P2.P1.InstQueue[11] [3]).
Adding EN signal on $auto$ff.cc:262:slice$17026 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20665 [2], Q = \P2.P1.InstQueue[11] [2]).
Adding EN signal on $auto$ff.cc:262:slice$17025 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20665 [1], Q = \P2.P1.InstQueue[11] [1]).
Adding EN signal on $auto$ff.cc:262:slice$17024 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20665 [0], Q = \P2.P1.InstQueue[11] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16904 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [3], Q = \P3.Datao [3]).
Adding EN signal on $auto$ff.cc:262:slice$16903 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [2], Q = \P3.Datao [2]).
Adding EN signal on $auto$ff.cc:262:slice$16902 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [1], Q = \P3.Datao [1]).
Adding EN signal on $auto$ff.cc:262:slice$16901 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [0], Q = \P3.Datao [0]).
Adding EN signal on $auto$ff.cc:262:slice$16900 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [31], Q = \P2.P1.InstAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$16899 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [30], Q = \P2.P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$16898 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [29], Q = \P2.P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$16897 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [28], Q = \P2.P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$16777 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [10], Q = \P2.EAX [10]).
Adding EN signal on $auto$ff.cc:262:slice$16776 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [9], Q = \P2.EAX [9]).
Adding EN signal on $auto$ff.cc:262:slice$16775 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [8], Q = \P2.EAX [8]).
Adding EN signal on $auto$ff.cc:262:slice$16774 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [7], Q = \P2.EAX [7]).
Adding EN signal on $auto$ff.cc:262:slice$16773 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [6], Q = \P2.EAX [6]).
Adding EN signal on $auto$ff.cc:262:slice$16772 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [5], Q = \P2.EAX [5]).
Adding EN signal on $auto$ff.cc:262:slice$16771 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [4], Q = \P2.EAX [4]).
Adding EN signal on $auto$ff.cc:262:slice$16770 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [3], Q = \P2.EAX [3]).
Adding EN signal on $auto$ff.cc:262:slice$17022 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20541 [6], Q = \P2.P1.InstQueue[10] [6]).
Adding EN signal on $auto$ff.cc:262:slice$17021 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20541 [5], Q = \P2.P1.InstQueue[10] [5]).
Adding EN signal on $auto$ff.cc:262:slice$17020 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20541 [4], Q = \P2.P1.InstQueue[10] [4]).
Adding EN signal on $auto$ff.cc:262:slice$17019 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20541 [3], Q = \P2.P1.InstQueue[10] [3]).
Adding EN signal on $auto$ff.cc:262:slice$17018 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20541 [2], Q = \P2.P1.InstQueue[10] [2]).
Adding EN signal on $auto$ff.cc:262:slice$17017 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20541 [1], Q = \P2.P1.InstQueue[10] [1]).
Adding EN signal on $auto$ff.cc:262:slice$17016 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20541 [0], Q = \P2.P1.InstQueue[10] [0]).
Adding EN signal on $auto$ff.cc:262:slice$15694 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [12], Q = \P1.Datao [12]).
Adding EN signal on $auto$ff.cc:262:slice$17015 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20417 [7], Q = \P2.P1.InstQueue[9] [7]).
Adding EN signal on $auto$ff.cc:262:slice$17014 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20417 [6], Q = \P2.P1.InstQueue[9] [6]).
Adding EN signal on $auto$ff.cc:262:slice$17013 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20417 [5], Q = \P2.P1.InstQueue[9] [5]).
Adding EN signal on $auto$ff.cc:262:slice$17012 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20417 [4], Q = \P2.P1.InstQueue[9] [4]).
Adding EN signal on $auto$ff.cc:262:slice$17011 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20417 [3], Q = \P2.P1.InstQueue[9] [3]).
Adding EN signal on $auto$ff.cc:262:slice$17010 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20417 [2], Q = \P2.P1.InstQueue[9] [2]).
Adding EN signal on $auto$ff.cc:262:slice$17009 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20417 [1], Q = \P2.P1.InstQueue[9] [1]).
Adding EN signal on $auto$ff.cc:262:slice$15693 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [11], Q = \P1.Datao [11]).
Adding EN signal on $auto$ff.cc:262:slice$17008 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20417 [0], Q = \P2.P1.InstQueue[9] [0]).
Adding EN signal on $auto$ff.cc:262:slice$17007 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20293 [7], Q = \P2.P1.InstQueue[8] [7]).
Adding EN signal on $auto$ff.cc:262:slice$17006 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20293 [6], Q = \P2.P1.InstQueue[8] [6]).
Adding EN signal on $auto$ff.cc:262:slice$17005 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20293 [5], Q = \P2.P1.InstQueue[8] [5]).
Adding EN signal on $auto$ff.cc:262:slice$17004 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20293 [4], Q = \P2.P1.InstQueue[8] [4]).
Adding EN signal on $auto$ff.cc:262:slice$17003 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20293 [3], Q = \P2.P1.InstQueue[8] [3]).
Adding EN signal on $auto$ff.cc:262:slice$17002 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20293 [2], Q = \P2.P1.InstQueue[8] [2]).
Adding EN signal on $auto$ff.cc:262:slice$15692 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [10], Q = \P1.Datao [10]).
Adding EN signal on $auto$ff.cc:262:slice$17001 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20293 [1], Q = \P2.P1.InstQueue[8] [1]).
Adding EN signal on $auto$ff.cc:262:slice$17000 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20293 [0], Q = \P2.P1.InstQueue[8] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16999 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20169 [7], Q = \P2.P1.InstQueue[7] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16998 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20169 [6], Q = \P2.P1.InstQueue[7] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16997 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20169 [5], Q = \P2.P1.InstQueue[7] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16996 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20169 [4], Q = \P2.P1.InstQueue[7] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16995 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20169 [3], Q = \P2.P1.InstQueue[7] [3]).
Adding EN signal on $auto$ff.cc:262:slice$15691 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [9], Q = \P1.Datao [9]).
Adding EN signal on $auto$ff.cc:262:slice$16994 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20169 [2], Q = \P2.P1.InstQueue[7] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16993 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20169 [1], Q = \P2.P1.InstQueue[7] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16992 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20169 [0], Q = \P2.P1.InstQueue[7] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16991 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20045 [7], Q = \P2.P1.InstQueue[6] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16990 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20045 [6], Q = \P2.P1.InstQueue[6] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16989 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20045 [5], Q = \P2.P1.InstQueue[6] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16988 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20045 [4], Q = \P2.P1.InstQueue[6] [4]).
Adding EN signal on $auto$ff.cc:262:slice$15690 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [8], Q = \P1.Datao [8]).
Adding EN signal on $auto$ff.cc:262:slice$16987 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20045 [3], Q = \P2.P1.InstQueue[6] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16986 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20045 [2], Q = \P2.P1.InstQueue[6] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16985 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20045 [1], Q = \P2.P1.InstQueue[6] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16984 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20045 [0], Q = \P2.P1.InstQueue[6] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16983 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19921 [7], Q = \P2.P1.InstQueue[5] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16982 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19921 [6], Q = \P2.P1.InstQueue[5] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16981 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19921 [5], Q = \P2.P1.InstQueue[5] [5]).
Adding EN signal on $auto$ff.cc:262:slice$15689 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [7], Q = \P1.Datao [7]).
Adding EN signal on $auto$ff.cc:262:slice$16980 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19921 [4], Q = \P2.P1.InstQueue[5] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16979 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19921 [3], Q = \P2.P1.InstQueue[5] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16978 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19921 [2], Q = \P2.P1.InstQueue[5] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16977 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19921 [1], Q = \P2.P1.InstQueue[5] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16976 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19921 [0], Q = \P2.P1.InstQueue[5] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16975 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19797 [7], Q = \P2.P1.InstQueue[4] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16974 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19797 [6], Q = \P2.P1.InstQueue[4] [6]).
Adding EN signal on $auto$ff.cc:262:slice$15688 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [6], Q = \P1.Datao [6]).
Adding EN signal on $auto$ff.cc:262:slice$16973 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19797 [5], Q = \P2.P1.InstQueue[4] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16972 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19797 [4], Q = \P2.P1.InstQueue[4] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16971 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19797 [3], Q = \P2.P1.InstQueue[4] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16970 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19797 [2], Q = \P2.P1.InstQueue[4] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16969 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19797 [1], Q = \P2.P1.InstQueue[4] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16968 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19797 [0], Q = \P2.P1.InstQueue[4] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16967 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19673 [7], Q = \P2.P1.InstQueue[3] [7]).
Adding EN signal on $auto$ff.cc:262:slice$15687 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [5], Q = \P1.Datao [5]).
Adding EN signal on $auto$ff.cc:262:slice$16966 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19673 [6], Q = \P2.P1.InstQueue[3] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16965 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19673 [5], Q = \P2.P1.InstQueue[3] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16964 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19673 [4], Q = \P2.P1.InstQueue[3] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16963 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19673 [3], Q = \P2.P1.InstQueue[3] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16962 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19673 [2], Q = \P2.P1.InstQueue[3] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16961 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19673 [1], Q = \P2.P1.InstQueue[3] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16960 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19673 [0], Q = \P2.P1.InstQueue[3] [0]).
Adding EN signal on $auto$ff.cc:262:slice$15686 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [4], Q = \P1.Datao [4]).
Adding EN signal on $auto$ff.cc:262:slice$16959 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19549 [7], Q = \P2.P1.InstQueue[2] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16958 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19549 [6], Q = \P2.P1.InstQueue[2] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16957 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19549 [5], Q = \P2.P1.InstQueue[2] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16956 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19549 [4], Q = \P2.P1.InstQueue[2] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16955 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19549 [3], Q = \P2.P1.InstQueue[2] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16954 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19549 [2], Q = \P2.P1.InstQueue[2] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16953 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19549 [1], Q = \P2.P1.InstQueue[2] [1]).
Adding EN signal on $auto$ff.cc:262:slice$15685 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [3], Q = \P1.Datao [3]).
Adding EN signal on $auto$ff.cc:262:slice$16952 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19549 [0], Q = \P2.P1.InstQueue[2] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16951 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19425 [7], Q = \P2.P1.InstQueue[1] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16950 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19425 [6], Q = \P2.P1.InstQueue[1] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16949 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19425 [5], Q = \P2.P1.InstQueue[1] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16948 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19425 [4], Q = \P2.P1.InstQueue[1] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16947 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19425 [3], Q = \P2.P1.InstQueue[1] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16946 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19425 [2], Q = \P2.P1.InstQueue[1] [2]).
Adding EN signal on $auto$ff.cc:262:slice$15684 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [2], Q = \P1.Datao [2]).
Adding EN signal on $auto$ff.cc:262:slice$16945 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19425 [1], Q = \P2.P1.InstQueue[1] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16944 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19425 [0], Q = \P2.P1.InstQueue[1] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16943 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19301 [7], Q = \P2.P1.InstQueue[0] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16942 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19301 [6], Q = \P2.P1.InstQueue[0] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16941 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19301 [5], Q = \P2.P1.InstQueue[0] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16940 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19301 [4], Q = \P2.P1.InstQueue[0] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16939 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19301 [3], Q = \P2.P1.InstQueue[0] [3]).
Adding EN signal on $auto$ff.cc:262:slice$15683 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [1], Q = \P1.Datao [1]).
Adding EN signal on $auto$ff.cc:262:slice$16938 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19301 [2], Q = \P2.P1.InstQueue[0] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16937 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19301 [1], Q = \P2.P1.InstQueue[0] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16936 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19301 [0], Q = \P2.P1.InstQueue[0] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16935 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29685 [3], Q = \P3.P1.InstQueueRd_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$16934 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29685 [2], Q = \P3.P1.InstQueueRd_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$16933 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29685 [1], Q = \P3.P1.InstQueueRd_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$16932 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29685 [0], Q = \P3.P1.InstQueueRd_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$15682 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [0], Q = \P1.Datao [0]).
Adding EN signal on $auto$ff.cc:262:slice$16931 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [30], Q = \P3.Datao [30]).
Adding EN signal on $auto$ff.cc:262:slice$16930 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [29], Q = \P3.Datao [29]).
Adding EN signal on $auto$ff.cc:262:slice$16929 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [28], Q = \P3.Datao [28]).
Adding EN signal on $auto$ff.cc:262:slice$16928 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [27], Q = \P3.Datao [27]).
Adding EN signal on $auto$ff.cc:262:slice$16927 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [26], Q = \P3.Datao [26]).
Adding EN signal on $auto$ff.cc:262:slice$16926 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [25], Q = \P3.Datao [25]).
Adding EN signal on $auto$ff.cc:262:slice$16925 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [24], Q = \P3.Datao [24]).
Adding EN signal on $auto$ff.cc:262:slice$16924 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [23], Q = \P3.Datao [23]).
Adding EN signal on $auto$ff.cc:262:slice$16923 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [22], Q = \P3.Datao [22]).
Adding EN signal on $auto$ff.cc:262:slice$16922 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [21], Q = \P3.Datao [21]).
Adding EN signal on $auto$ff.cc:262:slice$16921 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [20], Q = \P3.Datao [20]).
Adding EN signal on $auto$ff.cc:262:slice$16920 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [19], Q = \P3.Datao [19]).
Adding EN signal on $auto$ff.cc:262:slice$16919 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [18], Q = \P3.Datao [18]).
Adding EN signal on $auto$ff.cc:262:slice$16918 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [17], Q = \P3.Datao [17]).
Adding EN signal on $auto$ff.cc:262:slice$16917 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [16], Q = \P3.Datao [16]).
Adding EN signal on $auto$ff.cc:262:slice$16916 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [15], Q = \P3.Datao [15]).
Adding EN signal on $auto$ff.cc:262:slice$16915 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [14], Q = \P3.Datao [14]).
Adding EN signal on $auto$ff.cc:262:slice$16914 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [13], Q = \P3.Datao [13]).
Adding EN signal on $auto$ff.cc:262:slice$16913 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [12], Q = \P3.Datao [12]).
Adding EN signal on $auto$ff.cc:262:slice$16912 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [11], Q = \P3.Datao [11]).
Adding EN signal on $auto$ff.cc:262:slice$16911 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [10], Q = \P3.Datao [10]).
Adding EN signal on $auto$ff.cc:262:slice$16907 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [6], Q = \P3.Datao [6]).
Adding EN signal on $auto$ff.cc:262:slice$16906 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [5], Q = \P3.Datao [5]).
Adding EN signal on $auto$ff.cc:262:slice$16905 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [4], Q = \P3.Datao [4]).
Adding EN signal on $auto$ff.cc:262:slice$16910 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [9], Q = \P3.Datao [9]).
Adding EN signal on $auto$ff.cc:262:slice$16909 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [8], Q = \P3.Datao [8]).
Adding EN signal on $auto$ff.cc:262:slice$16908 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28117 [7], Q = \P3.Datao [7]).
Adding EN signal on $auto$ff.cc:262:slice$14885 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [29], Q = \P1.Address [29]).
Adding EN signal on $auto$ff.cc:262:slice$16895 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [26], Q = \P2.P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$16894 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [25], Q = \P2.P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$16893 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [24], Q = \P2.P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$16892 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [23], Q = \P2.P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$16891 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [22], Q = \P2.P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$16890 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [21], Q = \P2.P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$16889 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [20], Q = \P2.P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$14883 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [27], Q = \P1.Address [27]).
Adding EN signal on $auto$ff.cc:262:slice$16888 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [19], Q = \P2.P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$16887 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [18], Q = \P2.P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$16886 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [17], Q = \P2.P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$16885 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [16], Q = \P2.P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$16884 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [15], Q = \P2.P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$16883 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [14], Q = \P2.P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$16882 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [13], Q = \P2.P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$14882 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [26], Q = \P1.Address [26]).
Adding EN signal on $auto$ff.cc:262:slice$16881 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [12], Q = \P2.P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$16880 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [11], Q = \P2.P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$16879 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [10], Q = \P2.P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$16878 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [9], Q = \P2.P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$16877 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [8], Q = \P2.P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$16876 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [7], Q = \P2.P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$16875 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [6], Q = \P2.P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$14881 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [25], Q = \P1.Address [25]).
Adding EN signal on $auto$ff.cc:262:slice$16874 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [5], Q = \P2.P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$16873 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [4], Q = \P2.P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$16872 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [3], Q = \P2.P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$16871 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [2], Q = \P2.P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$16870 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [1], Q = \P2.P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$16869 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22260 [0], Q = \P2.P1.InstAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$16868 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [31], Q = \P2.P1.PhyAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$14880 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [24], Q = \P1.Address [24]).
Adding EN signal on $auto$ff.cc:262:slice$16867 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [30], Q = \P2.P1.PhyAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$16866 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [29], Q = \P2.P1.PhyAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$16865 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [28], Q = \P2.P1.PhyAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$16864 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [27], Q = \P2.P1.PhyAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$16863 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [26], Q = \P2.P1.PhyAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$16862 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [25], Q = \P2.P1.PhyAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$16861 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [24], Q = \P2.P1.PhyAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$14879 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [23], Q = \P1.Address [23]).
Adding EN signal on $auto$ff.cc:262:slice$16860 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [23], Q = \P2.P1.PhyAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$16859 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [22], Q = \P2.P1.PhyAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$16858 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [21], Q = \P2.P1.PhyAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$16857 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [20], Q = \P2.P1.PhyAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$16856 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [19], Q = \P2.P1.PhyAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$16855 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [18], Q = \P2.P1.PhyAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$16854 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [17], Q = \P2.P1.PhyAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$14878 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [22], Q = \P1.Address [22]).
Adding EN signal on $auto$ff.cc:262:slice$16853 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [16], Q = \P2.P1.PhyAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$16852 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [15], Q = \P2.P1.PhyAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$16851 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [14], Q = \P2.P1.PhyAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$16850 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [13], Q = \P2.P1.PhyAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$16849 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [12], Q = \P2.P1.PhyAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$16848 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [11], Q = \P2.P1.PhyAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$16847 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [10], Q = \P2.P1.PhyAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$14877 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [21], Q = \P1.Address [21]).
Adding EN signal on $auto$ff.cc:262:slice$16846 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [9], Q = \P2.P1.PhyAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$16845 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [8], Q = \P2.P1.PhyAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$16844 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [7], Q = \P2.P1.PhyAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$16843 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [6], Q = \P2.P1.PhyAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$16842 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [5], Q = \P2.P1.PhyAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$16841 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [4], Q = \P2.P1.PhyAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$16840 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [3], Q = \P2.P1.PhyAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$14876 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [20], Q = \P1.Address [20]).
Adding EN signal on $auto$ff.cc:262:slice$16839 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [2], Q = \P2.P1.PhyAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$16838 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [1], Q = \P2.P1.PhyAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$16837 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22744 [0], Q = \P2.P1.PhyAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$16836 ($_DFF_PP0_) from module b17 (D = $auto$rtlil.cc:2459:Mux$1840, Q = \P2.P1.More).
Adding EN signal on $auto$ff.cc:262:slice$16835 ($_DFF_PP0_) from module b17 (D = $auto$rtlil.cc:2459:Mux$1826, Q = \P2.P1.Flush).
Adding EN signal on $auto$ff.cc:262:slice$16834 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [15], Q = \P2.P1.lWord [15]).
Adding EN signal on $auto$ff.cc:262:slice$16833 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [14], Q = \P2.P1.lWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$14875 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [19], Q = \P1.Address [19]).
Adding EN signal on $auto$ff.cc:262:slice$16832 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [13], Q = \P2.P1.lWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$16831 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [12], Q = \P2.P1.lWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$16830 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [11], Q = \P2.P1.lWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$16829 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [10], Q = \P2.P1.lWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$16828 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [9], Q = \P2.P1.lWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$16827 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [8], Q = \P2.P1.lWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$16826 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [7], Q = \P2.P1.lWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$14874 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [18], Q = \P1.Address [18]).
Adding EN signal on $auto$ff.cc:262:slice$16825 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [6], Q = \P2.P1.lWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$16824 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [5], Q = \P2.P1.lWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$16823 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [4], Q = \P2.P1.lWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$16822 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [3], Q = \P2.P1.lWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$16821 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [2], Q = \P2.P1.lWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$16820 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [1], Q = \P2.P1.lWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$16819 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17794 [0], Q = \P2.P1.lWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$14873 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [17], Q = \P1.Address [17]).
Adding EN signal on $auto$ff.cc:262:slice$16818 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [14], Q = \P2.P1.uWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$16817 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [13], Q = \P2.P1.uWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$16816 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [12], Q = \P2.P1.uWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$16815 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [11], Q = \P2.P1.uWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$16814 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [10], Q = \P2.P1.uWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$16813 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [9], Q = \P2.P1.uWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$16812 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [8], Q = \P2.P1.uWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$14872 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [16], Q = \P1.Address [16]).
Adding EN signal on $auto$ff.cc:262:slice$16811 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [7], Q = \P2.P1.uWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$16810 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [6], Q = \P2.P1.uWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$16809 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [5], Q = \P2.P1.uWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$16808 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [4], Q = \P2.P1.uWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$16807 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [3], Q = \P2.P1.uWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$16806 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [2], Q = \P2.P1.uWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$16805 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [1], Q = \P2.P1.uWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$14871 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [15], Q = \P1.Address [15]).
Adding EN signal on $auto$ff.cc:262:slice$16804 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18024 [0], Q = \P2.P1.uWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$16803 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21187, Q = \P2.CodeFetch).
Adding EN signal on $auto$ff.cc:262:slice$16802 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19180 [3], Q = \P2.P1.InstQueueWr_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$16801 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19180 [2], Q = \P2.P1.InstQueueWr_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$16800 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19180 [1], Q = \P2.P1.InstQueueWr_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$16799 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19180 [0], Q = \P2.P1.InstQueueWr_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$16798 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [31], Q = \P2.EAX [31]).
Adding EN signal on $auto$ff.cc:262:slice$14870 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [14], Q = \P1.Address [14]).
Adding EN signal on $auto$ff.cc:262:slice$16797 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [30], Q = \P2.EAX [30]).
Adding EN signal on $auto$ff.cc:262:slice$16796 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [29], Q = \P2.EAX [29]).
Adding EN signal on $auto$ff.cc:262:slice$16795 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [28], Q = \P2.EAX [28]).
Adding EN signal on $auto$ff.cc:262:slice$16794 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [27], Q = \P2.EAX [27]).
Adding EN signal on $auto$ff.cc:262:slice$16793 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [26], Q = \P2.EAX [26]).
Adding EN signal on $auto$ff.cc:262:slice$16792 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [25], Q = \P2.EAX [25]).
Adding EN signal on $auto$ff.cc:262:slice$16791 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [24], Q = \P2.EAX [24]).
Adding EN signal on $auto$ff.cc:262:slice$14869 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [13], Q = \P1.Address [13]).
Adding EN signal on $auto$ff.cc:262:slice$16790 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [23], Q = \P2.EAX [23]).
Adding EN signal on $auto$ff.cc:262:slice$16789 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [22], Q = \P2.EAX [22]).
Adding EN signal on $auto$ff.cc:262:slice$16788 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [21], Q = \P2.EAX [21]).
Adding EN signal on $auto$ff.cc:262:slice$16787 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [20], Q = \P2.EAX [20]).
Adding EN signal on $auto$ff.cc:262:slice$16786 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [19], Q = \P2.EAX [19]).
Adding EN signal on $auto$ff.cc:262:slice$16785 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [18], Q = \P2.EAX [18]).
Adding EN signal on $auto$ff.cc:262:slice$16784 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [17], Q = \P2.EAX [17]).
Adding EN signal on $auto$ff.cc:262:slice$14868 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [12], Q = \P1.Address [12]).
Adding EN signal on $auto$ff.cc:262:slice$16780 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [13], Q = \P2.EAX [13]).
Adding EN signal on $auto$ff.cc:262:slice$16779 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [12], Q = \P2.EAX [12]).
Adding EN signal on $auto$ff.cc:262:slice$16778 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [11], Q = \P2.EAX [11]).
Adding EN signal on $auto$ff.cc:262:slice$14867 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [11], Q = \P1.Address [11]).
Adding EN signal on $auto$ff.cc:262:slice$16783 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [16], Q = \P2.EAX [16]).
Adding EN signal on $auto$ff.cc:262:slice$16782 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [15], Q = \P2.EAX [15]).
Adding EN signal on $auto$ff.cc:262:slice$16781 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [14], Q = \P2.EAX [14]).
Adding EN signal on $auto$ff.cc:262:slice$14866 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [10], Q = \P1.Address [10]).
Adding EN signal on $auto$ff.cc:262:slice$16768 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [1], Q = \P2.EAX [1]).
Adding EN signal on $auto$ff.cc:262:slice$16767 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18975 [0], Q = \P2.EAX [0]).
Adding EN signal on $auto$ff.cc:262:slice$16766 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [31], Q = \P2.EBX [31]).
Adding EN signal on $auto$ff.cc:262:slice$16765 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [30], Q = \P2.EBX [30]).
Adding EN signal on $auto$ff.cc:262:slice$16764 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [29], Q = \P2.EBX [29]).
Adding EN signal on $auto$ff.cc:262:slice$16763 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [28], Q = \P2.EBX [28]).
Adding EN signal on $auto$ff.cc:262:slice$16762 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [27], Q = \P2.EBX [27]).
Adding EN signal on $auto$ff.cc:262:slice$14864 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [8], Q = \P1.Address [8]).
Adding EN signal on $auto$ff.cc:262:slice$16761 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [26], Q = \P2.EBX [26]).
Adding EN signal on $auto$ff.cc:262:slice$16760 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [25], Q = \P2.EBX [25]).
Adding EN signal on $auto$ff.cc:262:slice$16759 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [24], Q = \P2.EBX [24]).
Adding EN signal on $auto$ff.cc:262:slice$16758 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [23], Q = \P2.EBX [23]).
Adding EN signal on $auto$ff.cc:262:slice$16757 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [22], Q = \P2.EBX [22]).
Adding EN signal on $auto$ff.cc:262:slice$16756 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [21], Q = \P2.EBX [21]).
Adding EN signal on $auto$ff.cc:262:slice$16755 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [20], Q = \P2.EBX [20]).
Adding EN signal on $auto$ff.cc:262:slice$14863 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [7], Q = \P1.Address [7]).
Adding EN signal on $auto$ff.cc:262:slice$16754 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [19], Q = \P2.EBX [19]).
Adding EN signal on $auto$ff.cc:262:slice$16753 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [18], Q = \P2.EBX [18]).
Adding EN signal on $auto$ff.cc:262:slice$16752 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [17], Q = \P2.EBX [17]).
Adding EN signal on $auto$ff.cc:262:slice$16751 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [16], Q = \P2.EBX [16]).
Adding EN signal on $auto$ff.cc:262:slice$16750 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [15], Q = \P2.EBX [15]).
Adding EN signal on $auto$ff.cc:262:slice$16749 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [14], Q = \P2.EBX [14]).
Adding EN signal on $auto$ff.cc:262:slice$16748 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [13], Q = \P2.EBX [13]).
Adding EN signal on $auto$ff.cc:262:slice$14862 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [6], Q = \P1.Address [6]).
Adding EN signal on $auto$ff.cc:262:slice$16747 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [12], Q = \P2.EBX [12]).
Adding EN signal on $auto$ff.cc:262:slice$16746 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [11], Q = \P2.EBX [11]).
Adding EN signal on $auto$ff.cc:262:slice$16745 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [10], Q = \P2.EBX [10]).
Adding EN signal on $auto$ff.cc:262:slice$16744 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [9], Q = \P2.EBX [9]).
Adding EN signal on $auto$ff.cc:262:slice$16743 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [8], Q = \P2.EBX [8]).
Adding EN signal on $auto$ff.cc:262:slice$16742 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [7], Q = \P2.EBX [7]).
Adding EN signal on $auto$ff.cc:262:slice$16741 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [6], Q = \P2.EBX [6]).
Adding EN signal on $auto$ff.cc:262:slice$14861 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [5], Q = \P1.Address [5]).
Adding EN signal on $auto$ff.cc:262:slice$16740 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [5], Q = \P2.EBX [5]).
Adding EN signal on $auto$ff.cc:262:slice$16739 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [4], Q = \P2.EBX [4]).
Adding EN signal on $auto$ff.cc:262:slice$16738 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [3], Q = \P2.EBX [3]).
Adding EN signal on $auto$ff.cc:262:slice$16737 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [2], Q = \P2.EBX [2]).
Adding EN signal on $auto$ff.cc:262:slice$16736 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [1], Q = \P2.EBX [1]).
Adding EN signal on $auto$ff.cc:262:slice$16735 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18491 [0], Q = \P2.EBX [0]).
Adding EN signal on $auto$ff.cc:262:slice$16734 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [32], Q = \P2.rEIP [31]).
Adding EN signal on $auto$ff.cc:262:slice$14860 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [4], Q = \P1.Address [4]).
Adding EN signal on $auto$ff.cc:262:slice$16733 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [30], Q = \P2.rEIP [30]).
Adding EN signal on $auto$ff.cc:262:slice$16732 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [29], Q = \P2.rEIP [29]).
Adding EN signal on $auto$ff.cc:262:slice$16731 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [28], Q = \P2.rEIP [28]).
Adding EN signal on $auto$ff.cc:262:slice$16730 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [27], Q = \P2.rEIP [27]).
Adding EN signal on $auto$ff.cc:262:slice$16729 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [26], Q = \P2.rEIP [26]).
Adding EN signal on $auto$ff.cc:262:slice$16728 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [25], Q = \P2.rEIP [25]).
Adding EN signal on $auto$ff.cc:262:slice$16727 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [24], Q = \P2.rEIP [24]).
Adding EN signal on $auto$ff.cc:262:slice$14859 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [3], Q = \P1.Address [3]).
Adding EN signal on $auto$ff.cc:262:slice$16726 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [23], Q = \P2.rEIP [23]).
Adding EN signal on $auto$ff.cc:262:slice$16725 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [22], Q = \P2.rEIP [22]).
Adding EN signal on $auto$ff.cc:262:slice$16724 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [21], Q = \P2.rEIP [21]).
Adding EN signal on $auto$ff.cc:262:slice$16723 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [20], Q = \P2.rEIP [20]).
Adding EN signal on $auto$ff.cc:262:slice$16722 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [19], Q = \P2.rEIP [19]).
Adding EN signal on $auto$ff.cc:262:slice$16721 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [18], Q = \P2.rEIP [18]).
Adding EN signal on $auto$ff.cc:262:slice$16720 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [17], Q = \P2.rEIP [17]).
Adding EN signal on $auto$ff.cc:262:slice$14858 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [2], Q = \P1.Address [2]).
Adding EN signal on $auto$ff.cc:262:slice$16719 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [16], Q = \P2.rEIP [16]).
Adding EN signal on $auto$ff.cc:262:slice$16718 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [15], Q = \P2.rEIP [15]).
Adding EN signal on $auto$ff.cc:262:slice$16717 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [14], Q = \P2.rEIP [14]).
Adding EN signal on $auto$ff.cc:262:slice$16716 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [13], Q = \P2.rEIP [13]).
Adding EN signal on $auto$ff.cc:262:slice$16715 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [12], Q = \P2.rEIP [12]).
Adding EN signal on $auto$ff.cc:262:slice$16714 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [11], Q = \P2.rEIP [11]).
Adding EN signal on $auto$ff.cc:262:slice$16713 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [10], Q = \P2.rEIP [10]).
Adding EN signal on $auto$ff.cc:262:slice$14857 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [1], Q = \P1.Address [1]).
Adding EN signal on $auto$ff.cc:262:slice$16712 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [9], Q = \P2.rEIP [9]).
Adding EN signal on $auto$ff.cc:262:slice$16711 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [8], Q = \P2.rEIP [8]).
Adding EN signal on $auto$ff.cc:262:slice$16710 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [7], Q = \P2.rEIP [7]).
Adding EN signal on $auto$ff.cc:262:slice$16709 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [6], Q = \P2.rEIP [6]).
Adding EN signal on $auto$ff.cc:262:slice$16708 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [5], Q = \P2.rEIP [5]).
Adding EN signal on $auto$ff.cc:262:slice$16707 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [4], Q = \P2.rEIP [4]).
Adding EN signal on $auto$ff.cc:262:slice$16706 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [3], Q = \P2.rEIP [3]).
Adding EN signal on $auto$ff.cc:262:slice$14856 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [0], Q = \P1.Address [0]).
Adding EN signal on $auto$ff.cc:262:slice$16705 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [2], Q = \P2.rEIP [2]).
Adding EN signal on $auto$ff.cc:262:slice$16704 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [1], Q = \P2.rEIP [1]).
Adding EN signal on $auto$ff.cc:262:slice$16703 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21711 [0], Q = \P2.rEIP [0]).
Adding EN signal on $auto$ff.cc:262:slice$16702 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21244, Q = \P2.ReadRequest).
Adding EN signal on $auto$ff.cc:262:slice$16701 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21225, Q = \P2.MemoryFetch).
Adding EN signal on $auto$ff.cc:262:slice$16700 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21206, Q = \P2.RequestPending).
Adding EN signal on $auto$ff.cc:262:slice$14854 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15472, Q = \P1.D_C_n).
Adding EN signal on $auto$ff.cc:262:slice$14852 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15462, Q = \P1.ADS_n).
Adding EN signal on $auto$ff.cc:262:slice$14851 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15450 [2], Q = \P1.State [2]).
Adding EN signal on $auto$ff.cc:262:slice$15712 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [30], Q = \P1.Datao [30]).
Adding EN signal on $auto$ff.cc:262:slice$15711 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [29], Q = \P1.Datao [29]).
Adding EN signal on $auto$ff.cc:262:slice$15710 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [28], Q = \P1.Datao [28]).
Adding EN signal on $auto$ff.cc:262:slice$15709 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [27], Q = \P1.Datao [27]).
Adding EN signal on $auto$ff.cc:262:slice$15708 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [26], Q = \P1.Datao [26]).
Adding EN signal on $auto$ff.cc:262:slice$14850 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15450 [1], Q = \P1.State [1]).
Adding EN signal on $auto$ff.cc:262:slice$15707 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [25], Q = \P1.Datao [25]).
Adding EN signal on $auto$ff.cc:262:slice$15706 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [24], Q = \P1.Datao [24]).
Adding EN signal on $auto$ff.cc:262:slice$15705 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [23], Q = \P1.Datao [23]).
Adding EN signal on $auto$ff.cc:262:slice$15704 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [22], Q = \P1.Datao [22]).
Adding EN signal on $auto$ff.cc:262:slice$15703 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [21], Q = \P1.Datao [21]).
Adding EN signal on $auto$ff.cc:262:slice$15702 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [20], Q = \P1.Datao [20]).
Adding EN signal on $auto$ff.cc:262:slice$15701 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [19], Q = \P1.Datao [19]).
Adding EN signal on $auto$ff.cc:262:slice$14849 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15450 [0], Q = \P1.State [0]).
Adding EN signal on $auto$ff.cc:262:slice$15697 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [15], Q = \P1.Datao [15]).
Adding EN signal on $auto$ff.cc:262:slice$15696 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [14], Q = \P1.Datao [14]).
Adding EN signal on $auto$ff.cc:262:slice$15695 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [13], Q = \P1.Datao [13]).
Adding EN signal on $auto$ff.cc:262:slice$14848 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15396, Q = \P1.StateBS16).
Adding EN signal on $auto$ff.cc:262:slice$15700 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [18], Q = \P1.Datao [18]).
Adding EN signal on $auto$ff.cc:262:slice$15699 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [17], Q = \P1.Datao [17]).
Adding EN signal on $auto$ff.cc:262:slice$15698 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5907 [16], Q = \P1.Datao [16]).
Adding EN signal on $auto$ff.cc:262:slice$14847 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26529 [1], Q = \P2.DataWidth [1]).
Adding EN signal on $auto$ff.cc:262:slice$14884 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [28], Q = \P1.Address [28]).
Adding EN signal on $auto$ff.cc:262:slice$14865 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15123 [9], Q = \P1.Address [9]).
Adding EN signal on $auto$ff.cc:262:slice$14846 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26529 [0], Q = \P2.DataWidth [0]).
Adding EN signal on $auto$ff.cc:262:slice$5441 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10178 [3], Q = \P1.P1.State2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$5440 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10178 [2], Q = \P1.P1.State2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$5439 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10178 [1], Q = \P1.P1.State2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$5438 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10178 [0], Q = \P1.P1.State2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$5437 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9535 [7], Q = \P1.P1.InstQueue[15] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5436 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9535 [6], Q = \P1.P1.InstQueue[15] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5435 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9535 [5], Q = \P1.P1.InstQueue[15] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5434 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9535 [4], Q = \P1.P1.InstQueue[15] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5433 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9535 [3], Q = \P1.P1.InstQueue[15] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5432 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9535 [2], Q = \P1.P1.InstQueue[15] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5431 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9535 [1], Q = \P1.P1.InstQueue[15] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5430 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9535 [0], Q = \P1.P1.InstQueue[15] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5429 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9411 [7], Q = \P1.P1.InstQueue[14] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5428 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9411 [6], Q = \P1.P1.InstQueue[14] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5427 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9411 [5], Q = \P1.P1.InstQueue[14] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5426 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9411 [4], Q = \P1.P1.InstQueue[14] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5425 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9411 [3], Q = \P1.P1.InstQueue[14] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5424 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9411 [2], Q = \P1.P1.InstQueue[14] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5423 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9411 [1], Q = \P1.P1.InstQueue[14] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5422 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9411 [0], Q = \P1.P1.InstQueue[14] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5421 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9287 [7], Q = \P1.P1.InstQueue[13] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5420 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9287 [6], Q = \P1.P1.InstQueue[13] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5419 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9287 [5], Q = \P1.P1.InstQueue[13] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5418 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9287 [4], Q = \P1.P1.InstQueue[13] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5417 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9287 [3], Q = \P1.P1.InstQueue[13] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5416 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9287 [2], Q = \P1.P1.InstQueue[13] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5415 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9287 [1], Q = \P1.P1.InstQueue[13] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5414 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9287 [0], Q = \P1.P1.InstQueue[13] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5413 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9163 [7], Q = \P1.P1.InstQueue[12] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5412 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9163 [6], Q = \P1.P1.InstQueue[12] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5411 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9163 [5], Q = \P1.P1.InstQueue[12] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5410 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9163 [4], Q = \P1.P1.InstQueue[12] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5409 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9163 [3], Q = \P1.P1.InstQueue[12] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5408 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9163 [2], Q = \P1.P1.InstQueue[12] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5407 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9163 [1], Q = \P1.P1.InstQueue[12] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5406 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9163 [0], Q = \P1.P1.InstQueue[12] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5405 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9039 [7], Q = \P1.P1.InstQueue[11] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5404 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9039 [6], Q = \P1.P1.InstQueue[11] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5403 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9039 [5], Q = \P1.P1.InstQueue[11] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5402 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9039 [4], Q = \P1.P1.InstQueue[11] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5401 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9039 [3], Q = \P1.P1.InstQueue[11] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5400 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9039 [2], Q = \P1.P1.InstQueue[11] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5399 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9039 [1], Q = \P1.P1.InstQueue[11] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5398 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9039 [0], Q = \P1.P1.InstQueue[11] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5397 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8915 [7], Q = \P1.P1.InstQueue[10] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5396 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8915 [6], Q = \P1.P1.InstQueue[10] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5395 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8915 [5], Q = \P1.P1.InstQueue[10] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5394 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8915 [4], Q = \P1.P1.InstQueue[10] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5393 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8915 [3], Q = \P1.P1.InstQueue[10] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5392 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8915 [2], Q = \P1.P1.InstQueue[10] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5391 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8915 [1], Q = \P1.P1.InstQueue[10] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5390 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8915 [0], Q = \P1.P1.InstQueue[10] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5389 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8791 [7], Q = \P1.P1.InstQueue[9] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5388 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8791 [6], Q = \P1.P1.InstQueue[9] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5387 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8791 [5], Q = \P1.P1.InstQueue[9] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5386 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8791 [4], Q = \P1.P1.InstQueue[9] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5385 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8791 [3], Q = \P1.P1.InstQueue[9] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5384 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8791 [2], Q = \P1.P1.InstQueue[9] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5383 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8791 [1], Q = \P1.P1.InstQueue[9] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5382 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8791 [0], Q = \P1.P1.InstQueue[9] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5381 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8667 [7], Q = \P1.P1.InstQueue[8] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5380 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8667 [6], Q = \P1.P1.InstQueue[8] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5379 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8667 [5], Q = \P1.P1.InstQueue[8] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5378 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8667 [4], Q = \P1.P1.InstQueue[8] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5377 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8667 [3], Q = \P1.P1.InstQueue[8] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5376 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8667 [2], Q = \P1.P1.InstQueue[8] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5375 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8667 [1], Q = \P1.P1.InstQueue[8] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5374 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8667 [0], Q = \P1.P1.InstQueue[8] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5373 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8543 [7], Q = \P1.P1.InstQueue[7] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5372 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8543 [6], Q = \P1.P1.InstQueue[7] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5371 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8543 [5], Q = \P1.P1.InstQueue[7] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5370 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8543 [4], Q = \P1.P1.InstQueue[7] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5369 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8543 [3], Q = \P1.P1.InstQueue[7] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5368 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8543 [2], Q = \P1.P1.InstQueue[7] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5367 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8543 [1], Q = \P1.P1.InstQueue[7] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5366 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8543 [0], Q = \P1.P1.InstQueue[7] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5365 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8419 [7], Q = \P1.P1.InstQueue[6] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5364 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8419 [6], Q = \P1.P1.InstQueue[6] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5363 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8419 [5], Q = \P1.P1.InstQueue[6] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5362 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8419 [4], Q = \P1.P1.InstQueue[6] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5361 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8419 [3], Q = \P1.P1.InstQueue[6] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5360 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8419 [2], Q = \P1.P1.InstQueue[6] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5359 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8419 [1], Q = \P1.P1.InstQueue[6] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5358 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8419 [0], Q = \P1.P1.InstQueue[6] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5357 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8295 [7], Q = \P1.P1.InstQueue[5] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5356 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8295 [6], Q = \P1.P1.InstQueue[5] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5355 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8295 [5], Q = \P1.P1.InstQueue[5] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5354 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8295 [4], Q = \P1.P1.InstQueue[5] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5353 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8295 [3], Q = \P1.P1.InstQueue[5] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5352 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8295 [2], Q = \P1.P1.InstQueue[5] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5351 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8295 [1], Q = \P1.P1.InstQueue[5] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5350 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8295 [0], Q = \P1.P1.InstQueue[5] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5349 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8171 [7], Q = \P1.P1.InstQueue[4] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5348 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8171 [6], Q = \P1.P1.InstQueue[4] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5347 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8171 [5], Q = \P1.P1.InstQueue[4] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5346 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8171 [4], Q = \P1.P1.InstQueue[4] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5345 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8171 [3], Q = \P1.P1.InstQueue[4] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5344 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8171 [2], Q = \P1.P1.InstQueue[4] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5343 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8171 [1], Q = \P1.P1.InstQueue[4] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5342 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8171 [0], Q = \P1.P1.InstQueue[4] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5341 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8047 [7], Q = \P1.P1.InstQueue[3] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5340 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8047 [6], Q = \P1.P1.InstQueue[3] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5339 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8047 [5], Q = \P1.P1.InstQueue[3] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5338 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8047 [4], Q = \P1.P1.InstQueue[3] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5337 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8047 [3], Q = \P1.P1.InstQueue[3] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5336 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8047 [2], Q = \P1.P1.InstQueue[3] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5335 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8047 [1], Q = \P1.P1.InstQueue[3] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5334 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8047 [0], Q = \P1.P1.InstQueue[3] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5333 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7923 [7], Q = \P1.P1.InstQueue[2] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5332 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7923 [6], Q = \P1.P1.InstQueue[2] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5331 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7923 [5], Q = \P1.P1.InstQueue[2] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5330 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7923 [4], Q = \P1.P1.InstQueue[2] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5329 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7923 [3], Q = \P1.P1.InstQueue[2] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5328 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7923 [2], Q = \P1.P1.InstQueue[2] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5327 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7923 [1], Q = \P1.P1.InstQueue[2] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5326 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7923 [0], Q = \P1.P1.InstQueue[2] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5325 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7799 [7], Q = \P1.P1.InstQueue[1] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5324 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7799 [6], Q = \P1.P1.InstQueue[1] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5323 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7799 [5], Q = \P1.P1.InstQueue[1] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5322 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7799 [4], Q = \P1.P1.InstQueue[1] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5321 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7799 [3], Q = \P1.P1.InstQueue[1] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5320 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7799 [2], Q = \P1.P1.InstQueue[1] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5319 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7799 [1], Q = \P1.P1.InstQueue[1] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5318 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7799 [0], Q = \P1.P1.InstQueue[1] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5317 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7675 [7], Q = \P1.P1.InstQueue[0] [7]).
Adding EN signal on $auto$ff.cc:262:slice$5316 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7675 [6], Q = \P1.P1.InstQueue[0] [6]).
Adding EN signal on $auto$ff.cc:262:slice$5315 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7675 [5], Q = \P1.P1.InstQueue[0] [5]).
Adding EN signal on $auto$ff.cc:262:slice$5314 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7675 [4], Q = \P1.P1.InstQueue[0] [4]).
Adding EN signal on $auto$ff.cc:262:slice$5313 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7675 [3], Q = \P1.P1.InstQueue[0] [3]).
Adding EN signal on $auto$ff.cc:262:slice$5312 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7675 [2], Q = \P1.P1.InstQueue[0] [2]).
Adding EN signal on $auto$ff.cc:262:slice$5311 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7675 [1], Q = \P1.P1.InstQueue[0] [1]).
Adding EN signal on $auto$ff.cc:262:slice$5310 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7675 [0], Q = \P1.P1.InstQueue[0] [0]).
Adding EN signal on $auto$ff.cc:262:slice$5309 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19101 [3], Q = \P2.P1.InstQueueRd_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$5308 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19101 [2], Q = \P2.P1.InstQueueRd_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$5307 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19101 [1], Q = \P2.P1.InstQueueRd_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$5306 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19101 [0], Q = \P2.P1.InstQueueRd_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$5305 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [30], Q = \P2.Datao [30]).
Adding EN signal on $auto$ff.cc:262:slice$5304 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [29], Q = \P2.Datao [29]).
Adding EN signal on $auto$ff.cc:262:slice$5303 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [28], Q = \P2.Datao [28]).
Adding EN signal on $auto$ff.cc:262:slice$5302 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [27], Q = \P2.Datao [27]).
Adding EN signal on $auto$ff.cc:262:slice$5301 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [26], Q = \P2.Datao [26]).
Adding EN signal on $auto$ff.cc:262:slice$5300 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [25], Q = \P2.Datao [25]).
Adding EN signal on $auto$ff.cc:262:slice$5299 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [24], Q = \P2.Datao [24]).
Adding EN signal on $auto$ff.cc:262:slice$5298 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [23], Q = \P2.Datao [23]).
Adding EN signal on $auto$ff.cc:262:slice$5297 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [22], Q = \P2.Datao [22]).
Adding EN signal on $auto$ff.cc:262:slice$5296 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [21], Q = \P2.Datao [21]).
Adding EN signal on $auto$ff.cc:262:slice$5295 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [20], Q = \P2.Datao [20]).
Adding EN signal on $auto$ff.cc:262:slice$5294 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [19], Q = \P2.Datao [19]).
Adding EN signal on $auto$ff.cc:262:slice$5293 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [18], Q = \P2.Datao [18]).
Adding EN signal on $auto$ff.cc:262:slice$5292 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [17], Q = \P2.Datao [17]).
Adding EN signal on $auto$ff.cc:262:slice$5291 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [16], Q = \P2.Datao [16]).
Adding EN signal on $auto$ff.cc:262:slice$5290 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [15], Q = \P2.Datao [15]).
Adding EN signal on $auto$ff.cc:262:slice$5289 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [14], Q = \P2.Datao [14]).
Adding EN signal on $auto$ff.cc:262:slice$5288 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [13], Q = \P2.Datao [13]).
Adding EN signal on $auto$ff.cc:262:slice$5287 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [12], Q = \P2.Datao [12]).
Adding EN signal on $auto$ff.cc:262:slice$5286 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [11], Q = \P2.Datao [11]).
Adding EN signal on $auto$ff.cc:262:slice$5285 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [10], Q = \P2.Datao [10]).
Adding EN signal on $auto$ff.cc:262:slice$5284 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [9], Q = \P2.Datao [9]).
Adding EN signal on $auto$ff.cc:262:slice$5283 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [8], Q = \P2.Datao [8]).
Adding EN signal on $auto$ff.cc:262:slice$5282 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [7], Q = \P2.Datao [7]).
Adding EN signal on $auto$ff.cc:262:slice$5281 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [6], Q = \P2.Datao [6]).
Adding EN signal on $auto$ff.cc:262:slice$5280 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [5], Q = \P2.Datao [5]).
Adding EN signal on $auto$ff.cc:262:slice$5279 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [4], Q = \P2.Datao [4]).
Adding EN signal on $auto$ff.cc:262:slice$5278 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [3], Q = \P2.Datao [3]).
Adding EN signal on $auto$ff.cc:262:slice$5277 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [2], Q = \P2.Datao [2]).
Adding EN signal on $auto$ff.cc:262:slice$5276 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [1], Q = \P2.Datao [1]).
Adding EN signal on $auto$ff.cc:262:slice$5275 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17533 [0], Q = \P2.Datao [0]).
Adding EN signal on $auto$ff.cc:262:slice$5274 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [31], Q = \P1.P1.InstAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$5273 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [30], Q = \P1.P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$5272 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [29], Q = \P1.P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$5271 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [28], Q = \P1.P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$5270 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [27], Q = \P1.P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$5269 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [26], Q = \P1.P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$5268 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [25], Q = \P1.P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$5267 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [24], Q = \P1.P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$5266 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [23], Q = \P1.P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$5265 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [22], Q = \P1.P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$5264 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [21], Q = \P1.P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$5263 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [20], Q = \P1.P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$5262 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [19], Q = \P1.P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$5261 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [18], Q = \P1.P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$5260 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [17], Q = \P1.P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$5259 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [16], Q = \P1.P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$5258 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [15], Q = \P1.P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$5257 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [14], Q = \P1.P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$5256 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [13], Q = \P1.P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$5255 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [12], Q = \P1.P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$5254 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [11], Q = \P1.P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$5253 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [10], Q = \P1.P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$5252 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [9], Q = \P1.P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$5251 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [8], Q = \P1.P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$5250 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [7], Q = \P1.P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$5249 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [6], Q = \P1.P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$5248 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [5], Q = \P1.P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$5247 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [4], Q = \P1.P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$5246 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [3], Q = \P1.P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$5245 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [2], Q = \P1.P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$5244 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [1], Q = \P1.P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$5243 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10634 [0], Q = \P1.P1.InstAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$5242 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [31], Q = \P1.P1.PhyAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$5241 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [30], Q = \P1.P1.PhyAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$5240 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [29], Q = \P1.P1.PhyAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$5239 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [28], Q = \P1.P1.PhyAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$5238 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [27], Q = \P1.P1.PhyAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$5237 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [26], Q = \P1.P1.PhyAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$5236 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [25], Q = \P1.P1.PhyAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$5235 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [24], Q = \P1.P1.PhyAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$5234 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [23], Q = \P1.P1.PhyAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$5233 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [22], Q = \P1.P1.PhyAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$5232 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [21], Q = \P1.P1.PhyAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$5231 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [20], Q = \P1.P1.PhyAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$5230 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [19], Q = \P1.P1.PhyAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$5229 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [18], Q = \P1.P1.PhyAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$5228 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [17], Q = \P1.P1.PhyAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$5227 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [16], Q = \P1.P1.PhyAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$5226 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [15], Q = \P1.P1.PhyAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$5225 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [14], Q = \P1.P1.PhyAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$5224 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [13], Q = \P1.P1.PhyAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$5223 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [12], Q = \P1.P1.PhyAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$5222 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [11], Q = \P1.P1.PhyAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$5221 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [10], Q = \P1.P1.PhyAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$5220 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [9], Q = \P1.P1.PhyAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$5219 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [8], Q = \P1.P1.PhyAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$5218 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [7], Q = \P1.P1.PhyAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$5217 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [6], Q = \P1.P1.PhyAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$5216 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [5], Q = \P1.P1.PhyAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$5215 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [4], Q = \P1.P1.PhyAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$5214 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [3], Q = \P1.P1.PhyAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$5213 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [2], Q = \P1.P1.PhyAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$5212 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [1], Q = \P1.P1.PhyAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$5211 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$11118 [0], Q = \P1.P1.PhyAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$5210 ($_DFF_PP0_) from module b17 (D = $auto$rtlil.cc:2459:Mux$1606, Q = \P1.P1.More).
Adding EN signal on $auto$ff.cc:262:slice$5209 ($_DFF_PP0_) from module b17 (D = $auto$rtlil.cc:2459:Mux$1592, Q = \P1.P1.Flush).
Adding EN signal on $auto$ff.cc:262:slice$5208 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [15], Q = \P1.P1.lWord [15]).
Adding EN signal on $auto$ff.cc:262:slice$5207 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [14], Q = \P1.P1.lWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$5206 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [13], Q = \P1.P1.lWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$5205 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [12], Q = \P1.P1.lWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$5204 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [11], Q = \P1.P1.lWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$5203 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [10], Q = \P1.P1.lWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$5202 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [9], Q = \P1.P1.lWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$5201 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [8], Q = \P1.P1.lWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$5200 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [7], Q = \P1.P1.lWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$5199 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [6], Q = \P1.P1.lWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$5198 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [5], Q = \P1.P1.lWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$5197 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [4], Q = \P1.P1.lWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$5196 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [3], Q = \P1.P1.lWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$5195 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [2], Q = \P1.P1.lWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$5194 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [1], Q = \P1.P1.lWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$5193 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6168 [0], Q = \P1.P1.lWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$5192 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [14], Q = \P1.P1.uWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$5191 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [13], Q = \P1.P1.uWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$5190 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [12], Q = \P1.P1.uWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$5189 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [11], Q = \P1.P1.uWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$5188 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [10], Q = \P1.P1.uWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$5187 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [9], Q = \P1.P1.uWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$5186 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [8], Q = \P1.P1.uWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$5185 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [7], Q = \P1.P1.uWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$5184 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [6], Q = \P1.P1.uWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$5183 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [5], Q = \P1.P1.uWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$5182 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [4], Q = \P1.P1.uWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$5181 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [3], Q = \P1.P1.uWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$5180 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [2], Q = \P1.P1.uWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$5179 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [1], Q = \P1.P1.uWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$5178 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6398 [0], Q = \P1.P1.uWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$5177 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9561, Q = \P1.CodeFetch).
Adding EN signal on $auto$ff.cc:262:slice$5176 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7554 [3], Q = \P1.P1.InstQueueWr_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$5175 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7554 [2], Q = \P1.P1.InstQueueWr_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$5174 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7554 [1], Q = \P1.P1.InstQueueWr_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$5173 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7554 [0], Q = \P1.P1.InstQueueWr_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$5172 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [31], Q = \P1.EAX [31]).
Adding EN signal on $auto$ff.cc:262:slice$5171 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [30], Q = \P1.EAX [30]).
Adding EN signal on $auto$ff.cc:262:slice$5170 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [29], Q = \P1.EAX [29]).
Adding EN signal on $auto$ff.cc:262:slice$5169 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [28], Q = \P1.EAX [28]).
Adding EN signal on $auto$ff.cc:262:slice$5168 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [27], Q = \P1.EAX [27]).
Adding EN signal on $auto$ff.cc:262:slice$5167 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [26], Q = \P1.EAX [26]).
Adding EN signal on $auto$ff.cc:262:slice$5166 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [25], Q = \P1.EAX [25]).
Adding EN signal on $auto$ff.cc:262:slice$5165 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [24], Q = \P1.EAX [24]).
Adding EN signal on $auto$ff.cc:262:slice$5164 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [23], Q = \P1.EAX [23]).
Adding EN signal on $auto$ff.cc:262:slice$5163 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [22], Q = \P1.EAX [22]).
Adding EN signal on $auto$ff.cc:262:slice$5162 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [21], Q = \P1.EAX [21]).
Adding EN signal on $auto$ff.cc:262:slice$5161 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [20], Q = \P1.EAX [20]).
Adding EN signal on $auto$ff.cc:262:slice$5160 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [19], Q = \P1.EAX [19]).
Adding EN signal on $auto$ff.cc:262:slice$5159 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [18], Q = \P1.EAX [18]).
Adding EN signal on $auto$ff.cc:262:slice$5158 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [17], Q = \P1.EAX [17]).
Adding EN signal on $auto$ff.cc:262:slice$5157 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [16], Q = \P1.EAX [16]).
Adding EN signal on $auto$ff.cc:262:slice$5156 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [15], Q = \P1.EAX [15]).
Adding EN signal on $auto$ff.cc:262:slice$5155 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [14], Q = \P1.EAX [14]).
Adding EN signal on $auto$ff.cc:262:slice$5154 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [13], Q = \P1.EAX [13]).
Adding EN signal on $auto$ff.cc:262:slice$5153 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [12], Q = \P1.EAX [12]).
Adding EN signal on $auto$ff.cc:262:slice$5152 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [11], Q = \P1.EAX [11]).
Adding EN signal on $auto$ff.cc:262:slice$5151 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [10], Q = \P1.EAX [10]).
Adding EN signal on $auto$ff.cc:262:slice$5150 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [9], Q = \P1.EAX [9]).
Adding EN signal on $auto$ff.cc:262:slice$5149 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [8], Q = \P1.EAX [8]).
Adding EN signal on $auto$ff.cc:262:slice$5148 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [7], Q = \P1.EAX [7]).
Adding EN signal on $auto$ff.cc:262:slice$5147 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [6], Q = \P1.EAX [6]).
Adding EN signal on $auto$ff.cc:262:slice$5146 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [5], Q = \P1.EAX [5]).
Adding EN signal on $auto$ff.cc:262:slice$5145 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [4], Q = \P1.EAX [4]).
Adding EN signal on $auto$ff.cc:262:slice$5144 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [3], Q = \P1.EAX [3]).
Adding EN signal on $auto$ff.cc:262:slice$5143 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [2], Q = \P1.EAX [2]).
Adding EN signal on $auto$ff.cc:262:slice$5142 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [1], Q = \P1.EAX [1]).
Adding EN signal on $auto$ff.cc:262:slice$5141 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7349 [0], Q = \P1.EAX [0]).
Adding EN signal on $auto$ff.cc:262:slice$5140 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [31], Q = \P1.EBX [31]).
Adding EN signal on $auto$ff.cc:262:slice$5139 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [30], Q = \P1.EBX [30]).
Adding EN signal on $auto$ff.cc:262:slice$5138 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [29], Q = \P1.EBX [29]).
Adding EN signal on $auto$ff.cc:262:slice$5137 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [28], Q = \P1.EBX [28]).
Adding EN signal on $auto$ff.cc:262:slice$5136 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [27], Q = \P1.EBX [27]).
Adding EN signal on $auto$ff.cc:262:slice$5135 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [26], Q = \P1.EBX [26]).
Adding EN signal on $auto$ff.cc:262:slice$5134 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [25], Q = \P1.EBX [25]).
Adding EN signal on $auto$ff.cc:262:slice$5133 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [24], Q = \P1.EBX [24]).
Adding EN signal on $auto$ff.cc:262:slice$5132 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [23], Q = \P1.EBX [23]).
Adding EN signal on $auto$ff.cc:262:slice$5131 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [22], Q = \P1.EBX [22]).
Adding EN signal on $auto$ff.cc:262:slice$5130 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [21], Q = \P1.EBX [21]).
Adding EN signal on $auto$ff.cc:262:slice$5129 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [20], Q = \P1.EBX [20]).
Adding EN signal on $auto$ff.cc:262:slice$5128 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [19], Q = \P1.EBX [19]).
Adding EN signal on $auto$ff.cc:262:slice$5127 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [18], Q = \P1.EBX [18]).
Adding EN signal on $auto$ff.cc:262:slice$5126 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [17], Q = \P1.EBX [17]).
Adding EN signal on $auto$ff.cc:262:slice$5125 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [16], Q = \P1.EBX [16]).
Adding EN signal on $auto$ff.cc:262:slice$5124 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [15], Q = \P1.EBX [15]).
Adding EN signal on $auto$ff.cc:262:slice$5123 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [14], Q = \P1.EBX [14]).
Adding EN signal on $auto$ff.cc:262:slice$5122 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [13], Q = \P1.EBX [13]).
Adding EN signal on $auto$ff.cc:262:slice$5121 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [12], Q = \P1.EBX [12]).
Adding EN signal on $auto$ff.cc:262:slice$5120 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [11], Q = \P1.EBX [11]).
Adding EN signal on $auto$ff.cc:262:slice$5119 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [10], Q = \P1.EBX [10]).
Adding EN signal on $auto$ff.cc:262:slice$5118 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [9], Q = \P1.EBX [9]).
Adding EN signal on $auto$ff.cc:262:slice$5117 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [8], Q = \P1.EBX [8]).
Adding EN signal on $auto$ff.cc:262:slice$5116 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [7], Q = \P1.EBX [7]).
Adding EN signal on $auto$ff.cc:262:slice$5115 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [6], Q = \P1.EBX [6]).
Adding EN signal on $auto$ff.cc:262:slice$5114 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [5], Q = \P1.EBX [5]).
Adding EN signal on $auto$ff.cc:262:slice$5113 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [4], Q = \P1.EBX [4]).
Adding EN signal on $auto$ff.cc:262:slice$5112 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [3], Q = \P1.EBX [3]).
Adding EN signal on $auto$ff.cc:262:slice$5111 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [2], Q = \P1.EBX [2]).
Adding EN signal on $auto$ff.cc:262:slice$5110 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [1], Q = \P1.EBX [1]).
Adding EN signal on $auto$ff.cc:262:slice$5109 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6865 [0], Q = \P1.EBX [0]).
Adding EN signal on $auto$ff.cc:262:slice$5108 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [32], Q = \P1.rEIP [31]).
Adding EN signal on $auto$ff.cc:262:slice$5107 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [30], Q = \P1.rEIP [30]).
Adding EN signal on $auto$ff.cc:262:slice$5106 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [29], Q = \P1.rEIP [29]).
Adding EN signal on $auto$ff.cc:262:slice$5105 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [28], Q = \P1.rEIP [28]).
Adding EN signal on $auto$ff.cc:262:slice$5104 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [27], Q = \P1.rEIP [27]).
Adding EN signal on $auto$ff.cc:262:slice$5103 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [26], Q = \P1.rEIP [26]).
Adding EN signal on $auto$ff.cc:262:slice$5102 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [25], Q = \P1.rEIP [25]).
Adding EN signal on $auto$ff.cc:262:slice$5101 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [24], Q = \P1.rEIP [24]).
Adding EN signal on $auto$ff.cc:262:slice$5100 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [23], Q = \P1.rEIP [23]).
Adding EN signal on $auto$ff.cc:262:slice$5099 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [22], Q = \P1.rEIP [22]).
Adding EN signal on $auto$ff.cc:262:slice$5098 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [21], Q = \P1.rEIP [21]).
Adding EN signal on $auto$ff.cc:262:slice$5097 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [20], Q = \P1.rEIP [20]).
Adding EN signal on $auto$ff.cc:262:slice$5096 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [19], Q = \P1.rEIP [19]).
Adding EN signal on $auto$ff.cc:262:slice$5095 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [18], Q = \P1.rEIP [18]).
Adding EN signal on $auto$ff.cc:262:slice$5094 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [17], Q = \P1.rEIP [17]).
Adding EN signal on $auto$ff.cc:262:slice$5093 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [16], Q = \P1.rEIP [16]).
Adding EN signal on $auto$ff.cc:262:slice$5092 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [15], Q = \P1.rEIP [15]).
Adding EN signal on $auto$ff.cc:262:slice$5091 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [14], Q = \P1.rEIP [14]).
Adding EN signal on $auto$ff.cc:262:slice$5090 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [13], Q = \P1.rEIP [13]).
Adding EN signal on $auto$ff.cc:262:slice$5089 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [12], Q = \P1.rEIP [12]).
Adding EN signal on $auto$ff.cc:262:slice$5088 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [11], Q = \P1.rEIP [11]).
Adding EN signal on $auto$ff.cc:262:slice$5087 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [10], Q = \P1.rEIP [10]).
Adding EN signal on $auto$ff.cc:262:slice$5086 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [9], Q = \P1.rEIP [9]).
Adding EN signal on $auto$ff.cc:262:slice$5085 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [8], Q = \P1.rEIP [8]).
Adding EN signal on $auto$ff.cc:262:slice$5084 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [7], Q = \P1.rEIP [7]).
Adding EN signal on $auto$ff.cc:262:slice$5083 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [6], Q = \P1.rEIP [6]).
Adding EN signal on $auto$ff.cc:262:slice$5082 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [5], Q = \P1.rEIP [5]).
Adding EN signal on $auto$ff.cc:262:slice$5081 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [4], Q = \P1.rEIP [4]).
Adding EN signal on $auto$ff.cc:262:slice$5080 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [3], Q = \P1.rEIP [3]).
Adding EN signal on $auto$ff.cc:262:slice$5079 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [2], Q = \P1.rEIP [2]).
Adding EN signal on $auto$ff.cc:262:slice$5078 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [1], Q = \P1.rEIP [1]).
Adding EN signal on $auto$ff.cc:262:slice$5077 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10085 [0], Q = \P1.rEIP [0]).
Adding EN signal on $auto$ff.cc:262:slice$5076 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9618, Q = \P1.ReadRequest).
Adding EN signal on $auto$ff.cc:262:slice$5075 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9599, Q = \P1.MemoryFetch).
Adding EN signal on $auto$ff.cc:262:slice$5074 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9580, Q = \P1.RequestPending).
Adding EN signal on $auto$ff.cc:262:slice$36958 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [29], Q = \P3.Address [29]).
Adding EN signal on $auto$ff.cc:262:slice$36957 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [28], Q = \P3.Address [28]).
Adding EN signal on $auto$ff.cc:262:slice$36956 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [27], Q = \P3.Address [27]).
Adding EN signal on $auto$ff.cc:262:slice$36955 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [26], Q = \P3.Address [26]).
Adding EN signal on $auto$ff.cc:262:slice$36954 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [25], Q = \P3.Address [25]).
Adding EN signal on $auto$ff.cc:262:slice$36953 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [24], Q = \P3.Address [24]).
Adding EN signal on $auto$ff.cc:262:slice$36952 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [23], Q = \P3.Address [23]).
Adding EN signal on $auto$ff.cc:262:slice$36951 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [22], Q = \P3.Address [22]).
Adding EN signal on $auto$ff.cc:262:slice$36950 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [21], Q = \P3.Address [21]).
Adding EN signal on $auto$ff.cc:262:slice$36949 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [20], Q = \P3.Address [20]).
Adding EN signal on $auto$ff.cc:262:slice$36948 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [19], Q = \P3.Address [19]).
Adding EN signal on $auto$ff.cc:262:slice$36947 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [18], Q = \P3.Address [18]).
Adding EN signal on $auto$ff.cc:262:slice$36946 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [17], Q = \P3.Address [17]).
Adding EN signal on $auto$ff.cc:262:slice$36945 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [16], Q = \P3.Address [16]).
Adding EN signal on $auto$ff.cc:262:slice$36944 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [15], Q = \P3.Address [15]).
Adding EN signal on $auto$ff.cc:262:slice$36943 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [14], Q = \P3.Address [14]).
Adding EN signal on $auto$ff.cc:262:slice$36942 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [13], Q = \P3.Address [13]).
Adding EN signal on $auto$ff.cc:262:slice$36941 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [12], Q = \P3.Address [12]).
Adding EN signal on $auto$ff.cc:262:slice$36940 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [11], Q = \P3.Address [11]).
Adding EN signal on $auto$ff.cc:262:slice$36939 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [10], Q = \P3.Address [10]).
Adding EN signal on $auto$ff.cc:262:slice$36938 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [9], Q = \P3.Address [9]).
Adding EN signal on $auto$ff.cc:262:slice$36937 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [8], Q = \P3.Address [8]).
Adding EN signal on $auto$ff.cc:262:slice$36936 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [7], Q = \P3.Address [7]).
Adding EN signal on $auto$ff.cc:262:slice$36935 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [6], Q = \P3.Address [6]).
Adding EN signal on $auto$ff.cc:262:slice$36934 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [5], Q = \P3.Address [5]).
Adding EN signal on $auto$ff.cc:262:slice$36933 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [4], Q = \P3.Address [4]).
Adding EN signal on $auto$ff.cc:262:slice$36932 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [3], Q = \P3.Address [3]).
Adding EN signal on $auto$ff.cc:262:slice$36931 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [2], Q = \P3.Address [2]).
Adding EN signal on $auto$ff.cc:262:slice$36930 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [1], Q = \P3.Address [1]).
Adding EN signal on $auto$ff.cc:262:slice$36929 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37196 [0], Q = \P3.Address [0]).
Adding EN signal on $auto$ff.cc:262:slice$36927 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37513, Q = \P3.D_C_n).
Adding EN signal on $auto$ff.cc:262:slice$36925 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37503, Q = \P3.ADS_n).
Adding EN signal on $auto$ff.cc:262:slice$36924 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37491 [2], Q = \P3.State [2]).
Adding EN signal on $auto$ff.cc:262:slice$36923 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37491 [1], Q = \P3.State [1]).
Adding EN signal on $auto$ff.cc:262:slice$36922 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37491 [0], Q = \P3.State [0]).
Adding EN signal on $auto$ff.cc:262:slice$36889 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37469, Q = \P3.StateBS16).
Adding EN signal on $auto$ff.cc:262:slice$3378 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7475 [3], Q = \P1.P1.InstQueueRd_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$3377 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7475 [2], Q = \P1.P1.InstQueueRd_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$3376 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7475 [1], Q = \P1.P1.InstQueueRd_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$3375 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7475 [0], Q = \P1.P1.InstQueueRd_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$27651 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32388 [3], Q = \P3.P1.State2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$27650 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32388 [2], Q = \P3.P1.State2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$27649 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32388 [1], Q = \P3.P1.State2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$27648 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32388 [0], Q = \P3.P1.State2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$27647 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31745 [7], Q = \P3.P1.InstQueue[15] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27646 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31745 [6], Q = \P3.P1.InstQueue[15] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27645 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31745 [5], Q = \P3.P1.InstQueue[15] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27644 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31745 [4], Q = \P3.P1.InstQueue[15] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27643 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31745 [3], Q = \P3.P1.InstQueue[15] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27642 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31745 [2], Q = \P3.P1.InstQueue[15] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27641 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31745 [1], Q = \P3.P1.InstQueue[15] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27640 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31745 [0], Q = \P3.P1.InstQueue[15] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27639 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31621 [7], Q = \P3.P1.InstQueue[14] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27638 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31621 [6], Q = \P3.P1.InstQueue[14] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27637 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31621 [5], Q = \P3.P1.InstQueue[14] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27636 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31621 [4], Q = \P3.P1.InstQueue[14] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27635 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31621 [3], Q = \P3.P1.InstQueue[14] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27634 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31621 [2], Q = \P3.P1.InstQueue[14] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27633 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31621 [1], Q = \P3.P1.InstQueue[14] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27632 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31621 [0], Q = \P3.P1.InstQueue[14] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27631 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31497 [7], Q = \P3.P1.InstQueue[13] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27630 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31497 [6], Q = \P3.P1.InstQueue[13] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27629 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31497 [5], Q = \P3.P1.InstQueue[13] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27628 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31497 [4], Q = \P3.P1.InstQueue[13] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27627 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31497 [3], Q = \P3.P1.InstQueue[13] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27626 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31497 [2], Q = \P3.P1.InstQueue[13] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27625 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31497 [1], Q = \P3.P1.InstQueue[13] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27624 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31497 [0], Q = \P3.P1.InstQueue[13] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27623 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31373 [7], Q = \P3.P1.InstQueue[12] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27622 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31373 [6], Q = \P3.P1.InstQueue[12] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27621 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31373 [5], Q = \P3.P1.InstQueue[12] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27620 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31373 [4], Q = \P3.P1.InstQueue[12] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27619 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31373 [3], Q = \P3.P1.InstQueue[12] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27618 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31373 [2], Q = \P3.P1.InstQueue[12] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27617 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31373 [1], Q = \P3.P1.InstQueue[12] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27616 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31373 [0], Q = \P3.P1.InstQueue[12] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27615 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31249 [7], Q = \P3.P1.InstQueue[11] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27614 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31249 [6], Q = \P3.P1.InstQueue[11] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27613 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31249 [5], Q = \P3.P1.InstQueue[11] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27612 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31249 [4], Q = \P3.P1.InstQueue[11] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27611 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31249 [3], Q = \P3.P1.InstQueue[11] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27610 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31249 [2], Q = \P3.P1.InstQueue[11] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27609 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31249 [1], Q = \P3.P1.InstQueue[11] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27608 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31249 [0], Q = \P3.P1.InstQueue[11] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27607 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31125 [7], Q = \P3.P1.InstQueue[10] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27606 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31125 [6], Q = \P3.P1.InstQueue[10] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27605 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31125 [5], Q = \P3.P1.InstQueue[10] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27604 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31125 [4], Q = \P3.P1.InstQueue[10] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27603 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31125 [3], Q = \P3.P1.InstQueue[10] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27602 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31125 [2], Q = \P3.P1.InstQueue[10] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27601 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31125 [1], Q = \P3.P1.InstQueue[10] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27600 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31125 [0], Q = \P3.P1.InstQueue[10] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27599 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31001 [7], Q = \P3.P1.InstQueue[9] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27598 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31001 [6], Q = \P3.P1.InstQueue[9] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27597 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31001 [5], Q = \P3.P1.InstQueue[9] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27596 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31001 [4], Q = \P3.P1.InstQueue[9] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27595 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31001 [3], Q = \P3.P1.InstQueue[9] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27594 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31001 [2], Q = \P3.P1.InstQueue[9] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27593 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31001 [1], Q = \P3.P1.InstQueue[9] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27592 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31001 [0], Q = \P3.P1.InstQueue[9] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27591 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30877 [7], Q = \P3.P1.InstQueue[8] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27590 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30877 [6], Q = \P3.P1.InstQueue[8] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27589 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30877 [5], Q = \P3.P1.InstQueue[8] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27588 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30877 [4], Q = \P3.P1.InstQueue[8] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27587 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30877 [3], Q = \P3.P1.InstQueue[8] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27586 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30877 [2], Q = \P3.P1.InstQueue[8] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27585 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30877 [1], Q = \P3.P1.InstQueue[8] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27584 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30877 [0], Q = \P3.P1.InstQueue[8] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27583 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30753 [7], Q = \P3.P1.InstQueue[7] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27582 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30753 [6], Q = \P3.P1.InstQueue[7] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27581 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30753 [5], Q = \P3.P1.InstQueue[7] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27580 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30753 [4], Q = \P3.P1.InstQueue[7] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27579 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30753 [3], Q = \P3.P1.InstQueue[7] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27578 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30753 [2], Q = \P3.P1.InstQueue[7] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27577 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30753 [1], Q = \P3.P1.InstQueue[7] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27576 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30753 [0], Q = \P3.P1.InstQueue[7] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27575 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30629 [7], Q = \P3.P1.InstQueue[6] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27574 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30629 [6], Q = \P3.P1.InstQueue[6] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27573 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30629 [5], Q = \P3.P1.InstQueue[6] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27572 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30629 [4], Q = \P3.P1.InstQueue[6] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27571 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30629 [3], Q = \P3.P1.InstQueue[6] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27570 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30629 [2], Q = \P3.P1.InstQueue[6] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27569 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30629 [1], Q = \P3.P1.InstQueue[6] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27568 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30629 [0], Q = \P3.P1.InstQueue[6] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27567 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30505 [7], Q = \P3.P1.InstQueue[5] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27566 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30505 [6], Q = \P3.P1.InstQueue[5] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27565 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30505 [5], Q = \P3.P1.InstQueue[5] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27564 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30505 [4], Q = \P3.P1.InstQueue[5] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27563 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30505 [3], Q = \P3.P1.InstQueue[5] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27562 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30505 [2], Q = \P3.P1.InstQueue[5] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27561 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30505 [1], Q = \P3.P1.InstQueue[5] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27560 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30505 [0], Q = \P3.P1.InstQueue[5] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27559 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30381 [7], Q = \P3.P1.InstQueue[4] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27558 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30381 [6], Q = \P3.P1.InstQueue[4] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27557 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30381 [5], Q = \P3.P1.InstQueue[4] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27556 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30381 [4], Q = \P3.P1.InstQueue[4] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27555 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30381 [3], Q = \P3.P1.InstQueue[4] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27554 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30381 [2], Q = \P3.P1.InstQueue[4] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27553 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30381 [1], Q = \P3.P1.InstQueue[4] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27552 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30381 [0], Q = \P3.P1.InstQueue[4] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27551 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30257 [7], Q = \P3.P1.InstQueue[3] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27550 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30257 [6], Q = \P3.P1.InstQueue[3] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27549 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30257 [5], Q = \P3.P1.InstQueue[3] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27548 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30257 [4], Q = \P3.P1.InstQueue[3] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27547 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30257 [3], Q = \P3.P1.InstQueue[3] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27546 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30257 [2], Q = \P3.P1.InstQueue[3] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27545 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30257 [1], Q = \P3.P1.InstQueue[3] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27544 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30257 [0], Q = \P3.P1.InstQueue[3] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27543 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30133 [7], Q = \P3.P1.InstQueue[2] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27542 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30133 [6], Q = \P3.P1.InstQueue[2] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27541 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30133 [5], Q = \P3.P1.InstQueue[2] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27540 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30133 [4], Q = \P3.P1.InstQueue[2] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27539 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30133 [3], Q = \P3.P1.InstQueue[2] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27538 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30133 [2], Q = \P3.P1.InstQueue[2] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27537 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30133 [1], Q = \P3.P1.InstQueue[2] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27536 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30133 [0], Q = \P3.P1.InstQueue[2] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27535 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30009 [7], Q = \P3.P1.InstQueue[1] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27534 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30009 [6], Q = \P3.P1.InstQueue[1] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27533 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30009 [5], Q = \P3.P1.InstQueue[1] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27532 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30009 [4], Q = \P3.P1.InstQueue[1] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27531 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30009 [3], Q = \P3.P1.InstQueue[1] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27530 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30009 [2], Q = \P3.P1.InstQueue[1] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27529 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30009 [1], Q = \P3.P1.InstQueue[1] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27528 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30009 [0], Q = \P3.P1.InstQueue[1] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27527 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29885 [7], Q = \P3.P1.InstQueue[0] [7]).
Adding EN signal on $auto$ff.cc:262:slice$27526 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29885 [6], Q = \P3.P1.InstQueue[0] [6]).
Adding EN signal on $auto$ff.cc:262:slice$27525 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29885 [5], Q = \P3.P1.InstQueue[0] [5]).
Adding EN signal on $auto$ff.cc:262:slice$27524 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29885 [4], Q = \P3.P1.InstQueue[0] [4]).
Adding EN signal on $auto$ff.cc:262:slice$27523 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29885 [3], Q = \P3.P1.InstQueue[0] [3]).
Adding EN signal on $auto$ff.cc:262:slice$27522 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29885 [2], Q = \P3.P1.InstQueue[0] [2]).
Adding EN signal on $auto$ff.cc:262:slice$27521 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29885 [1], Q = \P3.P1.InstQueue[0] [1]).
Adding EN signal on $auto$ff.cc:262:slice$27520 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29885 [0], Q = \P3.P1.InstQueue[0] [0]).
Adding EN signal on $auto$ff.cc:262:slice$27519 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [31], Q = \P3.P1.InstAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$27518 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [30], Q = \P3.P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$27517 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [29], Q = \P3.P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$27516 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [28], Q = \P3.P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$27515 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [27], Q = \P3.P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$27514 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [26], Q = \P3.P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$27513 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [25], Q = \P3.P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$27512 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [24], Q = \P3.P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$27511 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [23], Q = \P3.P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$27510 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [22], Q = \P3.P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$27509 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [21], Q = \P3.P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$27508 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [20], Q = \P3.P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$27507 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [19], Q = \P3.P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$27506 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [18], Q = \P3.P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$27505 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [17], Q = \P3.P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$27504 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [16], Q = \P3.P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$27503 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [15], Q = \P3.P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$27502 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [14], Q = \P3.P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$27501 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [13], Q = \P3.P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$27500 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [12], Q = \P3.P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$27499 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [11], Q = \P3.P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$27498 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [10], Q = \P3.P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$27497 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [9], Q = \P3.P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$27496 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [8], Q = \P3.P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$27495 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [7], Q = \P3.P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$27494 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [6], Q = \P3.P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$27493 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [5], Q = \P3.P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$27492 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [4], Q = \P3.P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$27491 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [3], Q = \P3.P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$27490 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [2], Q = \P3.P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$27489 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [1], Q = \P3.P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$27488 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32844 [0], Q = \P3.P1.InstAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$27487 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [31], Q = \P3.P1.PhyAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$27486 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [30], Q = \P3.P1.PhyAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$27485 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [29], Q = \P3.P1.PhyAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$27484 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [28], Q = \P3.P1.PhyAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$27483 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [27], Q = \P3.P1.PhyAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$27482 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [26], Q = \P3.P1.PhyAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$27481 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [25], Q = \P3.P1.PhyAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$27480 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [24], Q = \P3.P1.PhyAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$27479 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [23], Q = \P3.P1.PhyAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$27478 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [22], Q = \P3.P1.PhyAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$27477 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [21], Q = \P3.P1.PhyAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$27476 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [20], Q = \P3.P1.PhyAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$27475 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [19], Q = \P3.P1.PhyAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$27474 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [18], Q = \P3.P1.PhyAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$27473 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [17], Q = \P3.P1.PhyAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$27472 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [16], Q = \P3.P1.PhyAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$27471 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [15], Q = \P3.P1.PhyAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$27470 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [14], Q = \P3.P1.PhyAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$27469 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [13], Q = \P3.P1.PhyAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$27468 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [12], Q = \P3.P1.PhyAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$27467 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [11], Q = \P3.P1.PhyAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$27466 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [10], Q = \P3.P1.PhyAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$27465 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [9], Q = \P3.P1.PhyAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$27464 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [8], Q = \P3.P1.PhyAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$27463 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [7], Q = \P3.P1.PhyAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$27462 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [6], Q = \P3.P1.PhyAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$27461 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [5], Q = \P3.P1.PhyAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$27460 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [4], Q = \P3.P1.PhyAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$27459 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [3], Q = \P3.P1.PhyAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$27458 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [2], Q = \P3.P1.PhyAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$27457 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [1], Q = \P3.P1.PhyAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$27456 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$33328 [0], Q = \P3.P1.PhyAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$27455 ($_DFF_PP0_) from module b17 (D = $auto$rtlil.cc:2459:Mux$2074, Q = \P3.P1.More).
Adding EN signal on $auto$ff.cc:262:slice$27454 ($_DFF_PP0_) from module b17 (D = $auto$rtlil.cc:2459:Mux$2060, Q = \P3.P1.Flush).
Adding EN signal on $auto$ff.cc:262:slice$27453 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [15], Q = \P3.P1.lWord [15]).
Adding EN signal on $auto$ff.cc:262:slice$27452 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [14], Q = \P3.P1.lWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$27451 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [13], Q = \P3.P1.lWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$27450 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [12], Q = \P3.P1.lWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$27449 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [11], Q = \P3.P1.lWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$27448 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [10], Q = \P3.P1.lWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$27447 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [9], Q = \P3.P1.lWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$27446 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [8], Q = \P3.P1.lWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$27445 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [7], Q = \P3.P1.lWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$27444 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [6], Q = \P3.P1.lWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$27443 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [5], Q = \P3.P1.lWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$27442 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [4], Q = \P3.P1.lWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$27441 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [3], Q = \P3.P1.lWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$27440 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [2], Q = \P3.P1.lWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$27439 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [1], Q = \P3.P1.lWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$27438 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28378 [0], Q = \P3.P1.lWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$27437 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [14], Q = \P3.P1.uWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$27436 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [13], Q = \P3.P1.uWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$27435 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [12], Q = \P3.P1.uWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$27434 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [11], Q = \P3.P1.uWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$27433 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [10], Q = \P3.P1.uWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$27432 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [9], Q = \P3.P1.uWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$27431 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [8], Q = \P3.P1.uWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$27430 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [7], Q = \P3.P1.uWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$27429 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [6], Q = \P3.P1.uWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$27428 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [5], Q = \P3.P1.uWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$27427 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [4], Q = \P3.P1.uWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$27426 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [3], Q = \P3.P1.uWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$27425 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [2], Q = \P3.P1.uWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$27424 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [1], Q = \P3.P1.uWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$27423 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28608 [0], Q = \P3.P1.uWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$27422 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31771, Q = \P3.CodeFetch).
Adding EN signal on $auto$ff.cc:262:slice$27421 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29764 [3], Q = \P3.P1.InstQueueWr_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$27420 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29764 [2], Q = \P3.P1.InstQueueWr_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$27419 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29764 [1], Q = \P3.P1.InstQueueWr_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$27418 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29764 [0], Q = \P3.P1.InstQueueWr_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$27417 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [31], Q = \P3.EAX [31]).
Adding EN signal on $auto$ff.cc:262:slice$27416 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [30], Q = \P3.EAX [30]).
Adding EN signal on $auto$ff.cc:262:slice$27415 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [29], Q = \P3.EAX [29]).
Adding EN signal on $auto$ff.cc:262:slice$27414 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [28], Q = \P3.EAX [28]).
Adding EN signal on $auto$ff.cc:262:slice$27413 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [27], Q = \P3.EAX [27]).
Adding EN signal on $auto$ff.cc:262:slice$27412 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [26], Q = \P3.EAX [26]).
Adding EN signal on $auto$ff.cc:262:slice$27411 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [25], Q = \P3.EAX [25]).
Adding EN signal on $auto$ff.cc:262:slice$27410 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [24], Q = \P3.EAX [24]).
Adding EN signal on $auto$ff.cc:262:slice$27409 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [23], Q = \P3.EAX [23]).
Adding EN signal on $auto$ff.cc:262:slice$27408 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [22], Q = \P3.EAX [22]).
Adding EN signal on $auto$ff.cc:262:slice$27407 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [21], Q = \P3.EAX [21]).
Adding EN signal on $auto$ff.cc:262:slice$27406 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [20], Q = \P3.EAX [20]).
Adding EN signal on $auto$ff.cc:262:slice$27405 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [19], Q = \P3.EAX [19]).
Adding EN signal on $auto$ff.cc:262:slice$27404 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [18], Q = \P3.EAX [18]).
Adding EN signal on $auto$ff.cc:262:slice$27403 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [17], Q = \P3.EAX [17]).
Adding EN signal on $auto$ff.cc:262:slice$27402 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [16], Q = \P3.EAX [16]).
Adding EN signal on $auto$ff.cc:262:slice$27401 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [15], Q = \P3.EAX [15]).
Adding EN signal on $auto$ff.cc:262:slice$27400 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [14], Q = \P3.EAX [14]).
Adding EN signal on $auto$ff.cc:262:slice$27399 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [13], Q = \P3.EAX [13]).
Adding EN signal on $auto$ff.cc:262:slice$27398 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [12], Q = \P3.EAX [12]).
Adding EN signal on $auto$ff.cc:262:slice$27397 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [11], Q = \P3.EAX [11]).
Adding EN signal on $auto$ff.cc:262:slice$27396 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [10], Q = \P3.EAX [10]).
Adding EN signal on $auto$ff.cc:262:slice$27395 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [9], Q = \P3.EAX [9]).
Adding EN signal on $auto$ff.cc:262:slice$27394 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [8], Q = \P3.EAX [8]).
Adding EN signal on $auto$ff.cc:262:slice$27393 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [7], Q = \P3.EAX [7]).
Adding EN signal on $auto$ff.cc:262:slice$27392 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [6], Q = \P3.EAX [6]).
Adding EN signal on $auto$ff.cc:262:slice$27391 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [5], Q = \P3.EAX [5]).
Adding EN signal on $auto$ff.cc:262:slice$27390 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [4], Q = \P3.EAX [4]).
Adding EN signal on $auto$ff.cc:262:slice$27389 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [3], Q = \P3.EAX [3]).
Adding EN signal on $auto$ff.cc:262:slice$27388 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [2], Q = \P3.EAX [2]).
Adding EN signal on $auto$ff.cc:262:slice$27387 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [1], Q = \P3.EAX [1]).
Adding EN signal on $auto$ff.cc:262:slice$27386 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29559 [0], Q = \P3.EAX [0]).
Adding EN signal on $auto$ff.cc:262:slice$27385 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [31], Q = \P3.EBX [31]).
Adding EN signal on $auto$ff.cc:262:slice$27384 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [30], Q = \P3.EBX [30]).
Adding EN signal on $auto$ff.cc:262:slice$27383 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [29], Q = \P3.EBX [29]).
Adding EN signal on $auto$ff.cc:262:slice$27382 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [28], Q = \P3.EBX [28]).
Adding EN signal on $auto$ff.cc:262:slice$27381 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [27], Q = \P3.EBX [27]).
Adding EN signal on $auto$ff.cc:262:slice$27380 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [26], Q = \P3.EBX [26]).
Adding EN signal on $auto$ff.cc:262:slice$27379 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [25], Q = \P3.EBX [25]).
Adding EN signal on $auto$ff.cc:262:slice$27378 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [24], Q = \P3.EBX [24]).
Adding EN signal on $auto$ff.cc:262:slice$27377 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [23], Q = \P3.EBX [23]).
Adding EN signal on $auto$ff.cc:262:slice$27376 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [22], Q = \P3.EBX [22]).
Adding EN signal on $auto$ff.cc:262:slice$27375 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [21], Q = \P3.EBX [21]).
Adding EN signal on $auto$ff.cc:262:slice$27374 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [20], Q = \P3.EBX [20]).
Adding EN signal on $auto$ff.cc:262:slice$27373 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [19], Q = \P3.EBX [19]).
Adding EN signal on $auto$ff.cc:262:slice$27372 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [18], Q = \P3.EBX [18]).
Adding EN signal on $auto$ff.cc:262:slice$27371 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [17], Q = \P3.EBX [17]).
Adding EN signal on $auto$ff.cc:262:slice$27370 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [16], Q = \P3.EBX [16]).
Adding EN signal on $auto$ff.cc:262:slice$27369 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [15], Q = \P3.EBX [15]).
Adding EN signal on $auto$ff.cc:262:slice$27368 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [14], Q = \P3.EBX [14]).
Adding EN signal on $auto$ff.cc:262:slice$27367 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [13], Q = \P3.EBX [13]).
Adding EN signal on $auto$ff.cc:262:slice$27366 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [12], Q = \P3.EBX [12]).
Adding EN signal on $auto$ff.cc:262:slice$27365 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [11], Q = \P3.EBX [11]).
Adding EN signal on $auto$ff.cc:262:slice$27364 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [10], Q = \P3.EBX [10]).
Adding EN signal on $auto$ff.cc:262:slice$27363 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [9], Q = \P3.EBX [9]).
Adding EN signal on $auto$ff.cc:262:slice$27362 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [8], Q = \P3.EBX [8]).
Adding EN signal on $auto$ff.cc:262:slice$27361 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [7], Q = \P3.EBX [7]).
Adding EN signal on $auto$ff.cc:262:slice$27360 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [6], Q = \P3.EBX [6]).
Adding EN signal on $auto$ff.cc:262:slice$27359 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [5], Q = \P3.EBX [5]).
Adding EN signal on $auto$ff.cc:262:slice$27358 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [4], Q = \P3.EBX [4]).
Adding EN signal on $auto$ff.cc:262:slice$27357 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [3], Q = \P3.EBX [3]).
Adding EN signal on $auto$ff.cc:262:slice$27356 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [2], Q = \P3.EBX [2]).
Adding EN signal on $auto$ff.cc:262:slice$27355 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [1], Q = \P3.EBX [1]).
Adding EN signal on $auto$ff.cc:262:slice$27354 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29075 [0], Q = \P3.EBX [0]).
Adding EN signal on $auto$ff.cc:262:slice$27353 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [32], Q = \P3.rEIP [31]).
Adding EN signal on $auto$ff.cc:262:slice$27352 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [30], Q = \P3.rEIP [30]).
Adding EN signal on $auto$ff.cc:262:slice$27351 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [29], Q = \P3.rEIP [29]).
Adding EN signal on $auto$ff.cc:262:slice$27350 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [28], Q = \P3.rEIP [28]).
Adding EN signal on $auto$ff.cc:262:slice$27349 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [27], Q = \P3.rEIP [27]).
Adding EN signal on $auto$ff.cc:262:slice$27348 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [26], Q = \P3.rEIP [26]).
Adding EN signal on $auto$ff.cc:262:slice$27347 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [25], Q = \P3.rEIP [25]).
Adding EN signal on $auto$ff.cc:262:slice$27346 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [24], Q = \P3.rEIP [24]).
Adding EN signal on $auto$ff.cc:262:slice$27345 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [23], Q = \P3.rEIP [23]).
Adding EN signal on $auto$ff.cc:262:slice$27344 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [22], Q = \P3.rEIP [22]).
Adding EN signal on $auto$ff.cc:262:slice$27343 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [21], Q = \P3.rEIP [21]).
Adding EN signal on $auto$ff.cc:262:slice$27342 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [20], Q = \P3.rEIP [20]).
Adding EN signal on $auto$ff.cc:262:slice$27341 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [19], Q = \P3.rEIP [19]).
Adding EN signal on $auto$ff.cc:262:slice$27340 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [18], Q = \P3.rEIP [18]).
Adding EN signal on $auto$ff.cc:262:slice$27339 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [17], Q = \P3.rEIP [17]).
Adding EN signal on $auto$ff.cc:262:slice$27338 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [16], Q = \P3.rEIP [16]).
Adding EN signal on $auto$ff.cc:262:slice$27337 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [15], Q = \P3.rEIP [15]).
Adding EN signal on $auto$ff.cc:262:slice$27336 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [14], Q = \P3.rEIP [14]).
Adding EN signal on $auto$ff.cc:262:slice$27335 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [13], Q = \P3.rEIP [13]).
Adding EN signal on $auto$ff.cc:262:slice$27334 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [12], Q = \P3.rEIP [12]).
Adding EN signal on $auto$ff.cc:262:slice$27333 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [11], Q = \P3.rEIP [11]).
Adding EN signal on $auto$ff.cc:262:slice$27332 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [10], Q = \P3.rEIP [10]).
Adding EN signal on $auto$ff.cc:262:slice$27331 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [9], Q = \P3.rEIP [9]).
Adding EN signal on $auto$ff.cc:262:slice$27330 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [8], Q = \P3.rEIP [8]).
Adding EN signal on $auto$ff.cc:262:slice$27329 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [7], Q = \P3.rEIP [7]).
Adding EN signal on $auto$ff.cc:262:slice$27328 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [6], Q = \P3.rEIP [6]).
Adding EN signal on $auto$ff.cc:262:slice$27327 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [5], Q = \P3.rEIP [5]).
Adding EN signal on $auto$ff.cc:262:slice$27326 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [4], Q = \P3.rEIP [4]).
Adding EN signal on $auto$ff.cc:262:slice$27325 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [3], Q = \P3.rEIP [3]).
Adding EN signal on $auto$ff.cc:262:slice$27324 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [2], Q = \P3.rEIP [2]).
Adding EN signal on $auto$ff.cc:262:slice$27323 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [1], Q = \P3.rEIP [1]).
Adding EN signal on $auto$ff.cc:262:slice$27322 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32295 [0], Q = \P3.rEIP [0]).
Adding EN signal on $auto$ff.cc:262:slice$27321 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31828, Q = \P3.ReadRequest).
Adding EN signal on $auto$ff.cc:262:slice$27320 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31809, Q = \P3.MemoryFetch).
Adding EN signal on $auto$ff.cc:262:slice$27319 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31790, Q = \P3.RequestPending).
Adding EN signal on $auto$ff.cc:262:slice$26837 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15354 [1], Q = \P1.DataWidth [1]).
Adding EN signal on $auto$ff.cc:262:slice$26836 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$15354 [0], Q = \P1.DataWidth [0]).
Adding EN signal on $auto$ff.cc:262:slice$26060 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [29], Q = \P2.Address [29]).
Adding EN signal on $auto$ff.cc:262:slice$26059 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [28], Q = \P2.Address [28]).
Adding EN signal on $auto$ff.cc:262:slice$26058 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [27], Q = \P2.Address [27]).
Adding EN signal on $auto$ff.cc:262:slice$26057 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [26], Q = \P2.Address [26]).
Adding EN signal on $auto$ff.cc:262:slice$26056 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [25], Q = \P2.Address [25]).
Adding EN signal on $auto$ff.cc:262:slice$26055 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [24], Q = \P2.Address [24]).
Adding EN signal on $auto$ff.cc:262:slice$26054 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [23], Q = \P2.Address [23]).
Adding EN signal on $auto$ff.cc:262:slice$26053 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [22], Q = \P2.Address [22]).
Adding EN signal on $auto$ff.cc:262:slice$26052 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [21], Q = \P2.Address [21]).
Adding EN signal on $auto$ff.cc:262:slice$26051 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [20], Q = \P2.Address [20]).
Adding EN signal on $auto$ff.cc:262:slice$26050 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [19], Q = \P2.Address [19]).
Adding EN signal on $auto$ff.cc:262:slice$26049 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [18], Q = \P2.Address [18]).
Adding EN signal on $auto$ff.cc:262:slice$26048 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [17], Q = \P2.Address [17]).
Adding EN signal on $auto$ff.cc:262:slice$26047 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [16], Q = \P2.Address [16]).
Adding EN signal on $auto$ff.cc:262:slice$26046 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [15], Q = \P2.Address [15]).
Adding EN signal on $auto$ff.cc:262:slice$26045 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [14], Q = \P2.Address [14]).
Adding EN signal on $auto$ff.cc:262:slice$26044 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [13], Q = \P2.Address [13]).
Adding EN signal on $auto$ff.cc:262:slice$26043 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [12], Q = \P2.Address [12]).
Adding EN signal on $auto$ff.cc:262:slice$26042 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [11], Q = \P2.Address [11]).
Adding EN signal on $auto$ff.cc:262:slice$26041 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [10], Q = \P2.Address [10]).
Adding EN signal on $auto$ff.cc:262:slice$26040 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [9], Q = \P2.Address [9]).
Adding EN signal on $auto$ff.cc:262:slice$26039 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [8], Q = \P2.Address [8]).
Adding EN signal on $auto$ff.cc:262:slice$26038 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [7], Q = \P2.Address [7]).
Adding EN signal on $auto$ff.cc:262:slice$26037 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [6], Q = \P2.Address [6]).
Adding EN signal on $auto$ff.cc:262:slice$26036 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [5], Q = \P2.Address [5]).
Adding EN signal on $auto$ff.cc:262:slice$26035 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [4], Q = \P2.Address [4]).
Adding EN signal on $auto$ff.cc:262:slice$26034 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [3], Q = \P2.Address [3]).
Adding EN signal on $auto$ff.cc:262:slice$26033 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [2], Q = \P2.Address [2]).
Adding EN signal on $auto$ff.cc:262:slice$26032 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [1], Q = \P2.Address [1]).
Adding EN signal on $auto$ff.cc:262:slice$26031 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26298 [0], Q = \P2.Address [0]).
Adding EN signal on $auto$ff.cc:262:slice$26029 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26647, Q = \P2.D_C_n).
Adding EN signal on $auto$ff.cc:262:slice$26027 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26637, Q = \P2.ADS_n).
Adding EN signal on $auto$ff.cc:262:slice$26026 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26625 [2], Q = \P2.State [2]).
Adding EN signal on $auto$ff.cc:262:slice$26025 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26625 [1], Q = \P2.State [1]).
Adding EN signal on $auto$ff.cc:262:slice$26024 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26625 [0], Q = \P2.State [0]).
Adding EN signal on $auto$ff.cc:262:slice$26023 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$26571, Q = \P2.StateBS16).
Adding EN signal on $auto$ff.cc:262:slice$26022 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37427 [1], Q = \P3.DataWidth [1]).
Adding EN signal on $auto$ff.cc:262:slice$26021 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$37427 [0], Q = \P3.DataWidth [0]).
Adding EN signal on $auto$ff.cc:262:slice$17067 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21804 [3], Q = \P2.P1.State2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$17066 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21804 [2], Q = \P2.P1.State2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$17065 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21804 [1], Q = \P2.P1.State2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$17064 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21804 [0], Q = \P2.P1.State2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$17063 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21161 [7], Q = \P2.P1.InstQueue[15] [7]).
Adding EN signal on $auto$ff.cc:262:slice$17062 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21161 [6], Q = \P2.P1.InstQueue[15] [6]).
Adding EN signal on $auto$ff.cc:262:slice$17061 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21161 [5], Q = \P2.P1.InstQueue[15] [5]).
Adding EN signal on $auto$ff.cc:262:slice$17060 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21161 [4], Q = \P2.P1.InstQueue[15] [4]).
Adding EN signal on $auto$ff.cc:262:slice$17059 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21161 [3], Q = \P2.P1.InstQueue[15] [3]).
Adding EN signal on $auto$ff.cc:262:slice$17058 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21161 [2], Q = \P2.P1.InstQueue[15] [2]).
Adding EN signal on $auto$ff.cc:262:slice$17057 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21161 [1], Q = \P2.P1.InstQueue[15] [1]).
Adding EN signal on $auto$ff.cc:262:slice$17056 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21161 [0], Q = \P2.P1.InstQueue[15] [0]).
Adding EN signal on $auto$ff.cc:262:slice$17055 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21037 [7], Q = \P2.P1.InstQueue[14] [7]).
Adding EN signal on $auto$ff.cc:262:slice$17054 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21037 [6], Q = \P2.P1.InstQueue[14] [6]).
Adding EN signal on $auto$ff.cc:262:slice$17053 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21037 [5], Q = \P2.P1.InstQueue[14] [5]).
Adding EN signal on $auto$ff.cc:262:slice$17052 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21037 [4], Q = \P2.P1.InstQueue[14] [4]).
Adding EN signal on $auto$ff.cc:262:slice$17051 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21037 [3], Q = \P2.P1.InstQueue[14] [3]).
Adding EN signal on $auto$ff.cc:262:slice$17050 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21037 [2], Q = \P2.P1.InstQueue[14] [2]).
Adding EN signal on $auto$ff.cc:262:slice$17049 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21037 [1], Q = \P2.P1.InstQueue[14] [1]).
Adding EN signal on $auto$ff.cc:262:slice$17048 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21037 [0], Q = \P2.P1.InstQueue[14] [0]).
Adding EN signal on $auto$ff.cc:262:slice$17047 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20913 [7], Q = \P2.P1.InstQueue[13] [7]).
Adding EN signal on $auto$ff.cc:262:slice$17046 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20913 [6], Q = \P2.P1.InstQueue[13] [6]).
Adding EN signal on $auto$ff.cc:262:slice$17045 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20913 [5], Q = \P2.P1.InstQueue[13] [5]).
Adding EN signal on $auto$ff.cc:262:slice$17044 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20913 [4], Q = \P2.P1.InstQueue[13] [4]).
Adding EN signal on $auto$ff.cc:262:slice$17043 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20913 [3], Q = \P2.P1.InstQueue[13] [3]).
Adding EN signal on $auto$ff.cc:262:slice$17042 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20913 [2], Q = \P2.P1.InstQueue[13] [2]).
Adding EN signal on $auto$ff.cc:262:slice$17041 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20913 [1], Q = \P2.P1.InstQueue[13] [1]).
Adding EN signal on $auto$ff.cc:262:slice$17040 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20913 [0], Q = \P2.P1.InstQueue[13] [0]).
Adding EN signal on $auto$ff.cc:262:slice$17039 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20789 [7], Q = \P2.P1.InstQueue[12] [7]).
Adding EN signal on $auto$ff.cc:262:slice$17038 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20789 [6], Q = \P2.P1.InstQueue[12] [6]).
Adding EN signal on $auto$ff.cc:262:slice$17037 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20789 [5], Q = \P2.P1.InstQueue[12] [5]).
Adding EN signal on $auto$ff.cc:262:slice$17036 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20789 [4], Q = \P2.P1.InstQueue[12] [4]).
Adding EN signal on $auto$ff.cc:262:slice$17035 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20789 [3], Q = \P2.P1.InstQueue[12] [3]).
Adding EN signal on $auto$ff.cc:262:slice$17034 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20789 [2], Q = \P2.P1.InstQueue[12] [2]).
Adding EN signal on $auto$ff.cc:262:slice$17033 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20789 [1], Q = \P2.P1.InstQueue[12] [1]).
Adding EN signal on $auto$ff.cc:262:slice$17032 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20789 [0], Q = \P2.P1.InstQueue[12] [0]).

yosys> opt_clean

3.23.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 21 unused cells and 9514 unused wires.
<suppressed ~22 debug messages>

yosys> opt_expr

3.23.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~39539 debug messages>

3.23.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.23.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.23.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~159807 debug messages>
Removed a total of 53269 cells.

yosys> opt_dff

3.23.20. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$36926 ($_DFF_PP0_) from module b17 (D = \P3.MemoryFetch, Q = \P3.M_IO_n).
Adding EN signal on $auto$ff.cc:262:slice$36928 ($_DFF_PP0_) from module b17 (D = $flatten\P3.$verific$n398$200, Q = \P3.W_R_n).
Adding EN signal on $auto$ff.cc:262:slice$36961 ($_DFF_PP0_) from module b17 (D = \P3.ByteEnable [2], Q = \P3.BE_n [2]).
Adding EN signal on $auto$ff.cc:262:slice$36962 ($_DFF_PP0_) from module b17 (D = \P3.ByteEnable [3], Q = \P3.BE_n [3]).
Adding EN signal on $auto$ff.cc:262:slice$36959 ($_DFF_PP0_) from module b17 (D = \P3.ByteEnable [0], Q = \P3.BE_n [0]).
Adding EN signal on $auto$ff.cc:262:slice$36960 ($_DFF_PP0_) from module b17 (D = \P3.ByteEnable [1], Q = \P3.BE_n [1]).
Adding EN signal on $auto$ff.cc:262:slice$14853 ($_DFF_PP0_) from module b17 (D = \P1.MemoryFetch, Q = \P1.M_IO_n).
Adding EN signal on $auto$ff.cc:262:slice$14855 ($_DFF_PP0_) from module b17 (D = $flatten\P1.$verific$n398$200, Q = \P1.W_R_n).
Adding EN signal on $auto$ff.cc:262:slice$14886 ($_DFF_PP0_) from module b17 (D = \P1.ByteEnable [0], Q = \P1.BE_n [0]).
Adding EN signal on $auto$ff.cc:262:slice$14887 ($_DFF_PP0_) from module b17 (D = \P1.ByteEnable [1], Q = \P1.BE_n [1]).
Adding EN signal on $auto$ff.cc:262:slice$14888 ($_DFF_PP0_) from module b17 (D = \P1.ByteEnable [2], Q = \P1.BE_n [2]).
Adding EN signal on $auto$ff.cc:262:slice$14889 ($_DFF_PP0_) from module b17 (D = \P1.ByteEnable [3], Q = \P1.BE_n [3]).
Adding EN signal on $auto$ff.cc:262:slice$26064 ($_DFF_PP0_) from module b17 (D = \P2.ByteEnable [3], Q = \P2.BE_n [3]).
Adding EN signal on $auto$ff.cc:262:slice$26063 ($_DFF_PP0_) from module b17 (D = \P2.ByteEnable [2], Q = \P2.BE_n [2]).
Adding EN signal on $auto$ff.cc:262:slice$26062 ($_DFF_PP0_) from module b17 (D = \P2.ByteEnable [1], Q = \P2.BE_n [1]).
Adding EN signal on $auto$ff.cc:262:slice$26061 ($_DFF_PP0_) from module b17 (D = \P2.ByteEnable [0], Q = \P2.BE_n [0]).
Adding EN signal on $auto$ff.cc:262:slice$26030 ($_DFF_PP0_) from module b17 (D = $flatten\P2.$verific$n398$200, Q = \P2.W_R_n).
Adding EN signal on $auto$ff.cc:262:slice$26028 ($_DFF_PP0_) from module b17 (D = \P2.MemoryFetch, Q = \P2.M_IO_n).

yosys> opt_clean

3.23.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 36 unused cells and 46424 unused wires.
<suppressed ~37 debug messages>

yosys> opt_expr

3.23.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.23.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.23.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.23.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~99 debug messages>
Removed a total of 33 cells.

yosys> opt_dff

3.23.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.23.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 33 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.23.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.23.30. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.23.31. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.32. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.23.33. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.23.34. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.23.35. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr

3.23.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.23.37. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.24. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.24.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~8784 debug messages>

yosys> opt_merge

3.24.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~132 debug messages>
Removed a total of 44 cells.

yosys> opt_dff

3.24.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 473 unused wires.
<suppressed ~1 debug messages>

3.24.5. Finished fast OPT passes.

yosys> memory_map

3.25. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~61 debug messages>

yosys> opt_merge -nomux

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.26.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.26.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.26.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_share

3.26.6. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:278:simplemap_mux$13577 in front of them:
        $auto$simplemap.cc:278:simplemap_mux$12065
        $auto$simplemap.cc:278:simplemap_mux$12445

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:278:simplemap_mux$14716 in front of them:
        $auto$simplemap.cc:278:simplemap_mux$34276
        $auto$simplemap.cc:278:simplemap_mux$34688

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:278:simplemap_mux$4650 in front of them:
        $auto$simplemap.cc:278:simplemap_mux$23597
        $auto$simplemap.cc:278:simplemap_mux$23949

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$15446 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$15436
        $auto$simplemap.cc:312:simplemap_bmux$15433

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$26621 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$26611
        $auto$simplemap.cc:312:simplemap_bmux$26608

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$37487 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$37477
        $auto$simplemap.cc:312:simplemap_bmux$37474


yosys> opt_dff

3.26.7. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$83129 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [1], Q = \P2.P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$82907 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [2], Q = \P2.P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$82685 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [3], Q = \P2.P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$82463 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [4], Q = \P2.P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$82241 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [5], Q = \P2.P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$81969 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [6], Q = \P2.P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$81747 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [7], Q = \P2.P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$81525 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [8], Q = \P2.P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$81303 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [9], Q = \P2.P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$81081 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [10], Q = \P2.P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$80859 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [11], Q = \P2.P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$80637 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [12], Q = \P2.P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$80365 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [13], Q = \P2.P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$80143 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [14], Q = \P2.P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$79921 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [15], Q = \P2.P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$79699 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [16], Q = \P2.P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$79477 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [17], Q = \P2.P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$79255 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [18], Q = \P2.P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$79033 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [19], Q = \P2.P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$78761 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [20], Q = \P2.P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$78539 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [21], Q = \P2.P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$78317 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [22], Q = \P2.P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$78095 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [23], Q = \P2.P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$77873 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [24], Q = \P2.P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$77651 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [25], Q = \P2.P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$77429 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [26], Q = \P2.P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$63428 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [28], Q = \P2.P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$63206 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [29], Q = \P2.P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$62984 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [30], Q = \P2.P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$62762 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [31], Q = \P2.P1.InstAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$61376 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$22195 [27], Q = \P2.P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$176373 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [1], Q = \P3.P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$176151 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [2], Q = \P3.P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$175929 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [3], Q = \P3.P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$175707 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [4], Q = \P3.P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$175485 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [5], Q = \P3.P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$175263 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [6], Q = \P3.P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$175041 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [7], Q = \P3.P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$174819 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [8], Q = \P3.P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$174597 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [9], Q = \P3.P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$174375 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [10], Q = \P3.P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$174153 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [11], Q = \P3.P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$173931 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [12], Q = \P3.P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$173709 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [13], Q = \P3.P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$173487 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [14], Q = \P3.P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$173265 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [15], Q = \P3.P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$173043 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [16], Q = \P3.P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$172821 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [17], Q = \P3.P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$172599 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [18], Q = \P3.P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$172377 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [19], Q = \P3.P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$172155 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [20], Q = \P3.P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$171933 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [21], Q = \P3.P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$171711 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [22], Q = \P3.P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$171489 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [23], Q = \P3.P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$171267 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [24], Q = \P3.P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$171045 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [25], Q = \P3.P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$170823 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [26], Q = \P3.P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$170601 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [27], Q = \P3.P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$170379 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [28], Q = \P3.P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$170157 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [29], Q = \P3.P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$169935 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [30], Q = \P3.P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$169713 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32779 [31], Q = \P3.P1.InstAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$132511 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [1], Q = \P1.P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$132289 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [2], Q = \P1.P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$132067 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [3], Q = \P1.P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$131845 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [4], Q = \P1.P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$131623 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [5], Q = \P1.P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$131401 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [6], Q = \P1.P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$131179 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [7], Q = \P1.P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$130957 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [8], Q = \P1.P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$130735 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [9], Q = \P1.P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$130513 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [10], Q = \P1.P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$130291 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [11], Q = \P1.P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$130069 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [12], Q = \P1.P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$129847 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [13], Q = \P1.P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$129625 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [14], Q = \P1.P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$129403 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [15], Q = \P1.P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$129181 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [16], Q = \P1.P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$128959 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [17], Q = \P1.P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$128737 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [18], Q = \P1.P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$128515 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [19], Q = \P1.P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$128293 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [20], Q = \P1.P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$128071 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [21], Q = \P1.P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$127849 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [22], Q = \P1.P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$127627 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [23], Q = \P1.P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$127405 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [24], Q = \P1.P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$127183 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [25], Q = \P1.P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$126961 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [26], Q = \P1.P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$126739 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [27], Q = \P1.P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$126517 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [28], Q = \P1.P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$126295 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [29], Q = \P1.P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$126073 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [30], Q = \P1.P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$125851 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10569 [31], Q = \P1.P1.InstAddrPointer [31]).

yosys> opt_clean

3.26.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 192 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.26.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~471 debug messages>

3.26.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.26.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce -full

3.26.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.26.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~1926 debug messages>
Removed a total of 642 cells.

yosys> opt_share

3.26.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.26.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 648 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.26.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.26.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.26.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce -full

3.26.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.26.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_share

3.26.22. Executing OPT_SHARE pass.

yosys> opt_dff

3.26.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr -full

3.26.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.26.26. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.27. Executing ABC pass (technology mapping using ABC).

3.27.1. Extracting gate netlist of module `\b17' to `<abc-temp-dir>/input.blif'..
Extracted 17215 gates and 18556 wires to a netlist network with 1339 inputs and 1447 outputs.

3.27.1.1. Executing ABC.
Running ABC command: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/result_23-03-2022T14-57-36/All_lut_synth_rs_ade.json/b17/abc_tmp.scr 
ABC:   #Luts =  6358  Max Lvl =  24  Avg Lvl =  11.27  [   4.47 sec. at Pass 0]
ABC:   #Luts =  4850  Max Lvl =  19  Avg Lvl =   8.59  [ 143.98 sec. at Pass 1]
ABC:   #Luts =  4731  Max Lvl =  19  Avg Lvl =   7.99  [  36.26 sec. at Pass 2]
ABC:   #Luts =  4634  Max Lvl =  20  Avg Lvl =   8.12  [  55.43 sec. at Pass 3]
ABC:   #Luts =  4620  Max Lvl =  18  Avg Lvl =   7.94  [  29.05 sec. at Pass 4]
ABC:   #Luts =  4518  Max Lvl =  18  Avg Lvl =   8.18  [  44.39 sec. at Pass 5]
ABC:   #Luts =  4498  Max Lvl =  19  Avg Lvl =   8.26  [  29.79 sec. at Pass 6]
ABC:   #Luts =  4438  Max Lvl =  20  Avg Lvl =   8.29  [  45.01 sec. at Pass 7]
ABC:   #Luts =  4423  Max Lvl =  21  Avg Lvl =   8.33  [  25.37 sec. at Pass 8]
ABC:   #Luts =  4389  Max Lvl =  20  Avg Lvl =   8.52  [  39.17 sec. at Pass 9]
ABC:   #Luts =  4384  Max Lvl =  20  Avg Lvl =   8.26  [  24.28 sec. at Pass 10]
ABC:   #Luts =  4353  Max Lvl =  19  Avg Lvl =   8.32  [  32.34 sec. at Pass 11]
ABC:   #Luts =  4341  Max Lvl =  19  Avg Lvl =   8.07  [  22.50 sec. at Pass 12]
ABC:   #Luts =  4315  Max Lvl =  23  Avg Lvl =   8.39  [  34.12 sec. at Pass 13]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.27.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     4331
ABC RESULTS:        internal signals:    15770
ABC RESULTS:           input signals:     1339
ABC RESULTS:          output signals:     1447
Removing temp directory.

yosys> opt

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~21 debug messages>
Removed a total of 7 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 6503 unused wires.
<suppressed ~9 debug messages>

yosys> opt_expr

3.28.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.28.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.28.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

3.28.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.28.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr

3.28.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.28.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.29. Printing statistics.

=== b17 ===

   Number of wires:               4485
   Number of wire bits:           6192
   Number of public wires:         191
   Number of public wire bits:    1898
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               5635
     $_DFFE_PP0P_                 1307
     $_DFF_PP0_                      4
     $lut                         4318
     $mux                            6


yosys> shregmap -minlen 8 -maxlen 20

3.30. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.31. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.32. Printing statistics.

=== b17 ===

   Number of wires:               4485
   Number of wire bits:           6192
   Number of public wires:         191
   Number of public wire bits:    1898
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               5635
     $_DFFE_PP0P_                 1307
     $_DFF_PP0_                      4
     $lut                         4318
     $mux                            6


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.33. Executing TECHMAP pass (map to technology primitives).

3.33.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.33.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Successfully finished Verilog frontend.

3.33.3. Continuing TECHMAP pass.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~7074 debug messages>

yosys> opt_expr -mux_undef

3.34. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~119858 debug messages>

yosys> simplemap

3.35. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~50691 debug messages>
Removed a total of 16897 cells.

yosys> opt_dff -nodffe -nosdff

3.38. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 17537 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~3800 debug messages>

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~399 debug messages>
Removed a total of 133 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 932 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.41. Executing ABC pass (technology mapping using ABC).

3.41.1. Extracting gate netlist of module `\b17' to `<abc-temp-dir>/input.blif'..
Extracted 18267 gates and 19589 wires to a netlist network with 1320 inputs and 1427 outputs.

3.41.1.1. Executing ABC.
Running ABC command: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/result_23-03-2022T14-57-36/All_lut_synth_rs_ade.json/b17/abc_tmp.scr 
ABC:   #Luts =  4336  Max Lvl =  23  Avg Lvl =   8.55  [   1.42 sec. at Pass 0]
ABC:   #Luts =  4336  Max Lvl =  23  Avg Lvl =   8.55  [  80.93 sec. at Pass 1]
ABC:   #Luts =  4336  Max Lvl =  23  Avg Lvl =   8.55  [  16.05 sec. at Pass 2]
ABC:   #Luts =  4253  Max Lvl =  18  Avg Lvl =   8.14  [  18.15 sec. at Pass 3]
ABC:   #Luts =  4253  Max Lvl =  18  Avg Lvl =   8.14  [  10.67 sec. at Pass 4]
ABC:   #Luts =  4253  Max Lvl =  18  Avg Lvl =   8.14  [  18.82 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.41.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     4264
ABC RESULTS:        internal signals:    16842
ABC RESULTS:           input signals:     1320
ABC RESULTS:          output signals:     1427
Removing temp directory.

yosys> opt

3.42. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.42.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

yosys> opt_merge -nomux

3.42.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.42.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.42.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.42.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 15563 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.42.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.42.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.42.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.42.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.42.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr

3.42.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.42.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.43. Executing HIERARCHY pass (managing design hierarchy).

3.43.1. Analyzing design hierarchy..
Top module:  \b17

3.43.2. Analyzing design hierarchy..
Top module:  \b17
Removed 0 unused modules.

yosys> stat

3.44. Printing statistics.

=== b17 ===

   Number of wires:               4424
   Number of wire bits:           6131
   Number of public wires:         191
   Number of public wire bits:    1898
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               5574
     $lut                         4263
     dffsre                       1311


yosys> opt_clean -purge

3.45. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 47 unused wires.
<suppressed ~47 debug messages>

yosys> write_verilog -noattr -nohex b17.verilog

3.46. Executing Verilog backend.

yosys> bmuxmap

3.46.1. Executing BMUXMAP pass.

yosys> demuxmap

3.46.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\b17'.

End of script. Logfile hash: f1691cbc50, CPU: user 203.65s system 1.51s, MEM: 323.05 MB peak
Yosys 0.14+36 (git sha1 4cd3e3b51, gcc 7.1.0 -fPIC -Os)
Time spent: 95% 2x abc (4280 sec), 1% 35x opt_dff (85 sec), ...
real 1105.51
user 4254.10
sys 230.44
