
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.14+36 (git sha1 15a4e900b, gcc 7.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl b17.vhd

yosys> verific -vhdl b17.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'b17.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-INFO [VHDL-1012] b17.vhd:1: analyzing entity 'b15'
VERIFIC-INFO [VHDL-1010] b17.vhd:17: analyzing architecture 'behav'
VERIFIC-INFO [VHDL-1012] b17.vhd:673: analyzing entity 'b17'
VERIFIC-INFO [VHDL-1010] b17.vhd:685: analyzing architecture 'behav'

yosys> synth_rs -top b17 -tech generic -goal area -no_dsp -no_bram -verilog b17.verilog

3. Executing synth_rs pass.

yosys> hierarchy -check -top b17

3.1. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] b17.vhd:673: processing 'b17(BEHAV)'
VERIFIC-INFO [VHDL-1067] b17.vhd:1: processing 'b15(BEHAV)'
Importing module standard.
Importing module b17.
Importing module b15(BEHAV).

3.1.1. Analyzing design hierarchy..
Top module:  \b17
Used module:     \b15(BEHAV)

3.1.2. Analyzing design hierarchy..
Top module:  \b17
Used module:     \b15(BEHAV)
Removing unused module `\standard'.
Removed 1 unused modules.

yosys> proc

3.2. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.2.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.2.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.2.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.2.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.2.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.2.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.2.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.2.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.2.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.2.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.2.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~4 debug messages>
Optimizing module b15(BEHAV).
<suppressed ~17 debug messages>

yosys> flatten

3.3. Executing FLATTEN pass (flatten design).
Deleting now unused module b15(BEHAV).
<suppressed ~3 debug messages>

yosys> tribuf -logic

3.4. Executing TRIBUF pass.

yosys> opt_expr

3.5. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~15 debug messages>

yosys> opt_clean

3.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 21 unused cells and 481 unused wires.
<suppressed ~211 debug messages>

yosys> check

3.7. Executing CHECK pass (checking for obvious problems).
Checking module b17...
Found and reported 0 problems.

yosys> deminout

3.8. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt -nodffe -nosdff

3.9. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.9.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~6 debug messages>

yosys> opt_merge -nomux

3.9.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~18 debug messages>
Removed a total of 6 cells.

yosys> opt_muxtree

3.9.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~279 debug messages>

yosys> opt_reduce

3.9.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
    New ctrl vector for $pmux cell $flatten\P1.$verific$Select_723$b17.vhd:562$1097: { $flatten\P1.$verific$n7981$278 $flatten\P1.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1268 $auto$opt_reduce.cc:134:opt_pmux$1266 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$Select_725$b17.vhd:562$1099: { $flatten\P1.$verific$n7981$278 $auto$opt_reduce.cc:134:opt_pmux$1274 $auto$opt_reduce.cc:134:opt_pmux$1272 $auto$opt_reduce.cc:134:opt_pmux$1270 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$Select_731$b17.vhd:562$1105: { $flatten\P1.$verific$n8173$299 $flatten\P1.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1276 $flatten\P1.$verific$n7990$287 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$Select_733$b17.vhd:562$1106: { $flatten\P1.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1280 $auto$opt_reduce.cc:134:opt_pmux$1278 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$Select_735$b17.vhd:562$1107: { $flatten\P1.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1284 $auto$opt_reduce.cc:134:opt_pmux$1282 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$Select_737$b17.vhd:562$1108: { $flatten\P1.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1286 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_720$b17.vhd:562$1094: { $flatten\P1.$verific$n7981$278 $flatten\P1.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1296 $auto$opt_reduce.cc:134:opt_pmux$1294 $auto$opt_reduce.cc:134:opt_pmux$1292 $auto$opt_reduce.cc:134:opt_pmux$1290 $auto$opt_reduce.cc:134:opt_pmux$1288 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_721$b17.vhd:562$1095: { $auto$opt_reduce.cc:134:opt_pmux$1306 $auto$opt_reduce.cc:134:opt_pmux$1304 $flatten\P1.$verific$n7987$284 $flatten\P1.$verific$n7989$286 $auto$opt_reduce.cc:134:opt_pmux$1302 $auto$opt_reduce.cc:134:opt_pmux$1300 $auto$opt_reduce.cc:134:opt_pmux$1298 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_726$b17.vhd:562$1100: { $flatten\P1.$verific$n7981$278 $flatten\P1.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1308 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_727$b17.vhd:562$1101: { $flatten\P1.$verific$n7985$282 $flatten\P1.$verific$n7987$284 $flatten\P1.$verific$n7989$286 $flatten\P1.$verific$n7995$292 $auto$opt_reduce.cc:134:opt_pmux$1310 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_728$b17.vhd:562$1102: { $flatten\P1.$verific$n7986$283 $flatten\P1.$verific$n7996$293 $auto$opt_reduce.cc:134:opt_pmux$1312 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_729$b17.vhd:562$1103: { $flatten\P1.$verific$n7987$284 $flatten\P1.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1316 $auto$opt_reduce.cc:134:opt_pmux$1314 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_738$b17.vhd:562$1109: { $flatten\P1.$verific$n7987$284 $flatten\P1.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1318 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_739$b17.vhd:562$1110: { $flatten\P1.$verific$n7987$284 $flatten\P1.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1320 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_740$b17.vhd:562$1111: { $flatten\P1.$verific$n7988$285 $flatten\P1.$verific$n7990$287 $auto$opt_reduce.cc:134:opt_pmux$1322 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_741$b17.vhd:562$1112: { $flatten\P1.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1324 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$Select_723$b17.vhd:562$1097: { $flatten\P2.$verific$n7981$278 $flatten\P2.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1328 $auto$opt_reduce.cc:134:opt_pmux$1326 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$Select_725$b17.vhd:562$1099: { $flatten\P2.$verific$n7981$278 $auto$opt_reduce.cc:134:opt_pmux$1334 $auto$opt_reduce.cc:134:opt_pmux$1332 $auto$opt_reduce.cc:134:opt_pmux$1330 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$Select_731$b17.vhd:562$1105: { $flatten\P2.$verific$n8173$299 $flatten\P2.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1336 $flatten\P2.$verific$n7990$287 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$Select_733$b17.vhd:562$1106: { $flatten\P2.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1340 $auto$opt_reduce.cc:134:opt_pmux$1338 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$Select_735$b17.vhd:562$1107: { $flatten\P2.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1344 $auto$opt_reduce.cc:134:opt_pmux$1342 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$Select_737$b17.vhd:562$1108: { $flatten\P2.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1346 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_720$b17.vhd:562$1094: { $flatten\P2.$verific$n7981$278 $flatten\P2.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1356 $auto$opt_reduce.cc:134:opt_pmux$1354 $auto$opt_reduce.cc:134:opt_pmux$1352 $auto$opt_reduce.cc:134:opt_pmux$1350 $auto$opt_reduce.cc:134:opt_pmux$1348 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_721$b17.vhd:562$1095: { $auto$opt_reduce.cc:134:opt_pmux$1366 $auto$opt_reduce.cc:134:opt_pmux$1364 $flatten\P2.$verific$n7987$284 $flatten\P2.$verific$n7989$286 $auto$opt_reduce.cc:134:opt_pmux$1362 $auto$opt_reduce.cc:134:opt_pmux$1360 $auto$opt_reduce.cc:134:opt_pmux$1358 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_726$b17.vhd:562$1100: { $flatten\P2.$verific$n7981$278 $flatten\P2.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1368 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_727$b17.vhd:562$1101: { $flatten\P2.$verific$n7985$282 $flatten\P2.$verific$n7987$284 $flatten\P2.$verific$n7989$286 $flatten\P2.$verific$n7995$292 $auto$opt_reduce.cc:134:opt_pmux$1370 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_728$b17.vhd:562$1102: { $flatten\P2.$verific$n7986$283 $flatten\P2.$verific$n7996$293 $auto$opt_reduce.cc:134:opt_pmux$1372 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_729$b17.vhd:562$1103: { $flatten\P2.$verific$n7987$284 $flatten\P2.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1376 $auto$opt_reduce.cc:134:opt_pmux$1374 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_738$b17.vhd:562$1109: { $flatten\P2.$verific$n7987$284 $flatten\P2.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1378 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_739$b17.vhd:562$1110: { $flatten\P2.$verific$n7987$284 $flatten\P2.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1380 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_740$b17.vhd:562$1111: { $flatten\P2.$verific$n7988$285 $flatten\P2.$verific$n7990$287 $auto$opt_reduce.cc:134:opt_pmux$1382 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_741$b17.vhd:562$1112: { $flatten\P2.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1384 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$Select_723$b17.vhd:562$1097: { $flatten\P3.$verific$n7981$278 $flatten\P3.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1388 $auto$opt_reduce.cc:134:opt_pmux$1386 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$Select_725$b17.vhd:562$1099: { $flatten\P3.$verific$n7981$278 $auto$opt_reduce.cc:134:opt_pmux$1394 $auto$opt_reduce.cc:134:opt_pmux$1392 $auto$opt_reduce.cc:134:opt_pmux$1390 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$Select_731$b17.vhd:562$1105: { $flatten\P3.$verific$n8173$299 $flatten\P3.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1396 $flatten\P3.$verific$n7990$287 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$Select_733$b17.vhd:562$1106: { $flatten\P3.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1400 $auto$opt_reduce.cc:134:opt_pmux$1398 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$Select_735$b17.vhd:562$1107: { $flatten\P3.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1404 $auto$opt_reduce.cc:134:opt_pmux$1402 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$Select_737$b17.vhd:562$1108: { $flatten\P3.$verific$n8173$299 $auto$opt_reduce.cc:134:opt_pmux$1406 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_720$b17.vhd:562$1094: { $flatten\P3.$verific$n7981$278 $flatten\P3.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1416 $auto$opt_reduce.cc:134:opt_pmux$1414 $auto$opt_reduce.cc:134:opt_pmux$1412 $auto$opt_reduce.cc:134:opt_pmux$1410 $auto$opt_reduce.cc:134:opt_pmux$1408 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_721$b17.vhd:562$1095: { $auto$opt_reduce.cc:134:opt_pmux$1426 $auto$opt_reduce.cc:134:opt_pmux$1424 $flatten\P3.$verific$n7987$284 $flatten\P3.$verific$n7989$286 $auto$opt_reduce.cc:134:opt_pmux$1422 $auto$opt_reduce.cc:134:opt_pmux$1420 $auto$opt_reduce.cc:134:opt_pmux$1418 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_726$b17.vhd:562$1100: { $flatten\P3.$verific$n7981$278 $flatten\P3.$verific$n7982$279 $auto$opt_reduce.cc:134:opt_pmux$1428 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_727$b17.vhd:562$1101: { $flatten\P3.$verific$n7985$282 $flatten\P3.$verific$n7987$284 $flatten\P3.$verific$n7989$286 $flatten\P3.$verific$n7995$292 $auto$opt_reduce.cc:134:opt_pmux$1430 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_728$b17.vhd:562$1102: { $flatten\P3.$verific$n7986$283 $flatten\P3.$verific$n7996$293 $auto$opt_reduce.cc:134:opt_pmux$1432 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_729$b17.vhd:562$1103: { $flatten\P3.$verific$n7987$284 $flatten\P3.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1436 $auto$opt_reduce.cc:134:opt_pmux$1434 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_738$b17.vhd:562$1109: { $flatten\P3.$verific$n7987$284 $flatten\P3.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1438 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_739$b17.vhd:562$1110: { $flatten\P3.$verific$n7987$284 $flatten\P3.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1440 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_740$b17.vhd:562$1111: { $flatten\P3.$verific$n7988$285 $flatten\P3.$verific$n7990$287 $auto$opt_reduce.cc:134:opt_pmux$1442 }
    New ctrl vector for $pmux cell $flatten\P3.$verific$select_741$b17.vhd:562$1112: { $flatten\P3.$verific$n7988$285 $auto$opt_reduce.cc:134:opt_pmux$1444 }
  Optimizing cells in module \b17.
Performed a total of 48 changes.

yosys> opt_merge

3.9.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~153 debug messages>
Removed a total of 51 cells.

yosys> opt_dff -nodffe -nosdff

3.9.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$ready22_reg$b17.vhd:759$124 ($aldff) from module b17.
Changing const-value async load to async reset on $verific$ready21_reg$b17.vhd:759$123 ($aldff) from module b17.
Changing const-value async load to async reset on $verific$ready12_reg$b17.vhd:738$103 ($aldff) from module b17.
Changing const-value async load to async reset on $verific$ready11_reg$b17.vhd:738$102 ($aldff) from module b17.
Changing const-value async load to async reset on $verific$buf2_reg$b17.vhd:759$122 ($aldff) from module b17.
Changing const-value async load to async reset on $verific$buf1_reg$b17.vhd:738$101 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$rEIP_reg$b17.vhd:612$1240 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$D_C_n_reg$b17.vhd:231$821 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$CodeFetch_reg$b17.vhd:612$1235 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$W_R_n_reg$b17.vhd:231$820 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$State_reg$b17.vhd:231$824 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$StateBS16_reg$b17.vhd:231$826 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$RequestPending_reg$b17.vhd:612$1244 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$ReadRequest_reg$b17.vhd:612$1242 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.uWord_reg$b17.vhd:612$1234 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.lWord_reg$b17.vhd:612$1233 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.State2_reg$b17.vhd:612$1210 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.PhyAddrPointer_reg$b17.vhd:612$1230 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.More_reg$b17.vhd:612$1231 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_9$b17.vhd:612$1218 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_8$b17.vhd:612$1217 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_7$b17.vhd:612$1216 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_6$b17.vhd:612$1215 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_5$b17.vhd:612$1214 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_4$b17.vhd:612$1213 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_3$b17.vhd:612$1212 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_2$b17.vhd:612$1211 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_16$b17.vhd:612$1225 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_15$b17.vhd:612$1224 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_14$b17.vhd:612$1223 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_13$b17.vhd:612$1222 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_12$b17.vhd:612$1221 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_11$b17.vhd:612$1220 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg_10$b17.vhd:612$1219 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueue_reg$b17.vhd:612$1226 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueueWr_Addr_reg$b17.vhd:612$1228 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstQueueRd_Addr_reg$b17.vhd:612$1227 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.InstAddrPointer_reg$b17.vhd:612$1229 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$P1.Flush_reg$b17.vhd:612$1232 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$MemoryFetch_reg$b17.vhd:612$1243 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$M_IO_n_reg$b17.vhd:231$822 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$EBX_reg$b17.vhd:612$1239 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$EAX_reg$b17.vhd:612$1238 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$Datao_reg$b17.vhd:612$1236 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$D_C_n_reg$b17.vhd:231$821 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$CodeFetch_reg$b17.vhd:612$1235 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$ByteEnable_reg$b17.vhd:668$1262 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$BE_n_reg$b17.vhd:231$818 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$Address_reg$b17.vhd:231$819 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P3.$verific$ADS_n_reg$b17.vhd:231$823 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$rEIP_reg$b17.vhd:612$1240 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$ByteEnable_reg$b17.vhd:668$1262 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$BE_n_reg$b17.vhd:231$818 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$Datao_reg$b17.vhd:612$1236 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$W_R_n_reg$b17.vhd:231$820 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$State_reg$b17.vhd:231$824 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$StateBS16_reg$b17.vhd:231$826 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$RequestPending_reg$b17.vhd:612$1244 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$ReadRequest_reg$b17.vhd:612$1242 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.uWord_reg$b17.vhd:612$1234 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.lWord_reg$b17.vhd:612$1233 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.State2_reg$b17.vhd:612$1210 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.PhyAddrPointer_reg$b17.vhd:612$1230 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.More_reg$b17.vhd:612$1231 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_9$b17.vhd:612$1218 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_8$b17.vhd:612$1217 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_7$b17.vhd:612$1216 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_6$b17.vhd:612$1215 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_5$b17.vhd:612$1214 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_4$b17.vhd:612$1213 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_3$b17.vhd:612$1212 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_2$b17.vhd:612$1211 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_16$b17.vhd:612$1225 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_15$b17.vhd:612$1224 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_14$b17.vhd:612$1223 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_13$b17.vhd:612$1222 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_12$b17.vhd:612$1221 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_11$b17.vhd:612$1220 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg_10$b17.vhd:612$1219 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueue_reg$b17.vhd:612$1226 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueueWr_Addr_reg$b17.vhd:612$1228 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstQueueRd_Addr_reg$b17.vhd:612$1227 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.InstAddrPointer_reg$b17.vhd:612$1229 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$P1.Flush_reg$b17.vhd:612$1232 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$MemoryFetch_reg$b17.vhd:612$1243 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$M_IO_n_reg$b17.vhd:231$822 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$EBX_reg$b17.vhd:612$1239 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$EAX_reg$b17.vhd:612$1238 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$Datao_reg$b17.vhd:612$1236 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$D_C_n_reg$b17.vhd:231$821 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$CodeFetch_reg$b17.vhd:612$1235 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$ByteEnable_reg$b17.vhd:668$1262 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$BE_n_reg$b17.vhd:231$818 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$Address_reg$b17.vhd:231$819 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P2.$verific$ADS_n_reg$b17.vhd:231$823 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$rEIP_reg$b17.vhd:612$1240 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$Address_reg$b17.vhd:231$819 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$ADS_n_reg$b17.vhd:231$823 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$W_R_n_reg$b17.vhd:231$820 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$State_reg$b17.vhd:231$824 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$StateBS16_reg$b17.vhd:231$826 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$RequestPending_reg$b17.vhd:612$1244 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$ReadRequest_reg$b17.vhd:612$1242 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.uWord_reg$b17.vhd:612$1234 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.lWord_reg$b17.vhd:612$1233 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.State2_reg$b17.vhd:612$1210 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.PhyAddrPointer_reg$b17.vhd:612$1230 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.More_reg$b17.vhd:612$1231 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_9$b17.vhd:612$1218 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_8$b17.vhd:612$1217 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_7$b17.vhd:612$1216 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_6$b17.vhd:612$1215 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_5$b17.vhd:612$1214 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_4$b17.vhd:612$1213 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_3$b17.vhd:612$1212 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_2$b17.vhd:612$1211 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_16$b17.vhd:612$1225 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_15$b17.vhd:612$1224 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_14$b17.vhd:612$1223 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_13$b17.vhd:612$1222 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_12$b17.vhd:612$1221 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_11$b17.vhd:612$1220 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg_10$b17.vhd:612$1219 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueue_reg$b17.vhd:612$1226 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueueWr_Addr_reg$b17.vhd:612$1228 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstQueueRd_Addr_reg$b17.vhd:612$1227 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.InstAddrPointer_reg$b17.vhd:612$1229 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$P1.Flush_reg$b17.vhd:612$1232 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$MemoryFetch_reg$b17.vhd:612$1243 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$M_IO_n_reg$b17.vhd:231$822 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$EBX_reg$b17.vhd:612$1239 ($aldff) from module b17.
Changing const-value async load to async reset on $flatten\P1.$verific$EAX_reg$b17.vhd:612$1238 ($aldff) from module b17.

yosys> opt_clean

3.9.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 6 unused cells and 69 unused wires.
<suppressed ~7 debug messages>

yosys> opt_expr

3.9.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.9.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.9.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~282 debug messages>

yosys> opt_reduce

3.9.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.9.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.9.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.9.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr

3.9.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.9.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

3.10. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.10.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.10.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.10.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.10.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> fsm_opt

3.10.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode

3.10.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.10.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.10.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~282 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$buf2_reg$b17.vhd:759$122 ($adff) from module b17 (D = \P2.Datao, Q = \buf2).
Adding EN signal on $verific$buf1_reg$b17.vhd:738$101 ($adff) from module b17 (D = $verific$n162$63, Q = \buf1).
Adding EN signal on $flatten\P3.$verific$ByteEnable_reg$b17.vhd:668$1262 ($adff) from module b17 (D = $flatten\P3.$verific$n9780$727, Q = \P3.ByteEnable).
Adding EN signal on $flatten\P2.$verific$ByteEnable_reg$b17.vhd:668$1262 ($adff) from module b17 (D = $flatten\P2.$verific$n9780$727, Q = \P2.ByteEnable).
Adding EN signal on $flatten\P1.$verific$ByteEnable_reg$b17.vhd:668$1262 ($adff) from module b17 (D = $flatten\P1.$verific$n9780$727, Q = \P1.ByteEnable).
Setting constant 0-bit at position 2 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 3 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 5 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 6 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 7 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 8 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 9 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 10 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 11 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 12 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 13 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 14 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 15 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 16 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 17 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 18 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 19 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 20 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 21 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 22 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 23 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 24 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 25 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 26 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 27 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 28 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 29 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 30 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 31 on $flatten\P1.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 31 on $flatten\P1.$verific$Datao_reg$b17.vhd:612$1236 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P1.$verific$P1.InstQueueWr_Addr_reg$b17.vhd:612$1228 ($adff) from module b17.
Setting constant 0-bit at position 2 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 3 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 5 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 6 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 7 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 8 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 9 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 10 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 11 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 12 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 13 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 14 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 15 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 16 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 17 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 18 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 19 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 20 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 21 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 22 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 23 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 24 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 25 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 26 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 27 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 28 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 29 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 30 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 31 on $flatten\P2.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 31 on $flatten\P2.$verific$Datao_reg$b17.vhd:612$1236 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P2.$verific$P1.InstQueueWr_Addr_reg$b17.vhd:612$1228 ($adff) from module b17.
Setting constant 0-bit at position 2 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 3 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 5 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 6 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 7 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 8 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 9 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 10 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 11 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 12 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 13 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 14 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 15 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 16 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 17 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 18 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 19 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 20 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 21 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 22 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 23 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 24 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 25 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 26 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 27 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 28 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 29 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 30 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 31 on $flatten\P3.$verific$DataWidth_reg$b17.vhd:231$827 ($adff) from module b17.
Setting constant 0-bit at position 31 on $flatten\P3.$verific$Datao_reg$b17.vhd:612$1236 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P3.$verific$P1.InstQueueWr_Addr_reg$b17.vhd:612$1228 ($adff) from module b17.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 1 unused cells and 1 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~11 debug messages>

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~281 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$1458 ($adff) from module b17.
Setting constant 0-bit at position 31 on $auto$ff.cc:262:slice$1459 ($adff) from module b17.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$1461 ($adff) from module b17.
Setting constant 0-bit at position 31 on $auto$ff.cc:262:slice$1462 ($adff) from module b17.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$1464 ($adff) from module b17.
Setting constant 0-bit at position 31 on $auto$ff.cc:262:slice$1465 ($adff) from module b17.
Setting constant 0-bit at position 31 on $auto$ff.cc:262:slice$1445 ($adffe) from module b17.
Setting constant 0-bit at position 31 on $auto$ff.cc:262:slice$1446 ($adffe) from module b17.
Setting constant 0-bit at position 4 on $flatten\P1.$verific$P1.InstQueueRd_Addr_reg$b17.vhd:612$1227 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P2.$verific$P1.InstQueueRd_Addr_reg$b17.vhd:612$1227 ($adff) from module b17.
Setting constant 0-bit at position 4 on $flatten\P3.$verific$P1.InstQueueRd_Addr_reg$b17.vhd:612$1227 ($adff) from module b17.

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 9 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~4 debug messages>

3.11.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~281 debug messages>

yosys> opt_reduce

3.11.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.11.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.11.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 2 unused cells and 7 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.11.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.11.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~281 debug messages>

yosys> opt_reduce

3.11.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.11.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.11.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr

3.11.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.11.30. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.12. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 32) from mux cell b17.$verific$mux_33$b17.vhd:737$97 ($mux).
Removed top 1 bits (of 32) from mux cell b17.$verific$mux_83$b17.vhd:777$127 ($mux).
Removed top 1 bits (of 32) from port A of cell b17.$verific$LessThan_84$b17.vhd:782$128 ($lt).
Removed top 1 bits (of 32) from port B of cell b17.$verific$LessThan_84$b17.vhd:782$128 ($lt).
Removed top 1 bits (of 32) from port A of cell b17.$verific$LessThan_85$b17.vhd:782$129 ($lt).
Removed top 1 bits (of 32) from port B of cell b17.$verific$LessThan_85$b17.vhd:782$129 ($lt).
Removed top 1 bits (of 32) from port A of cell b17.$verific$LessThan_86$b17.vhd:782$130 ($lt).
Removed top 1 bits (of 32) from port B of cell b17.$verific$LessThan_86$b17.vhd:782$130 ($lt).
Removed top 1 bits (of 33) from FF cell b17.$flatten\P1.$verific$rEIP_reg$b17.vhd:612$1240 ($adff).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P1.$verific$mux_812$b17.vhd:605$1175 ($mux).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P1.$verific$LessThan_771$b17.vhd:597$1139 ($le).
Removed top 1 bits (of 5) from port B of cell b17.$flatten\P1.$verific$LessThan_771$b17.vhd:597$1139 ($le).
Removed top 1 bits (of 6) from port A of cell b17.$flatten\P1.$verific$LessThan_768$b17.vhd:589$1137 ($lt).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P1.$verific$sub_767$b17.vhd:589$1136 ($sub).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P1.$verific$sub_767$b17.vhd:589$1136 ($sub).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P1.$verific$mux_766$b17.vhd:588$1135 ($mux).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P1.$verific$mux_765$b17.vhd:588$1134 ($mux).
Removed top 1 bits (of 4) from mux cell b17.$flatten\P1.$verific$mux_764$b17.vhd:587$1133 ($mux).
Removed top 1 bits (of 2) from port A of cell b17.$flatten\P1.$verific$add_760$b17.vhd:586$1131 ($add).
Removed top 30 bits (of 32) from mux cell b17.$flatten\P1.$verific$mux_759$b17.vhd:585$1129 ($mux).
Removed top 31 bits (of 33) from port Y of cell b17.$flatten\P1.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
Removed top 31 bits (of 33) from port A of cell b17.$flatten\P1.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P1.$verific$LessThan_755$b17.vhd:579$1124 ($lt).
Removed top 1 bits (of 6) from port A of cell b17.$flatten\P1.$verific$LessThan_745$b17.vhd:563$1116 ($lt).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P1.$verific$sub_744$b17.vhd:563$1115 ($sub).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P1.$verific$sub_744$b17.vhd:563$1115 ($sub).
Removed top 1 bits (of 5) from port B of cell b17.$flatten\P1.$verific$LessThan_742$b17.vhd:563$1113 ($lt).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P1.$verific$equal_718$b17.vhd:551$1090 ($eq).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P1.$verific$equal_717$b17.vhd:545$1089 ($eq).
Removed top 5 bits (of 8) from port A of cell b17.$flatten\P1.$verific$equal_714$b17.vhd:530$1086 ($eq).
Removed top 5 bits (of 8) from port A of cell b17.$flatten\P1.$verific$equal_713$b17.vhd:525$1085 ($eq).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P1.$verific$equal_702$b17.vhd:348$1074 ($eq).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P1.$verific$add_689$b17.vhd:552$1071 ($add).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P1.$verific$add_681$b17.vhd:546$1069 ($add).
Removed top 1 bits (of 64) from mux cell b17.$flatten\P1.$verific$mux_950$b17.vhd:479$1060 ($mux).
Removed top 1 bits (of 3) from port A of cell b17.$flatten\P1.$verific$equal_528$b17.vhd:462$1040 ($eq).
Removed top 1 bits (of 16) from port Y of cell b17.$flatten\P1.$verific$add_522$b17.vhd:457$1035 ($add).
Removed top 1 bits (of 16) from port A of cell b17.$flatten\P1.$verific$add_522$b17.vhd:457$1035 ($add).
Removed top 1 bits (of 10) from mux cell b17.$flatten\P1.$verific$mux_958$b17.vhd:444$1030 ($mux).
Removed top 1 bits (of 15) from mux cell b17.$flatten\P1.$verific$mux_957$b17.vhd:448$1019 ($mux).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P1.$verific$add_477$b17.vhd:430$1002 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P1.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P1.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P1.$verific$LessThan_463$b17.vhd:413$996 ($lt).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P1.$verific$LessThan_462$b17.vhd:412$995 ($le).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P1.$verific$mux_440$b17.vhd:399$992 ($mux).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P1.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 2 bits (of 5) from port B of cell b17.$flatten\P1.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P1.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 1 bits (of 4) from port A of cell b17.$flatten\P1.$verific$add_427$b17.vhd:391$984 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P1.$verific$add_427$b17.vhd:391$984 ($add).
Removed top 7 bits (of 8) from port B of cell b17.$flatten\P1.$verific$add_426$b17.vhd:391$983 ($add).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P1.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 3 bits (of 5) from port B of cell b17.$flatten\P1.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P1.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 1 bits (of 3) from port A of cell b17.$flatten\P1.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 2 bits (of 3) from port B of cell b17.$flatten\P1.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 1 bits (of 3) from port Y of cell b17.$flatten\P1.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 24 bits (of 32) from port B of cell b17.$flatten\P1.$verific$add_403$b17.vhd:371$972 ($add).
Removed top 29 bits (of 32) from port B of cell b17.$flatten\P1.$verific$add_399$b17.vhd:371$971 ($add).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P1.$verific$LessThan_397$b17.vhd:370$970 ($le).
Removed top 24 bits (of 32) from port B of cell b17.$flatten\P1.$verific$add_387$b17.vhd:360$963 ($add).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P1.$verific$add_383$b17.vhd:360$962 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P1.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P1.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 33) from port B of cell b17.$flatten\P1.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 9) from port A of cell b17.$flatten\P1.$verific$sub_378$b17.vhd:357$959 ($sub).
Removed top 1 bits (of 9) from port B of cell b17.$flatten\P1.$verific$sub_378$b17.vhd:357$959 ($sub).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P1.$verific$LessThan_373$b17.vhd:356$958 ($lt).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P1.$verific$LessThan_370$b17.vhd:355$956 ($le).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P1.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 2 bits (of 6) from port B of cell b17.$flatten\P1.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 1 bits (of 6) from port Y of cell b17.$flatten\P1.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P1.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 4 bits (of 5) from port B of cell b17.$flatten\P1.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 1 bits (of 6) from port Y of cell b17.$flatten\P1.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P1.$verific$add_360$b17.vhd:344$951 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P1.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P1.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P1.$verific$LessThan_286$b17.vhd:319$925 ($lt).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P1.$verific$add_284$b17.vhd:318$923 ($add).
Removed top 29 bits (of 30) from port B of cell b17.$flatten\P1.$verific$add_281$b17.vhd:315$921 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P1.$verific$add_278$b17.vhd:314$920 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P1.$verific$Decoder_261$b17.vhd:313$903 ($shl).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P1.$verific$add_254$b17.vhd:312$895 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P1.$verific$Decoder_237$b17.vhd:311$878 ($shl).
Removed top 8 bits (of 16) from port Y of cell b17.$flatten\P1.$verific$add_235$b17.vhd:311$873 ($add).
Removed top 8 bits (of 16) from port A of cell b17.$flatten\P1.$verific$add_235$b17.vhd:311$873 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P1.$verific$add_230$b17.vhd:309$869 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P1.$verific$Decoder_213$b17.vhd:308$852 ($shl).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P1.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 4 bits (of 5) from port B of cell b17.$flatten\P1.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P1.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P1.$verific$Decoder_193$b17.vhd:305$832 ($shl).
Removed top 1 bits (of 3) from mux cell b17.$flatten\P1.$verific$mux_127$b17.vhd:215$797 ($mux).
Removed top 1 bits (of 31) from port Y of cell b17.$flatten\P1.$verific$add_113$b17.vhd:197$791 ($add).
Removed top 1 bits (of 31) from port A of cell b17.$flatten\P1.$verific$add_113$b17.vhd:197$791 ($add).
Removed top 30 bits (of 32) from mux cell b17.$flatten\P1.$verific$mux_98$b17.vhd:181$787 ($mux).
Removed top 1 bits (of 2) from port A of cell b17.$flatten\P1.$verific$equal_909$b17.vhd:634$1254 ($eq).
Removed top 1 bits (of 33) from FF cell b17.$flatten\P2.$verific$rEIP_reg$b17.vhd:612$1240 ($adff).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P2.$verific$mux_812$b17.vhd:605$1175 ($mux).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P2.$verific$LessThan_771$b17.vhd:597$1139 ($le).
Removed top 1 bits (of 5) from port B of cell b17.$flatten\P2.$verific$LessThan_771$b17.vhd:597$1139 ($le).
Removed top 1 bits (of 6) from port A of cell b17.$flatten\P2.$verific$LessThan_768$b17.vhd:589$1137 ($lt).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P2.$verific$sub_767$b17.vhd:589$1136 ($sub).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P2.$verific$sub_767$b17.vhd:589$1136 ($sub).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P2.$verific$mux_766$b17.vhd:588$1135 ($mux).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P2.$verific$mux_765$b17.vhd:588$1134 ($mux).
Removed top 1 bits (of 4) from mux cell b17.$flatten\P2.$verific$mux_764$b17.vhd:587$1133 ($mux).
Removed top 1 bits (of 2) from port A of cell b17.$flatten\P2.$verific$add_760$b17.vhd:586$1131 ($add).
Removed top 30 bits (of 32) from mux cell b17.$flatten\P2.$verific$mux_759$b17.vhd:585$1129 ($mux).
Removed top 31 bits (of 33) from port Y of cell b17.$flatten\P2.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
Removed top 31 bits (of 33) from port A of cell b17.$flatten\P2.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P2.$verific$LessThan_755$b17.vhd:579$1124 ($lt).
Removed top 1 bits (of 6) from port A of cell b17.$flatten\P2.$verific$LessThan_745$b17.vhd:563$1116 ($lt).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P2.$verific$sub_744$b17.vhd:563$1115 ($sub).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P2.$verific$sub_744$b17.vhd:563$1115 ($sub).
Removed top 1 bits (of 5) from port B of cell b17.$flatten\P2.$verific$LessThan_742$b17.vhd:563$1113 ($lt).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P2.$verific$equal_718$b17.vhd:551$1090 ($eq).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P2.$verific$equal_717$b17.vhd:545$1089 ($eq).
Removed top 5 bits (of 8) from port A of cell b17.$flatten\P2.$verific$equal_714$b17.vhd:530$1086 ($eq).
Removed top 5 bits (of 8) from port A of cell b17.$flatten\P2.$verific$equal_713$b17.vhd:525$1085 ($eq).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P2.$verific$equal_702$b17.vhd:348$1074 ($eq).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P2.$verific$add_689$b17.vhd:552$1071 ($add).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P2.$verific$add_681$b17.vhd:546$1069 ($add).
Removed top 1 bits (of 64) from mux cell b17.$flatten\P2.$verific$mux_950$b17.vhd:479$1060 ($mux).
Removed top 1 bits (of 3) from port A of cell b17.$flatten\P2.$verific$equal_528$b17.vhd:462$1040 ($eq).
Removed top 1 bits (of 16) from port Y of cell b17.$flatten\P2.$verific$add_522$b17.vhd:457$1035 ($add).
Removed top 1 bits (of 16) from port A of cell b17.$flatten\P2.$verific$add_522$b17.vhd:457$1035 ($add).
Removed top 1 bits (of 10) from mux cell b17.$flatten\P2.$verific$mux_958$b17.vhd:444$1030 ($mux).
Removed top 1 bits (of 15) from mux cell b17.$flatten\P2.$verific$mux_957$b17.vhd:448$1019 ($mux).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P2.$verific$add_477$b17.vhd:430$1002 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P2.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P2.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P2.$verific$LessThan_463$b17.vhd:413$996 ($lt).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P2.$verific$LessThan_462$b17.vhd:412$995 ($le).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P2.$verific$mux_440$b17.vhd:399$992 ($mux).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P2.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 2 bits (of 5) from port B of cell b17.$flatten\P2.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P2.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 1 bits (of 4) from port A of cell b17.$flatten\P2.$verific$add_427$b17.vhd:391$984 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P2.$verific$add_427$b17.vhd:391$984 ($add).
Removed top 7 bits (of 8) from port B of cell b17.$flatten\P2.$verific$add_426$b17.vhd:391$983 ($add).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P2.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 3 bits (of 5) from port B of cell b17.$flatten\P2.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P2.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 1 bits (of 3) from port A of cell b17.$flatten\P2.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 2 bits (of 3) from port B of cell b17.$flatten\P2.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 1 bits (of 3) from port Y of cell b17.$flatten\P2.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 24 bits (of 32) from port B of cell b17.$flatten\P2.$verific$add_403$b17.vhd:371$972 ($add).
Removed top 29 bits (of 32) from port B of cell b17.$flatten\P2.$verific$add_399$b17.vhd:371$971 ($add).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P2.$verific$LessThan_397$b17.vhd:370$970 ($le).
Removed top 24 bits (of 32) from port B of cell b17.$flatten\P2.$verific$add_387$b17.vhd:360$963 ($add).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P2.$verific$add_383$b17.vhd:360$962 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P2.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P2.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 33) from port B of cell b17.$flatten\P2.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 9) from port A of cell b17.$flatten\P2.$verific$sub_378$b17.vhd:357$959 ($sub).
Removed top 1 bits (of 9) from port B of cell b17.$flatten\P2.$verific$sub_378$b17.vhd:357$959 ($sub).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P2.$verific$LessThan_373$b17.vhd:356$958 ($lt).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P2.$verific$LessThan_370$b17.vhd:355$956 ($le).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P2.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 2 bits (of 6) from port B of cell b17.$flatten\P2.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 1 bits (of 6) from port Y of cell b17.$flatten\P2.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P2.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 4 bits (of 5) from port B of cell b17.$flatten\P2.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 1 bits (of 6) from port Y of cell b17.$flatten\P2.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P2.$verific$add_360$b17.vhd:344$951 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P2.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P2.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P2.$verific$LessThan_286$b17.vhd:319$925 ($lt).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P2.$verific$add_284$b17.vhd:318$923 ($add).
Removed top 29 bits (of 30) from port B of cell b17.$flatten\P2.$verific$add_281$b17.vhd:315$921 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P2.$verific$add_278$b17.vhd:314$920 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P2.$verific$Decoder_261$b17.vhd:313$903 ($shl).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P2.$verific$add_259$b17.vhd:313$899 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P2.$verific$add_254$b17.vhd:312$895 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P2.$verific$Decoder_237$b17.vhd:311$878 ($shl).
Removed top 1 bits (of 16) from port A of cell b17.$flatten\P2.$verific$add_235$b17.vhd:311$873 ($add).
Removed top 8 bits (of 16) from port Y of cell b17.$flatten\P2.$verific$add_235$b17.vhd:311$873 ($add).
Removed top 7 bits (of 15) from port A of cell b17.$flatten\P2.$verific$add_235$b17.vhd:311$873 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P2.$verific$add_230$b17.vhd:309$869 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P2.$verific$Decoder_213$b17.vhd:308$852 ($shl).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P2.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 4 bits (of 5) from port B of cell b17.$flatten\P2.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P2.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P2.$verific$Decoder_193$b17.vhd:305$832 ($shl).
Removed top 1 bits (of 3) from mux cell b17.$flatten\P2.$verific$mux_127$b17.vhd:215$797 ($mux).
Removed top 1 bits (of 31) from port Y of cell b17.$flatten\P2.$verific$add_113$b17.vhd:197$791 ($add).
Removed top 1 bits (of 31) from port A of cell b17.$flatten\P2.$verific$add_113$b17.vhd:197$791 ($add).
Removed top 1 bits (of 2) from port A of cell b17.$flatten\P2.$verific$equal_909$b17.vhd:634$1254 ($eq).
Removed top 1 bits (of 33) from FF cell b17.$flatten\P3.$verific$rEIP_reg$b17.vhd:612$1240 ($adff).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P3.$verific$mux_812$b17.vhd:605$1175 ($mux).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P3.$verific$LessThan_771$b17.vhd:597$1139 ($le).
Removed top 1 bits (of 5) from port B of cell b17.$flatten\P3.$verific$LessThan_771$b17.vhd:597$1139 ($le).
Removed top 1 bits (of 6) from port A of cell b17.$flatten\P3.$verific$LessThan_768$b17.vhd:589$1137 ($lt).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P3.$verific$sub_767$b17.vhd:589$1136 ($sub).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P3.$verific$sub_767$b17.vhd:589$1136 ($sub).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P3.$verific$mux_766$b17.vhd:588$1135 ($mux).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P3.$verific$mux_765$b17.vhd:588$1134 ($mux).
Removed top 1 bits (of 4) from mux cell b17.$flatten\P3.$verific$mux_764$b17.vhd:587$1133 ($mux).
Removed top 1 bits (of 2) from port A of cell b17.$flatten\P3.$verific$add_760$b17.vhd:586$1131 ($add).
Removed top 30 bits (of 32) from mux cell b17.$flatten\P3.$verific$mux_759$b17.vhd:585$1129 ($mux).
Removed top 31 bits (of 33) from port Y of cell b17.$flatten\P3.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
Removed top 31 bits (of 33) from port A of cell b17.$flatten\P3.$verific$unary_minus_756$b17.vhd:580$1125 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P3.$verific$LessThan_755$b17.vhd:579$1124 ($lt).
Removed top 1 bits (of 6) from port A of cell b17.$flatten\P3.$verific$LessThan_745$b17.vhd:563$1116 ($lt).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P3.$verific$sub_744$b17.vhd:563$1115 ($sub).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P3.$verific$sub_744$b17.vhd:563$1115 ($sub).
Removed top 1 bits (of 5) from port B of cell b17.$flatten\P3.$verific$LessThan_742$b17.vhd:563$1113 ($lt).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P3.$verific$equal_718$b17.vhd:551$1090 ($eq).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P3.$verific$equal_717$b17.vhd:545$1089 ($eq).
Removed top 5 bits (of 8) from port A of cell b17.$flatten\P3.$verific$equal_714$b17.vhd:530$1086 ($eq).
Removed top 5 bits (of 8) from port A of cell b17.$flatten\P3.$verific$equal_713$b17.vhd:525$1085 ($eq).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P3.$verific$equal_702$b17.vhd:348$1074 ($eq).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P3.$verific$add_689$b17.vhd:552$1071 ($add).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P3.$verific$add_681$b17.vhd:546$1069 ($add).
Removed top 1 bits (of 64) from mux cell b17.$flatten\P3.$verific$mux_950$b17.vhd:479$1060 ($mux).
Removed top 1 bits (of 3) from port A of cell b17.$flatten\P3.$verific$equal_528$b17.vhd:462$1040 ($eq).
Removed top 1 bits (of 16) from port Y of cell b17.$flatten\P3.$verific$add_522$b17.vhd:457$1035 ($add).
Removed top 1 bits (of 16) from port A of cell b17.$flatten\P3.$verific$add_522$b17.vhd:457$1035 ($add).
Removed top 1 bits (of 10) from mux cell b17.$flatten\P3.$verific$mux_958$b17.vhd:444$1030 ($mux).
Removed top 1 bits (of 15) from mux cell b17.$flatten\P3.$verific$mux_957$b17.vhd:448$1019 ($mux).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P3.$verific$add_477$b17.vhd:430$1002 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P3.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P3.$verific$unary_minus_464$b17.vhd:414$997 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P3.$verific$LessThan_463$b17.vhd:413$996 ($lt).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P3.$verific$LessThan_462$b17.vhd:412$995 ($le).
Removed top 1 bits (of 5) from mux cell b17.$flatten\P3.$verific$mux_440$b17.vhd:399$992 ($mux).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P3.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 2 bits (of 5) from port B of cell b17.$flatten\P3.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P3.$verific$add_435$b17.vhd:395$987 ($add).
Removed top 1 bits (of 4) from port A of cell b17.$flatten\P3.$verific$add_427$b17.vhd:391$984 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P3.$verific$add_427$b17.vhd:391$984 ($add).
Removed top 7 bits (of 8) from port B of cell b17.$flatten\P3.$verific$add_426$b17.vhd:391$983 ($add).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P3.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 3 bits (of 5) from port B of cell b17.$flatten\P3.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P3.$verific$add_424$b17.vhd:391$980 ($add).
Removed top 1 bits (of 3) from port A of cell b17.$flatten\P3.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 2 bits (of 3) from port B of cell b17.$flatten\P3.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 1 bits (of 3) from port Y of cell b17.$flatten\P3.$verific$add_422$b17.vhd:391$977 ($add).
Removed top 24 bits (of 32) from port B of cell b17.$flatten\P3.$verific$add_403$b17.vhd:371$972 ($add).
Removed top 29 bits (of 32) from port B of cell b17.$flatten\P3.$verific$add_399$b17.vhd:371$971 ($add).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P3.$verific$LessThan_397$b17.vhd:370$970 ($le).
Removed top 24 bits (of 32) from port B of cell b17.$flatten\P3.$verific$add_387$b17.vhd:360$963 ($add).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P3.$verific$add_383$b17.vhd:360$962 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P3.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P3.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 33) from port B of cell b17.$flatten\P3.$verific$sub_379$b17.vhd:357$960 ($sub).
Removed top 1 bits (of 9) from port A of cell b17.$flatten\P3.$verific$sub_378$b17.vhd:357$959 ($sub).
Removed top 1 bits (of 9) from port B of cell b17.$flatten\P3.$verific$sub_378$b17.vhd:357$959 ($sub).
Removed top 1 bits (of 8) from port A of cell b17.$flatten\P3.$verific$LessThan_373$b17.vhd:356$958 ($lt).
Removed top 1 bits (of 6) from port B of cell b17.$flatten\P3.$verific$LessThan_370$b17.vhd:355$956 ($le).
Removed top 2 bits (of 6) from port A of cell b17.$flatten\P3.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 2 bits (of 6) from port B of cell b17.$flatten\P3.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 1 bits (of 6) from port Y of cell b17.$flatten\P3.$verific$sub_369$b17.vhd:355$955 ($sub).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P3.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 4 bits (of 5) from port B of cell b17.$flatten\P3.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 1 bits (of 6) from port Y of cell b17.$flatten\P3.$verific$add_362$b17.vhd:345$953 ($add).
Removed top 31 bits (of 32) from port B of cell b17.$flatten\P3.$verific$add_360$b17.vhd:344$951 ($add).
Removed top 1 bits (of 33) from port Y of cell b17.$flatten\P3.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
Removed top 1 bits (of 33) from port A of cell b17.$flatten\P3.$verific$unary_minus_287$b17.vhd:320$926 ($neg).
Removed top 1 bits (of 32) from port A of cell b17.$flatten\P3.$verific$LessThan_286$b17.vhd:319$925 ($lt).
Removed top 30 bits (of 31) from port B of cell b17.$flatten\P3.$verific$add_284$b17.vhd:318$923 ($add).
Removed top 29 bits (of 30) from port B of cell b17.$flatten\P3.$verific$add_281$b17.vhd:315$921 ($add).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P3.$verific$add_278$b17.vhd:314$920 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P3.$verific$Decoder_261$b17.vhd:313$903 ($shl).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P3.$verific$add_254$b17.vhd:312$895 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P3.$verific$Decoder_237$b17.vhd:311$878 ($shl).
Removed top 3 bits (of 4) from port B of cell b17.$flatten\P3.$verific$add_230$b17.vhd:309$869 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P3.$verific$Decoder_213$b17.vhd:308$852 ($shl).
Removed top 1 bits (of 5) from port A of cell b17.$flatten\P3.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 4 bits (of 5) from port B of cell b17.$flatten\P3.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 1 bits (of 5) from port Y of cell b17.$flatten\P3.$verific$add_210$b17.vhd:306$849 ($add).
Removed top 15 bits (of 16) from port A of cell b17.$flatten\P3.$verific$Decoder_193$b17.vhd:305$832 ($shl).
Removed top 1 bits (of 3) from mux cell b17.$flatten\P3.$verific$mux_127$b17.vhd:215$797 ($mux).
Removed top 1 bits (of 31) from port Y of cell b17.$flatten\P3.$verific$add_113$b17.vhd:197$791 ($add).
Removed top 1 bits (of 31) from port A of cell b17.$flatten\P3.$verific$add_113$b17.vhd:197$791 ($add).
Removed top 1 bits (of 2) from port A of cell b17.$flatten\P3.$verific$equal_909$b17.vhd:634$1254 ($eq).
Removed top 1 bits (of 32) from mux cell b17.$verific$mux_32$b17.vhd:737$96 ($mux).
Removed top 30 bits (of 32) from wire b17.$flatten\P1.$verific$n1001$360.
Removed top 1 bits (of 31) from wire b17.$flatten\P1.$verific$n1151$365.
Removed top 1 bits (of 3) from wire b17.$flatten\P1.$verific$n1294$370.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n2071$403.
Removed top 8 bits (of 16) from wire b17.$flatten\P1.$verific$n2267$424.
Removed top 1 bits (of 33) from wire b17.$flatten\P1.$verific$n2793$470.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n3660$497.
Removed top 1 bits (of 33) from wire b17.$flatten\P1.$verific$n3837$504.
Removed top 1 bits (of 3) from wire b17.$flatten\P1.$verific$n4619$525.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n4633$527.
Removed top 1 bits (of 4) from wire b17.$flatten\P1.$verific$n4659$530.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n4791$534.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n4869$538.
Removed top 1 bits (of 33) from wire b17.$flatten\P1.$verific$n5140$541.
Removed top 11 bits (of 32) from wire b17.$flatten\P1.$verific$n5240$544.
Removed top 11 bits (of 31) from wire b17.$flatten\P1.$verific$n5314$547.
Removed top 3 bits (of 32) from wire b17.$flatten\P1.$verific$n5415$551.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n5695$560.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n5839$566.
Removed top 1 bits (of 16) from wire b17.$flatten\P1.$verific$n5974$571.
Removed top 1 bits (of 32) from wire b17.$flatten\P1.$verific$n6324$578.
Removed top 31 bits (of 33) from wire b17.$flatten\P1.$verific$n8312$636.
Removed top 30 bits (of 32) from wire b17.$flatten\P1.$verific$n8412$639.
Removed top 1 bits (of 4) from wire b17.$flatten\P1.$verific$n8452$641.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n8457$642.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n8463$643.
Removed top 3 bits (of 4) from wire b17.$flatten\P1.$verific$n8477$645.
Removed top 1 bits (of 5) from wire b17.$flatten\P1.$verific$n8841$682.
Removed top 3 bits (of 4) from wire b17.$flatten\P1.$verific$n8847$683.
Removed top 1 bits (of 31) from wire b17.$flatten\P2.$verific$n1151$365.
Removed top 1 bits (of 3) from wire b17.$flatten\P2.$verific$n1294$370.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n2071$403.
Removed top 8 bits (of 16) from wire b17.$flatten\P2.$verific$n2267$424.
Removed top 1 bits (of 33) from wire b17.$flatten\P2.$verific$n2793$470.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n3660$497.
Removed top 1 bits (of 33) from wire b17.$flatten\P2.$verific$n3837$504.
Removed top 1 bits (of 3) from wire b17.$flatten\P2.$verific$n4619$525.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n4633$527.
Removed top 1 bits (of 4) from wire b17.$flatten\P2.$verific$n4659$530.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n4791$534.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n4869$538.
Removed top 1 bits (of 33) from wire b17.$flatten\P2.$verific$n5140$541.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n5695$560.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n5839$566.
Removed top 1 bits (of 16) from wire b17.$flatten\P2.$verific$n5974$571.
Removed top 1 bits (of 32) from wire b17.$flatten\P2.$verific$n6324$578.
Removed top 31 bits (of 33) from wire b17.$flatten\P2.$verific$n8312$636.
Removed top 30 bits (of 32) from wire b17.$flatten\P2.$verific$n8412$639.
Removed top 1 bits (of 4) from wire b17.$flatten\P2.$verific$n8452$641.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n8457$642.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n8463$643.
Removed top 3 bits (of 4) from wire b17.$flatten\P2.$verific$n8477$645.
Removed top 1 bits (of 5) from wire b17.$flatten\P2.$verific$n8841$682.
Removed top 3 bits (of 4) from wire b17.$flatten\P2.$verific$n8847$683.
Removed top 1 bits (of 31) from wire b17.$flatten\P3.$verific$n1151$365.
Removed top 1 bits (of 3) from wire b17.$flatten\P3.$verific$n1294$370.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n2071$403.
Removed top 1 bits (of 33) from wire b17.$flatten\P3.$verific$n2793$470.
Removed top 11 bits (of 32) from wire b17.$flatten\P3.$verific$n2893$473.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n2926$474.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n2935$475.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n2944$476.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n2953$477.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n2962$478.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n2971$479.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n2980$480.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n2989$481.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n2998$482.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n3007$483.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n3016$484.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n3025$485.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n3034$486.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n3043$487.
Removed top 3 bits (of 8) from wire b17.$flatten\P3.$verific$n3052$488.
Removed top 1 bits (of 8) from wire b17.$flatten\P3.$verific$n3061$489.
Removed top 1 bits (of 4) from wire b17.$flatten\P3.$verific$n3070$490.
Removed top 1 bits (of 32) from wire b17.$flatten\P3.$verific$n3075$491.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n3660$497.
Removed top 1 bits (of 33) from wire b17.$flatten\P3.$verific$n3837$504.
Removed top 7 bits (of 31) from wire b17.$flatten\P3.$verific$n3939$507.
Removed top 1 bits (of 3) from wire b17.$flatten\P3.$verific$n4619$525.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n4633$527.
Removed top 1 bits (of 4) from wire b17.$flatten\P3.$verific$n4659$530.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n4791$534.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n4869$538.
Removed top 1 bits (of 33) from wire b17.$flatten\P3.$verific$n5140$541.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n5695$560.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n5839$566.
Removed top 1 bits (of 16) from wire b17.$flatten\P3.$verific$n5974$571.
Removed top 1 bits (of 32) from wire b17.$flatten\P3.$verific$n6324$578.
Removed top 31 bits (of 33) from wire b17.$flatten\P3.$verific$n8312$636.
Removed top 1 bits (of 5) from wire b17.$flatten\P3.$verific$n8841$682.
Removed top 3 bits (of 4) from wire b17.$flatten\P3.$verific$n8847$683.
Removed top 1 bits (of 32) from wire b17.$verific$n129$62.
Removed top 1 bits (of 32) from wire b17.$verific$n162$63.
Removed top 1 bits (of 32) from wire b17.buf1.
Removed top 1 bits (of 32) from wire b17.buf2.
Removed top 1 bits (of 32) from wire b17.di2.
Removed top 1 bits (of 32) from wire b17.do1.
Removed top 1 bits (of 32) from wire b17.do2.
Removed top 1 bits (of 32) from wire b17.do3.

yosys> peepopt

3.13. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.14. Executing PMUXTREE pass.

yosys> opt_clean

3.15. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 102 unused cells and 295 unused wires.
<suppressed ~103 debug messages>

yosys> techmap

3.16. Executing TECHMAP pass (map to technology primitives).

3.16.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.16.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $reduce_or.
Running "alumacc" on wrapper $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=30:B_SIGNED=0:B_WIDTH=30:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=30:B_SIGNED=0:B_WIDTH=30:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=30:B_SIGNED=0:B_WIDTH=30:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $adff.
Running "alumacc" on wrapper $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=31:B_SIGNED=0:B_WIDTH=31:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=31:B_SIGNED=0:B_WIDTH=31:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=31:B_SIGNED=0:B_WIDTH=31:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $bmux.
Running "alumacc" on wrapper $extern:wrap:$le:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$le:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$le:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=5:B_SIGNED=0:B_WIDTH=6:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=5:B_SIGNED=0:B_WIDTH=6:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=5:B_SIGNED=0:B_WIDTH=6:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=5:Y_WIDTH=6:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=5:Y_WIDTH=6:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=5:Y_WIDTH=6:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=1:B_SIGNED=0:B_WIDTH=2:Y_WIDTH=3:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=1:B_SIGNED=0:B_WIDTH=2:Y_WIDTH=3:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=1:B_SIGNED=0:B_WIDTH=2:Y_WIDTH=3:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$neg:A_SIGNED=0:A_WIDTH=2:Y_WIDTH=2:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$neg:A_SIGNED=0:A_WIDTH=2:Y_WIDTH=2:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$neg:A_SIGNED=0:A_WIDTH=2:Y_WIDTH=2:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=31:B_SIGNED=0:B_WIDTH=32:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=31:B_SIGNED=0:B_WIDTH=32:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=31:B_SIGNED=0:B_WIDTH=32:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=5:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=5:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=5:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using extmapper simplemap for cells of type $eq.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=32:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=32:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=32:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=15:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=15:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=15:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=15:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=15:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=15:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=31:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=31:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=31:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=31:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=31:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=31:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$neg:A_SIGNED=0:A_WIDTH=32:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$neg:A_SIGNED=0:A_WIDTH=32:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$neg:A_SIGNED=0:A_WIDTH=32:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$le:A_SIGNED=0:A_WIDTH=6:B_SIGNED=0:B_WIDTH=5:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$le:A_SIGNED=0:A_WIDTH=6:B_SIGNED=0:B_WIDTH=5:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$le:A_SIGNED=0:A_WIDTH=6:B_SIGNED=0:B_WIDTH=5:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=3:Y_WIDTH=4:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=3:Y_WIDTH=4:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=3:Y_WIDTH=4:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=3:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=4:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=3:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=4:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=3:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=4:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=2:Y_WIDTH=4:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=2:Y_WIDTH=4:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=2:Y_WIDTH=4:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=2:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=2:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=2:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=2:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=2:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=2:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=32:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=32:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=32:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=32:B_SIGNED=0:B_WIDTH=3:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=32:B_SIGNED=0:B_WIDTH=3:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=32:B_SIGNED=0:B_WIDTH=3:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=32:B_SIGNED=0:B_WIDTH=32:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=32:B_SIGNED=0:B_WIDTH=32:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=32:B_SIGNED=0:B_WIDTH=32:Y_WIDTH=32:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=7:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=7:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=7:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=5:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=5:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=5:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=5:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=5:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=5:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=30:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=30:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=30:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=30:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=30:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=30:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=4:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=4:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=4:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=4:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $paramod$constmap:0c58e37f7f9ab9c08bb604a660a738f4cdfdf6a8$paramod$0c53878c2ab6a84f047b5c15f705bf752551700e\_90_shift_ops_shr_shl_sshl_sshr for cells of type $shl.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47.
Using extmapper simplemap for cells of type $reduce_bool.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=7:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=7:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=7:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $paramod$ebf89ea36a793f0f77858f212141d47c833068ad\_90_alu for cells of type $alu.
Using template $paramod$403d07c18de10cda2ac652a859c56aea81aaf9b5\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_and.
Using template $paramod$740b056ede97228d3eae64ea2fdc81f0a33e0fe7\_90_alu for cells of type $alu.
Using template $paramod$653d0dc5a667330298513325d0bd1def0e6c1128\_90_alu for cells of type $alu.
Using template $paramod$e04283ca12514baf3d204c6994bec8f178dd89f8\_90_alu for cells of type $alu.
Using template $paramod$b3c20b05d9b1fc2c940ef2f6c917486aead042e8\_90_alu for cells of type $alu.
Using template $paramod$d1615bf4e5e328245ffd1550e5fe105901cda77b\_90_alu for cells of type $alu.
Using template $paramod$e891e6b399cf52748460a311fafe476815d24bd7\_90_alu for cells of type $alu.
Using template $paramod$83dd457849c736323edf2edb15923eb27f99c683\_90_alu for cells of type $alu.
Using template $paramod$6a42b6fefed750f8a1c58eab59479d960557103c\_90_alu for cells of type $alu.
Using template $paramod$3b7577489eb4433b1d5620cab7f3794743dee5ea\_90_alu for cells of type $alu.
Using template $paramod$788c3d57e5abb3a3f89aea6d4acd665be37f4e9b\_90_alu for cells of type $alu.
Using template $paramod$c6baa65225090ac0a120feab1b920965244aa496\_90_alu for cells of type $alu.
Using template $paramod$b85fbb3374a1d9ba7ee4f4d6323c30f939df3ada\_90_alu for cells of type $alu.
Using template $paramod$1a3a0c35c4a4896fbfd612699525c057298e72d2\_90_alu for cells of type $alu.
Using template $paramod$bfceb922395790c0ce92e9f9b5b428d4fc72cc30\_90_alu for cells of type $alu.
Using template $paramod$a2af9b43308e3114c3b5dd3f4dc3329b2387395d\_90_alu for cells of type $alu.
Using template $paramod$f85408ed1aa3d09e465edae8a7bf590332ae9f7b\_90_alu for cells of type $alu.
Using template $paramod$175e67c02b86e96b1288b9dc100122520d7240d8\_90_alu for cells of type $alu.
Using template $paramod$076c9a7a3f037230073fe14dd4865d470cb48917\_90_alu for cells of type $alu.
Using template $paramod$91f82ead1edc61e0a1452110f15ef747116b421b\_90_alu for cells of type $alu.
Using template $paramod$4ccbe221165818e15f326ddee3d1183c7924e12f\_90_alu for cells of type $alu.
Using template $paramod$fbc7873bff55778c0b3173955b7e4bce1d9d6834\_90_alu for cells of type $alu.
Using template $paramod$dfca81329cbbac01700318224209a5f2318c7128\_90_alu for cells of type $alu.
Using template $paramod$943564b9366bbc392bf4bbc801aa0a2d7742a4e0\_90_alu for cells of type $alu.
Using template $paramod$44a13d10af618e7fbe7b9aad2f6151ffcee1e2fa\_90_alu for cells of type $alu.
Using template $paramod$32a7b7b86c07519b7537abc18e96f0331f97914d\_90_alu for cells of type $alu.
Using template $paramod$c3cd1564c35d873179656addd6052d7ea8b6d991\_90_alu for cells of type $alu.
Using template $paramod$0a77e3c00010cb33e399decd813a7380c6e25cba\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011111 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000011 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001111 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001000 for cells of type $lcu.
No more expansions possible.
<suppressed ~15663 debug messages>

yosys> alumacc

3.17. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module b17:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.18. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.18.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~24284 debug messages>

yosys> opt_merge -nomux

3.18.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~10311 debug messages>
Removed a total of 3437 cells.

yosys> opt_muxtree

3.18.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.18.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.18.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.18.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 2042 unused cells and 10465 unused wires.
<suppressed ~2043 debug messages>

yosys> opt_expr

3.18.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~438 debug messages>

3.18.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.18.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.18.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.18.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$16128 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19646 [7], Q = \P2.P1.InstQueue[10] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16001 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [27], Q = \P2.P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$15874 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [2], Q = \P2.EAX [2]).
Adding EN signal on $auto$ff.cc:262:slice$15876 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [4], Q = \P2.EAX [4]).
Adding EN signal on $auto$ff.cc:262:slice$15875 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [3], Q = \P2.EAX [3]).
Adding EN signal on $auto$ff.cc:262:slice$16136 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19770 [7], Q = \P2.P1.InstQueue[11] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16135 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19770 [6], Q = \P2.P1.InstQueue[11] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16134 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19770 [5], Q = \P2.P1.InstQueue[11] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16133 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19770 [4], Q = \P2.P1.InstQueue[11] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16132 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19770 [3], Q = \P2.P1.InstQueue[11] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16131 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19770 [2], Q = \P2.P1.InstQueue[11] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16130 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19770 [1], Q = \P2.P1.InstQueue[11] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16129 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19770 [0], Q = \P2.P1.InstQueue[11] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16009 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [3], Q = \P3.Datao [3]).
Adding EN signal on $auto$ff.cc:262:slice$16008 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [2], Q = \P3.Datao [2]).
Adding EN signal on $auto$ff.cc:262:slice$16007 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [1], Q = \P3.Datao [1]).
Adding EN signal on $auto$ff.cc:262:slice$16006 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [0], Q = \P3.Datao [0]).
Adding EN signal on $auto$ff.cc:262:slice$16005 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [31], Q = \P2.P1.InstAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$16004 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [30], Q = \P2.P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$16003 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [29], Q = \P2.P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$16002 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [28], Q = \P2.P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$15882 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [10], Q = \P2.EAX [10]).
Adding EN signal on $auto$ff.cc:262:slice$15881 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [9], Q = \P2.EAX [9]).
Adding EN signal on $auto$ff.cc:262:slice$15880 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [8], Q = \P2.EAX [8]).
Adding EN signal on $auto$ff.cc:262:slice$15879 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [7], Q = \P2.EAX [7]).
Adding EN signal on $auto$ff.cc:262:slice$15878 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [6], Q = \P2.EAX [6]).
Adding EN signal on $auto$ff.cc:262:slice$15877 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [5], Q = \P2.EAX [5]).
Adding EN signal on $auto$ff.cc:262:slice$16127 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19646 [6], Q = \P2.P1.InstQueue[10] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16126 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19646 [5], Q = \P2.P1.InstQueue[10] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16125 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19646 [4], Q = \P2.P1.InstQueue[10] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16124 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19646 [3], Q = \P2.P1.InstQueue[10] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16123 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19646 [2], Q = \P2.P1.InstQueue[10] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16122 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19646 [1], Q = \P2.P1.InstQueue[10] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16121 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19646 [0], Q = \P2.P1.InstQueue[10] [0]).
Adding EN signal on $auto$ff.cc:262:slice$14865 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [12], Q = \P1.Datao [12]).
Adding EN signal on $auto$ff.cc:262:slice$16120 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19522 [7], Q = \P2.P1.InstQueue[9] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16119 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19522 [6], Q = \P2.P1.InstQueue[9] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16118 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19522 [5], Q = \P2.P1.InstQueue[9] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16117 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19522 [4], Q = \P2.P1.InstQueue[9] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16116 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19522 [3], Q = \P2.P1.InstQueue[9] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16115 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19522 [2], Q = \P2.P1.InstQueue[9] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16114 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19522 [1], Q = \P2.P1.InstQueue[9] [1]).
Adding EN signal on $auto$ff.cc:262:slice$14864 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [11], Q = \P1.Datao [11]).
Adding EN signal on $auto$ff.cc:262:slice$16113 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19522 [0], Q = \P2.P1.InstQueue[9] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16112 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19398 [7], Q = \P2.P1.InstQueue[8] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16111 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19398 [6], Q = \P2.P1.InstQueue[8] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16110 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19398 [5], Q = \P2.P1.InstQueue[8] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16109 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19398 [4], Q = \P2.P1.InstQueue[8] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16108 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19398 [3], Q = \P2.P1.InstQueue[8] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16107 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19398 [2], Q = \P2.P1.InstQueue[8] [2]).
Adding EN signal on $auto$ff.cc:262:slice$14863 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [10], Q = \P1.Datao [10]).
Adding EN signal on $auto$ff.cc:262:slice$16106 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19398 [1], Q = \P2.P1.InstQueue[8] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16105 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19398 [0], Q = \P2.P1.InstQueue[8] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16104 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19274 [7], Q = \P2.P1.InstQueue[7] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16103 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19274 [6], Q = \P2.P1.InstQueue[7] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16102 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19274 [5], Q = \P2.P1.InstQueue[7] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16101 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19274 [4], Q = \P2.P1.InstQueue[7] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16100 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19274 [3], Q = \P2.P1.InstQueue[7] [3]).
Adding EN signal on $auto$ff.cc:262:slice$14862 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [9], Q = \P1.Datao [9]).
Adding EN signal on $auto$ff.cc:262:slice$16099 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19274 [2], Q = \P2.P1.InstQueue[7] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16098 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19274 [1], Q = \P2.P1.InstQueue[7] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16097 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19274 [0], Q = \P2.P1.InstQueue[7] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16096 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19150 [7], Q = \P2.P1.InstQueue[6] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16095 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19150 [6], Q = \P2.P1.InstQueue[6] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16094 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19150 [5], Q = \P2.P1.InstQueue[6] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16093 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19150 [4], Q = \P2.P1.InstQueue[6] [4]).
Adding EN signal on $auto$ff.cc:262:slice$14861 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [8], Q = \P1.Datao [8]).
Adding EN signal on $auto$ff.cc:262:slice$16092 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19150 [3], Q = \P2.P1.InstQueue[6] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16091 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19150 [2], Q = \P2.P1.InstQueue[6] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16090 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19150 [1], Q = \P2.P1.InstQueue[6] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16089 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19150 [0], Q = \P2.P1.InstQueue[6] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16088 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19026 [7], Q = \P2.P1.InstQueue[5] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16087 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19026 [6], Q = \P2.P1.InstQueue[5] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16086 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19026 [5], Q = \P2.P1.InstQueue[5] [5]).
Adding EN signal on $auto$ff.cc:262:slice$14860 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [7], Q = \P1.Datao [7]).
Adding EN signal on $auto$ff.cc:262:slice$16085 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19026 [4], Q = \P2.P1.InstQueue[5] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16084 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19026 [3], Q = \P2.P1.InstQueue[5] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16083 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19026 [2], Q = \P2.P1.InstQueue[5] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16082 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19026 [1], Q = \P2.P1.InstQueue[5] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16081 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19026 [0], Q = \P2.P1.InstQueue[5] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16080 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18902 [7], Q = \P2.P1.InstQueue[4] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16079 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18902 [6], Q = \P2.P1.InstQueue[4] [6]).
Adding EN signal on $auto$ff.cc:262:slice$14859 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [6], Q = \P1.Datao [6]).
Adding EN signal on $auto$ff.cc:262:slice$16078 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18902 [5], Q = \P2.P1.InstQueue[4] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16077 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18902 [4], Q = \P2.P1.InstQueue[4] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16076 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18902 [3], Q = \P2.P1.InstQueue[4] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16075 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18902 [2], Q = \P2.P1.InstQueue[4] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16074 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18902 [1], Q = \P2.P1.InstQueue[4] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16073 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18902 [0], Q = \P2.P1.InstQueue[4] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16072 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18778 [7], Q = \P2.P1.InstQueue[3] [7]).
Adding EN signal on $auto$ff.cc:262:slice$14858 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [5], Q = \P1.Datao [5]).
Adding EN signal on $auto$ff.cc:262:slice$16071 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18778 [6], Q = \P2.P1.InstQueue[3] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16070 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18778 [5], Q = \P2.P1.InstQueue[3] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16069 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18778 [4], Q = \P2.P1.InstQueue[3] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16068 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18778 [3], Q = \P2.P1.InstQueue[3] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16067 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18778 [2], Q = \P2.P1.InstQueue[3] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16066 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18778 [1], Q = \P2.P1.InstQueue[3] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16065 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18778 [0], Q = \P2.P1.InstQueue[3] [0]).
Adding EN signal on $auto$ff.cc:262:slice$14857 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [4], Q = \P1.Datao [4]).
Adding EN signal on $auto$ff.cc:262:slice$16064 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18654 [7], Q = \P2.P1.InstQueue[2] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16063 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18654 [6], Q = \P2.P1.InstQueue[2] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16062 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18654 [5], Q = \P2.P1.InstQueue[2] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16061 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18654 [4], Q = \P2.P1.InstQueue[2] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16060 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18654 [3], Q = \P2.P1.InstQueue[2] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16059 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18654 [2], Q = \P2.P1.InstQueue[2] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16058 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18654 [1], Q = \P2.P1.InstQueue[2] [1]).
Adding EN signal on $auto$ff.cc:262:slice$14856 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [3], Q = \P1.Datao [3]).
Adding EN signal on $auto$ff.cc:262:slice$16057 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18654 [0], Q = \P2.P1.InstQueue[2] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16056 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18530 [7], Q = \P2.P1.InstQueue[1] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16055 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18530 [6], Q = \P2.P1.InstQueue[1] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16054 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18530 [5], Q = \P2.P1.InstQueue[1] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16053 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18530 [4], Q = \P2.P1.InstQueue[1] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16052 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18530 [3], Q = \P2.P1.InstQueue[1] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16051 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18530 [2], Q = \P2.P1.InstQueue[1] [2]).
Adding EN signal on $auto$ff.cc:262:slice$14855 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [2], Q = \P1.Datao [2]).
Adding EN signal on $auto$ff.cc:262:slice$16050 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18530 [1], Q = \P2.P1.InstQueue[1] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16049 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18530 [0], Q = \P2.P1.InstQueue[1] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16048 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18406 [7], Q = \P2.P1.InstQueue[0] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16047 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18406 [6], Q = \P2.P1.InstQueue[0] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16046 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18406 [5], Q = \P2.P1.InstQueue[0] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16045 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18406 [4], Q = \P2.P1.InstQueue[0] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16044 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18406 [3], Q = \P2.P1.InstQueue[0] [3]).
Adding EN signal on $auto$ff.cc:262:slice$14854 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [1], Q = \P1.Datao [1]).
Adding EN signal on $auto$ff.cc:262:slice$16043 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18406 [2], Q = \P2.P1.InstQueue[0] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16042 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18406 [1], Q = \P2.P1.InstQueue[0] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16041 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18406 [0], Q = \P2.P1.InstQueue[0] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16040 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28791 [3], Q = \P3.P1.InstQueueRd_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$16039 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28791 [2], Q = \P3.P1.InstQueueRd_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$16038 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28791 [1], Q = \P3.P1.InstQueueRd_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$16037 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28791 [0], Q = \P3.P1.InstQueueRd_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$14853 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [0], Q = \P1.Datao [0]).
Adding EN signal on $auto$ff.cc:262:slice$16036 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [30], Q = \P3.Datao [30]).
Adding EN signal on $auto$ff.cc:262:slice$16035 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [29], Q = \P3.Datao [29]).
Adding EN signal on $auto$ff.cc:262:slice$16034 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [28], Q = \P3.Datao [28]).
Adding EN signal on $auto$ff.cc:262:slice$16033 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [27], Q = \P3.Datao [27]).
Adding EN signal on $auto$ff.cc:262:slice$16032 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [26], Q = \P3.Datao [26]).
Adding EN signal on $auto$ff.cc:262:slice$16031 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [25], Q = \P3.Datao [25]).
Adding EN signal on $auto$ff.cc:262:slice$16030 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [24], Q = \P3.Datao [24]).
Adding EN signal on $auto$ff.cc:262:slice$16029 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [23], Q = \P3.Datao [23]).
Adding EN signal on $auto$ff.cc:262:slice$16028 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [22], Q = \P3.Datao [22]).
Adding EN signal on $auto$ff.cc:262:slice$16027 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [21], Q = \P3.Datao [21]).
Adding EN signal on $auto$ff.cc:262:slice$16026 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [20], Q = \P3.Datao [20]).
Adding EN signal on $auto$ff.cc:262:slice$16025 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [19], Q = \P3.Datao [19]).
Adding EN signal on $auto$ff.cc:262:slice$16024 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [18], Q = \P3.Datao [18]).
Adding EN signal on $auto$ff.cc:262:slice$16023 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [17], Q = \P3.Datao [17]).
Adding EN signal on $auto$ff.cc:262:slice$16022 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [16], Q = \P3.Datao [16]).
Adding EN signal on $auto$ff.cc:262:slice$16021 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [15], Q = \P3.Datao [15]).
Adding EN signal on $auto$ff.cc:262:slice$16020 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [14], Q = \P3.Datao [14]).
Adding EN signal on $auto$ff.cc:262:slice$16019 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [13], Q = \P3.Datao [13]).
Adding EN signal on $auto$ff.cc:262:slice$16018 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [12], Q = \P3.Datao [12]).
Adding EN signal on $auto$ff.cc:262:slice$16017 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [11], Q = \P3.Datao [11]).
Adding EN signal on $auto$ff.cc:262:slice$16016 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [10], Q = \P3.Datao [10]).
Adding EN signal on $auto$ff.cc:262:slice$16012 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [6], Q = \P3.Datao [6]).
Adding EN signal on $auto$ff.cc:262:slice$16011 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [5], Q = \P3.Datao [5]).
Adding EN signal on $auto$ff.cc:262:slice$16010 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [4], Q = \P3.Datao [4]).
Adding EN signal on $auto$ff.cc:262:slice$16015 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [9], Q = \P3.Datao [9]).
Adding EN signal on $auto$ff.cc:262:slice$16014 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [8], Q = \P3.Datao [8]).
Adding EN signal on $auto$ff.cc:262:slice$16013 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27223 [7], Q = \P3.Datao [7]).
Adding EN signal on $auto$ff.cc:262:slice$14056 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [29], Q = \P1.Address [29]).
Adding EN signal on $auto$ff.cc:262:slice$16000 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [26], Q = \P2.P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$15999 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [25], Q = \P2.P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$15998 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [24], Q = \P2.P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$15997 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [23], Q = \P2.P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$15996 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [22], Q = \P2.P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$15995 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [21], Q = \P2.P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$15994 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [20], Q = \P2.P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$14054 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [27], Q = \P1.Address [27]).
Adding EN signal on $auto$ff.cc:262:slice$15993 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [19], Q = \P2.P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$15992 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [18], Q = \P2.P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$15991 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [17], Q = \P2.P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$15990 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [16], Q = \P2.P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$15989 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [15], Q = \P2.P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$15988 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [14], Q = \P2.P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$15987 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [13], Q = \P2.P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$14053 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [26], Q = \P1.Address [26]).
Adding EN signal on $auto$ff.cc:262:slice$15986 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [12], Q = \P2.P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$15985 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [11], Q = \P2.P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$15984 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [10], Q = \P2.P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$15983 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [9], Q = \P2.P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$15982 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [8], Q = \P2.P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$15981 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [7], Q = \P2.P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$15980 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [6], Q = \P2.P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$14052 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [25], Q = \P1.Address [25]).
Adding EN signal on $auto$ff.cc:262:slice$15979 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [5], Q = \P2.P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$15978 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [4], Q = \P2.P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$15977 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [3], Q = \P2.P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$15976 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [2], Q = \P2.P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$15975 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [1], Q = \P2.P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$15974 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21365 [0], Q = \P2.P1.InstAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$15973 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [31], Q = \P2.P1.PhyAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$14051 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [24], Q = \P1.Address [24]).
Adding EN signal on $auto$ff.cc:262:slice$15972 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [30], Q = \P2.P1.PhyAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$15971 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [29], Q = \P2.P1.PhyAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$15970 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [28], Q = \P2.P1.PhyAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$15969 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [27], Q = \P2.P1.PhyAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$15968 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [26], Q = \P2.P1.PhyAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$15967 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [25], Q = \P2.P1.PhyAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$15966 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [24], Q = \P2.P1.PhyAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$14050 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [23], Q = \P1.Address [23]).
Adding EN signal on $auto$ff.cc:262:slice$15965 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [23], Q = \P2.P1.PhyAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$15964 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [22], Q = \P2.P1.PhyAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$15963 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [21], Q = \P2.P1.PhyAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$15962 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [20], Q = \P2.P1.PhyAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$15961 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [19], Q = \P2.P1.PhyAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$15960 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [18], Q = \P2.P1.PhyAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$15959 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [17], Q = \P2.P1.PhyAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$14049 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [22], Q = \P1.Address [22]).
Adding EN signal on $auto$ff.cc:262:slice$15958 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [16], Q = \P2.P1.PhyAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$15957 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [15], Q = \P2.P1.PhyAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$15956 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [14], Q = \P2.P1.PhyAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$15955 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [13], Q = \P2.P1.PhyAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$15954 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [12], Q = \P2.P1.PhyAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$15953 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [11], Q = \P2.P1.PhyAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$15952 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [10], Q = \P2.P1.PhyAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$14048 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [21], Q = \P1.Address [21]).
Adding EN signal on $auto$ff.cc:262:slice$15951 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [9], Q = \P2.P1.PhyAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$15950 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [8], Q = \P2.P1.PhyAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$15949 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [7], Q = \P2.P1.PhyAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$15948 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [6], Q = \P2.P1.PhyAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$15947 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [5], Q = \P2.P1.PhyAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$15946 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [4], Q = \P2.P1.PhyAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$15945 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [3], Q = \P2.P1.PhyAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$14047 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [20], Q = \P1.Address [20]).
Adding EN signal on $auto$ff.cc:262:slice$15944 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [2], Q = \P2.P1.PhyAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$15943 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [1], Q = \P2.P1.PhyAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$15942 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21849 [0], Q = \P2.P1.PhyAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$15941 ($_DFF_PP0_) from module b17 (D = $auto$rtlil.cc:2459:Mux$1840, Q = \P2.P1.More).
Adding EN signal on $auto$ff.cc:262:slice$15940 ($_DFF_PP0_) from module b17 (D = $auto$rtlil.cc:2459:Mux$1826, Q = \P2.P1.Flush).
Adding EN signal on $auto$ff.cc:262:slice$15939 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [15], Q = \P2.P1.lWord [15]).
Adding EN signal on $auto$ff.cc:262:slice$15938 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [14], Q = \P2.P1.lWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$14046 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [19], Q = \P1.Address [19]).
Adding EN signal on $auto$ff.cc:262:slice$15937 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [13], Q = \P2.P1.lWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$15936 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [12], Q = \P2.P1.lWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$15935 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [11], Q = \P2.P1.lWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$15934 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [10], Q = \P2.P1.lWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$15933 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [9], Q = \P2.P1.lWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$15932 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [8], Q = \P2.P1.lWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$15931 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [7], Q = \P2.P1.lWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$14045 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [18], Q = \P1.Address [18]).
Adding EN signal on $auto$ff.cc:262:slice$15930 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [6], Q = \P2.P1.lWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$15929 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [5], Q = \P2.P1.lWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$15928 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [4], Q = \P2.P1.lWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$15927 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [3], Q = \P2.P1.lWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$15926 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [2], Q = \P2.P1.lWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$15925 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [1], Q = \P2.P1.lWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$15924 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16899 [0], Q = \P2.P1.lWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$14044 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [17], Q = \P1.Address [17]).
Adding EN signal on $auto$ff.cc:262:slice$15923 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [14], Q = \P2.P1.uWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$15922 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [13], Q = \P2.P1.uWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$15921 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [12], Q = \P2.P1.uWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$15920 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [11], Q = \P2.P1.uWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$15919 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [10], Q = \P2.P1.uWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$15918 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [9], Q = \P2.P1.uWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$15917 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [8], Q = \P2.P1.uWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$14043 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [16], Q = \P1.Address [16]).
Adding EN signal on $auto$ff.cc:262:slice$15916 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [7], Q = \P2.P1.uWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$15915 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [6], Q = \P2.P1.uWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$15914 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [5], Q = \P2.P1.uWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$15913 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [4], Q = \P2.P1.uWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$15912 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [3], Q = \P2.P1.uWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$15911 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [2], Q = \P2.P1.uWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$15910 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [1], Q = \P2.P1.uWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$14042 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [15], Q = \P1.Address [15]).
Adding EN signal on $auto$ff.cc:262:slice$15909 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17129 [0], Q = \P2.P1.uWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$15908 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20292, Q = \P2.CodeFetch).
Adding EN signal on $auto$ff.cc:262:slice$15907 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18285 [3], Q = \P2.P1.InstQueueWr_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$15906 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18285 [2], Q = \P2.P1.InstQueueWr_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$15905 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18285 [1], Q = \P2.P1.InstQueueWr_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$15904 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18285 [0], Q = \P2.P1.InstQueueWr_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$15903 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [31], Q = \P2.EAX [31]).
Adding EN signal on $auto$ff.cc:262:slice$14041 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [14], Q = \P1.Address [14]).
Adding EN signal on $auto$ff.cc:262:slice$15902 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [30], Q = \P2.EAX [30]).
Adding EN signal on $auto$ff.cc:262:slice$15901 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [29], Q = \P2.EAX [29]).
Adding EN signal on $auto$ff.cc:262:slice$15900 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [28], Q = \P2.EAX [28]).
Adding EN signal on $auto$ff.cc:262:slice$15899 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [27], Q = \P2.EAX [27]).
Adding EN signal on $auto$ff.cc:262:slice$15898 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [26], Q = \P2.EAX [26]).
Adding EN signal on $auto$ff.cc:262:slice$15897 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [25], Q = \P2.EAX [25]).
Adding EN signal on $auto$ff.cc:262:slice$15896 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [24], Q = \P2.EAX [24]).
Adding EN signal on $auto$ff.cc:262:slice$14040 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [13], Q = \P1.Address [13]).
Adding EN signal on $auto$ff.cc:262:slice$15895 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [23], Q = \P2.EAX [23]).
Adding EN signal on $auto$ff.cc:262:slice$15894 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [22], Q = \P2.EAX [22]).
Adding EN signal on $auto$ff.cc:262:slice$15893 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [21], Q = \P2.EAX [21]).
Adding EN signal on $auto$ff.cc:262:slice$15892 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [20], Q = \P2.EAX [20]).
Adding EN signal on $auto$ff.cc:262:slice$15891 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [19], Q = \P2.EAX [19]).
Adding EN signal on $auto$ff.cc:262:slice$15890 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [18], Q = \P2.EAX [18]).
Adding EN signal on $auto$ff.cc:262:slice$15889 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [17], Q = \P2.EAX [17]).
Adding EN signal on $auto$ff.cc:262:slice$14039 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [12], Q = \P1.Address [12]).
Adding EN signal on $auto$ff.cc:262:slice$15885 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [13], Q = \P2.EAX [13]).
Adding EN signal on $auto$ff.cc:262:slice$15884 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [12], Q = \P2.EAX [12]).
Adding EN signal on $auto$ff.cc:262:slice$15883 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [11], Q = \P2.EAX [11]).
Adding EN signal on $auto$ff.cc:262:slice$14038 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [11], Q = \P1.Address [11]).
Adding EN signal on $auto$ff.cc:262:slice$15888 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [16], Q = \P2.EAX [16]).
Adding EN signal on $auto$ff.cc:262:slice$15887 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [15], Q = \P2.EAX [15]).
Adding EN signal on $auto$ff.cc:262:slice$15886 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [14], Q = \P2.EAX [14]).
Adding EN signal on $auto$ff.cc:262:slice$14037 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [10], Q = \P1.Address [10]).
Adding EN signal on $auto$ff.cc:262:slice$15873 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [1], Q = \P2.EAX [1]).
Adding EN signal on $auto$ff.cc:262:slice$15872 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18080 [0], Q = \P2.EAX [0]).
Adding EN signal on $auto$ff.cc:262:slice$15871 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [31], Q = \P2.EBX [31]).
Adding EN signal on $auto$ff.cc:262:slice$15870 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [30], Q = \P2.EBX [30]).
Adding EN signal on $auto$ff.cc:262:slice$15869 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [29], Q = \P2.EBX [29]).
Adding EN signal on $auto$ff.cc:262:slice$15868 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [28], Q = \P2.EBX [28]).
Adding EN signal on $auto$ff.cc:262:slice$15867 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [27], Q = \P2.EBX [27]).
Adding EN signal on $auto$ff.cc:262:slice$14035 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [8], Q = \P1.Address [8]).
Adding EN signal on $auto$ff.cc:262:slice$15866 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [26], Q = \P2.EBX [26]).
Adding EN signal on $auto$ff.cc:262:slice$15865 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [25], Q = \P2.EBX [25]).
Adding EN signal on $auto$ff.cc:262:slice$15864 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [24], Q = \P2.EBX [24]).
Adding EN signal on $auto$ff.cc:262:slice$15863 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [23], Q = \P2.EBX [23]).
Adding EN signal on $auto$ff.cc:262:slice$15862 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [22], Q = \P2.EBX [22]).
Adding EN signal on $auto$ff.cc:262:slice$15861 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [21], Q = \P2.EBX [21]).
Adding EN signal on $auto$ff.cc:262:slice$15860 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [20], Q = \P2.EBX [20]).
Adding EN signal on $auto$ff.cc:262:slice$14034 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [7], Q = \P1.Address [7]).
Adding EN signal on $auto$ff.cc:262:slice$15859 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [19], Q = \P2.EBX [19]).
Adding EN signal on $auto$ff.cc:262:slice$15858 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [18], Q = \P2.EBX [18]).
Adding EN signal on $auto$ff.cc:262:slice$15857 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [17], Q = \P2.EBX [17]).
Adding EN signal on $auto$ff.cc:262:slice$15856 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [16], Q = \P2.EBX [16]).
Adding EN signal on $auto$ff.cc:262:slice$15855 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [15], Q = \P2.EBX [15]).
Adding EN signal on $auto$ff.cc:262:slice$15854 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [14], Q = \P2.EBX [14]).
Adding EN signal on $auto$ff.cc:262:slice$15853 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [13], Q = \P2.EBX [13]).
Adding EN signal on $auto$ff.cc:262:slice$14033 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [6], Q = \P1.Address [6]).
Adding EN signal on $auto$ff.cc:262:slice$15852 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [12], Q = \P2.EBX [12]).
Adding EN signal on $auto$ff.cc:262:slice$15851 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [11], Q = \P2.EBX [11]).
Adding EN signal on $auto$ff.cc:262:slice$15850 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [10], Q = \P2.EBX [10]).
Adding EN signal on $auto$ff.cc:262:slice$15849 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [9], Q = \P2.EBX [9]).
Adding EN signal on $auto$ff.cc:262:slice$15848 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [8], Q = \P2.EBX [8]).
Adding EN signal on $auto$ff.cc:262:slice$15847 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [7], Q = \P2.EBX [7]).
Adding EN signal on $auto$ff.cc:262:slice$15846 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [6], Q = \P2.EBX [6]).
Adding EN signal on $auto$ff.cc:262:slice$14032 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [5], Q = \P1.Address [5]).
Adding EN signal on $auto$ff.cc:262:slice$15845 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [5], Q = \P2.EBX [5]).
Adding EN signal on $auto$ff.cc:262:slice$15844 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [4], Q = \P2.EBX [4]).
Adding EN signal on $auto$ff.cc:262:slice$15843 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [3], Q = \P2.EBX [3]).
Adding EN signal on $auto$ff.cc:262:slice$15842 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [2], Q = \P2.EBX [2]).
Adding EN signal on $auto$ff.cc:262:slice$15841 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [1], Q = \P2.EBX [1]).
Adding EN signal on $auto$ff.cc:262:slice$15840 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$17596 [0], Q = \P2.EBX [0]).
Adding EN signal on $auto$ff.cc:262:slice$15839 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [32], Q = \P2.rEIP [31]).
Adding EN signal on $auto$ff.cc:262:slice$14031 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [4], Q = \P1.Address [4]).
Adding EN signal on $auto$ff.cc:262:slice$15838 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [30], Q = \P2.rEIP [30]).
Adding EN signal on $auto$ff.cc:262:slice$15837 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [29], Q = \P2.rEIP [29]).
Adding EN signal on $auto$ff.cc:262:slice$15836 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [28], Q = \P2.rEIP [28]).
Adding EN signal on $auto$ff.cc:262:slice$15835 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [27], Q = \P2.rEIP [27]).
Adding EN signal on $auto$ff.cc:262:slice$15834 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [26], Q = \P2.rEIP [26]).
Adding EN signal on $auto$ff.cc:262:slice$15833 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [25], Q = \P2.rEIP [25]).
Adding EN signal on $auto$ff.cc:262:slice$15832 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [24], Q = \P2.rEIP [24]).
Adding EN signal on $auto$ff.cc:262:slice$14030 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [3], Q = \P1.Address [3]).
Adding EN signal on $auto$ff.cc:262:slice$15831 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [23], Q = \P2.rEIP [23]).
Adding EN signal on $auto$ff.cc:262:slice$15830 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [22], Q = \P2.rEIP [22]).
Adding EN signal on $auto$ff.cc:262:slice$15829 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [21], Q = \P2.rEIP [21]).
Adding EN signal on $auto$ff.cc:262:slice$15828 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [20], Q = \P2.rEIP [20]).
Adding EN signal on $auto$ff.cc:262:slice$15827 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [19], Q = \P2.rEIP [19]).
Adding EN signal on $auto$ff.cc:262:slice$15826 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [18], Q = \P2.rEIP [18]).
Adding EN signal on $auto$ff.cc:262:slice$15825 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [17], Q = \P2.rEIP [17]).
Adding EN signal on $auto$ff.cc:262:slice$14029 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [2], Q = \P1.Address [2]).
Adding EN signal on $auto$ff.cc:262:slice$15824 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [16], Q = \P2.rEIP [16]).
Adding EN signal on $auto$ff.cc:262:slice$15823 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [15], Q = \P2.rEIP [15]).
Adding EN signal on $auto$ff.cc:262:slice$15822 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [14], Q = \P2.rEIP [14]).
Adding EN signal on $auto$ff.cc:262:slice$15821 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [13], Q = \P2.rEIP [13]).
Adding EN signal on $auto$ff.cc:262:slice$15820 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [12], Q = \P2.rEIP [12]).
Adding EN signal on $auto$ff.cc:262:slice$15819 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [11], Q = \P2.rEIP [11]).
Adding EN signal on $auto$ff.cc:262:slice$15818 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [10], Q = \P2.rEIP [10]).
Adding EN signal on $auto$ff.cc:262:slice$14028 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [1], Q = \P1.Address [1]).
Adding EN signal on $auto$ff.cc:262:slice$15817 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [9], Q = \P2.rEIP [9]).
Adding EN signal on $auto$ff.cc:262:slice$15816 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [8], Q = \P2.rEIP [8]).
Adding EN signal on $auto$ff.cc:262:slice$15815 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [7], Q = \P2.rEIP [7]).
Adding EN signal on $auto$ff.cc:262:slice$15814 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [6], Q = \P2.rEIP [6]).
Adding EN signal on $auto$ff.cc:262:slice$15813 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [5], Q = \P2.rEIP [5]).
Adding EN signal on $auto$ff.cc:262:slice$15812 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [4], Q = \P2.rEIP [4]).
Adding EN signal on $auto$ff.cc:262:slice$15811 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [3], Q = \P2.rEIP [3]).
Adding EN signal on $auto$ff.cc:262:slice$14027 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [0], Q = \P1.Address [0]).
Adding EN signal on $auto$ff.cc:262:slice$15810 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [2], Q = \P2.rEIP [2]).
Adding EN signal on $auto$ff.cc:262:slice$15809 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [1], Q = \P2.rEIP [1]).
Adding EN signal on $auto$ff.cc:262:slice$15808 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20816 [0], Q = \P2.rEIP [0]).
Adding EN signal on $auto$ff.cc:262:slice$15807 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20349, Q = \P2.ReadRequest).
Adding EN signal on $auto$ff.cc:262:slice$15806 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20330, Q = \P2.MemoryFetch).
Adding EN signal on $auto$ff.cc:262:slice$15805 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20311, Q = \P2.RequestPending).
Adding EN signal on $auto$ff.cc:262:slice$14025 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14643, Q = \P1.D_C_n).
Adding EN signal on $auto$ff.cc:262:slice$14023 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14633, Q = \P1.ADS_n).
Adding EN signal on $auto$ff.cc:262:slice$14022 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14621 [2], Q = \P1.State [2]).
Adding EN signal on $auto$ff.cc:262:slice$14883 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [30], Q = \P1.Datao [30]).
Adding EN signal on $auto$ff.cc:262:slice$14882 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [29], Q = \P1.Datao [29]).
Adding EN signal on $auto$ff.cc:262:slice$14881 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [28], Q = \P1.Datao [28]).
Adding EN signal on $auto$ff.cc:262:slice$14880 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [27], Q = \P1.Datao [27]).
Adding EN signal on $auto$ff.cc:262:slice$14879 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [26], Q = \P1.Datao [26]).
Adding EN signal on $auto$ff.cc:262:slice$14021 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14621 [1], Q = \P1.State [1]).
Adding EN signal on $auto$ff.cc:262:slice$14878 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [25], Q = \P1.Datao [25]).
Adding EN signal on $auto$ff.cc:262:slice$14877 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [24], Q = \P1.Datao [24]).
Adding EN signal on $auto$ff.cc:262:slice$14876 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [23], Q = \P1.Datao [23]).
Adding EN signal on $auto$ff.cc:262:slice$14875 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [22], Q = \P1.Datao [22]).
Adding EN signal on $auto$ff.cc:262:slice$14874 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [21], Q = \P1.Datao [21]).
Adding EN signal on $auto$ff.cc:262:slice$14873 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [20], Q = \P1.Datao [20]).
Adding EN signal on $auto$ff.cc:262:slice$14872 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [19], Q = \P1.Datao [19]).
Adding EN signal on $auto$ff.cc:262:slice$14020 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14621 [0], Q = \P1.State [0]).
Adding EN signal on $auto$ff.cc:262:slice$14868 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [15], Q = \P1.Datao [15]).
Adding EN signal on $auto$ff.cc:262:slice$14867 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [14], Q = \P1.Datao [14]).
Adding EN signal on $auto$ff.cc:262:slice$14866 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [13], Q = \P1.Datao [13]).
Adding EN signal on $auto$ff.cc:262:slice$14019 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14567, Q = \P1.StateBS16).
Adding EN signal on $auto$ff.cc:262:slice$14871 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [18], Q = \P1.Datao [18]).
Adding EN signal on $auto$ff.cc:262:slice$14870 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [17], Q = \P1.Datao [17]).
Adding EN signal on $auto$ff.cc:262:slice$14869 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5084 [16], Q = \P1.Datao [16]).
Adding EN signal on $auto$ff.cc:262:slice$14018 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25689 [1], Q = \P2.DataWidth [1]).
Adding EN signal on $auto$ff.cc:262:slice$14055 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [28], Q = \P1.Address [28]).
Adding EN signal on $auto$ff.cc:262:slice$14036 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14294 [9], Q = \P1.Address [9]).
Adding EN signal on $auto$ff.cc:262:slice$14017 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25689 [0], Q = \P2.DataWidth [0]).
Adding EN signal on $auto$ff.cc:262:slice$4618 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9355 [3], Q = \P1.P1.State2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$4617 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9355 [2], Q = \P1.P1.State2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$4616 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9355 [1], Q = \P1.P1.State2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$4615 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9355 [0], Q = \P1.P1.State2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$4614 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8712 [7], Q = \P1.P1.InstQueue[15] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4613 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8712 [6], Q = \P1.P1.InstQueue[15] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4612 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8712 [5], Q = \P1.P1.InstQueue[15] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4611 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8712 [4], Q = \P1.P1.InstQueue[15] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4610 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8712 [3], Q = \P1.P1.InstQueue[15] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4609 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8712 [2], Q = \P1.P1.InstQueue[15] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4608 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8712 [1], Q = \P1.P1.InstQueue[15] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4607 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8712 [0], Q = \P1.P1.InstQueue[15] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4606 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8588 [7], Q = \P1.P1.InstQueue[14] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4605 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8588 [6], Q = \P1.P1.InstQueue[14] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4604 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8588 [5], Q = \P1.P1.InstQueue[14] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4603 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8588 [4], Q = \P1.P1.InstQueue[14] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4602 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8588 [3], Q = \P1.P1.InstQueue[14] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4601 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8588 [2], Q = \P1.P1.InstQueue[14] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4600 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8588 [1], Q = \P1.P1.InstQueue[14] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4599 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8588 [0], Q = \P1.P1.InstQueue[14] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4598 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8464 [7], Q = \P1.P1.InstQueue[13] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4597 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8464 [6], Q = \P1.P1.InstQueue[13] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4596 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8464 [5], Q = \P1.P1.InstQueue[13] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4595 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8464 [4], Q = \P1.P1.InstQueue[13] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4594 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8464 [3], Q = \P1.P1.InstQueue[13] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4593 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8464 [2], Q = \P1.P1.InstQueue[13] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4592 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8464 [1], Q = \P1.P1.InstQueue[13] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4591 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8464 [0], Q = \P1.P1.InstQueue[13] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4590 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8340 [7], Q = \P1.P1.InstQueue[12] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4589 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8340 [6], Q = \P1.P1.InstQueue[12] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4588 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8340 [5], Q = \P1.P1.InstQueue[12] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4587 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8340 [4], Q = \P1.P1.InstQueue[12] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4586 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8340 [3], Q = \P1.P1.InstQueue[12] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4585 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8340 [2], Q = \P1.P1.InstQueue[12] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4584 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8340 [1], Q = \P1.P1.InstQueue[12] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4583 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8340 [0], Q = \P1.P1.InstQueue[12] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4582 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8216 [7], Q = \P1.P1.InstQueue[11] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4581 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8216 [6], Q = \P1.P1.InstQueue[11] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4580 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8216 [5], Q = \P1.P1.InstQueue[11] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4579 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8216 [4], Q = \P1.P1.InstQueue[11] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4578 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8216 [3], Q = \P1.P1.InstQueue[11] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4577 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8216 [2], Q = \P1.P1.InstQueue[11] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4576 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8216 [1], Q = \P1.P1.InstQueue[11] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4575 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8216 [0], Q = \P1.P1.InstQueue[11] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4574 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8092 [7], Q = \P1.P1.InstQueue[10] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4573 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8092 [6], Q = \P1.P1.InstQueue[10] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4572 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8092 [5], Q = \P1.P1.InstQueue[10] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4571 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8092 [4], Q = \P1.P1.InstQueue[10] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4570 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8092 [3], Q = \P1.P1.InstQueue[10] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4569 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8092 [2], Q = \P1.P1.InstQueue[10] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4568 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8092 [1], Q = \P1.P1.InstQueue[10] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4567 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8092 [0], Q = \P1.P1.InstQueue[10] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4566 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7968 [7], Q = \P1.P1.InstQueue[9] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4565 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7968 [6], Q = \P1.P1.InstQueue[9] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4564 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7968 [5], Q = \P1.P1.InstQueue[9] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4563 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7968 [4], Q = \P1.P1.InstQueue[9] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4562 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7968 [3], Q = \P1.P1.InstQueue[9] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4561 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7968 [2], Q = \P1.P1.InstQueue[9] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4560 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7968 [1], Q = \P1.P1.InstQueue[9] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4559 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7968 [0], Q = \P1.P1.InstQueue[9] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4558 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7844 [7], Q = \P1.P1.InstQueue[8] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4557 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7844 [6], Q = \P1.P1.InstQueue[8] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4556 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7844 [5], Q = \P1.P1.InstQueue[8] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4555 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7844 [4], Q = \P1.P1.InstQueue[8] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4554 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7844 [3], Q = \P1.P1.InstQueue[8] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4553 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7844 [2], Q = \P1.P1.InstQueue[8] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4552 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7844 [1], Q = \P1.P1.InstQueue[8] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4551 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7844 [0], Q = \P1.P1.InstQueue[8] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4550 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7720 [7], Q = \P1.P1.InstQueue[7] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4549 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7720 [6], Q = \P1.P1.InstQueue[7] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4548 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7720 [5], Q = \P1.P1.InstQueue[7] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4547 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7720 [4], Q = \P1.P1.InstQueue[7] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4546 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7720 [3], Q = \P1.P1.InstQueue[7] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4545 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7720 [2], Q = \P1.P1.InstQueue[7] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4544 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7720 [1], Q = \P1.P1.InstQueue[7] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4543 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7720 [0], Q = \P1.P1.InstQueue[7] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4542 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7596 [7], Q = \P1.P1.InstQueue[6] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4541 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7596 [6], Q = \P1.P1.InstQueue[6] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4540 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7596 [5], Q = \P1.P1.InstQueue[6] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4539 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7596 [4], Q = \P1.P1.InstQueue[6] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4538 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7596 [3], Q = \P1.P1.InstQueue[6] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4537 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7596 [2], Q = \P1.P1.InstQueue[6] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4536 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7596 [1], Q = \P1.P1.InstQueue[6] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4535 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7596 [0], Q = \P1.P1.InstQueue[6] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4534 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7472 [7], Q = \P1.P1.InstQueue[5] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4533 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7472 [6], Q = \P1.P1.InstQueue[5] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4532 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7472 [5], Q = \P1.P1.InstQueue[5] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4531 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7472 [4], Q = \P1.P1.InstQueue[5] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4530 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7472 [3], Q = \P1.P1.InstQueue[5] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4529 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7472 [2], Q = \P1.P1.InstQueue[5] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4528 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7472 [1], Q = \P1.P1.InstQueue[5] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4527 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7472 [0], Q = \P1.P1.InstQueue[5] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4526 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7348 [7], Q = \P1.P1.InstQueue[4] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4525 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7348 [6], Q = \P1.P1.InstQueue[4] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4524 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7348 [5], Q = \P1.P1.InstQueue[4] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4523 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7348 [4], Q = \P1.P1.InstQueue[4] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4522 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7348 [3], Q = \P1.P1.InstQueue[4] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4521 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7348 [2], Q = \P1.P1.InstQueue[4] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4520 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7348 [1], Q = \P1.P1.InstQueue[4] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4519 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7348 [0], Q = \P1.P1.InstQueue[4] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4518 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7224 [7], Q = \P1.P1.InstQueue[3] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4517 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7224 [6], Q = \P1.P1.InstQueue[3] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4516 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7224 [5], Q = \P1.P1.InstQueue[3] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4515 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7224 [4], Q = \P1.P1.InstQueue[3] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4514 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7224 [3], Q = \P1.P1.InstQueue[3] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4513 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7224 [2], Q = \P1.P1.InstQueue[3] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4512 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7224 [1], Q = \P1.P1.InstQueue[3] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4511 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7224 [0], Q = \P1.P1.InstQueue[3] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4510 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7100 [7], Q = \P1.P1.InstQueue[2] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4509 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7100 [6], Q = \P1.P1.InstQueue[2] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4508 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7100 [5], Q = \P1.P1.InstQueue[2] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4507 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7100 [4], Q = \P1.P1.InstQueue[2] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4506 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7100 [3], Q = \P1.P1.InstQueue[2] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4505 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7100 [2], Q = \P1.P1.InstQueue[2] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4504 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7100 [1], Q = \P1.P1.InstQueue[2] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4503 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$7100 [0], Q = \P1.P1.InstQueue[2] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4502 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6976 [7], Q = \P1.P1.InstQueue[1] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4501 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6976 [6], Q = \P1.P1.InstQueue[1] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4500 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6976 [5], Q = \P1.P1.InstQueue[1] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4499 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6976 [4], Q = \P1.P1.InstQueue[1] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4498 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6976 [3], Q = \P1.P1.InstQueue[1] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4497 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6976 [2], Q = \P1.P1.InstQueue[1] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4496 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6976 [1], Q = \P1.P1.InstQueue[1] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4495 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6976 [0], Q = \P1.P1.InstQueue[1] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4494 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6852 [7], Q = \P1.P1.InstQueue[0] [7]).
Adding EN signal on $auto$ff.cc:262:slice$4493 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6852 [6], Q = \P1.P1.InstQueue[0] [6]).
Adding EN signal on $auto$ff.cc:262:slice$4492 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6852 [5], Q = \P1.P1.InstQueue[0] [5]).
Adding EN signal on $auto$ff.cc:262:slice$4491 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6852 [4], Q = \P1.P1.InstQueue[0] [4]).
Adding EN signal on $auto$ff.cc:262:slice$4490 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6852 [3], Q = \P1.P1.InstQueue[0] [3]).
Adding EN signal on $auto$ff.cc:262:slice$4489 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6852 [2], Q = \P1.P1.InstQueue[0] [2]).
Adding EN signal on $auto$ff.cc:262:slice$4488 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6852 [1], Q = \P1.P1.InstQueue[0] [1]).
Adding EN signal on $auto$ff.cc:262:slice$4487 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6852 [0], Q = \P1.P1.InstQueue[0] [0]).
Adding EN signal on $auto$ff.cc:262:slice$4486 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18206 [3], Q = \P2.P1.InstQueueRd_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$4485 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18206 [2], Q = \P2.P1.InstQueueRd_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$4484 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18206 [1], Q = \P2.P1.InstQueueRd_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$4483 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$18206 [0], Q = \P2.P1.InstQueueRd_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$4482 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [30], Q = \P2.Datao [30]).
Adding EN signal on $auto$ff.cc:262:slice$4481 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [29], Q = \P2.Datao [29]).
Adding EN signal on $auto$ff.cc:262:slice$4480 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [28], Q = \P2.Datao [28]).
Adding EN signal on $auto$ff.cc:262:slice$4479 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [27], Q = \P2.Datao [27]).
Adding EN signal on $auto$ff.cc:262:slice$4478 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [26], Q = \P2.Datao [26]).
Adding EN signal on $auto$ff.cc:262:slice$4477 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [25], Q = \P2.Datao [25]).
Adding EN signal on $auto$ff.cc:262:slice$4476 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [24], Q = \P2.Datao [24]).
Adding EN signal on $auto$ff.cc:262:slice$4475 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [23], Q = \P2.Datao [23]).
Adding EN signal on $auto$ff.cc:262:slice$4474 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [22], Q = \P2.Datao [22]).
Adding EN signal on $auto$ff.cc:262:slice$4473 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [21], Q = \P2.Datao [21]).
Adding EN signal on $auto$ff.cc:262:slice$4472 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [20], Q = \P2.Datao [20]).
Adding EN signal on $auto$ff.cc:262:slice$4471 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [19], Q = \P2.Datao [19]).
Adding EN signal on $auto$ff.cc:262:slice$4470 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [18], Q = \P2.Datao [18]).
Adding EN signal on $auto$ff.cc:262:slice$4469 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [17], Q = \P2.Datao [17]).
Adding EN signal on $auto$ff.cc:262:slice$4468 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [16], Q = \P2.Datao [16]).
Adding EN signal on $auto$ff.cc:262:slice$4467 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [15], Q = \P2.Datao [15]).
Adding EN signal on $auto$ff.cc:262:slice$4466 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [14], Q = \P2.Datao [14]).
Adding EN signal on $auto$ff.cc:262:slice$4465 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [13], Q = \P2.Datao [13]).
Adding EN signal on $auto$ff.cc:262:slice$4464 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [12], Q = \P2.Datao [12]).
Adding EN signal on $auto$ff.cc:262:slice$4463 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [11], Q = \P2.Datao [11]).
Adding EN signal on $auto$ff.cc:262:slice$4462 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [10], Q = \P2.Datao [10]).
Adding EN signal on $auto$ff.cc:262:slice$4461 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [9], Q = \P2.Datao [9]).
Adding EN signal on $auto$ff.cc:262:slice$4460 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [8], Q = \P2.Datao [8]).
Adding EN signal on $auto$ff.cc:262:slice$4459 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [7], Q = \P2.Datao [7]).
Adding EN signal on $auto$ff.cc:262:slice$4458 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [6], Q = \P2.Datao [6]).
Adding EN signal on $auto$ff.cc:262:slice$4457 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [5], Q = \P2.Datao [5]).
Adding EN signal on $auto$ff.cc:262:slice$4456 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [4], Q = \P2.Datao [4]).
Adding EN signal on $auto$ff.cc:262:slice$4455 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [3], Q = \P2.Datao [3]).
Adding EN signal on $auto$ff.cc:262:slice$4454 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [2], Q = \P2.Datao [2]).
Adding EN signal on $auto$ff.cc:262:slice$4453 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [1], Q = \P2.Datao [1]).
Adding EN signal on $auto$ff.cc:262:slice$4452 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$16638 [0], Q = \P2.Datao [0]).
Adding EN signal on $auto$ff.cc:262:slice$4451 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [31], Q = \P1.P1.InstAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$4450 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [30], Q = \P1.P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$4449 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [29], Q = \P1.P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$4448 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [28], Q = \P1.P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$4447 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [27], Q = \P1.P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$4446 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [26], Q = \P1.P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$4445 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [25], Q = \P1.P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$4444 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [24], Q = \P1.P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$4443 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [23], Q = \P1.P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$4442 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [22], Q = \P1.P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$4441 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [21], Q = \P1.P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$4440 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [20], Q = \P1.P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$4439 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [19], Q = \P1.P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$4438 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [18], Q = \P1.P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$4437 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [17], Q = \P1.P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$4436 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [16], Q = \P1.P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$4435 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [15], Q = \P1.P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$4434 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [14], Q = \P1.P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$4433 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [13], Q = \P1.P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$4432 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [12], Q = \P1.P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$4431 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [11], Q = \P1.P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$4430 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [10], Q = \P1.P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$4429 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [9], Q = \P1.P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$4428 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [8], Q = \P1.P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$4427 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [7], Q = \P1.P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$4426 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [6], Q = \P1.P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$4425 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [5], Q = \P1.P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$4424 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [4], Q = \P1.P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$4423 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [3], Q = \P1.P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$4422 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [2], Q = \P1.P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$4421 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [1], Q = \P1.P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$4420 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9811 [0], Q = \P1.P1.InstAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$4419 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [31], Q = \P1.P1.PhyAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$4418 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [30], Q = \P1.P1.PhyAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$4417 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [29], Q = \P1.P1.PhyAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$4416 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [28], Q = \P1.P1.PhyAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$4415 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [27], Q = \P1.P1.PhyAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$4414 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [26], Q = \P1.P1.PhyAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$4413 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [25], Q = \P1.P1.PhyAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$4412 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [24], Q = \P1.P1.PhyAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$4411 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [23], Q = \P1.P1.PhyAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$4410 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [22], Q = \P1.P1.PhyAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$4409 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [21], Q = \P1.P1.PhyAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$4408 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [20], Q = \P1.P1.PhyAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$4407 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [19], Q = \P1.P1.PhyAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$4406 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [18], Q = \P1.P1.PhyAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$4405 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [17], Q = \P1.P1.PhyAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$4404 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [16], Q = \P1.P1.PhyAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$4403 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [15], Q = \P1.P1.PhyAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$4402 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [14], Q = \P1.P1.PhyAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$4401 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [13], Q = \P1.P1.PhyAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$4400 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [12], Q = \P1.P1.PhyAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$4399 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [11], Q = \P1.P1.PhyAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$4398 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [10], Q = \P1.P1.PhyAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$4397 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [9], Q = \P1.P1.PhyAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$4396 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [8], Q = \P1.P1.PhyAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$4395 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [7], Q = \P1.P1.PhyAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$4394 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [6], Q = \P1.P1.PhyAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$4393 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [5], Q = \P1.P1.PhyAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$4392 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [4], Q = \P1.P1.PhyAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$4391 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [3], Q = \P1.P1.PhyAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$4390 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [2], Q = \P1.P1.PhyAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$4389 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [1], Q = \P1.P1.PhyAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$4388 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$10295 [0], Q = \P1.P1.PhyAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$4387 ($_DFF_PP0_) from module b17 (D = $auto$rtlil.cc:2459:Mux$1606, Q = \P1.P1.More).
Adding EN signal on $auto$ff.cc:262:slice$4386 ($_DFF_PP0_) from module b17 (D = $auto$rtlil.cc:2459:Mux$1592, Q = \P1.P1.Flush).
Adding EN signal on $auto$ff.cc:262:slice$4385 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [15], Q = \P1.P1.lWord [15]).
Adding EN signal on $auto$ff.cc:262:slice$4384 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [14], Q = \P1.P1.lWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$4383 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [13], Q = \P1.P1.lWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$4382 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [12], Q = \P1.P1.lWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$4381 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [11], Q = \P1.P1.lWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$4380 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [10], Q = \P1.P1.lWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$4379 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [9], Q = \P1.P1.lWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$4378 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [8], Q = \P1.P1.lWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$4377 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [7], Q = \P1.P1.lWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$4376 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [6], Q = \P1.P1.lWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$4375 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [5], Q = \P1.P1.lWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$4374 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [4], Q = \P1.P1.lWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$4373 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [3], Q = \P1.P1.lWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$4372 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [2], Q = \P1.P1.lWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$4371 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [1], Q = \P1.P1.lWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$4370 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5345 [0], Q = \P1.P1.lWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$4369 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [14], Q = \P1.P1.uWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$4368 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [13], Q = \P1.P1.uWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$4367 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [12], Q = \P1.P1.uWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$4366 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [11], Q = \P1.P1.uWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$4365 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [10], Q = \P1.P1.uWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$4364 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [9], Q = \P1.P1.uWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$4363 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [8], Q = \P1.P1.uWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$4362 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [7], Q = \P1.P1.uWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$4361 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [6], Q = \P1.P1.uWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$4360 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [5], Q = \P1.P1.uWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$4359 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [4], Q = \P1.P1.uWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$4358 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [3], Q = \P1.P1.uWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$4357 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [2], Q = \P1.P1.uWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$4356 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [1], Q = \P1.P1.uWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$4355 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$5575 [0], Q = \P1.P1.uWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$4354 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8738, Q = \P1.CodeFetch).
Adding EN signal on $auto$ff.cc:262:slice$4353 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6731 [3], Q = \P1.P1.InstQueueWr_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$4352 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6731 [2], Q = \P1.P1.InstQueueWr_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$4351 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6731 [1], Q = \P1.P1.InstQueueWr_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$4350 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6731 [0], Q = \P1.P1.InstQueueWr_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$4349 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [31], Q = \P1.EAX [31]).
Adding EN signal on $auto$ff.cc:262:slice$4348 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [30], Q = \P1.EAX [30]).
Adding EN signal on $auto$ff.cc:262:slice$4347 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [29], Q = \P1.EAX [29]).
Adding EN signal on $auto$ff.cc:262:slice$4346 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [28], Q = \P1.EAX [28]).
Adding EN signal on $auto$ff.cc:262:slice$4345 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [27], Q = \P1.EAX [27]).
Adding EN signal on $auto$ff.cc:262:slice$4344 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [26], Q = \P1.EAX [26]).
Adding EN signal on $auto$ff.cc:262:slice$4343 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [25], Q = \P1.EAX [25]).
Adding EN signal on $auto$ff.cc:262:slice$4342 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [24], Q = \P1.EAX [24]).
Adding EN signal on $auto$ff.cc:262:slice$4341 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [23], Q = \P1.EAX [23]).
Adding EN signal on $auto$ff.cc:262:slice$4340 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [22], Q = \P1.EAX [22]).
Adding EN signal on $auto$ff.cc:262:slice$4339 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [21], Q = \P1.EAX [21]).
Adding EN signal on $auto$ff.cc:262:slice$4338 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [20], Q = \P1.EAX [20]).
Adding EN signal on $auto$ff.cc:262:slice$4337 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [19], Q = \P1.EAX [19]).
Adding EN signal on $auto$ff.cc:262:slice$4336 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [18], Q = \P1.EAX [18]).
Adding EN signal on $auto$ff.cc:262:slice$4335 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [17], Q = \P1.EAX [17]).
Adding EN signal on $auto$ff.cc:262:slice$4334 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [16], Q = \P1.EAX [16]).
Adding EN signal on $auto$ff.cc:262:slice$4333 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [15], Q = \P1.EAX [15]).
Adding EN signal on $auto$ff.cc:262:slice$4332 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [14], Q = \P1.EAX [14]).
Adding EN signal on $auto$ff.cc:262:slice$4331 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [13], Q = \P1.EAX [13]).
Adding EN signal on $auto$ff.cc:262:slice$4330 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [12], Q = \P1.EAX [12]).
Adding EN signal on $auto$ff.cc:262:slice$4329 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [11], Q = \P1.EAX [11]).
Adding EN signal on $auto$ff.cc:262:slice$4328 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [10], Q = \P1.EAX [10]).
Adding EN signal on $auto$ff.cc:262:slice$4327 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [9], Q = \P1.EAX [9]).
Adding EN signal on $auto$ff.cc:262:slice$4326 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [8], Q = \P1.EAX [8]).
Adding EN signal on $auto$ff.cc:262:slice$4325 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [7], Q = \P1.EAX [7]).
Adding EN signal on $auto$ff.cc:262:slice$4324 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [6], Q = \P1.EAX [6]).
Adding EN signal on $auto$ff.cc:262:slice$4323 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [5], Q = \P1.EAX [5]).
Adding EN signal on $auto$ff.cc:262:slice$4322 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [4], Q = \P1.EAX [4]).
Adding EN signal on $auto$ff.cc:262:slice$4321 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [3], Q = \P1.EAX [3]).
Adding EN signal on $auto$ff.cc:262:slice$4320 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [2], Q = \P1.EAX [2]).
Adding EN signal on $auto$ff.cc:262:slice$4319 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [1], Q = \P1.EAX [1]).
Adding EN signal on $auto$ff.cc:262:slice$4318 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6526 [0], Q = \P1.EAX [0]).
Adding EN signal on $auto$ff.cc:262:slice$4317 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [31], Q = \P1.EBX [31]).
Adding EN signal on $auto$ff.cc:262:slice$4316 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [30], Q = \P1.EBX [30]).
Adding EN signal on $auto$ff.cc:262:slice$4315 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [29], Q = \P1.EBX [29]).
Adding EN signal on $auto$ff.cc:262:slice$4314 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [28], Q = \P1.EBX [28]).
Adding EN signal on $auto$ff.cc:262:slice$4313 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [27], Q = \P1.EBX [27]).
Adding EN signal on $auto$ff.cc:262:slice$4312 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [26], Q = \P1.EBX [26]).
Adding EN signal on $auto$ff.cc:262:slice$4311 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [25], Q = \P1.EBX [25]).
Adding EN signal on $auto$ff.cc:262:slice$4310 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [24], Q = \P1.EBX [24]).
Adding EN signal on $auto$ff.cc:262:slice$4309 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [23], Q = \P1.EBX [23]).
Adding EN signal on $auto$ff.cc:262:slice$4308 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [22], Q = \P1.EBX [22]).
Adding EN signal on $auto$ff.cc:262:slice$4307 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [21], Q = \P1.EBX [21]).
Adding EN signal on $auto$ff.cc:262:slice$4306 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [20], Q = \P1.EBX [20]).
Adding EN signal on $auto$ff.cc:262:slice$4305 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [19], Q = \P1.EBX [19]).
Adding EN signal on $auto$ff.cc:262:slice$4304 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [18], Q = \P1.EBX [18]).
Adding EN signal on $auto$ff.cc:262:slice$4303 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [17], Q = \P1.EBX [17]).
Adding EN signal on $auto$ff.cc:262:slice$4302 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [16], Q = \P1.EBX [16]).
Adding EN signal on $auto$ff.cc:262:slice$4301 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [15], Q = \P1.EBX [15]).
Adding EN signal on $auto$ff.cc:262:slice$4300 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [14], Q = \P1.EBX [14]).
Adding EN signal on $auto$ff.cc:262:slice$4299 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [13], Q = \P1.EBX [13]).
Adding EN signal on $auto$ff.cc:262:slice$4298 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [12], Q = \P1.EBX [12]).
Adding EN signal on $auto$ff.cc:262:slice$4297 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [11], Q = \P1.EBX [11]).
Adding EN signal on $auto$ff.cc:262:slice$4296 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [10], Q = \P1.EBX [10]).
Adding EN signal on $auto$ff.cc:262:slice$4295 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [9], Q = \P1.EBX [9]).
Adding EN signal on $auto$ff.cc:262:slice$4294 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [8], Q = \P1.EBX [8]).
Adding EN signal on $auto$ff.cc:262:slice$4293 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [7], Q = \P1.EBX [7]).
Adding EN signal on $auto$ff.cc:262:slice$4292 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [6], Q = \P1.EBX [6]).
Adding EN signal on $auto$ff.cc:262:slice$4291 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [5], Q = \P1.EBX [5]).
Adding EN signal on $auto$ff.cc:262:slice$4290 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [4], Q = \P1.EBX [4]).
Adding EN signal on $auto$ff.cc:262:slice$4289 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [3], Q = \P1.EBX [3]).
Adding EN signal on $auto$ff.cc:262:slice$4288 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [2], Q = \P1.EBX [2]).
Adding EN signal on $auto$ff.cc:262:slice$4287 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [1], Q = \P1.EBX [1]).
Adding EN signal on $auto$ff.cc:262:slice$4286 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6042 [0], Q = \P1.EBX [0]).
Adding EN signal on $auto$ff.cc:262:slice$4285 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [32], Q = \P1.rEIP [31]).
Adding EN signal on $auto$ff.cc:262:slice$4284 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [30], Q = \P1.rEIP [30]).
Adding EN signal on $auto$ff.cc:262:slice$4283 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [29], Q = \P1.rEIP [29]).
Adding EN signal on $auto$ff.cc:262:slice$4282 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [28], Q = \P1.rEIP [28]).
Adding EN signal on $auto$ff.cc:262:slice$4281 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [27], Q = \P1.rEIP [27]).
Adding EN signal on $auto$ff.cc:262:slice$4280 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [26], Q = \P1.rEIP [26]).
Adding EN signal on $auto$ff.cc:262:slice$4279 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [25], Q = \P1.rEIP [25]).
Adding EN signal on $auto$ff.cc:262:slice$4278 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [24], Q = \P1.rEIP [24]).
Adding EN signal on $auto$ff.cc:262:slice$4277 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [23], Q = \P1.rEIP [23]).
Adding EN signal on $auto$ff.cc:262:slice$4276 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [22], Q = \P1.rEIP [22]).
Adding EN signal on $auto$ff.cc:262:slice$4275 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [21], Q = \P1.rEIP [21]).
Adding EN signal on $auto$ff.cc:262:slice$4274 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [20], Q = \P1.rEIP [20]).
Adding EN signal on $auto$ff.cc:262:slice$4273 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [19], Q = \P1.rEIP [19]).
Adding EN signal on $auto$ff.cc:262:slice$4272 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [18], Q = \P1.rEIP [18]).
Adding EN signal on $auto$ff.cc:262:slice$4271 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [17], Q = \P1.rEIP [17]).
Adding EN signal on $auto$ff.cc:262:slice$4270 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [16], Q = \P1.rEIP [16]).
Adding EN signal on $auto$ff.cc:262:slice$4269 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [15], Q = \P1.rEIP [15]).
Adding EN signal on $auto$ff.cc:262:slice$4268 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [14], Q = \P1.rEIP [14]).
Adding EN signal on $auto$ff.cc:262:slice$4267 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [13], Q = \P1.rEIP [13]).
Adding EN signal on $auto$ff.cc:262:slice$4266 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [12], Q = \P1.rEIP [12]).
Adding EN signal on $auto$ff.cc:262:slice$4265 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [11], Q = \P1.rEIP [11]).
Adding EN signal on $auto$ff.cc:262:slice$4264 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [10], Q = \P1.rEIP [10]).
Adding EN signal on $auto$ff.cc:262:slice$4263 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [9], Q = \P1.rEIP [9]).
Adding EN signal on $auto$ff.cc:262:slice$4262 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [8], Q = \P1.rEIP [8]).
Adding EN signal on $auto$ff.cc:262:slice$4261 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [7], Q = \P1.rEIP [7]).
Adding EN signal on $auto$ff.cc:262:slice$4260 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [6], Q = \P1.rEIP [6]).
Adding EN signal on $auto$ff.cc:262:slice$4259 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [5], Q = \P1.rEIP [5]).
Adding EN signal on $auto$ff.cc:262:slice$4258 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [4], Q = \P1.rEIP [4]).
Adding EN signal on $auto$ff.cc:262:slice$4257 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [3], Q = \P1.rEIP [3]).
Adding EN signal on $auto$ff.cc:262:slice$4256 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [2], Q = \P1.rEIP [2]).
Adding EN signal on $auto$ff.cc:262:slice$4255 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [1], Q = \P1.rEIP [1]).
Adding EN signal on $auto$ff.cc:262:slice$4254 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9262 [0], Q = \P1.rEIP [0]).
Adding EN signal on $auto$ff.cc:262:slice$4253 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8795, Q = \P1.ReadRequest).
Adding EN signal on $auto$ff.cc:262:slice$4252 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8776, Q = \P1.MemoryFetch).
Adding EN signal on $auto$ff.cc:262:slice$4251 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$8757, Q = \P1.RequestPending).
Adding EN signal on $auto$ff.cc:262:slice$36060 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [29], Q = \P3.Address [29]).
Adding EN signal on $auto$ff.cc:262:slice$36059 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [28], Q = \P3.Address [28]).
Adding EN signal on $auto$ff.cc:262:slice$36058 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [27], Q = \P3.Address [27]).
Adding EN signal on $auto$ff.cc:262:slice$36057 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [26], Q = \P3.Address [26]).
Adding EN signal on $auto$ff.cc:262:slice$36056 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [25], Q = \P3.Address [25]).
Adding EN signal on $auto$ff.cc:262:slice$36055 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [24], Q = \P3.Address [24]).
Adding EN signal on $auto$ff.cc:262:slice$36054 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [23], Q = \P3.Address [23]).
Adding EN signal on $auto$ff.cc:262:slice$36053 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [22], Q = \P3.Address [22]).
Adding EN signal on $auto$ff.cc:262:slice$36052 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [21], Q = \P3.Address [21]).
Adding EN signal on $auto$ff.cc:262:slice$36051 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [20], Q = \P3.Address [20]).
Adding EN signal on $auto$ff.cc:262:slice$36050 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [19], Q = \P3.Address [19]).
Adding EN signal on $auto$ff.cc:262:slice$36049 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [18], Q = \P3.Address [18]).
Adding EN signal on $auto$ff.cc:262:slice$36048 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [17], Q = \P3.Address [17]).
Adding EN signal on $auto$ff.cc:262:slice$36047 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [16], Q = \P3.Address [16]).
Adding EN signal on $auto$ff.cc:262:slice$36046 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [15], Q = \P3.Address [15]).
Adding EN signal on $auto$ff.cc:262:slice$36045 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [14], Q = \P3.Address [14]).
Adding EN signal on $auto$ff.cc:262:slice$36044 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [13], Q = \P3.Address [13]).
Adding EN signal on $auto$ff.cc:262:slice$36043 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [12], Q = \P3.Address [12]).
Adding EN signal on $auto$ff.cc:262:slice$36042 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [11], Q = \P3.Address [11]).
Adding EN signal on $auto$ff.cc:262:slice$36041 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [10], Q = \P3.Address [10]).
Adding EN signal on $auto$ff.cc:262:slice$36040 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [9], Q = \P3.Address [9]).
Adding EN signal on $auto$ff.cc:262:slice$36039 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [8], Q = \P3.Address [8]).
Adding EN signal on $auto$ff.cc:262:slice$36038 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [7], Q = \P3.Address [7]).
Adding EN signal on $auto$ff.cc:262:slice$36037 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [6], Q = \P3.Address [6]).
Adding EN signal on $auto$ff.cc:262:slice$36036 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [5], Q = \P3.Address [5]).
Adding EN signal on $auto$ff.cc:262:slice$36035 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [4], Q = \P3.Address [4]).
Adding EN signal on $auto$ff.cc:262:slice$36034 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [3], Q = \P3.Address [3]).
Adding EN signal on $auto$ff.cc:262:slice$36033 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [2], Q = \P3.Address [2]).
Adding EN signal on $auto$ff.cc:262:slice$36032 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [1], Q = \P3.Address [1]).
Adding EN signal on $auto$ff.cc:262:slice$36031 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36298 [0], Q = \P3.Address [0]).
Adding EN signal on $auto$ff.cc:262:slice$36029 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36615, Q = \P3.D_C_n).
Adding EN signal on $auto$ff.cc:262:slice$36027 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36605, Q = \P3.ADS_n).
Adding EN signal on $auto$ff.cc:262:slice$36026 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36593 [2], Q = \P3.State [2]).
Adding EN signal on $auto$ff.cc:262:slice$36025 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36593 [1], Q = \P3.State [1]).
Adding EN signal on $auto$ff.cc:262:slice$36024 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36593 [0], Q = \P3.State [0]).
Adding EN signal on $auto$ff.cc:262:slice$35991 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36571, Q = \P3.StateBS16).
Adding EN signal on $auto$ff.cc:262:slice$2745 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6652 [3], Q = \P1.P1.InstQueueRd_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$2744 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6652 [2], Q = \P1.P1.InstQueueRd_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$2743 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6652 [1], Q = \P1.P1.InstQueueRd_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$2742 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$6652 [0], Q = \P1.P1.InstQueueRd_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$26757 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31494 [3], Q = \P3.P1.State2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$26756 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31494 [2], Q = \P3.P1.State2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$26755 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31494 [1], Q = \P3.P1.State2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$26754 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31494 [0], Q = \P3.P1.State2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$26753 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30851 [7], Q = \P3.P1.InstQueue[15] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26752 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30851 [6], Q = \P3.P1.InstQueue[15] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26751 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30851 [5], Q = \P3.P1.InstQueue[15] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26750 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30851 [4], Q = \P3.P1.InstQueue[15] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26749 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30851 [3], Q = \P3.P1.InstQueue[15] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26748 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30851 [2], Q = \P3.P1.InstQueue[15] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26747 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30851 [1], Q = \P3.P1.InstQueue[15] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26746 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30851 [0], Q = \P3.P1.InstQueue[15] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26745 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30727 [7], Q = \P3.P1.InstQueue[14] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26744 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30727 [6], Q = \P3.P1.InstQueue[14] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26743 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30727 [5], Q = \P3.P1.InstQueue[14] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26742 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30727 [4], Q = \P3.P1.InstQueue[14] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26741 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30727 [3], Q = \P3.P1.InstQueue[14] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26740 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30727 [2], Q = \P3.P1.InstQueue[14] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26739 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30727 [1], Q = \P3.P1.InstQueue[14] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26738 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30727 [0], Q = \P3.P1.InstQueue[14] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26737 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30603 [7], Q = \P3.P1.InstQueue[13] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26736 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30603 [6], Q = \P3.P1.InstQueue[13] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26735 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30603 [5], Q = \P3.P1.InstQueue[13] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26734 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30603 [4], Q = \P3.P1.InstQueue[13] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26733 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30603 [3], Q = \P3.P1.InstQueue[13] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26732 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30603 [2], Q = \P3.P1.InstQueue[13] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26731 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30603 [1], Q = \P3.P1.InstQueue[13] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26730 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30603 [0], Q = \P3.P1.InstQueue[13] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26729 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30479 [7], Q = \P3.P1.InstQueue[12] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26728 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30479 [6], Q = \P3.P1.InstQueue[12] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26727 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30479 [5], Q = \P3.P1.InstQueue[12] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26726 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30479 [4], Q = \P3.P1.InstQueue[12] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26725 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30479 [3], Q = \P3.P1.InstQueue[12] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26724 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30479 [2], Q = \P3.P1.InstQueue[12] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26723 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30479 [1], Q = \P3.P1.InstQueue[12] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26722 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30479 [0], Q = \P3.P1.InstQueue[12] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26721 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30355 [7], Q = \P3.P1.InstQueue[11] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26720 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30355 [6], Q = \P3.P1.InstQueue[11] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26719 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30355 [5], Q = \P3.P1.InstQueue[11] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26718 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30355 [4], Q = \P3.P1.InstQueue[11] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26717 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30355 [3], Q = \P3.P1.InstQueue[11] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26716 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30355 [2], Q = \P3.P1.InstQueue[11] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26715 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30355 [1], Q = \P3.P1.InstQueue[11] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26714 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30355 [0], Q = \P3.P1.InstQueue[11] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26713 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30231 [7], Q = \P3.P1.InstQueue[10] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26712 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30231 [6], Q = \P3.P1.InstQueue[10] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26711 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30231 [5], Q = \P3.P1.InstQueue[10] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26710 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30231 [4], Q = \P3.P1.InstQueue[10] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26709 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30231 [3], Q = \P3.P1.InstQueue[10] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26708 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30231 [2], Q = \P3.P1.InstQueue[10] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26707 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30231 [1], Q = \P3.P1.InstQueue[10] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26706 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30231 [0], Q = \P3.P1.InstQueue[10] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26705 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30107 [7], Q = \P3.P1.InstQueue[9] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26704 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30107 [6], Q = \P3.P1.InstQueue[9] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26703 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30107 [5], Q = \P3.P1.InstQueue[9] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26702 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30107 [4], Q = \P3.P1.InstQueue[9] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26701 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30107 [3], Q = \P3.P1.InstQueue[9] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26700 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30107 [2], Q = \P3.P1.InstQueue[9] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26699 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30107 [1], Q = \P3.P1.InstQueue[9] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26698 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30107 [0], Q = \P3.P1.InstQueue[9] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26697 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29983 [7], Q = \P3.P1.InstQueue[8] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26696 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29983 [6], Q = \P3.P1.InstQueue[8] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26695 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29983 [5], Q = \P3.P1.InstQueue[8] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26694 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29983 [4], Q = \P3.P1.InstQueue[8] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26693 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29983 [3], Q = \P3.P1.InstQueue[8] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26692 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29983 [2], Q = \P3.P1.InstQueue[8] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26691 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29983 [1], Q = \P3.P1.InstQueue[8] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26690 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29983 [0], Q = \P3.P1.InstQueue[8] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26689 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29859 [7], Q = \P3.P1.InstQueue[7] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26688 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29859 [6], Q = \P3.P1.InstQueue[7] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26687 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29859 [5], Q = \P3.P1.InstQueue[7] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26686 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29859 [4], Q = \P3.P1.InstQueue[7] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26685 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29859 [3], Q = \P3.P1.InstQueue[7] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26684 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29859 [2], Q = \P3.P1.InstQueue[7] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26683 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29859 [1], Q = \P3.P1.InstQueue[7] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26682 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29859 [0], Q = \P3.P1.InstQueue[7] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26681 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29735 [7], Q = \P3.P1.InstQueue[6] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26680 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29735 [6], Q = \P3.P1.InstQueue[6] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26679 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29735 [5], Q = \P3.P1.InstQueue[6] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26678 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29735 [4], Q = \P3.P1.InstQueue[6] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26677 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29735 [3], Q = \P3.P1.InstQueue[6] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26676 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29735 [2], Q = \P3.P1.InstQueue[6] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26675 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29735 [1], Q = \P3.P1.InstQueue[6] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26674 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29735 [0], Q = \P3.P1.InstQueue[6] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26673 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29611 [7], Q = \P3.P1.InstQueue[5] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26672 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29611 [6], Q = \P3.P1.InstQueue[5] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26671 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29611 [5], Q = \P3.P1.InstQueue[5] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26670 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29611 [4], Q = \P3.P1.InstQueue[5] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26669 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29611 [3], Q = \P3.P1.InstQueue[5] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26668 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29611 [2], Q = \P3.P1.InstQueue[5] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26667 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29611 [1], Q = \P3.P1.InstQueue[5] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26666 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29611 [0], Q = \P3.P1.InstQueue[5] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26665 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29487 [7], Q = \P3.P1.InstQueue[4] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26664 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29487 [6], Q = \P3.P1.InstQueue[4] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26663 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29487 [5], Q = \P3.P1.InstQueue[4] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26662 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29487 [4], Q = \P3.P1.InstQueue[4] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26661 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29487 [3], Q = \P3.P1.InstQueue[4] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26660 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29487 [2], Q = \P3.P1.InstQueue[4] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26659 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29487 [1], Q = \P3.P1.InstQueue[4] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26658 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29487 [0], Q = \P3.P1.InstQueue[4] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26657 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29363 [7], Q = \P3.P1.InstQueue[3] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26656 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29363 [6], Q = \P3.P1.InstQueue[3] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26655 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29363 [5], Q = \P3.P1.InstQueue[3] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26654 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29363 [4], Q = \P3.P1.InstQueue[3] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26653 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29363 [3], Q = \P3.P1.InstQueue[3] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26652 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29363 [2], Q = \P3.P1.InstQueue[3] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26651 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29363 [1], Q = \P3.P1.InstQueue[3] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26650 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29363 [0], Q = \P3.P1.InstQueue[3] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26649 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29239 [7], Q = \P3.P1.InstQueue[2] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26648 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29239 [6], Q = \P3.P1.InstQueue[2] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26647 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29239 [5], Q = \P3.P1.InstQueue[2] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26646 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29239 [4], Q = \P3.P1.InstQueue[2] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26645 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29239 [3], Q = \P3.P1.InstQueue[2] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26644 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29239 [2], Q = \P3.P1.InstQueue[2] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26643 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29239 [1], Q = \P3.P1.InstQueue[2] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26642 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29239 [0], Q = \P3.P1.InstQueue[2] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26641 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29115 [7], Q = \P3.P1.InstQueue[1] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26640 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29115 [6], Q = \P3.P1.InstQueue[1] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26639 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29115 [5], Q = \P3.P1.InstQueue[1] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26638 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29115 [4], Q = \P3.P1.InstQueue[1] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26637 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29115 [3], Q = \P3.P1.InstQueue[1] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26636 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29115 [2], Q = \P3.P1.InstQueue[1] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26635 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29115 [1], Q = \P3.P1.InstQueue[1] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26634 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$29115 [0], Q = \P3.P1.InstQueue[1] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26633 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28991 [7], Q = \P3.P1.InstQueue[0] [7]).
Adding EN signal on $auto$ff.cc:262:slice$26632 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28991 [6], Q = \P3.P1.InstQueue[0] [6]).
Adding EN signal on $auto$ff.cc:262:slice$26631 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28991 [5], Q = \P3.P1.InstQueue[0] [5]).
Adding EN signal on $auto$ff.cc:262:slice$26630 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28991 [4], Q = \P3.P1.InstQueue[0] [4]).
Adding EN signal on $auto$ff.cc:262:slice$26629 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28991 [3], Q = \P3.P1.InstQueue[0] [3]).
Adding EN signal on $auto$ff.cc:262:slice$26628 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28991 [2], Q = \P3.P1.InstQueue[0] [2]).
Adding EN signal on $auto$ff.cc:262:slice$26627 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28991 [1], Q = \P3.P1.InstQueue[0] [1]).
Adding EN signal on $auto$ff.cc:262:slice$26626 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28991 [0], Q = \P3.P1.InstQueue[0] [0]).
Adding EN signal on $auto$ff.cc:262:slice$26625 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [31], Q = \P3.P1.InstAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$26624 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [30], Q = \P3.P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$26623 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [29], Q = \P3.P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$26622 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [28], Q = \P3.P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$26621 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [27], Q = \P3.P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$26620 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [26], Q = \P3.P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$26619 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [25], Q = \P3.P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$26618 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [24], Q = \P3.P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$26617 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [23], Q = \P3.P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$26616 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [22], Q = \P3.P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$26615 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [21], Q = \P3.P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$26614 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [20], Q = \P3.P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$26613 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [19], Q = \P3.P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$26612 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [18], Q = \P3.P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$26611 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [17], Q = \P3.P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$26610 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [16], Q = \P3.P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$26609 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [15], Q = \P3.P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$26608 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [14], Q = \P3.P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$26607 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [13], Q = \P3.P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$26606 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [12], Q = \P3.P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$26605 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [11], Q = \P3.P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$26604 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [10], Q = \P3.P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$26603 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [9], Q = \P3.P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$26602 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [8], Q = \P3.P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$26601 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [7], Q = \P3.P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$26600 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [6], Q = \P3.P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$26599 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [5], Q = \P3.P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$26598 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [4], Q = \P3.P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$26597 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [3], Q = \P3.P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$26596 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [2], Q = \P3.P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$26595 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [1], Q = \P3.P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$26594 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31950 [0], Q = \P3.P1.InstAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$26593 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [31], Q = \P3.P1.PhyAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$26592 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [30], Q = \P3.P1.PhyAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$26591 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [29], Q = \P3.P1.PhyAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$26590 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [28], Q = \P3.P1.PhyAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$26589 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [27], Q = \P3.P1.PhyAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$26588 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [26], Q = \P3.P1.PhyAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$26587 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [25], Q = \P3.P1.PhyAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$26586 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [24], Q = \P3.P1.PhyAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$26585 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [23], Q = \P3.P1.PhyAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$26584 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [22], Q = \P3.P1.PhyAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$26583 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [21], Q = \P3.P1.PhyAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$26582 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [20], Q = \P3.P1.PhyAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$26581 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [19], Q = \P3.P1.PhyAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$26580 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [18], Q = \P3.P1.PhyAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$26579 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [17], Q = \P3.P1.PhyAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$26578 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [16], Q = \P3.P1.PhyAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$26577 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [15], Q = \P3.P1.PhyAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$26576 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [14], Q = \P3.P1.PhyAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$26575 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [13], Q = \P3.P1.PhyAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$26574 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [12], Q = \P3.P1.PhyAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$26573 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [11], Q = \P3.P1.PhyAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$26572 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [10], Q = \P3.P1.PhyAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$26571 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [9], Q = \P3.P1.PhyAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$26570 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [8], Q = \P3.P1.PhyAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$26569 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [7], Q = \P3.P1.PhyAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$26568 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [6], Q = \P3.P1.PhyAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$26567 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [5], Q = \P3.P1.PhyAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$26566 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [4], Q = \P3.P1.PhyAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$26565 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [3], Q = \P3.P1.PhyAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$26564 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [2], Q = \P3.P1.PhyAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$26563 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [1], Q = \P3.P1.PhyAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$26562 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$32434 [0], Q = \P3.P1.PhyAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$26561 ($_DFF_PP0_) from module b17 (D = $auto$rtlil.cc:2459:Mux$2074, Q = \P3.P1.More).
Adding EN signal on $auto$ff.cc:262:slice$26560 ($_DFF_PP0_) from module b17 (D = $auto$rtlil.cc:2459:Mux$2060, Q = \P3.P1.Flush).
Adding EN signal on $auto$ff.cc:262:slice$26559 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [15], Q = \P3.P1.lWord [15]).
Adding EN signal on $auto$ff.cc:262:slice$26558 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [14], Q = \P3.P1.lWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$26557 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [13], Q = \P3.P1.lWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$26556 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [12], Q = \P3.P1.lWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$26555 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [11], Q = \P3.P1.lWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$26554 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [10], Q = \P3.P1.lWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$26553 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [9], Q = \P3.P1.lWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$26552 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [8], Q = \P3.P1.lWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$26551 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [7], Q = \P3.P1.lWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$26550 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [6], Q = \P3.P1.lWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$26549 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [5], Q = \P3.P1.lWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$26548 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [4], Q = \P3.P1.lWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$26547 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [3], Q = \P3.P1.lWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$26546 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [2], Q = \P3.P1.lWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$26545 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [1], Q = \P3.P1.lWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$26544 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27484 [0], Q = \P3.P1.lWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$26543 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [14], Q = \P3.P1.uWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$26542 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [13], Q = \P3.P1.uWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$26541 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [12], Q = \P3.P1.uWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$26540 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [11], Q = \P3.P1.uWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$26539 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [10], Q = \P3.P1.uWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$26538 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [9], Q = \P3.P1.uWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$26537 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [8], Q = \P3.P1.uWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$26536 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [7], Q = \P3.P1.uWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$26535 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [6], Q = \P3.P1.uWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$26534 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [5], Q = \P3.P1.uWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$26533 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [4], Q = \P3.P1.uWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$26532 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [3], Q = \P3.P1.uWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$26531 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [2], Q = \P3.P1.uWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$26530 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [1], Q = \P3.P1.uWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$26529 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$27714 [0], Q = \P3.P1.uWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$26528 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30877, Q = \P3.CodeFetch).
Adding EN signal on $auto$ff.cc:262:slice$26527 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28870 [3], Q = \P3.P1.InstQueueWr_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$26526 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28870 [2], Q = \P3.P1.InstQueueWr_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$26525 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28870 [1], Q = \P3.P1.InstQueueWr_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$26524 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28870 [0], Q = \P3.P1.InstQueueWr_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$26523 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [31], Q = \P3.EAX [31]).
Adding EN signal on $auto$ff.cc:262:slice$26522 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [30], Q = \P3.EAX [30]).
Adding EN signal on $auto$ff.cc:262:slice$26521 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [29], Q = \P3.EAX [29]).
Adding EN signal on $auto$ff.cc:262:slice$26520 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [28], Q = \P3.EAX [28]).
Adding EN signal on $auto$ff.cc:262:slice$26519 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [27], Q = \P3.EAX [27]).
Adding EN signal on $auto$ff.cc:262:slice$26518 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [26], Q = \P3.EAX [26]).
Adding EN signal on $auto$ff.cc:262:slice$26517 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [25], Q = \P3.EAX [25]).
Adding EN signal on $auto$ff.cc:262:slice$26516 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [24], Q = \P3.EAX [24]).
Adding EN signal on $auto$ff.cc:262:slice$26515 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [23], Q = \P3.EAX [23]).
Adding EN signal on $auto$ff.cc:262:slice$26514 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [22], Q = \P3.EAX [22]).
Adding EN signal on $auto$ff.cc:262:slice$26513 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [21], Q = \P3.EAX [21]).
Adding EN signal on $auto$ff.cc:262:slice$26512 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [20], Q = \P3.EAX [20]).
Adding EN signal on $auto$ff.cc:262:slice$26511 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [19], Q = \P3.EAX [19]).
Adding EN signal on $auto$ff.cc:262:slice$26510 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [18], Q = \P3.EAX [18]).
Adding EN signal on $auto$ff.cc:262:slice$26509 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [17], Q = \P3.EAX [17]).
Adding EN signal on $auto$ff.cc:262:slice$26508 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [16], Q = \P3.EAX [16]).
Adding EN signal on $auto$ff.cc:262:slice$26507 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [15], Q = \P3.EAX [15]).
Adding EN signal on $auto$ff.cc:262:slice$26506 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [14], Q = \P3.EAX [14]).
Adding EN signal on $auto$ff.cc:262:slice$26505 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [13], Q = \P3.EAX [13]).
Adding EN signal on $auto$ff.cc:262:slice$26504 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [12], Q = \P3.EAX [12]).
Adding EN signal on $auto$ff.cc:262:slice$26503 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [11], Q = \P3.EAX [11]).
Adding EN signal on $auto$ff.cc:262:slice$26502 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [10], Q = \P3.EAX [10]).
Adding EN signal on $auto$ff.cc:262:slice$26501 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [9], Q = \P3.EAX [9]).
Adding EN signal on $auto$ff.cc:262:slice$26500 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [8], Q = \P3.EAX [8]).
Adding EN signal on $auto$ff.cc:262:slice$26499 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [7], Q = \P3.EAX [7]).
Adding EN signal on $auto$ff.cc:262:slice$26498 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [6], Q = \P3.EAX [6]).
Adding EN signal on $auto$ff.cc:262:slice$26497 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [5], Q = \P3.EAX [5]).
Adding EN signal on $auto$ff.cc:262:slice$26496 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [4], Q = \P3.EAX [4]).
Adding EN signal on $auto$ff.cc:262:slice$26495 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [3], Q = \P3.EAX [3]).
Adding EN signal on $auto$ff.cc:262:slice$26494 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [2], Q = \P3.EAX [2]).
Adding EN signal on $auto$ff.cc:262:slice$26493 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [1], Q = \P3.EAX [1]).
Adding EN signal on $auto$ff.cc:262:slice$26492 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28665 [0], Q = \P3.EAX [0]).
Adding EN signal on $auto$ff.cc:262:slice$26491 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [31], Q = \P3.EBX [31]).
Adding EN signal on $auto$ff.cc:262:slice$26490 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [30], Q = \P3.EBX [30]).
Adding EN signal on $auto$ff.cc:262:slice$26489 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [29], Q = \P3.EBX [29]).
Adding EN signal on $auto$ff.cc:262:slice$26488 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [28], Q = \P3.EBX [28]).
Adding EN signal on $auto$ff.cc:262:slice$26487 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [27], Q = \P3.EBX [27]).
Adding EN signal on $auto$ff.cc:262:slice$26486 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [26], Q = \P3.EBX [26]).
Adding EN signal on $auto$ff.cc:262:slice$26485 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [25], Q = \P3.EBX [25]).
Adding EN signal on $auto$ff.cc:262:slice$26484 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [24], Q = \P3.EBX [24]).
Adding EN signal on $auto$ff.cc:262:slice$26483 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [23], Q = \P3.EBX [23]).
Adding EN signal on $auto$ff.cc:262:slice$26482 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [22], Q = \P3.EBX [22]).
Adding EN signal on $auto$ff.cc:262:slice$26481 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [21], Q = \P3.EBX [21]).
Adding EN signal on $auto$ff.cc:262:slice$26480 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [20], Q = \P3.EBX [20]).
Adding EN signal on $auto$ff.cc:262:slice$26479 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [19], Q = \P3.EBX [19]).
Adding EN signal on $auto$ff.cc:262:slice$26478 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [18], Q = \P3.EBX [18]).
Adding EN signal on $auto$ff.cc:262:slice$26477 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [17], Q = \P3.EBX [17]).
Adding EN signal on $auto$ff.cc:262:slice$26476 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [16], Q = \P3.EBX [16]).
Adding EN signal on $auto$ff.cc:262:slice$26475 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [15], Q = \P3.EBX [15]).
Adding EN signal on $auto$ff.cc:262:slice$26474 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [14], Q = \P3.EBX [14]).
Adding EN signal on $auto$ff.cc:262:slice$26473 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [13], Q = \P3.EBX [13]).
Adding EN signal on $auto$ff.cc:262:slice$26472 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [12], Q = \P3.EBX [12]).
Adding EN signal on $auto$ff.cc:262:slice$26471 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [11], Q = \P3.EBX [11]).
Adding EN signal on $auto$ff.cc:262:slice$26470 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [10], Q = \P3.EBX [10]).
Adding EN signal on $auto$ff.cc:262:slice$26469 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [9], Q = \P3.EBX [9]).
Adding EN signal on $auto$ff.cc:262:slice$26468 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [8], Q = \P3.EBX [8]).
Adding EN signal on $auto$ff.cc:262:slice$26467 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [7], Q = \P3.EBX [7]).
Adding EN signal on $auto$ff.cc:262:slice$26466 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [6], Q = \P3.EBX [6]).
Adding EN signal on $auto$ff.cc:262:slice$26465 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [5], Q = \P3.EBX [5]).
Adding EN signal on $auto$ff.cc:262:slice$26464 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [4], Q = \P3.EBX [4]).
Adding EN signal on $auto$ff.cc:262:slice$26463 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [3], Q = \P3.EBX [3]).
Adding EN signal on $auto$ff.cc:262:slice$26462 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [2], Q = \P3.EBX [2]).
Adding EN signal on $auto$ff.cc:262:slice$26461 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [1], Q = \P3.EBX [1]).
Adding EN signal on $auto$ff.cc:262:slice$26460 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$28181 [0], Q = \P3.EBX [0]).
Adding EN signal on $auto$ff.cc:262:slice$26459 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [32], Q = \P3.rEIP [31]).
Adding EN signal on $auto$ff.cc:262:slice$26458 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [30], Q = \P3.rEIP [30]).
Adding EN signal on $auto$ff.cc:262:slice$26457 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [29], Q = \P3.rEIP [29]).
Adding EN signal on $auto$ff.cc:262:slice$26456 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [28], Q = \P3.rEIP [28]).
Adding EN signal on $auto$ff.cc:262:slice$26455 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [27], Q = \P3.rEIP [27]).
Adding EN signal on $auto$ff.cc:262:slice$26454 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [26], Q = \P3.rEIP [26]).
Adding EN signal on $auto$ff.cc:262:slice$26453 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [25], Q = \P3.rEIP [25]).
Adding EN signal on $auto$ff.cc:262:slice$26452 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [24], Q = \P3.rEIP [24]).
Adding EN signal on $auto$ff.cc:262:slice$26451 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [23], Q = \P3.rEIP [23]).
Adding EN signal on $auto$ff.cc:262:slice$26450 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [22], Q = \P3.rEIP [22]).
Adding EN signal on $auto$ff.cc:262:slice$26449 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [21], Q = \P3.rEIP [21]).
Adding EN signal on $auto$ff.cc:262:slice$26448 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [20], Q = \P3.rEIP [20]).
Adding EN signal on $auto$ff.cc:262:slice$26447 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [19], Q = \P3.rEIP [19]).
Adding EN signal on $auto$ff.cc:262:slice$26446 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [18], Q = \P3.rEIP [18]).
Adding EN signal on $auto$ff.cc:262:slice$26445 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [17], Q = \P3.rEIP [17]).
Adding EN signal on $auto$ff.cc:262:slice$26444 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [16], Q = \P3.rEIP [16]).
Adding EN signal on $auto$ff.cc:262:slice$26443 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [15], Q = \P3.rEIP [15]).
Adding EN signal on $auto$ff.cc:262:slice$26442 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [14], Q = \P3.rEIP [14]).
Adding EN signal on $auto$ff.cc:262:slice$26441 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [13], Q = \P3.rEIP [13]).
Adding EN signal on $auto$ff.cc:262:slice$26440 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [12], Q = \P3.rEIP [12]).
Adding EN signal on $auto$ff.cc:262:slice$26439 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [11], Q = \P3.rEIP [11]).
Adding EN signal on $auto$ff.cc:262:slice$26438 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [10], Q = \P3.rEIP [10]).
Adding EN signal on $auto$ff.cc:262:slice$26437 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [9], Q = \P3.rEIP [9]).
Adding EN signal on $auto$ff.cc:262:slice$26436 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [8], Q = \P3.rEIP [8]).
Adding EN signal on $auto$ff.cc:262:slice$26435 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [7], Q = \P3.rEIP [7]).
Adding EN signal on $auto$ff.cc:262:slice$26434 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [6], Q = \P3.rEIP [6]).
Adding EN signal on $auto$ff.cc:262:slice$26433 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [5], Q = \P3.rEIP [5]).
Adding EN signal on $auto$ff.cc:262:slice$26432 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [4], Q = \P3.rEIP [4]).
Adding EN signal on $auto$ff.cc:262:slice$26431 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [3], Q = \P3.rEIP [3]).
Adding EN signal on $auto$ff.cc:262:slice$26430 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [2], Q = \P3.rEIP [2]).
Adding EN signal on $auto$ff.cc:262:slice$26429 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [1], Q = \P3.rEIP [1]).
Adding EN signal on $auto$ff.cc:262:slice$26428 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31401 [0], Q = \P3.rEIP [0]).
Adding EN signal on $auto$ff.cc:262:slice$26427 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30934, Q = \P3.ReadRequest).
Adding EN signal on $auto$ff.cc:262:slice$26426 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30915, Q = \P3.MemoryFetch).
Adding EN signal on $auto$ff.cc:262:slice$26425 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$30896, Q = \P3.RequestPending).
Adding EN signal on $auto$ff.cc:262:slice$25990 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14525 [1], Q = \P1.DataWidth [1]).
Adding EN signal on $auto$ff.cc:262:slice$25989 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$14525 [0], Q = \P1.DataWidth [0]).
Adding EN signal on $auto$ff.cc:262:slice$25220 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [29], Q = \P2.Address [29]).
Adding EN signal on $auto$ff.cc:262:slice$25219 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [28], Q = \P2.Address [28]).
Adding EN signal on $auto$ff.cc:262:slice$25218 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [27], Q = \P2.Address [27]).
Adding EN signal on $auto$ff.cc:262:slice$25217 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [26], Q = \P2.Address [26]).
Adding EN signal on $auto$ff.cc:262:slice$25216 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [25], Q = \P2.Address [25]).
Adding EN signal on $auto$ff.cc:262:slice$25215 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [24], Q = \P2.Address [24]).
Adding EN signal on $auto$ff.cc:262:slice$25214 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [23], Q = \P2.Address [23]).
Adding EN signal on $auto$ff.cc:262:slice$25213 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [22], Q = \P2.Address [22]).
Adding EN signal on $auto$ff.cc:262:slice$25212 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [21], Q = \P2.Address [21]).
Adding EN signal on $auto$ff.cc:262:slice$25211 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [20], Q = \P2.Address [20]).
Adding EN signal on $auto$ff.cc:262:slice$25210 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [19], Q = \P2.Address [19]).
Adding EN signal on $auto$ff.cc:262:slice$25209 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [18], Q = \P2.Address [18]).
Adding EN signal on $auto$ff.cc:262:slice$25208 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [17], Q = \P2.Address [17]).
Adding EN signal on $auto$ff.cc:262:slice$25207 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [16], Q = \P2.Address [16]).
Adding EN signal on $auto$ff.cc:262:slice$25206 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [15], Q = \P2.Address [15]).
Adding EN signal on $auto$ff.cc:262:slice$25205 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [14], Q = \P2.Address [14]).
Adding EN signal on $auto$ff.cc:262:slice$25204 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [13], Q = \P2.Address [13]).
Adding EN signal on $auto$ff.cc:262:slice$25203 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [12], Q = \P2.Address [12]).
Adding EN signal on $auto$ff.cc:262:slice$25202 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [11], Q = \P2.Address [11]).
Adding EN signal on $auto$ff.cc:262:slice$25201 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [10], Q = \P2.Address [10]).
Adding EN signal on $auto$ff.cc:262:slice$25200 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [9], Q = \P2.Address [9]).
Adding EN signal on $auto$ff.cc:262:slice$25199 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [8], Q = \P2.Address [8]).
Adding EN signal on $auto$ff.cc:262:slice$25198 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [7], Q = \P2.Address [7]).
Adding EN signal on $auto$ff.cc:262:slice$25197 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [6], Q = \P2.Address [6]).
Adding EN signal on $auto$ff.cc:262:slice$25196 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [5], Q = \P2.Address [5]).
Adding EN signal on $auto$ff.cc:262:slice$25195 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [4], Q = \P2.Address [4]).
Adding EN signal on $auto$ff.cc:262:slice$25194 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [3], Q = \P2.Address [3]).
Adding EN signal on $auto$ff.cc:262:slice$25193 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [2], Q = \P2.Address [2]).
Adding EN signal on $auto$ff.cc:262:slice$25192 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [1], Q = \P2.Address [1]).
Adding EN signal on $auto$ff.cc:262:slice$25191 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25458 [0], Q = \P2.Address [0]).
Adding EN signal on $auto$ff.cc:262:slice$25189 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25807, Q = \P2.D_C_n).
Adding EN signal on $auto$ff.cc:262:slice$25187 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25797, Q = \P2.ADS_n).
Adding EN signal on $auto$ff.cc:262:slice$25186 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25785 [2], Q = \P2.State [2]).
Adding EN signal on $auto$ff.cc:262:slice$25185 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25785 [1], Q = \P2.State [1]).
Adding EN signal on $auto$ff.cc:262:slice$25184 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25785 [0], Q = \P2.State [0]).
Adding EN signal on $auto$ff.cc:262:slice$25183 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$25731, Q = \P2.StateBS16).
Adding EN signal on $auto$ff.cc:262:slice$25182 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36529 [1], Q = \P3.DataWidth [1]).
Adding EN signal on $auto$ff.cc:262:slice$25181 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$36529 [0], Q = \P3.DataWidth [0]).
Adding EN signal on $auto$ff.cc:262:slice$16172 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20909 [3], Q = \P2.P1.State2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$16171 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20909 [2], Q = \P2.P1.State2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$16170 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20909 [1], Q = \P2.P1.State2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$16169 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20909 [0], Q = \P2.P1.State2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$16168 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20266 [7], Q = \P2.P1.InstQueue[15] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16167 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20266 [6], Q = \P2.P1.InstQueue[15] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16166 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20266 [5], Q = \P2.P1.InstQueue[15] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16165 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20266 [4], Q = \P2.P1.InstQueue[15] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16164 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20266 [3], Q = \P2.P1.InstQueue[15] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16163 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20266 [2], Q = \P2.P1.InstQueue[15] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16162 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20266 [1], Q = \P2.P1.InstQueue[15] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16161 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20266 [0], Q = \P2.P1.InstQueue[15] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16160 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20142 [7], Q = \P2.P1.InstQueue[14] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16159 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20142 [6], Q = \P2.P1.InstQueue[14] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16158 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20142 [5], Q = \P2.P1.InstQueue[14] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16157 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20142 [4], Q = \P2.P1.InstQueue[14] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16156 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20142 [3], Q = \P2.P1.InstQueue[14] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16155 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20142 [2], Q = \P2.P1.InstQueue[14] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16154 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20142 [1], Q = \P2.P1.InstQueue[14] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16153 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20142 [0], Q = \P2.P1.InstQueue[14] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16152 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20018 [7], Q = \P2.P1.InstQueue[13] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16151 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20018 [6], Q = \P2.P1.InstQueue[13] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16150 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20018 [5], Q = \P2.P1.InstQueue[13] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16149 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20018 [4], Q = \P2.P1.InstQueue[13] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16148 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20018 [3], Q = \P2.P1.InstQueue[13] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16147 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20018 [2], Q = \P2.P1.InstQueue[13] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16146 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20018 [1], Q = \P2.P1.InstQueue[13] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16145 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$20018 [0], Q = \P2.P1.InstQueue[13] [0]).
Adding EN signal on $auto$ff.cc:262:slice$16144 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19894 [7], Q = \P2.P1.InstQueue[12] [7]).
Adding EN signal on $auto$ff.cc:262:slice$16143 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19894 [6], Q = \P2.P1.InstQueue[12] [6]).
Adding EN signal on $auto$ff.cc:262:slice$16142 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19894 [5], Q = \P2.P1.InstQueue[12] [5]).
Adding EN signal on $auto$ff.cc:262:slice$16141 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19894 [4], Q = \P2.P1.InstQueue[12] [4]).
Adding EN signal on $auto$ff.cc:262:slice$16140 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19894 [3], Q = \P2.P1.InstQueue[12] [3]).
Adding EN signal on $auto$ff.cc:262:slice$16139 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19894 [2], Q = \P2.P1.InstQueue[12] [2]).
Adding EN signal on $auto$ff.cc:262:slice$16138 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19894 [1], Q = \P2.P1.InstQueue[12] [1]).
Adding EN signal on $auto$ff.cc:262:slice$16137 ($_DFF_PP0_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$19894 [0], Q = \P2.P1.InstQueue[12] [0]).

yosys> opt_clean

3.18.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 21 unused cells and 9514 unused wires.
<suppressed ~22 debug messages>

yosys> opt_expr

3.18.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~39539 debug messages>

3.18.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.18.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.18.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~159927 debug messages>
Removed a total of 53309 cells.

yosys> opt_dff

3.18.20. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$25188 ($_DFF_PP0_) from module b17 (D = \P2.MemoryFetch, Q = \P2.M_IO_n).
Adding EN signal on $auto$ff.cc:262:slice$25222 ($_DFF_PP0_) from module b17 (D = \P2.ByteEnable [1], Q = \P2.BE_n [1]).
Adding EN signal on $auto$ff.cc:262:slice$25221 ($_DFF_PP0_) from module b17 (D = \P2.ByteEnable [0], Q = \P2.BE_n [0]).
Adding EN signal on $auto$ff.cc:262:slice$25190 ($_DFF_PP0_) from module b17 (D = $flatten\P2.$verific$n398$200, Q = \P2.W_R_n).
Adding EN signal on $auto$ff.cc:262:slice$25223 ($_DFF_PP0_) from module b17 (D = \P2.ByteEnable [2], Q = \P2.BE_n [2]).
Adding EN signal on $auto$ff.cc:262:slice$25224 ($_DFF_PP0_) from module b17 (D = \P2.ByteEnable [3], Q = \P2.BE_n [3]).
Adding EN signal on $auto$ff.cc:262:slice$36028 ($_DFF_PP0_) from module b17 (D = \P3.MemoryFetch, Q = \P3.M_IO_n).
Adding EN signal on $auto$ff.cc:262:slice$36030 ($_DFF_PP0_) from module b17 (D = $flatten\P3.$verific$n398$200, Q = \P3.W_R_n).
Adding EN signal on $auto$ff.cc:262:slice$36061 ($_DFF_PP0_) from module b17 (D = \P3.ByteEnable [0], Q = \P3.BE_n [0]).
Adding EN signal on $auto$ff.cc:262:slice$36062 ($_DFF_PP0_) from module b17 (D = \P3.ByteEnable [1], Q = \P3.BE_n [1]).
Adding EN signal on $auto$ff.cc:262:slice$36063 ($_DFF_PP0_) from module b17 (D = \P3.ByteEnable [2], Q = \P3.BE_n [2]).
Adding EN signal on $auto$ff.cc:262:slice$36064 ($_DFF_PP0_) from module b17 (D = \P3.ByteEnable [3], Q = \P3.BE_n [3]).
Adding EN signal on $auto$ff.cc:262:slice$14026 ($_DFF_PP0_) from module b17 (D = $flatten\P1.$verific$n398$200, Q = \P1.W_R_n).
Adding EN signal on $auto$ff.cc:262:slice$14024 ($_DFF_PP0_) from module b17 (D = \P1.MemoryFetch, Q = \P1.M_IO_n).
Adding EN signal on $auto$ff.cc:262:slice$14057 ($_DFF_PP0_) from module b17 (D = \P1.ByteEnable [0], Q = \P1.BE_n [0]).
Adding EN signal on $auto$ff.cc:262:slice$14058 ($_DFF_PP0_) from module b17 (D = \P1.ByteEnable [1], Q = \P1.BE_n [1]).
Adding EN signal on $auto$ff.cc:262:slice$14059 ($_DFF_PP0_) from module b17 (D = \P1.ByteEnable [2], Q = \P1.BE_n [2]).
Adding EN signal on $auto$ff.cc:262:slice$14060 ($_DFF_PP0_) from module b17 (D = \P1.ByteEnable [3], Q = \P1.BE_n [3]).

yosys> opt_clean

3.18.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 36 unused cells and 46451 unused wires.
<suppressed ~37 debug messages>

yosys> opt_expr

3.18.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.18.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.18.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.18.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~99 debug messages>
Removed a total of 33 cells.

yosys> opt_dff

3.18.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.18.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 33 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.18.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.18.30. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.18.31. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18.32. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.18.33. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.18.34. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.18.35. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr

3.18.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.18.37. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.19. Executing MEMORY pass.

yosys> opt_mem

3.19.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.19.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.19.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.19.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.19.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> memory_share

3.19.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.19.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.19.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> memory_collect

3.19.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.20. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr -mux_undef

3.21. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~8488 debug messages>

yosys> simplemap

3.22. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

yosys> opt_merge

3.24. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~45 debug messages>
Removed a total of 15 cells.

yosys> opt_dff -nodffe -nosdff

3.25. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 468 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.27.9. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~357 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~84 debug messages>
Removed a total of 28 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$82926 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [1], Q = \P2.P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$82704 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [2], Q = \P2.P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$82482 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [3], Q = \P2.P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$82260 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [4], Q = \P2.P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$82038 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [5], Q = \P2.P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$81766 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [6], Q = \P2.P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$81544 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [7], Q = \P2.P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$81322 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [8], Q = \P2.P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$81100 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [9], Q = \P2.P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$80878 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [10], Q = \P2.P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$80656 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [11], Q = \P2.P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$80434 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [12], Q = \P2.P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$80162 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [13], Q = \P2.P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$79940 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [14], Q = \P2.P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$79718 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [15], Q = \P2.P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$79496 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [16], Q = \P2.P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$79274 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [17], Q = \P2.P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$79052 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [18], Q = \P2.P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$78830 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [19], Q = \P2.P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$78558 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [20], Q = \P2.P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$78336 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [21], Q = \P2.P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$78114 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [22], Q = \P2.P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$77892 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [23], Q = \P2.P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$77670 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [24], Q = \P2.P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$77448 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [25], Q = \P2.P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$77226 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [26], Q = \P2.P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$63425 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [28], Q = \P2.P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$63203 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [29], Q = \P2.P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$62981 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [30], Q = \P2.P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$62759 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [31], Q = \P2.P1.InstAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$61173 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$21300 [27], Q = \P2.P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$176170 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [1], Q = \P3.P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$175948 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [2], Q = \P3.P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$175726 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [3], Q = \P3.P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$175504 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [4], Q = \P3.P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$175282 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [5], Q = \P3.P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$175060 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [6], Q = \P3.P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$174838 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [7], Q = \P3.P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$174616 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [8], Q = \P3.P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$174394 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [9], Q = \P3.P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$174172 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [10], Q = \P3.P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$173950 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [11], Q = \P3.P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$173728 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [12], Q = \P3.P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$173506 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [13], Q = \P3.P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$173284 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [14], Q = \P3.P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$173062 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [15], Q = \P3.P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$172840 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [16], Q = \P3.P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$172618 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [17], Q = \P3.P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$172396 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [18], Q = \P3.P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$172174 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [19], Q = \P3.P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$171952 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [20], Q = \P3.P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$171730 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [21], Q = \P3.P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$171508 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [22], Q = \P3.P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$171286 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [23], Q = \P3.P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$171064 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [24], Q = \P3.P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$170842 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [25], Q = \P3.P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$170620 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [26], Q = \P3.P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$170398 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [27], Q = \P3.P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$170176 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [28], Q = \P3.P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$169954 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [29], Q = \P3.P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$169732 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [30], Q = \P3.P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$169510 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$31885 [31], Q = \P3.P1.InstAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$132308 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [1], Q = \P1.P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$132086 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [2], Q = \P1.P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$131864 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [3], Q = \P1.P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$131642 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [4], Q = \P1.P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$131420 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [5], Q = \P1.P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$131198 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [6], Q = \P1.P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$130976 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [7], Q = \P1.P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$130754 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [8], Q = \P1.P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$130532 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [9], Q = \P1.P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$130310 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [10], Q = \P1.P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$130088 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [11], Q = \P1.P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$129866 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [12], Q = \P1.P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$129644 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [13], Q = \P1.P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$129422 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [14], Q = \P1.P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$129200 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [15], Q = \P1.P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$128978 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [16], Q = \P1.P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$128756 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [17], Q = \P1.P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$128534 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [18], Q = \P1.P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$128312 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [19], Q = \P1.P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$128090 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [20], Q = \P1.P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$127868 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [21], Q = \P1.P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$127646 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [22], Q = \P1.P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$127424 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [23], Q = \P1.P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$127202 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [24], Q = \P1.P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$126980 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [25], Q = \P1.P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$126758 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [26], Q = \P1.P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$126536 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [27], Q = \P1.P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$126314 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [28], Q = \P1.P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$126092 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [29], Q = \P1.P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$125870 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [30], Q = \P1.P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$125648 ($_DFFE_PP0P_) from module b17 (D = $auto$simplemap.cc:309:simplemap_bmux$9746 [31], Q = \P1.P1.InstAddrPointer [31]).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 190 unused wires.
<suppressed ~1 debug messages>

3.28.5. Rerunning OPT passes. (Removed registers in this run.)

yosys> opt_expr -full

3.28.6. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~465 debug messages>

yosys> opt_merge

3.28.7. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
<suppressed ~1926 debug messages>
Removed a total of 642 cells.

yosys> opt_dff

3.28.8. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 645 unused wires.
<suppressed ~1 debug messages>

3.28.10. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:278:simplemap_mux$12746 in front of them:
        $auto$simplemap.cc:278:simplemap_mux$11240
        $auto$simplemap.cc:278:simplemap_mux$11623

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:278:simplemap_mux$13887 in front of them:
        $auto$simplemap.cc:278:simplemap_mux$33381
        $auto$simplemap.cc:278:simplemap_mux$33793

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:278:simplemap_mux$3867 in front of them:
        $auto$simplemap.cc:278:simplemap_mux$22704
        $auto$simplemap.cc:278:simplemap_mux$23056

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14617 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$14607
        $auto$simplemap.cc:312:simplemap_bmux$14604

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$25781 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$25771
        $auto$simplemap.cc:312:simplemap_bmux$25768

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$36589 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$36579
        $auto$simplemap.cc:312:simplemap_bmux$36576


yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 6 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.
<suppressed ~6 debug messages>

3.30.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce -full

3.30.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.30.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_share

3.30.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.30.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce -full

3.30.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.30.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_share

3.30.22. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr -full

3.30.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.30.26. Finished OPT passes. (There is nothing left to do.)

yosys> techmap

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
No more expansions possible.
<suppressed ~77 debug messages>

yosys> opt

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.32.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Extracting gate netlist of module `\b17' to `<abc-temp-dir>/input.blif'..
Extracted 17123 gates and 18458 wires to a netlist network with 1333 inputs and 1432 outputs.

3.33.1.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/yosys_verific_rs/result_09-03-2022T20-36-44/All_lut_synth_rs_area.json/b17/abc_tmp.scr 
ABC: netlist  : i/o =   1333/   1432  and =   30940  lev =   63 (23.51)  mem = 0.42 MB
ABC: Mapping (K=6)  :  lut =   5462  edge =   24614  lev =   28 (9.26)  mem = 0.26 MB
ABC: netlist  : i/o =   1333/   1432  and =   30812  lev =   63 (23.49)  mem = 0.42 MB
ABC: Mapping (K=6)  :  lut =   5234  edge =   23595  lev =   22 (9.03)  mem = 0.26 MB
ABC: netlist  : i/o =   1333/   1432  and =   30286  lev =   61 (23.51)  mem = 0.41 MB
ABC: Mapping (K=6)  :  lut =   5132  edge =   23141  lev =   23 (9.05)  mem = 0.25 MB
ABC: netlist  : i/o =   1333/   1432  and =   30408  lev =   55 (20.15)  mem = 0.42 MB
ABC: Mapping (K=6)  :  lut =   4992  edge =   22889  lev =   22 (8.83)  mem = 0.25 MB
ABC: netlist  : i/o =   1333/   1432  and =   29250  lev =   64 (22.85)  mem = 0.40 MB
ABC: Mapping (K=6)  :  lut =   4990  edge =   22582  lev =   21 (8.87)  mem = 0.25 MB
ABC: netlist  : i/o =   1333/   1432  and =   29273  lev =   61 (23.18)  mem = 0.52 MB
ABC: Mapping (K=6)  :  lut =   4739  edge =   22366  lev =   21 (8.11)  mem = 0.24 MB
ABC: netlist  : i/o =   1333/   1432  and =   29146  lev =   61 (22.80)  mem = 0.52 MB
ABC: Mapping (K=6)  :  lut =   4669  edge =   22198  lev =   21 (8.12)  mem = 0.24 MB
ABC: netlist  : i/o =   1333/   1432  and =   29062  lev =   57 (22.81)  mem = 0.52 MB
ABC: Mapping (K=6)  :  lut =   4653  edge =   22081  lev =   20 (8.24)  mem = 0.24 MB
ABC: netlist  : i/o =   1333/   1432  and =   28940  lev =   57 (20.51)  mem = 0.52 MB
ABC: Mapping (K=6)  :  lut =   4618  edge =   21839  lev =   21 (8.29)  mem = 0.24 MB
ABC: netlist  : i/o =   1333/   1432  and =   28830  lev =   64 (21.56)  mem = 0.52 MB
ABC: Mapping (K=6)  :  lut =   4559  edge =   21418  lev =   21 (8.27)  mem = 0.24 MB
ABC: netlist  : i/o =   1333/   1432  and =   28262  lev =   64 (22.51)  mem = 0.51 MB
ABC: Mapping (K=6)  :  lut =   4495  edge =   21226  lev =   20 (8.12)  mem = 0.23 MB
ABC: netlist  : i/o =   1333/   1432  and =   28976  lev =   63 (21.58)  mem = 0.52 MB
ABC: Mapping (K=6)  :  lut =   4475  edge =   21286  lev =   20 (8.03)  mem = 0.24 MB
ABC: netlist  : i/o =   1333/   1432  and =   28739  lev =   61 (22.69)  mem = 0.52 MB
ABC: Mapping (K=6)  :  lut =   4469  edge =   21233  lev =   20 (8.03)  mem = 0.24 MB
ABC: netlist  : i/o =   1333/   1432  and =   28739  lev =   61 (22.69)  mem = 0.40 MB
ABC: Mapping (K=6)  :  lut =   4469  edge =   21233  lev =   20 (8.03)  mem = 0.24 MB
ABC: netlist  : i/o =   1333/   1432  and =   28739  lev =   61 (22.69)  mem = 0.52 MB
ABC: Mapping (K=6)  :  lut =   4469  edge =   21233  lev =   20 (8.03)  mem = 0.24 MB
ABC: netlist  : i/o =   1333/   1432  and =   29064  lev =   61 (22.67)  mem = 0.40 MB
ABC: Mapping (K=6)  :  lut =   4469  edge =   21233  lev =   20 (8.03)  mem = 0.24 MB
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     4485
ABC RESULTS:        internal signals:    15693
ABC RESULTS:           input signals:     1333
ABC RESULTS:          output signals:     1432
Removing temp directory.

yosys> opt

3.34. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.34.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

yosys> opt_merge -nomux

3.34.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.34.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.34.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.34.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.34.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.34.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 6446 unused wires.
<suppressed ~9 debug messages>

yosys> opt_expr

3.34.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.34.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.34.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b17..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.34.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b17.
Performed a total of 0 changes.

yosys> opt_merge

3.34.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b17'.
Removed a total of 0 cells.

yosys> opt_dff

3.34.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.34.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..

yosys> opt_expr

3.34.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b17.

3.34.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.35. Executing HIERARCHY pass (managing design hierarchy).

3.35.1. Analyzing design hierarchy..
Top module:  \b17

3.35.2. Analyzing design hierarchy..
Top module:  \b17
Removed 0 unused modules.

yosys> stat

3.36. Printing statistics.

=== b17 ===

   Number of wires:               4640
   Number of wire bits:           6347
   Number of public wires:         191
   Number of public wire bits:    1898
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               5790
     $_DFFE_PP0P_                 1307
     $_DFF_PP0_                      4
     $lut                         4479


yosys> opt_clean -purge

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b17..
Removed 0 unused cells and 47 unused wires.
<suppressed ~47 debug messages>

yosys> write_verilog -noattr -nohex b17.verilog

3.38. Executing Verilog backend.

yosys> bmuxmap

3.38.1. Executing BMUXMAP pass.

yosys> demuxmap

3.38.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\b17'.

End of script. Logfile hash: 9e1d634687, CPU: user 122.56s system 0.67s, MEM: 260.30 MB peak
Yosys 0.14+36 (git sha1 15a4e900b, gcc 7.1.0 -fPIC -Os)
Time spent: 49% 1x abc (121 sec), 26% 32x opt_dff (65 sec), ...
