
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.14+36 (git sha1 4cd3e3b51, gcc 7.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl b20.vhd

yosys> verific -vhdl b20.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'b20.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-INFO [VHDL-1012] b20.vhd:1: analyzing entity 'b14'
VERIFIC-INFO [VHDL-1010] b20.vhd:11: analyzing architecture 'behav'
VERIFIC-INFO [VHDL-1012] b20.vhd:511: analyzing entity 'b14rev'
VERIFIC-INFO [VHDL-1010] b20.vhd:521: analyzing architecture 'behav'
VERIFIC-INFO [VHDL-1012] b20.vhd:1021: analyzing entity 'b20'
VERIFIC-INFO [VHDL-1010] b20.vhd:1029: analyzing architecture 'behav'

yosys> synth_rs -top b20 -tech genesis -goal area -de -no_dsp -no_bram -verilog b20.verilog

3. Executing synth_rs pass.

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dff'.
Generating RTLIL representation for module `\dffn'.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top b20

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] b20.vhd:1021: processing 'b20(BEHAV)'
VERIFIC-INFO [VHDL-1067] b20.vhd:1: processing 'b14(BEHAV)'
VERIFIC-INFO [VHDL-1172] b20.vhd:478: 'others' clause is never selected
VERIFIC-INFO [VHDL-1067] b20.vhd:511: processing 'b14rev(BEHAV)'
VERIFIC-INFO [VHDL-1172] b20.vhd:988: 'others' clause is never selected
Importing module standard.
Importing module b20.
Importing module b14(BEHAV).
Importing module b14rev(BEHAV).

3.3.1. Analyzing design hierarchy..
Top module:  \b20
Used module:     \b14rev(BEHAV)
Used module:     \b14(BEHAV)

3.3.2. Analyzing design hierarchy..
Top module:  \b20
Used module:     \b14rev(BEHAV)
Used module:     \b14(BEHAV)
Removing unused module `\standard'.
Removed 1 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module b14(BEHAV).
<suppressed ~26 debug messages>
Optimizing module b20.
Optimizing module b14rev(BEHAV).
<suppressed ~26 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module b14(BEHAV).
Deleting now unused module b14rev(BEHAV).
<suppressed ~2 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.
<suppressed ~13 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 14 unused cells and 343 unused wires.
<suppressed ~117 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module b20...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
    dead port 2/2 on $mux $flatten\P1.$verific$i684$b20.vhd:501$532.
    dead port 2/2 on $mux $flatten\P1.$verific$mux_672$b20.vhd:501$523.
    dead port 2/2 on $mux $flatten\P1.$verific$mux_685$b20.vhd:501$534.
    dead port 2/2 on $mux $flatten\P2.$verific$i653$b20.vhd:1011$1052.
    dead port 2/2 on $mux $flatten\P2.$verific$mux_641$b20.vhd:1011$1043.
    dead port 2/2 on $mux $flatten\P2.$verific$mux_654$b20.vhd:1011$1054.
Removed 6 multiplexer ports.
<suppressed ~52 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_746$b20.vhd:486$485: { $flatten\P1.$verific$n2255$116 $auto$opt_reduce.cc:134:opt_pmux$1096 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_750$b20.vhd:486$426: { $flatten\P1.$verific$n2256$117 $auto$opt_reduce.cc:134:opt_pmux$1098 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_751$b20.vhd:486$503: { $flatten\P1.$verific$n2257$118 $auto$opt_reduce.cc:134:opt_pmux$1100 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_752$b20.vhd:486$504: { $flatten\P1.$verific$n2258$119 $auto$opt_reduce.cc:134:opt_pmux$1102 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_494$b20.vhd:953$999: { $flatten\P2.$verific$n2118$618 $auto$opt_reduce.cc:134:opt_pmux$1104 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_495$b20.vhd:953$1000: { $flatten\P2.$verific$n2120$620 $auto$opt_reduce.cc:134:opt_pmux$1106 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_496$b20.vhd:953$1001: { $flatten\P2.$verific$n2119$619 $auto$opt_reduce.cc:134:opt_pmux$1108 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_497$b20.vhd:953$1002: { $flatten\P2.$verific$n2121$621 $auto$opt_reduce.cc:134:opt_pmux$1110 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_534$b20.vhd:973$1005: { $flatten\P2.$verific$n2121$621 $auto$opt_reduce.cc:134:opt_pmux$1112 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_535$b20.vhd:973$1006: { $flatten\P2.$verific$n2119$619 $auto$opt_reduce.cc:134:opt_pmux$1114 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_536$b20.vhd:973$1007: { $flatten\P2.$verific$n2120$620 $auto$opt_reduce.cc:134:opt_pmux$1116 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_537$b20.vhd:973$1008: { $flatten\P2.$verific$n2118$618 $auto$opt_reduce.cc:134:opt_pmux$1118 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_617$b20.vhd:996$1019: { $flatten\P2.$verific$n2121$621 $auto$opt_reduce.cc:134:opt_pmux$1120 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_618$b20.vhd:996$1020: { $flatten\P2.$verific$n2120$620 $auto$opt_reduce.cc:134:opt_pmux$1122 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_619$b20.vhd:996$1021: { $flatten\P2.$verific$n2119$619 $auto$opt_reduce.cc:134:opt_pmux$1124 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_620$b20.vhd:996$1022: { $flatten\P2.$verific$n2118$618 $auto$opt_reduce.cc:134:opt_pmux$1126 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_717$b20.vhd:873$990: { $flatten\P2.$verific$n2118$618 $auto$opt_reduce.cc:134:opt_pmux$1128 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_718$b20.vhd:873$996: { $flatten\P2.$verific$n2119$619 $auto$opt_reduce.cc:134:opt_pmux$1130 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_719$b20.vhd:873$997: { $flatten\P2.$verific$n2120$620 $auto$opt_reduce.cc:134:opt_pmux$1132 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_720$b20.vhd:873$998: { $flatten\P2.$verific$n2121$621 $auto$opt_reduce.cc:134:opt_pmux$1134 }
  Optimizing cells in module \b20.
Performed a total of 20 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
<suppressed ~36 debug messages>
Removed a total of 12 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\P2.$verific$wr_reg$b20.vhd:1015$1089 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P2.$verific$state_reg$b20.vhd:1015$1091 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P2.$verific$reg3_reg$b20.vhd:1015$1086 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P2.$verific$reg2_reg$b20.vhd:1015$1085 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P2.$verific$reg1_reg$b20.vhd:1015$1084 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P2.$verific$reg0_reg$b20.vhd:1015$1083 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P2.$verific$rd_reg$b20.vhd:1015$1088 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P1.$verific$B_reg$b20.vhd:505$562 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P2.$verific$datao_reg$b20.vhd:1015$1090 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P2.$verific$addr_reg$b20.vhd:1015$1087 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P2.$verific$IR_reg$b20.vhd:1015$1080 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P2.$verific$B_reg$b20.vhd:1015$1082 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P1.$verific$wr_reg$b20.vhd:505$569 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P1.$verific$state_reg$b20.vhd:505$571 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P1.$verific$reg3_reg$b20.vhd:505$566 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P1.$verific$reg2_reg$b20.vhd:505$565 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P1.$verific$reg1_reg$b20.vhd:505$564 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P1.$verific$reg0_reg$b20.vhd:505$563 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P1.$verific$rd_reg$b20.vhd:505$568 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P1.$verific$IR_reg$b20.vhd:505$560 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P1.$verific$datao_reg$b20.vhd:505$570 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($aldff) from module b20.
Changing const-value async load to async reset on $flatten\P1.$verific$addr_reg$b20.vhd:505$567 ($aldff) from module b20.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 20 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~52 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).
Found FSM state register b20.P1.d.
Found FSM state register b20.P2.d.

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).
Extracting FSM `\P1.d' from module `\b20'.
  found $adff cell for state register: $flatten\P1.$verific$d_reg$b20.vhd:505$561
  root of input selection tree: $flatten\P1.$verific$n11472$366
  found reset state: 0 (from async reset)
  found ctrl input: \P1.state
  found ctrl input: $flatten\P1.$verific$n341$212 [0]
  found ctrl input: $flatten\P1.$verific$n10346$183
  found ctrl input: $flatten\P1.$verific$n1405$110
  found ctrl input: $flatten\P1.$verific$n1440$111
  found ctrl input: $flatten\P1.$verific$n1474$112
  found ctrl input: $flatten\P1.$verific$n1475$113
  found ctrl input: $flatten\P1.$verific$n1476$114
  found ctrl input: $flatten\P1.$verific$n1477$115
  found state code: 1
  found state code: 2
  found state code: 3
  found ctrl input: \P1.B
  ctrl inputs: { \P1.B \P1.state $flatten\P1.$verific$n1405$110 $flatten\P1.$verific$n1440$111 $flatten\P1.$verific$n1474$112 $flatten\P1.$verific$n1475$113 $flatten\P1.$verific$n1476$114 $flatten\P1.$verific$n1477$115 $flatten\P1.$verific$n10346$183 $flatten\P1.$verific$n341$212 [0] }
  ctrl outputs: $flatten\P1.$verific$n11472$366
  transition:          0 10'-0-------- ->          0 0
  transition:          0 10'-100000000 ->          0 0
  transition:          0 10'-100000100 ->          0 0
  transition:          0 10'-100001-00 ->          1 1
  transition:          0 10'-10001--00 ->          2 2
  transition:          0 10'-1001---00 ->          3 3
  transition:          0 10'0101----00 ->          0 0
  transition:          0 10'1101----00 ->          3 3
  transition:          0 10'011-----00 ->          3 3
  transition:          0 10'111-----00 ->          0 0
  transition:          0 10'-1------10 ->          0 0
  transition:          0 10'-1-------1 ->          0 0
  transition:          2 10'-0-------- ->          2 2
  transition:          2 10'-100000000 ->          2 2
  transition:          2 10'-100000100 ->          0 0
  transition:          2 10'-100001-00 ->          1 1
  transition:          2 10'-10001--00 ->          2 2
  transition:          2 10'-1001---00 ->          3 3
  transition:          2 10'0101----00 ->          2 2
  transition:          2 10'1101----00 ->          3 3
  transition:          2 10'011-----00 ->          3 3
  transition:          2 10'111-----00 ->          2 2
  transition:          2 10'-1------10 ->          2 2
  transition:          2 10'-1-------1 ->          2 2
  transition:          1 10'-0-------- ->          1 1
  transition:          1 10'-100000000 ->          1 1
  transition:          1 10'-100000100 ->          0 0
  transition:          1 10'-100001-00 ->          1 1
  transition:          1 10'-10001--00 ->          2 2
  transition:          1 10'-1001---00 ->          3 3
  transition:          1 10'0101----00 ->          1 1
  transition:          1 10'1101----00 ->          3 3
  transition:          1 10'011-----00 ->          3 3
  transition:          1 10'111-----00 ->          1 1
  transition:          1 10'-1------10 ->          1 1
  transition:          1 10'-1-------1 ->          1 1
  transition:          3 10'-0-------- ->          3 3
  transition:          3 10'-100000000 ->          3 3
  transition:          3 10'-100000100 ->          0 0
  transition:          3 10'-100001-00 ->          1 1
  transition:          3 10'-10001--00 ->          2 2
  transition:          3 10'-1001---00 ->          3 3
  transition:          3 10'0101----00 ->          3 3
  transition:          3 10'1101----00 ->          3 3
  transition:          3 10'011-----00 ->          3 3
  transition:          3 10'111-----00 ->          3 3
  transition:          3 10'-1------10 ->          3 3
  transition:          3 10'-1-------1 ->          3 3
Extracting FSM `\P2.d' from module `\b20'.
  found $adff cell for state register: $flatten\P2.$verific$d_reg$b20.vhd:1015$1081
  root of input selection tree: $flatten\P2.$verific$n11328$869
  found reset state: 0 (from async reset)
  found ctrl input: \P2.state
  found ctrl input: $flatten\P2.$verific$n341$712 [0]
  found ctrl input: $flatten\P2.$verific$n10195$685
  found ctrl input: $flatten\P2.$verific$n1406$612
  found ctrl input: $flatten\P2.$verific$n1441$613
  found ctrl input: $flatten\P2.$verific$n1475$614
  found ctrl input: $flatten\P2.$verific$n1476$615
  found ctrl input: $flatten\P2.$verific$n1477$616
  found ctrl input: $flatten\P2.$verific$n1478$617
  found state code: 1
  found state code: 2
  found state code: 3
  found ctrl input: \P2.B
  ctrl inputs: { \P2.B \P2.state $flatten\P2.$verific$n1406$612 $flatten\P2.$verific$n1441$613 $flatten\P2.$verific$n1475$614 $flatten\P2.$verific$n1476$615 $flatten\P2.$verific$n1477$616 $flatten\P2.$verific$n1478$617 $flatten\P2.$verific$n10195$685 $flatten\P2.$verific$n341$712 [0] }
  ctrl outputs: $flatten\P2.$verific$n11328$869
  transition:          0 10'-0-------- ->          0 0
  transition:          0 10'-100000000 ->          0 0
  transition:          0 10'-100000100 ->          0 0
  transition:          0 10'-100001-00 ->          1 1
  transition:          0 10'-10001--00 ->          2 2
  transition:          0 10'-1001---00 ->          3 3
  transition:          0 10'0101----00 ->          0 0
  transition:          0 10'1101----00 ->          3 3
  transition:          0 10'011-----00 ->          3 3
  transition:          0 10'111-----00 ->          0 0
  transition:          0 10'-1------10 ->          0 0
  transition:          0 10'-1-------1 ->          0 0
  transition:          2 10'-0-------- ->          2 2
  transition:          2 10'-100000000 ->          2 2
  transition:          2 10'-100000100 ->          0 0
  transition:          2 10'-100001-00 ->          1 1
  transition:          2 10'-10001--00 ->          2 2
  transition:          2 10'-1001---00 ->          3 3
  transition:          2 10'0101----00 ->          2 2
  transition:          2 10'1101----00 ->          3 3
  transition:          2 10'011-----00 ->          3 3
  transition:          2 10'111-----00 ->          2 2
  transition:          2 10'-1------10 ->          2 2
  transition:          2 10'-1-------1 ->          2 2
  transition:          1 10'-0-------- ->          1 1
  transition:          1 10'-100000000 ->          1 1
  transition:          1 10'-100000100 ->          0 0
  transition:          1 10'-100001-00 ->          1 1
  transition:          1 10'-10001--00 ->          2 2
  transition:          1 10'-1001---00 ->          3 3
  transition:          1 10'0101----00 ->          1 1
  transition:          1 10'1101----00 ->          3 3
  transition:          1 10'011-----00 ->          3 3
  transition:          1 10'111-----00 ->          1 1
  transition:          1 10'-1------10 ->          1 1
  transition:          1 10'-1-------1 ->          1 1
  transition:          3 10'-0-------- ->          3 3
  transition:          3 10'-100000000 ->          3 3
  transition:          3 10'-100000100 ->          0 0
  transition:          3 10'-100001-00 ->          1 1
  transition:          3 10'-10001--00 ->          2 2
  transition:          3 10'-1001---00 ->          3 3
  transition:          3 10'0101----00 ->          3 3
  transition:          3 10'1101----00 ->          3 3
  transition:          3 10'011-----00 ->          3 3
  transition:          3 10'111-----00 ->          3 3
  transition:          3 10'-1------10 ->          3 3
  transition:          3 10'-1-------1 ->          3 3

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\P2.d$1137' from module `\b20'.
  Merging pattern 10'-100000000 and 10'-100000100 from group (0 0 0).
  Merging pattern 10'-100000100 and 10'-100000000 from group (0 0 0).
  Merging pattern 10'0101----00 and 10'1101----00 from group (3 3 3).
  Merging pattern 10'1101----00 and 10'0101----00 from group (3 3 3).
  Merging pattern 10'011-----00 and 10'111-----00 from group (3 3 3).
  Merging pattern 10'111-----00 and 10'011-----00 from group (3 3 3).
Optimizing FSM `$fsm$\P1.d$1135' from module `\b20'.
  Merging pattern 10'-100000000 and 10'-100000100 from group (0 0 0).
  Merging pattern 10'-100000100 and 10'-100000000 from group (0 0 0).
  Merging pattern 10'0101----00 and 10'1101----00 from group (3 3 3).
  Merging pattern 10'1101----00 and 10'0101----00 from group (3 3 3).
  Merging pattern 10'011-----00 and 10'111-----00 from group (3 3 3).
  Merging pattern 10'111-----00 and 10'011-----00 from group (3 3 3).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 6 unused cells and 6 unused wires.
<suppressed ~7 debug messages>

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\P1.d$1135' from module `\b20'.
Optimizing FSM `$fsm$\P2.d$1137' from module `\b20'.

yosys> fsm_recode

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).
Recoding FSM `$fsm$\P1.d$1135' from module `\b20' using `auto' encoding:
  mapping auto encoding to `one-hot` for this FSM.
  00000000000000000000000000000000 -> ---1
  00000000000000000000000000000010 -> --1-
  00000000000000000000000000000001 -> -1--
  00000000000000000000000000000011 -> 1---
Recoding FSM `$fsm$\P2.d$1137' from module `\b20' using `auto' encoding:
  mapping auto encoding to `one-hot` for this FSM.
  00000000000000000000000000000000 -> ---1
  00000000000000000000000000000010 -> --1-
  00000000000000000000000000000001 -> -1--
  00000000000000000000000000000011 -> 1---

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

FSM `$fsm$\P1.d$1135' from module `b20':
-------------------------------------

  Information on FSM $fsm$\P1.d$1135 (\P1.d):

  Number of input signals:   10
  Number of output signals:  32
  Number of state bits:       4

  Input signals:
    0: $flatten\P1.$verific$n341$212 [0]
    1: $flatten\P1.$verific$n10346$183
    2: $flatten\P1.$verific$n1477$115
    3: $flatten\P1.$verific$n1476$114
    4: $flatten\P1.$verific$n1475$113
    5: $flatten\P1.$verific$n1474$112
    6: $flatten\P1.$verific$n1440$111
    7: $flatten\P1.$verific$n1405$110
    8: \P1.state
    9: \P1.B

  Output signals:
    0: $flatten\P1.$verific$n11472$366 [0]
    1: $flatten\P1.$verific$n11472$366 [1]
    2: $flatten\P1.$verific$n11472$366 [2]
    3: $flatten\P1.$verific$n11472$366 [3]
    4: $flatten\P1.$verific$n11472$366 [4]
    5: $flatten\P1.$verific$n11472$366 [5]
    6: $flatten\P1.$verific$n11472$366 [6]
    7: $flatten\P1.$verific$n11472$366 [7]
    8: $flatten\P1.$verific$n11472$366 [8]
    9: $flatten\P1.$verific$n11472$366 [9]
   10: $flatten\P1.$verific$n11472$366 [10]
   11: $flatten\P1.$verific$n11472$366 [11]
   12: $flatten\P1.$verific$n11472$366 [12]
   13: $flatten\P1.$verific$n11472$366 [13]
   14: $flatten\P1.$verific$n11472$366 [14]
   15: $flatten\P1.$verific$n11472$366 [15]
   16: $flatten\P1.$verific$n11472$366 [16]
   17: $flatten\P1.$verific$n11472$366 [17]
   18: $flatten\P1.$verific$n11472$366 [18]
   19: $flatten\P1.$verific$n11472$366 [19]
   20: $flatten\P1.$verific$n11472$366 [20]
   21: $flatten\P1.$verific$n11472$366 [21]
   22: $flatten\P1.$verific$n11472$366 [22]
   23: $flatten\P1.$verific$n11472$366 [23]
   24: $flatten\P1.$verific$n11472$366 [24]
   25: $flatten\P1.$verific$n11472$366 [25]
   26: $flatten\P1.$verific$n11472$366 [26]
   27: $flatten\P1.$verific$n11472$366 [27]
   28: $flatten\P1.$verific$n11472$366 [28]
   29: $flatten\P1.$verific$n11472$366 [29]
   30: $flatten\P1.$verific$n11472$366 [30]
   31: $flatten\P1.$verific$n11472$366 [31]

  State encoding:
    0:     4'---1  <RESET STATE>
    1:     4'--1-
    2:     4'-1--
    3:     4'1---

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 10'-100000-00   ->     0 0
      1:     0 10'0101----00   ->     0 0
      2:     0 10'111-----00   ->     0 0
      3:     0 10'-1------10   ->     0 0
      4:     0 10'-1-------1   ->     0 0
      5:     0 10'-0--------   ->     0 0
      6:     0 10'-10001--00   ->     1 2
      7:     0 10'-100001-00   ->     2 1
      8:     0 10'-1001---00   ->     3 3
      9:     0 10'1101----00   ->     3 3
     10:     0 10'011-----00   ->     3 3
     11:     1 10'-100000100   ->     0 0
     12:     1 10'-100000000   ->     1 2
     13:     1 10'-10001--00   ->     1 2
     14:     1 10'0101----00   ->     1 2
     15:     1 10'111-----00   ->     1 2
     16:     1 10'-1------10   ->     1 2
     17:     1 10'-1-------1   ->     1 2
     18:     1 10'-0--------   ->     1 2
     19:     1 10'-100001-00   ->     2 1
     20:     1 10'-1001---00   ->     3 3
     21:     1 10'1101----00   ->     3 3
     22:     1 10'011-----00   ->     3 3
     23:     2 10'-100000100   ->     0 0
     24:     2 10'-10001--00   ->     1 2
     25:     2 10'-100000000   ->     2 1
     26:     2 10'-100001-00   ->     2 1
     27:     2 10'0101----00   ->     2 1
     28:     2 10'111-----00   ->     2 1
     29:     2 10'-1------10   ->     2 1
     30:     2 10'-1-------1   ->     2 1
     31:     2 10'-0--------   ->     2 1
     32:     2 10'-1001---00   ->     3 3
     33:     2 10'1101----00   ->     3 3
     34:     2 10'011-----00   ->     3 3
     35:     3 10'-100000100   ->     0 0
     36:     3 10'-10001--00   ->     1 2
     37:     3 10'-100001-00   ->     2 1
     38:     3 10'-100000000   ->     3 3
     39:     3 10'-1001---00   ->     3 3
     40:     3 10'-101----00   ->     3 3
     41:     3 10'-11-----00   ->     3 3
     42:     3 10'-1------10   ->     3 3
     43:     3 10'-1-------1   ->     3 3
     44:     3 10'-0--------   ->     3 3

-------------------------------------

FSM `$fsm$\P2.d$1137' from module `b20':
-------------------------------------

  Information on FSM $fsm$\P2.d$1137 (\P2.d):

  Number of input signals:   10
  Number of output signals:  32
  Number of state bits:       4

  Input signals:
    0: $flatten\P2.$verific$n341$712 [0]
    1: $flatten\P2.$verific$n10195$685
    2: $flatten\P2.$verific$n1478$617
    3: $flatten\P2.$verific$n1477$616
    4: $flatten\P2.$verific$n1476$615
    5: $flatten\P2.$verific$n1475$614
    6: $flatten\P2.$verific$n1441$613
    7: $flatten\P2.$verific$n1406$612
    8: \P2.state
    9: \P2.B

  Output signals:
    0: $flatten\P2.$verific$n11328$869 [0]
    1: $flatten\P2.$verific$n11328$869 [1]
    2: $flatten\P2.$verific$n11328$869 [2]
    3: $flatten\P2.$verific$n11328$869 [3]
    4: $flatten\P2.$verific$n11328$869 [4]
    5: $flatten\P2.$verific$n11328$869 [5]
    6: $flatten\P2.$verific$n11328$869 [6]
    7: $flatten\P2.$verific$n11328$869 [7]
    8: $flatten\P2.$verific$n11328$869 [8]
    9: $flatten\P2.$verific$n11328$869 [9]
   10: $flatten\P2.$verific$n11328$869 [10]
   11: $flatten\P2.$verific$n11328$869 [11]
   12: $flatten\P2.$verific$n11328$869 [12]
   13: $flatten\P2.$verific$n11328$869 [13]
   14: $flatten\P2.$verific$n11328$869 [14]
   15: $flatten\P2.$verific$n11328$869 [15]
   16: $flatten\P2.$verific$n11328$869 [16]
   17: $flatten\P2.$verific$n11328$869 [17]
   18: $flatten\P2.$verific$n11328$869 [18]
   19: $flatten\P2.$verific$n11328$869 [19]
   20: $flatten\P2.$verific$n11328$869 [20]
   21: $flatten\P2.$verific$n11328$869 [21]
   22: $flatten\P2.$verific$n11328$869 [22]
   23: $flatten\P2.$verific$n11328$869 [23]
   24: $flatten\P2.$verific$n11328$869 [24]
   25: $flatten\P2.$verific$n11328$869 [25]
   26: $flatten\P2.$verific$n11328$869 [26]
   27: $flatten\P2.$verific$n11328$869 [27]
   28: $flatten\P2.$verific$n11328$869 [28]
   29: $flatten\P2.$verific$n11328$869 [29]
   30: $flatten\P2.$verific$n11328$869 [30]
   31: $flatten\P2.$verific$n11328$869 [31]

  State encoding:
    0:     4'---1  <RESET STATE>
    1:     4'--1-
    2:     4'-1--
    3:     4'1---

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 10'-100000-00   ->     0 0
      1:     0 10'0101----00   ->     0 0
      2:     0 10'111-----00   ->     0 0
      3:     0 10'-1------10   ->     0 0
      4:     0 10'-1-------1   ->     0 0
      5:     0 10'-0--------   ->     0 0
      6:     0 10'-10001--00   ->     1 2
      7:     0 10'-100001-00   ->     2 1
      8:     0 10'-1001---00   ->     3 3
      9:     0 10'1101----00   ->     3 3
     10:     0 10'011-----00   ->     3 3
     11:     1 10'-100000100   ->     0 0
     12:     1 10'-100000000   ->     1 2
     13:     1 10'-10001--00   ->     1 2
     14:     1 10'0101----00   ->     1 2
     15:     1 10'111-----00   ->     1 2
     16:     1 10'-1------10   ->     1 2
     17:     1 10'-1-------1   ->     1 2
     18:     1 10'-0--------   ->     1 2
     19:     1 10'-100001-00   ->     2 1
     20:     1 10'-1001---00   ->     3 3
     21:     1 10'1101----00   ->     3 3
     22:     1 10'011-----00   ->     3 3
     23:     2 10'-100000100   ->     0 0
     24:     2 10'-10001--00   ->     1 2
     25:     2 10'-100000000   ->     2 1
     26:     2 10'-100001-00   ->     2 1
     27:     2 10'0101----00   ->     2 1
     28:     2 10'111-----00   ->     2 1
     29:     2 10'-1------10   ->     2 1
     30:     2 10'-1-------1   ->     2 1
     31:     2 10'-0--------   ->     2 1
     32:     2 10'-1001---00   ->     3 3
     33:     2 10'1101----00   ->     3 3
     34:     2 10'011-----00   ->     3 3
     35:     3 10'-100000100   ->     0 0
     36:     3 10'-10001--00   ->     1 2
     37:     3 10'-100001-00   ->     2 1
     38:     3 10'-100000000   ->     3 3
     39:     3 10'-1001---00   ->     3 3
     40:     3 10'-101----00   ->     3 3
     41:     3 10'-11-----00   ->     3 3
     42:     3 10'-1------10   ->     3 3
     43:     3 10'-1-------1   ->     3 3
     44:     3 10'-0--------   ->     3 3

-------------------------------------

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).
Mapping FSM `$fsm$\P1.d$1135' from module `\b20'.
Mapping FSM `$fsm$\P2.d$1137' from module `\b20'.

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.
<suppressed ~12 debug messages>

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
<suppressed ~324 debug messages>
Removed a total of 108 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~50 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\P2.$verific$reg3_reg$b20.vhd:1015$1086 ($adff) from module b20 (D = $flatten\P2.$verific$n11034$864, Q = \P2.reg3).
Adding EN signal on $flatten\P2.$verific$reg2_reg$b20.vhd:1015$1085 ($adff) from module b20 (D = $flatten\P2.$verific$n10128$837, Q = \P2.reg2).
Adding EN signal on $flatten\P2.$verific$reg1_reg$b20.vhd:1015$1084 ($adff) from module b20 (D = $flatten\P2.$verific$n10095$836, Q = \P2.reg1).
Adding EN signal on $flatten\P2.$verific$reg0_reg$b20.vhd:1015$1083 ($adff) from module b20 (D = $flatten\P2.$verific$n10062$835, Q = \P2.reg0).
Adding EN signal on $flatten\P2.$verific$datao_reg$b20.vhd:1015$1090 ($adff) from module b20 (D = { $flatten\P2.$verific$add_540$b20.vhd:976$1011 $flatten\P2.$verific$n10370$847 [0] }, Q = \P2.datao).
Adding EN signal on $flatten\P2.$verific$B_reg$b20.vhd:1015$1082 ($adff) from module b20 (D = $flatten\P2.$verific$n10835$691, Q = \P2.B).
Adding EN signal on $flatten\P1.$verific$reg3_reg$b20.vhd:505$566 ($adff) from module b20 (D = $flatten\P1.$verific$n10312$336 [2:0], Q = \P1.reg3 [2:0]).
Adding EN signal on $flatten\P1.$verific$reg3_reg$b20.vhd:505$566 ($adff) from module b20 (D = $flatten\P1.$verific$n11178$361 [31:3], Q = \P1.reg3 [31:3]).
Adding EN signal on $flatten\P1.$verific$reg2_reg$b20.vhd:505$565 ($adff) from module b20 (D = $flatten\P1.$verific$n10279$335, Q = \P1.reg2).
Adding EN signal on $flatten\P1.$verific$reg1_reg$b20.vhd:505$564 ($adff) from module b20 (D = $flatten\P1.$verific$n10246$334, Q = \P1.reg1).
Adding EN signal on $flatten\P1.$verific$reg0_reg$b20.vhd:505$563 ($adff) from module b20 (D = $flatten\P1.$verific$n10213$333, Q = \P1.reg0).
Adding EN signal on $flatten\P1.$verific$datao_reg$b20.vhd:505$570 ($adff) from module b20 (D = { $flatten\P1.$verific$add_570$b20.vhd:466$494 $flatten\P1.$verific$n10514$344 [0] }, Q = \P1.datao).
Adding EN signal on $flatten\P1.$verific$B_reg$b20.vhd:505$562 ($adff) from module b20 (D = $flatten\P1.$verific$n10979$191, Q = \P1.B).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 28 unused cells and 140 unused wires.
<suppressed ~29 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~42 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
<suppressed ~51 debug messages>
Removed a total of 17 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 2 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 3 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 4 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 5 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 6 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 7 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 8 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 9 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 10 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 11 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 12 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 13 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 14 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 15 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 16 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 17 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 18 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 19 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 20 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 21 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 22 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 23 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 24 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 25 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 26 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 27 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 28 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 29 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 30 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 31 on $flatten\P1.$verific$d_reg$b20.vhd:505$561 ($adff) from module b20.
Setting constant 0-bit at position 2 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 3 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 4 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 5 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 6 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 7 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 8 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 9 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 10 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 11 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 12 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 13 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 14 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 15 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 16 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 17 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 18 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 19 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 20 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 21 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 22 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 23 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 24 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 25 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 26 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 27 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 28 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 29 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 30 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.
Setting constant 0-bit at position 31 on $flatten\P2.$verific$d_reg$b20.vhd:1015$1081 ($adff) from module b20.

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 17 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.13.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~42 debug messages>

yosys> opt_reduce

3.13.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.13.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..

yosys> opt_expr

3.13.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.13.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 20) from port A of cell b20.$verific$LessThan_16$b20.vhd:1076$61 ($lt).
Removed top 1 bits (of 20) from port A of cell b20.$verific$LessThan_17$b20.vhd:1076$62 ($lt).
Removed top 1 bits (of 5) from port B of cell b20.$auto$fsm_map.cc:77:implement_pattern_cache$1325 ($eq).
Removed top 1 bits (of 6) from port B of cell b20.$auto$fsm_map.cc:77:implement_pattern_cache$1315 ($eq).
Removed top 3 bits (of 33) from port Y of cell b20.$flatten\P1.$verific$sub_365$b20.vhd:358$488 ($sub).
Removed top 3 bits (of 33) from port A of cell b20.$flatten\P1.$verific$sub_365$b20.vhd:358$488 ($sub).
Removed top 3 bits (of 33) from port B of cell b20.$flatten\P1.$verific$sub_365$b20.vhd:358$488 ($sub).
Removed top 2 bits (of 32) from port Y of cell b20.$flatten\P1.$verific$add_283$b20.vhd:318$486 ($add).
Removed top 2 bits (of 32) from port A of cell b20.$flatten\P1.$verific$add_283$b20.vhd:318$486 ($add).
Removed top 2 bits (of 32) from port B of cell b20.$flatten\P1.$verific$add_283$b20.vhd:318$486 ($add).
Removed top 30 bits (of 32) from port A of cell b20.$flatten\P1.$verific$equal_179$b20.vhd:246$480 ($eq).
Removed top 30 bits (of 32) from port A of cell b20.$flatten\P1.$verific$equal_178$b20.vhd:245$479 ($eq).
Removed top 31 bits (of 32) from port A of cell b20.$flatten\P1.$verific$equal_177$b20.vhd:244$478 ($eq).
Removed top 32 bits (of 33) from port A of cell b20.$flatten\P1.$verific$sub_168$b20.vhd:243$475 ($sub).
Removed top 1 bits (of 33) from port Y of cell b20.$flatten\P1.$verific$sub_168$b20.vhd:243$475 ($sub).
Removed top 1 bits (of 33) from port B of cell b20.$flatten\P1.$verific$sub_168$b20.vhd:243$475 ($sub).
Removed top 30 bits (of 32) from mux cell b20.$flatten\P1.$verific$mux_145$b20.vhd:226$469 ($mux).
Removed top 2 bits (of 3) from port A of cell b20.$flatten\P1.$verific$equal_143$b20.vhd:224$467 ($eq).
Removed top 1 bits (of 3) from port A of cell b20.$flatten\P1.$verific$equal_142$b20.vhd:223$466 ($eq).
Removed top 1 bits (of 3) from port A of cell b20.$flatten\P1.$verific$equal_141$b20.vhd:221$465 ($eq).
Removed top 30 bits (of 32) from mux cell b20.$flatten\P1.$verific$mux_140$b20.vhd:220$464 ($mux).
Removed top 30 bits (of 32) from mux cell b20.$flatten\P1.$verific$mux_138$b20.vhd:216$462 ($mux).
Removed top 2 bits (of 33) from port B of cell b20.$flatten\P1.$verific$sub_84$b20.vhd:149$444 ($sub).
Removed top 1 bits (of 33) from port Y of cell b20.$flatten\P1.$verific$sub_84$b20.vhd:149$444 ($sub).
Removed top 1 bits (of 33) from port A of cell b20.$flatten\P1.$verific$sub_84$b20.vhd:149$444 ($sub).
Removed top 1 bits (of 32) from port B of cell b20.$flatten\P1.$verific$LessThan_83$b20.vhd:148$443 ($lt).
Removed top 12 bits (of 32) from port A of cell b20.$flatten\P1.$verific$add_61$b20.vhd:113$431 ($add).
Removed top 12 bits (of 32) from port Y of cell b20.$flatten\P1.$verific$add_61$b20.vhd:113$431 ($add).
Removed top 12 bits (of 32) from port B of cell b20.$flatten\P1.$verific$add_61$b20.vhd:113$431 ($add).
Removed top 12 bits (of 32) from port A of cell b20.$flatten\P1.$verific$add_56$b20.vhd:110$429 ($add).
Removed top 12 bits (of 32) from port Y of cell b20.$flatten\P1.$verific$add_56$b20.vhd:110$429 ($add).
Removed top 12 bits (of 32) from port B of cell b20.$flatten\P1.$verific$add_56$b20.vhd:110$429 ($add).
Removed top 1 bits (of 3) from port Y of cell b20.$flatten\P1.$verific$add_44$b20.vhd:96$421 ($add).
Removed top 1 bits (of 3) from port A of cell b20.$flatten\P1.$verific$add_44$b20.vhd:96$421 ($add).
Removed top 25 bits (of 26) from port B of cell b20.$flatten\P1.$verific$add_39$b20.vhd:95$417 ($add).
Removed top 8 bits (of 9) from port Y of cell b20.$flatten\P1.$verific$add_36$b20.vhd:92$411 ($add).
Removed top 8 bits (of 9) from port A of cell b20.$flatten\P1.$verific$add_36$b20.vhd:92$411 ($add).
Removed top 1 bits (of 6) from port B of cell b20.$auto$fsm_map.cc:77:implement_pattern_cache$1529 ($eq).
Removed top 9 bits (of 13) from port Y of cell b20.$flatten\P1.$verific$add_31$b20.vhd:90$404 ($add).
Removed top 9 bits (of 13) from port A of cell b20.$flatten\P1.$verific$add_31$b20.vhd:90$404 ($add).
Removed top 5 bits (of 8) from port Y of cell b20.$flatten\P1.$verific$add_26$b20.vhd:88$397 ($add).
Removed top 5 bits (of 8) from port A of cell b20.$flatten\P1.$verific$add_26$b20.vhd:88$397 ($add).
Removed top 3 bits (of 5) from port Y of cell b20.$flatten\P1.$verific$add_21$b20.vhd:86$390 ($add).
Removed top 3 bits (of 5) from port A of cell b20.$flatten\P1.$verific$add_21$b20.vhd:86$390 ($add).
Removed top 1 bits (of 33) from port Y of cell b20.$flatten\P1.$verific$unary_minus_15$b20.vhd:84$384 ($neg).
Removed top 1 bits (of 33) from port A of cell b20.$flatten\P1.$verific$unary_minus_15$b20.vhd:84$384 ($neg).
Removed top 1 bits (of 32) from port A of cell b20.$flatten\P1.$verific$LessThan_14$b20.vhd:83$383 ($lt).
Removed top 1 bits (of 5) from port B of cell b20.$auto$fsm_map.cc:77:implement_pattern_cache$1539 ($eq).
Removed top 3 bits (of 29) from FF cell b20.$auto$ff.cc:262:slice$1606 ($adffe).
Removed top 1 bits (of 21) from port A of cell b20.$flatten\P2.$verific$sub_634$b20.vhd:1004$1035 ($sub).
Removed top 1 bits (of 21) from port B of cell b20.$flatten\P2.$verific$sub_634$b20.vhd:1004$1035 ($sub).
Removed top 1 bits (of 21) from port A of cell b20.$flatten\P2.$verific$sub_632$b20.vhd:1003$1032 ($sub).
Removed top 1 bits (of 21) from port B of cell b20.$flatten\P2.$verific$sub_632$b20.vhd:1003$1032 ($sub).
Removed top 3 bits (of 32) from FF cell b20.$auto$ff.cc:262:slice$1567 ($adffe).
Removed top 2 bits (of 32) from port Y of cell b20.$flatten\P2.$verific$add_331$b20.vhd:868$993 ($add).
Removed top 2 bits (of 32) from port A of cell b20.$flatten\P2.$verific$add_331$b20.vhd:868$993 ($add).
Removed top 2 bits (of 32) from port B of cell b20.$flatten\P2.$verific$add_331$b20.vhd:868$993 ($add).
Removed top 3 bits (of 33) from port Y of cell b20.$flatten\P2.$verific$sub_297$b20.vhd:848$991 ($sub).
Removed top 3 bits (of 33) from port A of cell b20.$flatten\P2.$verific$sub_297$b20.vhd:848$991 ($sub).
Removed top 3 bits (of 33) from port B of cell b20.$flatten\P2.$verific$sub_297$b20.vhd:848$991 ($sub).
Removed top 30 bits (of 32) from port A of cell b20.$flatten\P2.$verific$equal_171$b20.vhd:756$983 ($eq).
Removed top 30 bits (of 32) from port A of cell b20.$flatten\P2.$verific$equal_170$b20.vhd:755$982 ($eq).
Removed top 31 bits (of 32) from port A of cell b20.$flatten\P2.$verific$equal_169$b20.vhd:754$981 ($eq).
Removed top 30 bits (of 32) from mux cell b20.$flatten\P2.$verific$mux_143$b20.vhd:736$972 ($mux).
Removed top 2 bits (of 3) from port A of cell b20.$flatten\P2.$verific$equal_141$b20.vhd:734$970 ($eq).
Removed top 1 bits (of 3) from port A of cell b20.$flatten\P2.$verific$equal_140$b20.vhd:733$969 ($eq).
Removed top 1 bits (of 3) from port A of cell b20.$flatten\P2.$verific$equal_139$b20.vhd:731$968 ($eq).
Removed top 30 bits (of 32) from mux cell b20.$flatten\P2.$verific$mux_138$b20.vhd:730$967 ($mux).
Removed top 30 bits (of 32) from mux cell b20.$flatten\P2.$verific$mux_136$b20.vhd:726$965 ($mux).
Removed top 2 bits (of 33) from port B of cell b20.$flatten\P2.$verific$sub_82$b20.vhd:659$947 ($sub).
Removed top 1 bits (of 33) from port Y of cell b20.$flatten\P2.$verific$sub_82$b20.vhd:659$947 ($sub).
Removed top 1 bits (of 33) from port A of cell b20.$flatten\P2.$verific$sub_82$b20.vhd:659$947 ($sub).
Removed top 1 bits (of 32) from port B of cell b20.$flatten\P2.$verific$LessThan_81$b20.vhd:658$946 ($lt).
Removed top 13 bits (of 33) from port A of cell b20.$flatten\P2.$verific$sub_59$b20.vhd:623$934 ($sub).
Removed top 13 bits (of 33) from port Y of cell b20.$flatten\P2.$verific$sub_59$b20.vhd:623$934 ($sub).
Removed top 13 bits (of 33) from port B of cell b20.$flatten\P2.$verific$sub_59$b20.vhd:623$934 ($sub).
Removed top 13 bits (of 33) from port A of cell b20.$flatten\P2.$verific$sub_55$b20.vhd:620$932 ($sub).
Removed top 13 bits (of 33) from port Y of cell b20.$flatten\P2.$verific$sub_55$b20.vhd:620$932 ($sub).
Removed top 13 bits (of 33) from port B of cell b20.$flatten\P2.$verific$sub_55$b20.vhd:620$932 ($sub).
Removed top 1 bits (of 3) from port Y of cell b20.$flatten\P2.$verific$add_44$b20.vhd:606$924 ($add).
Removed top 1 bits (of 3) from port A of cell b20.$flatten\P2.$verific$add_44$b20.vhd:606$924 ($add).
Removed top 1 bits (of 30) from port A of cell b20.$flatten\P2.$verific$sub_39$b20.vhd:605$920 ($sub).
Removed top 26 bits (of 30) from port B of cell b20.$flatten\P2.$verific$sub_39$b20.vhd:605$920 ($sub).
Removed top 8 bits (of 9) from port Y of cell b20.$flatten\P2.$verific$add_36$b20.vhd:602$914 ($add).
Removed top 8 bits (of 9) from port A of cell b20.$flatten\P2.$verific$add_36$b20.vhd:602$914 ($add).
Removed top 9 bits (of 13) from port Y of cell b20.$flatten\P2.$verific$add_31$b20.vhd:600$907 ($add).
Removed top 9 bits (of 13) from port A of cell b20.$flatten\P2.$verific$add_31$b20.vhd:600$907 ($add).
Removed top 5 bits (of 8) from port Y of cell b20.$flatten\P2.$verific$add_26$b20.vhd:598$900 ($add).
Removed top 5 bits (of 8) from port A of cell b20.$flatten\P2.$verific$add_26$b20.vhd:598$900 ($add).
Removed top 3 bits (of 5) from port Y of cell b20.$flatten\P2.$verific$add_21$b20.vhd:596$893 ($add).
Removed top 3 bits (of 5) from port A of cell b20.$flatten\P2.$verific$add_21$b20.vhd:596$893 ($add).
Removed top 1 bits (of 33) from port Y of cell b20.$flatten\P2.$verific$unary_minus_15$b20.vhd:594$887 ($neg).
Removed top 1 bits (of 33) from port A of cell b20.$flatten\P2.$verific$unary_minus_15$b20.vhd:594$887 ($neg).
Removed top 1 bits (of 32) from port A of cell b20.$flatten\P2.$verific$LessThan_14$b20.vhd:593$886 ($lt).
Removed top 3 bits (of 32) from mux cell b20.$flatten\P1.$verific$mux_698$b20.vhd:502$544 ($mux).
Removed top 3 bits (of 32) from mux cell b20.$flatten\P2.$verific$mux_667$b20.vhd:1012$1064 ($mux).
Removed top 3 bits (of 32) from mux cell b20.$flatten\P1.$verific$mux_679$b20.vhd:501$530 ($mux).
Removed top 3 bits (of 32) from mux cell b20.$flatten\P2.$verific$mux_648$b20.vhd:1011$1050 ($mux).
Removed top 20 bits (of 21) from wire b20.$flatten\P1.$verific$n10477$341.
Removed top 3 bits (of 32) from wire b20.$flatten\P1.$verific$n10755$352.
Removed top 3 bits (of 32) from wire b20.$flatten\P1.$verific$n11178$361.
Removed top 30 bits (of 32) from wire b20.$flatten\P1.$verific$n11472$366.
Removed top 30 bits (of 32) from wire b20.$flatten\P1.$verific$n1407$234.
Removed top 30 bits (of 32) from wire b20.$flatten\P1.$verific$n1441$235.
Removed top 30 bits (of 32) from wire b20.$flatten\P1.$verific$n1478$236.
Removed top 1 bits (of 33) from wire b20.$flatten\P1.$verific$n184$203.
Removed top 1 bits (of 33) from wire b20.$flatten\P1.$verific$n1987$247.
Removed top 3 bits (of 5) from wire b20.$flatten\P1.$verific$n288$206.
Removed top 6 bits (of 8) from wire b20.$flatten\P1.$verific$n301$208.
Removed top 9 bits (of 13) from wire b20.$flatten\P1.$verific$n318$210.
Removed top 8 bits (of 9) from wire b20.$flatten\P1.$verific$n341$212.
Removed top 2 bits (of 32) from wire b20.$flatten\P1.$verific$n4241$280.
Removed top 1 bits (of 3) from wire b20.$flatten\P1.$verific$n436$216.
Removed top 3 bits (of 33) from wire b20.$flatten\P1.$verific$n5666$294.
Removed top 1 bits (of 32) from wire b20.$flatten\P1.$verific$n862$229.
Removed top 1 bits (of 33) from wire b20.$flatten\P1.$verific$n933$231.
Removed top 1 bits (of 21) from wire b20.$flatten\P2.$verific$n10326$845.
Removed top 3 bits (of 32) from wire b20.$flatten\P2.$verific$n10611$855.
Removed top 3 bits (of 32) from wire b20.$flatten\P2.$verific$n11034$864.
Removed top 30 bits (of 32) from wire b20.$flatten\P2.$verific$n11328$869.
Removed top 30 bits (of 32) from wire b20.$flatten\P2.$verific$n1408$734.
Removed top 31 bits (of 32) from wire b20.$flatten\P2.$verific$n1442$735.
Removed top 30 bits (of 32) from wire b20.$flatten\P2.$verific$n1479$736.
Removed top 1 bits (of 33) from wire b20.$flatten\P2.$verific$n184$703.
Removed top 1 bits (of 3) from wire b20.$flatten\P2.$verific$n439$716.
Removed top 3 bits (of 33) from wire b20.$flatten\P2.$verific$n4798$778.
Removed top 2 bits (of 32) from wire b20.$flatten\P2.$verific$n5506$788.
Removed top 1 bits (of 33) from wire b20.$flatten\P2.$verific$n934$731.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 40 unused cells and 137 unused wires.
<suppressed ~41 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module b20:
  creating $macc model for $flatten\P1.$verific$add_21$b20.vhd:86$390 ($add).
  creating $macc model for $flatten\P1.$verific$add_26$b20.vhd:88$397 ($add).
  creating $macc model for $flatten\P1.$verific$add_283$b20.vhd:318$486 ($add).
  creating $macc model for $flatten\P1.$verific$add_31$b20.vhd:90$404 ($add).
  creating $macc model for $flatten\P1.$verific$add_36$b20.vhd:92$411 ($add).
  creating $macc model for $flatten\P1.$verific$add_39$b20.vhd:95$417 ($add).
  creating $macc model for $flatten\P1.$verific$add_44$b20.vhd:96$421 ($add).
  creating $macc model for $flatten\P1.$verific$add_56$b20.vhd:110$429 ($add).
  creating $macc model for $flatten\P1.$verific$add_570$b20.vhd:466$493 ($add).
  creating $macc model for $flatten\P1.$verific$add_61$b20.vhd:113$431 ($add).
  creating $macc model for $flatten\P1.$verific$add_662$b20.vhd:493$513 ($add).
  creating $macc model for $flatten\P1.$verific$add_664$b20.vhd:494$515 ($add).
  creating $macc model for $flatten\P1.$verific$mult_667$b20.vhd:497$519 ($mul).
  creating $macc model for $flatten\P1.$verific$sub_168$b20.vhd:243$475 ($sub).
  creating $macc model for $flatten\P1.$verific$sub_365$b20.vhd:358$488 ($sub).
  creating $macc model for $flatten\P1.$verific$sub_84$b20.vhd:149$444 ($sub).
  creating $macc model for $flatten\P1.$verific$unary_minus_15$b20.vhd:84$384 ($neg).
  creating $macc model for $flatten\P2.$verific$add_21$b20.vhd:596$893 ($add).
  creating $macc model for $flatten\P2.$verific$add_26$b20.vhd:598$900 ($add).
  creating $macc model for $flatten\P2.$verific$add_31$b20.vhd:600$907 ($add).
  creating $macc model for $flatten\P2.$verific$add_331$b20.vhd:868$993 ($add).
  creating $macc model for $flatten\P2.$verific$add_36$b20.vhd:602$914 ($add).
  creating $macc model for $flatten\P2.$verific$add_44$b20.vhd:606$924 ($add).
  creating $macc model for $flatten\P2.$verific$add_540$b20.vhd:976$1010 ($add).
  creating $macc model for $flatten\P2.$verific$sub_297$b20.vhd:848$991 ($sub).
  creating $macc model for $flatten\P2.$verific$sub_39$b20.vhd:605$920 ($sub).
  creating $macc model for $flatten\P2.$verific$sub_55$b20.vhd:620$932 ($sub).
  creating $macc model for $flatten\P2.$verific$sub_59$b20.vhd:623$934 ($sub).
  creating $macc model for $flatten\P2.$verific$sub_632$b20.vhd:1003$1032 ($sub).
  creating $macc model for $flatten\P2.$verific$sub_634$b20.vhd:1004$1035 ($sub).
  creating $macc model for $flatten\P2.$verific$sub_82$b20.vhd:659$947 ($sub).
  creating $macc model for $flatten\P2.$verific$unary_minus_15$b20.vhd:594$887 ($neg).
  creating $macc model for $verific$add_24$b20.vhd:1077$66 ($add).
  creating $macc model for $verific$add_3$b20.vhd:1068$48 ($add).
  creating $macc model for $verific$add_30$b20.vhd:1081$68 ($add).
  creating $alu model for $macc $verific$add_30$b20.vhd:1081$68.
  creating $alu model for $macc $verific$add_3$b20.vhd:1068$48.
  creating $alu model for $macc $verific$add_24$b20.vhd:1077$66.
  creating $alu model for $macc $flatten\P2.$verific$unary_minus_15$b20.vhd:594$887.
  creating $alu model for $macc $flatten\P2.$verific$sub_82$b20.vhd:659$947.
  creating $alu model for $macc $flatten\P2.$verific$sub_634$b20.vhd:1004$1035.
  creating $alu model for $macc $flatten\P2.$verific$sub_632$b20.vhd:1003$1032.
  creating $alu model for $macc $flatten\P2.$verific$sub_59$b20.vhd:623$934.
  creating $alu model for $macc $flatten\P2.$verific$sub_55$b20.vhd:620$932.
  creating $alu model for $macc $flatten\P2.$verific$sub_39$b20.vhd:605$920.
  creating $alu model for $macc $flatten\P2.$verific$sub_297$b20.vhd:848$991.
  creating $alu model for $macc $flatten\P2.$verific$add_540$b20.vhd:976$1010.
  creating $alu model for $macc $flatten\P2.$verific$add_44$b20.vhd:606$924.
  creating $alu model for $macc $flatten\P2.$verific$add_36$b20.vhd:602$914.
  creating $alu model for $macc $flatten\P2.$verific$add_331$b20.vhd:868$993.
  creating $alu model for $macc $flatten\P2.$verific$add_31$b20.vhd:600$907.
  creating $alu model for $macc $flatten\P2.$verific$add_26$b20.vhd:598$900.
  creating $alu model for $macc $flatten\P2.$verific$add_21$b20.vhd:596$893.
  creating $alu model for $macc $flatten\P1.$verific$unary_minus_15$b20.vhd:84$384.
  creating $alu model for $macc $flatten\P1.$verific$sub_84$b20.vhd:149$444.
  creating $alu model for $macc $flatten\P1.$verific$sub_365$b20.vhd:358$488.
  creating $alu model for $macc $flatten\P1.$verific$sub_168$b20.vhd:243$475.
  creating $alu model for $macc $flatten\P1.$verific$add_664$b20.vhd:494$515.
  creating $alu model for $macc $flatten\P1.$verific$add_662$b20.vhd:493$513.
  creating $alu model for $macc $flatten\P1.$verific$add_61$b20.vhd:113$431.
  creating $alu model for $macc $flatten\P1.$verific$add_570$b20.vhd:466$493.
  creating $alu model for $macc $flatten\P1.$verific$add_56$b20.vhd:110$429.
  creating $alu model for $macc $flatten\P1.$verific$add_44$b20.vhd:96$421.
  creating $alu model for $macc $flatten\P1.$verific$add_39$b20.vhd:95$417.
  creating $alu model for $macc $flatten\P1.$verific$add_36$b20.vhd:92$411.
  creating $alu model for $macc $flatten\P1.$verific$add_31$b20.vhd:90$404.
  creating $alu model for $macc $flatten\P1.$verific$add_283$b20.vhd:318$486.
  creating $alu model for $macc $flatten\P1.$verific$add_26$b20.vhd:88$397.
  creating $alu model for $macc $flatten\P1.$verific$add_21$b20.vhd:86$390.
  creating $macc cell for $flatten\P1.$verific$mult_667$b20.vhd:497$519: $auto$alumacc.cc:365:replace_macc$1830
  creating $alu model for $flatten\P1.$verific$LessThan_14$b20.vhd:83$383 ($lt): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_68$b20.vhd:118$437 ($lt): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_78$b20.vhd:138$441 ($lt): merged with $flatten\P1.$verific$LessThan_68$b20.vhd:118$437.
  creating $alu model for $flatten\P1.$verific$LessThan_83$b20.vhd:148$443 ($lt): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_87$b20.vhd:151$448 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_14$b20.vhd:593$886 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_66$b20.vhd:628$940 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_76$b20.vhd:648$944 ($lt): merged with $flatten\P2.$verific$LessThan_66$b20.vhd:628$940.
  creating $alu model for $flatten\P2.$verific$LessThan_81$b20.vhd:658$946 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_85$b20.vhd:661$951 ($lt): new $alu
  creating $alu model for $verific$LessThan_11$b20.vhd:1075$56 ($lt): new $alu
  creating $alu model for $verific$LessThan_12$b20.vhd:1075$57 ($lt): new $alu
  creating $alu model for $verific$LessThan_16$b20.vhd:1076$61 ($lt): new $alu
  creating $alu model for $verific$LessThan_17$b20.vhd:1076$62 ($lt): new $alu
  creating $alu cell for $verific$LessThan_17$b20.vhd:1076$62: $auto$alumacc.cc:485:replace_alu$1843
  creating $alu cell for $verific$LessThan_16$b20.vhd:1076$61: $auto$alumacc.cc:485:replace_alu$1848
  creating $alu cell for $verific$LessThan_12$b20.vhd:1075$57: $auto$alumacc.cc:485:replace_alu$1853
  creating $alu cell for $verific$LessThan_11$b20.vhd:1075$56: $auto$alumacc.cc:485:replace_alu$1858
  creating $alu cell for $flatten\P2.$verific$LessThan_85$b20.vhd:661$951: $auto$alumacc.cc:485:replace_alu$1863
  creating $alu cell for $flatten\P2.$verific$LessThan_81$b20.vhd:658$946: $auto$alumacc.cc:485:replace_alu$1868
  creating $alu cell for $flatten\P2.$verific$LessThan_66$b20.vhd:628$940, $flatten\P2.$verific$LessThan_76$b20.vhd:648$944: $auto$alumacc.cc:485:replace_alu$1879
  creating $alu cell for $flatten\P2.$verific$LessThan_14$b20.vhd:593$886: $auto$alumacc.cc:485:replace_alu$1890
  creating $alu cell for $flatten\P1.$verific$LessThan_87$b20.vhd:151$448: $auto$alumacc.cc:485:replace_alu$1895
  creating $alu cell for $flatten\P1.$verific$LessThan_83$b20.vhd:148$443: $auto$alumacc.cc:485:replace_alu$1906
  creating $alu cell for $flatten\P1.$verific$LessThan_68$b20.vhd:118$437, $flatten\P1.$verific$LessThan_78$b20.vhd:138$441: $auto$alumacc.cc:485:replace_alu$1917
  creating $alu cell for $flatten\P1.$verific$LessThan_14$b20.vhd:83$383: $auto$alumacc.cc:485:replace_alu$1928
  creating $alu cell for $flatten\P1.$verific$add_21$b20.vhd:86$390: $auto$alumacc.cc:485:replace_alu$1933
  creating $alu cell for $flatten\P1.$verific$add_26$b20.vhd:88$397: $auto$alumacc.cc:485:replace_alu$1936
  creating $alu cell for $flatten\P1.$verific$add_283$b20.vhd:318$486: $auto$alumacc.cc:485:replace_alu$1939
  creating $alu cell for $flatten\P1.$verific$add_31$b20.vhd:90$404: $auto$alumacc.cc:485:replace_alu$1942
  creating $alu cell for $flatten\P1.$verific$add_36$b20.vhd:92$411: $auto$alumacc.cc:485:replace_alu$1945
  creating $alu cell for $flatten\P1.$verific$add_39$b20.vhd:95$417: $auto$alumacc.cc:485:replace_alu$1948
  creating $alu cell for $flatten\P1.$verific$add_44$b20.vhd:96$421: $auto$alumacc.cc:485:replace_alu$1951
  creating $alu cell for $flatten\P1.$verific$add_570$b20.vhd:466$493: $auto$alumacc.cc:485:replace_alu$1954
  creating $alu cell for $flatten\P1.$verific$add_56$b20.vhd:110$429: $auto$alumacc.cc:485:replace_alu$1957
  creating $alu cell for $flatten\P1.$verific$add_662$b20.vhd:493$513: $auto$alumacc.cc:485:replace_alu$1960
  creating $alu cell for $flatten\P1.$verific$add_61$b20.vhd:113$431: $auto$alumacc.cc:485:replace_alu$1963
  creating $alu cell for $flatten\P1.$verific$add_664$b20.vhd:494$515: $auto$alumacc.cc:485:replace_alu$1966
  creating $alu cell for $flatten\P1.$verific$sub_168$b20.vhd:243$475: $auto$alumacc.cc:485:replace_alu$1969
  creating $alu cell for $flatten\P1.$verific$sub_365$b20.vhd:358$488: $auto$alumacc.cc:485:replace_alu$1972
  creating $alu cell for $flatten\P1.$verific$sub_84$b20.vhd:149$444: $auto$alumacc.cc:485:replace_alu$1975
  creating $alu cell for $flatten\P1.$verific$unary_minus_15$b20.vhd:84$384: $auto$alumacc.cc:485:replace_alu$1978
  creating $alu cell for $flatten\P2.$verific$add_21$b20.vhd:596$893: $auto$alumacc.cc:485:replace_alu$1981
  creating $alu cell for $flatten\P2.$verific$add_26$b20.vhd:598$900: $auto$alumacc.cc:485:replace_alu$1984
  creating $alu cell for $flatten\P2.$verific$add_31$b20.vhd:600$907: $auto$alumacc.cc:485:replace_alu$1987
  creating $alu cell for $flatten\P2.$verific$add_331$b20.vhd:868$993: $auto$alumacc.cc:485:replace_alu$1990
  creating $alu cell for $flatten\P2.$verific$add_36$b20.vhd:602$914: $auto$alumacc.cc:485:replace_alu$1993
  creating $alu cell for $flatten\P2.$verific$add_44$b20.vhd:606$924: $auto$alumacc.cc:485:replace_alu$1996
  creating $alu cell for $flatten\P2.$verific$add_540$b20.vhd:976$1010: $auto$alumacc.cc:485:replace_alu$1999
  creating $alu cell for $flatten\P2.$verific$sub_297$b20.vhd:848$991: $auto$alumacc.cc:485:replace_alu$2002
  creating $alu cell for $flatten\P2.$verific$sub_39$b20.vhd:605$920: $auto$alumacc.cc:485:replace_alu$2005
  creating $alu cell for $flatten\P2.$verific$sub_55$b20.vhd:620$932: $auto$alumacc.cc:485:replace_alu$2008
  creating $alu cell for $flatten\P2.$verific$sub_59$b20.vhd:623$934: $auto$alumacc.cc:485:replace_alu$2011
  creating $alu cell for $flatten\P2.$verific$sub_632$b20.vhd:1003$1032: $auto$alumacc.cc:485:replace_alu$2014
  creating $alu cell for $flatten\P2.$verific$sub_634$b20.vhd:1004$1035: $auto$alumacc.cc:485:replace_alu$2017
  creating $alu cell for $flatten\P2.$verific$sub_82$b20.vhd:659$947: $auto$alumacc.cc:485:replace_alu$2020
  creating $alu cell for $flatten\P2.$verific$unary_minus_15$b20.vhd:594$887: $auto$alumacc.cc:485:replace_alu$2023
  creating $alu cell for $verific$add_24$b20.vhd:1077$66: $auto$alumacc.cc:485:replace_alu$2026
  creating $alu cell for $verific$add_3$b20.vhd:1068$48: $auto$alumacc.cc:485:replace_alu$2029
  creating $alu cell for $verific$add_30$b20.vhd:1081$68: $auto$alumacc.cc:485:replace_alu$2032
  created 46 $alu and 1 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.
<suppressed ~10 debug messages>

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~42 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 4 unused cells and 24 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~42 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..

yosys> techmap

3.22. Executing TECHMAP pass (map to technology primitives).

3.22.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.22.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $reduce_or.
Using template $paramod$fbc7873bff55778c0b3173955b7e4bce1d9d6834\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $xor.
Using template $paramod$6fc37af1c109ae54e8aed83fcd995c12d378ce93\_90_alu for cells of type $alu.
Using template $paramod$51c80ded93a30cabdd6a720b4f0ed1d8c51829dd\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $bmux.
Using template $paramod$6a42b6fefed750f8a1c58eab59479d960557103c\_90_alu for cells of type $alu.
Using template $paramod$c32aaa9fd758c6ea2b382f4327253b21b576e597\_90_alu for cells of type $alu.
Using template $paramod$32a7b7b86c07519b7537abc18e96f0331f97914d\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $logic_not.
Using template $paramod$403d07c18de10cda2ac652a859c56aea81aaf9b5\_90_alu for cells of type $alu.
Using template $paramod$e891e6b399cf52748460a311fafe476815d24bd7\_90_alu for cells of type $alu.
Using template $paramod$c6baa65225090ac0a120feab1b920965244aa496\_90_alu for cells of type $alu.
Using template $paramod$a7926d38756e33b5022e02ebfd484599309272c7\_90_alu for cells of type $alu.
Using template $paramod$788c3d57e5abb3a3f89aea6d4acd665be37f4e9b\_90_alu for cells of type $alu.
Using template $paramod$175e67c02b86e96b1288b9dc100122520d7240d8\_90_alu for cells of type $alu.
Using template $paramod$83784888def4f70dbbded37c6d05d2ea1157c936\_90_alu for cells of type $alu.
Using template $paramod$fc972a7a46956c1788f3cb5257b53c8f1df2d0cc\_90_alu for cells of type $alu.
Using template $paramod$3ef7d3dd227da7627a99c5e5a6a4deb817573e39\_90_alu for cells of type $alu.
Using extmapper maccmap for cells of type $macc.
  add 3'101 * $auto$wreduce.cc:454:run$1640 [0] (3x1 bits, unsigned)
Using extmapper simplemap for cells of type $ne.
Using template $paramod$6dc2bc4e177433cbefea60fe94ff11f8a7c6abf8\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010100 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011111 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011011 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000011 for cells of type $lcu.
No more expansions possible.
<suppressed ~7129 debug messages>

yosys> opt

3.23. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.23.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.
<suppressed ~7568 debug messages>

yosys> opt_merge -nomux

3.23.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
<suppressed ~10854 debug messages>
Removed a total of 3618 cells.

yosys> opt_muxtree

3.23.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.23.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff

3.23.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$10210 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [19], Q = \P2.addr [19]).
Adding EN signal on $auto$ff.cc:262:slice$3865 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [19], Q = \P1.addr [19]).
Adding EN signal on $auto$ff.cc:262:slice$3843 ($_DFFE_PP0P_) from module b20 (D = $flatten\P1.$verific$n10979$191, Q = \P1.B).
Adding EN signal on $auto$ff.cc:262:slice$10188 ($_DFFE_PP0P_) from module b20 (D = $flatten\P2.$verific$n10835$691, Q = \P2.B).
Adding EN signal on $auto$ff.cc:262:slice$3846 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [0], Q = \P1.addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$3847 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [1], Q = \P1.addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$3848 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [2], Q = \P1.addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$3849 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [3], Q = \P1.addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$3850 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [4], Q = \P1.addr [4]).
Adding EN signal on $auto$ff.cc:262:slice$3851 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [5], Q = \P1.addr [5]).
Adding EN signal on $auto$ff.cc:262:slice$3852 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [6], Q = \P1.addr [6]).
Adding EN signal on $auto$ff.cc:262:slice$3853 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [7], Q = \P1.addr [7]).
Adding EN signal on $auto$ff.cc:262:slice$3854 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [8], Q = \P1.addr [8]).
Adding EN signal on $auto$ff.cc:262:slice$3855 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [9], Q = \P1.addr [9]).
Adding EN signal on $auto$ff.cc:262:slice$3856 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [10], Q = \P1.addr [10]).
Adding EN signal on $auto$ff.cc:262:slice$3857 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [11], Q = \P1.addr [11]).
Adding EN signal on $auto$ff.cc:262:slice$3858 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [12], Q = \P1.addr [12]).
Adding EN signal on $auto$ff.cc:262:slice$3859 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [13], Q = \P1.addr [13]).
Adding EN signal on $auto$ff.cc:262:slice$3860 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [14], Q = \P1.addr [14]).
Adding EN signal on $auto$ff.cc:262:slice$3861 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [15], Q = \P1.addr [15]).
Adding EN signal on $auto$ff.cc:262:slice$3862 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [16], Q = \P1.addr [16]).
Adding EN signal on $auto$ff.cc:262:slice$3863 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [17], Q = \P1.addr [17]).
Adding EN signal on $auto$ff.cc:262:slice$3864 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11246$363 [18], Q = \P1.addr [18]).
Adding EN signal on $auto$ff.cc:262:slice$3996 ($_DFF_PP0_) from module b20 (D = $flatten\P1.$verific$n11301$364 [0], Q = \P1.IR [0]).
Adding EN signal on $auto$ff.cc:262:slice$10191 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [0], Q = \P2.addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$10192 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [1], Q = \P2.addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$10193 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [2], Q = \P2.addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$10194 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [3], Q = \P2.addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$10195 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [4], Q = \P2.addr [4]).
Adding EN signal on $auto$ff.cc:262:slice$10196 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [5], Q = \P2.addr [5]).
Adding EN signal on $auto$ff.cc:262:slice$10197 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [6], Q = \P2.addr [6]).
Adding EN signal on $auto$ff.cc:262:slice$10198 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [7], Q = \P2.addr [7]).
Adding EN signal on $auto$ff.cc:262:slice$10199 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [8], Q = \P2.addr [8]).
Adding EN signal on $auto$ff.cc:262:slice$10200 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [9], Q = \P2.addr [9]).
Adding EN signal on $auto$ff.cc:262:slice$10201 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [10], Q = \P2.addr [10]).
Adding EN signal on $auto$ff.cc:262:slice$10202 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [11], Q = \P2.addr [11]).
Adding EN signal on $auto$ff.cc:262:slice$10203 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [12], Q = \P2.addr [12]).
Adding EN signal on $auto$ff.cc:262:slice$10204 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [13], Q = \P2.addr [13]).
Adding EN signal on $auto$ff.cc:262:slice$10205 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [14], Q = \P2.addr [14]).
Adding EN signal on $auto$ff.cc:262:slice$10206 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [15], Q = \P2.addr [15]).
Adding EN signal on $auto$ff.cc:262:slice$10207 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [16], Q = \P2.addr [16]).
Adding EN signal on $auto$ff.cc:262:slice$10208 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [17], Q = \P2.addr [17]).
Adding EN signal on $auto$ff.cc:262:slice$10209 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11102$866 [18], Q = \P2.addr [18]).
Adding EN signal on $auto$ff.cc:262:slice$10342 ($_DFF_PP0_) from module b20 (D = $flatten\P2.$verific$n11157$867 [0], Q = \P2.IR [0]).
Adding EN signal on $auto$ff.cc:262:slice$13997 ($_DFFE_PP0P_) from module b20 (D = $auto$wreduce.cc:454:run$1660 [0], Q = \P2.reg3 [0]).
Adding EN signal on $auto$ff.cc:262:slice$13998 ($_DFFE_PP0P_) from module b20 (D = $auto$wreduce.cc:454:run$1660 [1], Q = \P2.reg3 [1]).
Adding EN signal on $auto$ff.cc:262:slice$13999 ($_DFFE_PP0P_) from module b20 (D = $auto$wreduce.cc:454:run$1660 [2], Q = \P2.reg3 [2]).

yosys> opt_clean

3.23.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 1218 unused cells and 3277 unused wires.
<suppressed ~1219 debug messages>

yosys> opt_expr

3.23.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.
<suppressed ~623 debug messages>

3.23.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.23.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.23.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
<suppressed ~1437 debug messages>
Removed a total of 479 cells.

yosys> opt_dff

3.23.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$3928 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [30], Q = \P1.reg1 [30]).
Adding EN signal on $auto$ff.cc:262:slice$3927 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [29], Q = \P1.reg1 [29]).
Adding EN signal on $auto$ff.cc:262:slice$3869 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [3], Q = \P1.reg2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$3868 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [2], Q = \P1.reg2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$3867 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [1], Q = \P1.reg2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$3866 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [0], Q = \P1.reg2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$3961 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [31], Q = \P1.reg0 [31]).
Adding EN signal on $auto$ff.cc:262:slice$3959 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [29], Q = \P1.reg0 [29]).
Adding EN signal on $auto$ff.cc:262:slice$10218 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [7], Q = \P2.reg2 [7]).
Adding EN signal on $auto$ff.cc:262:slice$10217 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [6], Q = \P2.reg2 [6]).
Adding EN signal on $auto$ff.cc:262:slice$10216 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [5], Q = \P2.reg2 [5]).
Adding EN signal on $auto$ff.cc:262:slice$10215 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [4], Q = \P2.reg2 [4]).
Adding EN signal on $auto$ff.cc:262:slice$10214 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [3], Q = \P2.reg2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$10213 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [2], Q = \P2.reg2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$3948 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [18], Q = \P1.reg0 [18]).
Adding EN signal on $auto$ff.cc:262:slice$3947 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [17], Q = \P1.reg0 [17]).
Adding EN signal on $auto$ff.cc:262:slice$3946 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [16], Q = \P1.reg0 [16]).
Adding EN signal on $auto$ff.cc:262:slice$3945 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [15], Q = \P1.reg0 [15]).
Adding EN signal on $auto$ff.cc:262:slice$3944 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [14], Q = \P1.reg0 [14]).
Adding EN signal on $auto$ff.cc:262:slice$3943 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [13], Q = \P1.reg0 [13]).
Adding EN signal on $auto$ff.cc:262:slice$3942 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [12], Q = \P1.reg0 [12]).
Adding EN signal on $auto$ff.cc:262:slice$3941 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [11], Q = \P1.reg0 [11]).
Adding EN signal on $auto$ff.cc:262:slice$3960 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [30], Q = \P1.reg0 [30]).
Adding EN signal on $auto$ff.cc:262:slice$3954 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [24], Q = \P1.reg0 [24]).
Adding EN signal on $auto$ff.cc:262:slice$3953 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [23], Q = \P1.reg0 [23]).
Adding EN signal on $auto$ff.cc:262:slice$3952 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [22], Q = \P1.reg0 [22]).
Adding EN signal on $auto$ff.cc:262:slice$3950 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [20], Q = \P1.reg0 [20]).
Adding EN signal on $auto$ff.cc:262:slice$3949 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [19], Q = \P1.reg0 [19]).
Adding EN signal on $auto$ff.cc:262:slice$3951 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [21], Q = \P1.reg0 [21]).
Adding EN signal on $auto$ff.cc:262:slice$3958 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [28], Q = \P1.reg0 [28]).
Adding EN signal on $auto$ff.cc:262:slice$3957 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [27], Q = \P1.reg0 [27]).
Adding EN signal on $auto$ff.cc:262:slice$3956 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [26], Q = \P1.reg0 [26]).
Adding EN signal on $auto$ff.cc:262:slice$3955 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [25], Q = \P1.reg0 [25]).
Adding EN signal on $auto$ff.cc:262:slice$10211 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [0], Q = \P2.reg2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$10212 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [1], Q = \P2.reg2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$10302 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [27], Q = \P2.reg0 [27]).
Adding EN signal on $auto$ff.cc:262:slice$10303 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [28], Q = \P2.reg0 [28]).
Adding EN signal on $auto$ff.cc:262:slice$10275 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [0], Q = \P2.reg0 [0]).
Adding EN signal on $auto$ff.cc:262:slice$10272 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [29], Q = \P2.reg1 [29]).
Adding EN signal on $auto$ff.cc:262:slice$10269 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [26], Q = \P2.reg1 [26]).
Adding EN signal on $auto$ff.cc:262:slice$10266 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [23], Q = \P2.reg1 [23]).
Adding EN signal on $auto$ff.cc:262:slice$10263 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [20], Q = \P2.reg1 [20]).
Adding EN signal on $auto$ff.cc:262:slice$10260 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [17], Q = \P2.reg1 [17]).
Adding EN signal on $auto$ff.cc:262:slice$10257 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [14], Q = \P2.reg1 [14]).
Adding EN signal on $auto$ff.cc:262:slice$10254 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [11], Q = \P2.reg1 [11]).
Adding EN signal on $auto$ff.cc:262:slice$10251 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [8], Q = \P2.reg1 [8]).
Adding EN signal on $auto$ff.cc:262:slice$10248 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [5], Q = \P2.reg1 [5]).
Adding EN signal on $auto$ff.cc:262:slice$10245 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [2], Q = \P2.reg1 [2]).
Adding EN signal on $auto$ff.cc:262:slice$10242 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [31], Q = \P2.reg2 [31]).
Adding EN signal on $auto$ff.cc:262:slice$10239 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [28], Q = \P2.reg2 [28]).
Adding EN signal on $auto$ff.cc:262:slice$10236 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [25], Q = \P2.reg2 [25]).
Adding EN signal on $auto$ff.cc:262:slice$10233 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [22], Q = \P2.reg2 [22]).
Adding EN signal on $auto$ff.cc:262:slice$10230 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [19], Q = \P2.reg2 [19]).
Adding EN signal on $auto$ff.cc:262:slice$10227 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [16], Q = \P2.reg2 [16]).
Adding EN signal on $auto$ff.cc:262:slice$10224 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [13], Q = \P2.reg2 [13]).
Adding EN signal on $auto$ff.cc:262:slice$10221 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [10], Q = \P2.reg2 [10]).
Adding EN signal on $auto$ff.cc:262:slice$10274 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [31], Q = \P2.reg1 [31]).
Adding EN signal on $auto$ff.cc:262:slice$10271 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [28], Q = \P2.reg1 [28]).
Adding EN signal on $auto$ff.cc:262:slice$10268 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [25], Q = \P2.reg1 [25]).
Adding EN signal on $auto$ff.cc:262:slice$10265 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [22], Q = \P2.reg1 [22]).
Adding EN signal on $auto$ff.cc:262:slice$10262 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [19], Q = \P2.reg1 [19]).
Adding EN signal on $auto$ff.cc:262:slice$10259 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [16], Q = \P2.reg1 [16]).
Adding EN signal on $auto$ff.cc:262:slice$10256 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [13], Q = \P2.reg1 [13]).
Adding EN signal on $auto$ff.cc:262:slice$10253 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [10], Q = \P2.reg1 [10]).
Adding EN signal on $auto$ff.cc:262:slice$10250 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [7], Q = \P2.reg1 [7]).
Adding EN signal on $auto$ff.cc:262:slice$10247 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [4], Q = \P2.reg1 [4]).
Adding EN signal on $auto$ff.cc:262:slice$10244 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [1], Q = \P2.reg1 [1]).
Adding EN signal on $auto$ff.cc:262:slice$10241 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [30], Q = \P2.reg2 [30]).
Adding EN signal on $auto$ff.cc:262:slice$10238 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [27], Q = \P2.reg2 [27]).
Adding EN signal on $auto$ff.cc:262:slice$10235 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [24], Q = \P2.reg2 [24]).
Adding EN signal on $auto$ff.cc:262:slice$10232 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [21], Q = \P2.reg2 [21]).
Adding EN signal on $auto$ff.cc:262:slice$10229 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [18], Q = \P2.reg2 [18]).
Adding EN signal on $auto$ff.cc:262:slice$10226 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [15], Q = \P2.reg2 [15]).
Adding EN signal on $auto$ff.cc:262:slice$10223 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [12], Q = \P2.reg2 [12]).
Adding EN signal on $auto$ff.cc:262:slice$10220 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [9], Q = \P2.reg2 [9]).
Adding EN signal on $auto$ff.cc:262:slice$10273 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [30], Q = \P2.reg1 [30]).
Adding EN signal on $auto$ff.cc:262:slice$10270 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [27], Q = \P2.reg1 [27]).
Adding EN signal on $auto$ff.cc:262:slice$10267 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [24], Q = \P2.reg1 [24]).
Adding EN signal on $auto$ff.cc:262:slice$10264 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [21], Q = \P2.reg1 [21]).
Adding EN signal on $auto$ff.cc:262:slice$10261 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [18], Q = \P2.reg1 [18]).
Adding EN signal on $auto$ff.cc:262:slice$10258 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [15], Q = \P2.reg1 [15]).
Adding EN signal on $auto$ff.cc:262:slice$10255 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [12], Q = \P2.reg1 [12]).
Adding EN signal on $auto$ff.cc:262:slice$10252 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [9], Q = \P2.reg1 [9]).
Adding EN signal on $auto$ff.cc:262:slice$10249 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [6], Q = \P2.reg1 [6]).
Adding EN signal on $auto$ff.cc:262:slice$10246 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [3], Q = \P2.reg1 [3]).
Adding EN signal on $auto$ff.cc:262:slice$10243 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [0], Q = \P2.reg1 [0]).
Adding EN signal on $auto$ff.cc:262:slice$10240 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [29], Q = \P2.reg2 [29]).
Adding EN signal on $auto$ff.cc:262:slice$10237 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [26], Q = \P2.reg2 [26]).
Adding EN signal on $auto$ff.cc:262:slice$10234 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [23], Q = \P2.reg2 [23]).
Adding EN signal on $auto$ff.cc:262:slice$10231 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [20], Q = \P2.reg2 [20]).
Adding EN signal on $auto$ff.cc:262:slice$10228 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [17], Q = \P2.reg2 [17]).
Adding EN signal on $auto$ff.cc:262:slice$10225 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [14], Q = \P2.reg2 [14]).
Adding EN signal on $auto$ff.cc:262:slice$10222 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [11], Q = \P2.reg2 [11]).
Adding EN signal on $auto$ff.cc:262:slice$10219 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$12542 [8], Q = \P2.reg2 [8]).
Adding EN signal on $auto$ff.cc:262:slice$10341 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$4734 [2], Q = \P1.reg3 [2]).
Adding EN signal on $auto$ff.cc:262:slice$10340 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$4734 [1], Q = \P1.reg3 [1]).
Adding EN signal on $auto$ff.cc:262:slice$10339 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$4734 [0], Q = \P1.reg3 [0]).
Adding EN signal on $auto$ff.cc:262:slice$10301 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [26], Q = \P2.reg0 [26]).
Adding EN signal on $auto$ff.cc:262:slice$10300 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [25], Q = \P2.reg0 [25]).
Adding EN signal on $auto$ff.cc:262:slice$10299 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [24], Q = \P2.reg0 [24]).
Adding EN signal on $auto$ff.cc:262:slice$10298 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [23], Q = \P2.reg0 [23]).
Adding EN signal on $auto$ff.cc:262:slice$10297 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [22], Q = \P2.reg0 [22]).
Adding EN signal on $auto$ff.cc:262:slice$10296 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [21], Q = \P2.reg0 [21]).
Adding EN signal on $auto$ff.cc:262:slice$10295 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [20], Q = \P2.reg0 [20]).
Adding EN signal on $auto$ff.cc:262:slice$10294 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [19], Q = \P2.reg0 [19]).
Adding EN signal on $auto$ff.cc:262:slice$10293 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [18], Q = \P2.reg0 [18]).
Adding EN signal on $auto$ff.cc:262:slice$10292 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [17], Q = \P2.reg0 [17]).
Adding EN signal on $auto$ff.cc:262:slice$10291 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [16], Q = \P2.reg0 [16]).
Adding EN signal on $auto$ff.cc:262:slice$10290 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [15], Q = \P2.reg0 [15]).
Adding EN signal on $auto$ff.cc:262:slice$10289 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [14], Q = \P2.reg0 [14]).
Adding EN signal on $auto$ff.cc:262:slice$10288 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [13], Q = \P2.reg0 [13]).
Adding EN signal on $auto$ff.cc:262:slice$10287 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [12], Q = \P2.reg0 [12]).
Adding EN signal on $auto$ff.cc:262:slice$10286 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [11], Q = \P2.reg0 [11]).
Adding EN signal on $auto$ff.cc:262:slice$10285 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [10], Q = \P2.reg0 [10]).
Adding EN signal on $auto$ff.cc:262:slice$10284 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [9], Q = \P2.reg0 [9]).
Adding EN signal on $auto$ff.cc:262:slice$10283 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [8], Q = \P2.reg0 [8]).
Adding EN signal on $auto$ff.cc:262:slice$10282 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [7], Q = \P2.reg0 [7]).
Adding EN signal on $auto$ff.cc:262:slice$10281 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [6], Q = \P2.reg0 [6]).
Adding EN signal on $auto$ff.cc:262:slice$10280 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [5], Q = \P2.reg0 [5]).
Adding EN signal on $auto$ff.cc:262:slice$10279 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [4], Q = \P2.reg0 [4]).
Adding EN signal on $auto$ff.cc:262:slice$10278 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [3], Q = \P2.reg0 [3]).
Adding EN signal on $auto$ff.cc:262:slice$10277 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [2], Q = \P2.reg0 [2]).
Adding EN signal on $auto$ff.cc:262:slice$10276 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [1], Q = \P2.reg0 [1]).
Adding EN signal on $auto$ff.cc:262:slice$10306 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [31], Q = \P2.reg0 [31]).
Adding EN signal on $auto$ff.cc:262:slice$10305 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [30], Q = \P2.reg0 [30]).
Adding EN signal on $auto$ff.cc:262:slice$10304 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [29], Q = \P2.reg0 [29]).
Adding EN signal on $auto$ff.cc:262:slice$3926 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [28], Q = \P1.reg1 [28]).
Adding EN signal on $auto$ff.cc:262:slice$3923 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [25], Q = \P1.reg1 [25]).
Adding EN signal on $auto$ff.cc:262:slice$3920 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [22], Q = \P1.reg1 [22]).
Adding EN signal on $auto$ff.cc:262:slice$3917 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [19], Q = \P1.reg1 [19]).
Adding EN signal on $auto$ff.cc:262:slice$3914 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [16], Q = \P1.reg1 [16]).
Adding EN signal on $auto$ff.cc:262:slice$3911 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [13], Q = \P1.reg1 [13]).
Adding EN signal on $auto$ff.cc:262:slice$3908 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [10], Q = \P1.reg1 [10]).
Adding EN signal on $auto$ff.cc:262:slice$3905 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [7], Q = \P1.reg1 [7]).
Adding EN signal on $auto$ff.cc:262:slice$3902 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [4], Q = \P1.reg1 [4]).
Adding EN signal on $auto$ff.cc:262:slice$3899 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [1], Q = \P1.reg1 [1]).
Adding EN signal on $auto$ff.cc:262:slice$3896 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [30], Q = \P1.reg2 [30]).
Adding EN signal on $auto$ff.cc:262:slice$3893 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [27], Q = \P1.reg2 [27]).
Adding EN signal on $auto$ff.cc:262:slice$3890 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [24], Q = \P1.reg2 [24]).
Adding EN signal on $auto$ff.cc:262:slice$3887 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [21], Q = \P1.reg2 [21]).
Adding EN signal on $auto$ff.cc:262:slice$3884 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [18], Q = \P1.reg2 [18]).
Adding EN signal on $auto$ff.cc:262:slice$3881 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [15], Q = \P1.reg2 [15]).
Adding EN signal on $auto$ff.cc:262:slice$3878 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [12], Q = \P1.reg2 [12]).
Adding EN signal on $auto$ff.cc:262:slice$3875 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [9], Q = \P1.reg2 [9]).
Adding EN signal on $auto$ff.cc:262:slice$3872 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [6], Q = \P1.reg2 [6]).
Adding EN signal on $auto$ff.cc:262:slice$3925 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [27], Q = \P1.reg1 [27]).
Adding EN signal on $auto$ff.cc:262:slice$3922 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [24], Q = \P1.reg1 [24]).
Adding EN signal on $auto$ff.cc:262:slice$3919 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [21], Q = \P1.reg1 [21]).
Adding EN signal on $auto$ff.cc:262:slice$3916 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [18], Q = \P1.reg1 [18]).
Adding EN signal on $auto$ff.cc:262:slice$3913 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [15], Q = \P1.reg1 [15]).
Adding EN signal on $auto$ff.cc:262:slice$3910 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [12], Q = \P1.reg1 [12]).
Adding EN signal on $auto$ff.cc:262:slice$3907 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [9], Q = \P1.reg1 [9]).
Adding EN signal on $auto$ff.cc:262:slice$3904 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [6], Q = \P1.reg1 [6]).
Adding EN signal on $auto$ff.cc:262:slice$3901 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [3], Q = \P1.reg1 [3]).
Adding EN signal on $auto$ff.cc:262:slice$3898 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [0], Q = \P1.reg1 [0]).
Adding EN signal on $auto$ff.cc:262:slice$3895 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [29], Q = \P1.reg2 [29]).
Adding EN signal on $auto$ff.cc:262:slice$3892 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [26], Q = \P1.reg2 [26]).
Adding EN signal on $auto$ff.cc:262:slice$3889 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [23], Q = \P1.reg2 [23]).
Adding EN signal on $auto$ff.cc:262:slice$3886 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [20], Q = \P1.reg2 [20]).
Adding EN signal on $auto$ff.cc:262:slice$3883 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [17], Q = \P1.reg2 [17]).
Adding EN signal on $auto$ff.cc:262:slice$3880 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [14], Q = \P1.reg2 [14]).
Adding EN signal on $auto$ff.cc:262:slice$3877 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [11], Q = \P1.reg2 [11]).
Adding EN signal on $auto$ff.cc:262:slice$3874 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [8], Q = \P1.reg2 [8]).
Adding EN signal on $auto$ff.cc:262:slice$3871 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [5], Q = \P1.reg2 [5]).
Adding EN signal on $auto$ff.cc:262:slice$3924 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [26], Q = \P1.reg1 [26]).
Adding EN signal on $auto$ff.cc:262:slice$3921 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [23], Q = \P1.reg1 [23]).
Adding EN signal on $auto$ff.cc:262:slice$3918 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [20], Q = \P1.reg1 [20]).
Adding EN signal on $auto$ff.cc:262:slice$3915 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [17], Q = \P1.reg1 [17]).
Adding EN signal on $auto$ff.cc:262:slice$3912 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [14], Q = \P1.reg1 [14]).
Adding EN signal on $auto$ff.cc:262:slice$3909 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [11], Q = \P1.reg1 [11]).
Adding EN signal on $auto$ff.cc:262:slice$3906 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [8], Q = \P1.reg1 [8]).
Adding EN signal on $auto$ff.cc:262:slice$3903 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [5], Q = \P1.reg1 [5]).
Adding EN signal on $auto$ff.cc:262:slice$3900 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [2], Q = \P1.reg1 [2]).
Adding EN signal on $auto$ff.cc:262:slice$3897 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [31], Q = \P1.reg2 [31]).
Adding EN signal on $auto$ff.cc:262:slice$3894 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [28], Q = \P1.reg2 [28]).
Adding EN signal on $auto$ff.cc:262:slice$3891 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [25], Q = \P1.reg2 [25]).
Adding EN signal on $auto$ff.cc:262:slice$3888 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [22], Q = \P1.reg2 [22]).
Adding EN signal on $auto$ff.cc:262:slice$3885 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [19], Q = \P1.reg2 [19]).
Adding EN signal on $auto$ff.cc:262:slice$3882 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [16], Q = \P1.reg2 [16]).
Adding EN signal on $auto$ff.cc:262:slice$3879 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [13], Q = \P1.reg2 [13]).
Adding EN signal on $auto$ff.cc:262:slice$3876 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [10], Q = \P1.reg2 [10]).
Adding EN signal on $auto$ff.cc:262:slice$3873 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [7], Q = \P1.reg2 [7]).
Adding EN signal on $auto$ff.cc:262:slice$3870 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5218 [4], Q = \P1.reg2 [4]).
Adding EN signal on $auto$ff.cc:262:slice$3940 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [10], Q = \P1.reg0 [10]).
Adding EN signal on $auto$ff.cc:262:slice$3939 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [9], Q = \P1.reg0 [9]).
Adding EN signal on $auto$ff.cc:262:slice$3938 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [8], Q = \P1.reg0 [8]).
Adding EN signal on $auto$ff.cc:262:slice$3937 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [7], Q = \P1.reg0 [7]).
Adding EN signal on $auto$ff.cc:262:slice$3936 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [6], Q = \P1.reg0 [6]).
Adding EN signal on $auto$ff.cc:262:slice$3935 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [5], Q = \P1.reg0 [5]).
Adding EN signal on $auto$ff.cc:262:slice$3934 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [4], Q = \P1.reg0 [4]).
Adding EN signal on $auto$ff.cc:262:slice$3933 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [3], Q = \P1.reg0 [3]).
Adding EN signal on $auto$ff.cc:262:slice$3932 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [2], Q = \P1.reg0 [2]).
Adding EN signal on $auto$ff.cc:262:slice$3931 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [1], Q = \P1.reg0 [1]).
Adding EN signal on $auto$ff.cc:262:slice$3930 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [0], Q = \P1.reg0 [0]).
Adding EN signal on $auto$ff.cc:262:slice$3929 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [31], Q = \P1.reg1 [31]).

yosys> opt_clean

3.23.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 1664 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.23.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.
<suppressed ~4187 debug messages>

3.23.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.23.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.23.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
<suppressed ~19770 debug messages>
Removed a total of 6590 cells.

yosys> opt_dff

3.23.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.23.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 6361 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.23.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.23.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.23.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.23.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff

3.23.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.23.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..

yosys> opt_expr

3.23.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.23.30. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.24. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.24.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.
<suppressed ~1239 debug messages>

yosys> opt_merge

3.24.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff

3.24.3. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$45022 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$6186 [0], Q = \P1.reg0 [0]).
Adding EN signal on $auto$ff.cc:262:slice$36310 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [26], Q = \P2.reg0 [26]).
Adding EN signal on $auto$ff.cc:262:slice$35444 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [0], Q = \P2.reg1 [0]).
Adding EN signal on $auto$ff.cc:262:slice$35274 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [6], Q = \P2.reg1 [6]).
Adding EN signal on $auto$ff.cc:262:slice$35104 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [12], Q = \P2.reg1 [12]).
Adding EN signal on $auto$ff.cc:262:slice$34934 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [18], Q = \P2.reg1 [18]).
Adding EN signal on $auto$ff.cc:262:slice$34764 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [24], Q = \P2.reg1 [24]).
Adding EN signal on $auto$ff.cc:262:slice$34594 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [30], Q = \P2.reg1 [30]).
Adding EN signal on $auto$ff.cc:262:slice$33864 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [4], Q = \P2.reg1 [4]).
Adding EN signal on $auto$ff.cc:262:slice$33694 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [10], Q = \P2.reg1 [10]).
Adding EN signal on $auto$ff.cc:262:slice$33524 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [16], Q = \P2.reg1 [16]).
Adding EN signal on $auto$ff.cc:262:slice$33354 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [22], Q = \P2.reg1 [22]).
Adding EN signal on $auto$ff.cc:262:slice$33184 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [28], Q = \P2.reg1 [28]).
Adding EN signal on $auto$ff.cc:262:slice$32369 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [5], Q = \P2.reg1 [5]).
Adding EN signal on $auto$ff.cc:262:slice$32199 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [11], Q = \P2.reg1 [11]).
Adding EN signal on $auto$ff.cc:262:slice$32029 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [17], Q = \P2.reg1 [17]).
Adding EN signal on $auto$ff.cc:262:slice$31859 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [23], Q = \P2.reg1 [23]).
Adding EN signal on $auto$ff.cc:262:slice$41440 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$5702 [0], Q = \P1.reg1 [0]).
Adding EN signal on $auto$ff.cc:262:slice$35359 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [3], Q = \P2.reg1 [3]).
Adding EN signal on $auto$ff.cc:262:slice$35189 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [9], Q = \P2.reg1 [9]).
Adding EN signal on $auto$ff.cc:262:slice$35019 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [15], Q = \P2.reg1 [15]).
Adding EN signal on $auto$ff.cc:262:slice$34849 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [21], Q = \P2.reg1 [21]).
Adding EN signal on $auto$ff.cc:262:slice$34679 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [27], Q = \P2.reg1 [27]).
Adding EN signal on $auto$ff.cc:262:slice$33949 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [1], Q = \P2.reg1 [1]).
Adding EN signal on $auto$ff.cc:262:slice$33779 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [7], Q = \P2.reg1 [7]).
Adding EN signal on $auto$ff.cc:262:slice$33609 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [13], Q = \P2.reg1 [13]).
Adding EN signal on $auto$ff.cc:262:slice$33439 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [19], Q = \P2.reg1 [19]).
Adding EN signal on $auto$ff.cc:262:slice$33269 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [25], Q = \P2.reg1 [25]).
Adding EN signal on $auto$ff.cc:262:slice$33099 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [31], Q = \P2.reg1 [31]).
Adding EN signal on $auto$ff.cc:262:slice$32454 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [2], Q = \P2.reg1 [2]).
Adding EN signal on $auto$ff.cc:262:slice$32284 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [8], Q = \P2.reg1 [8]).
Adding EN signal on $auto$ff.cc:262:slice$32114 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [14], Q = \P2.reg1 [14]).
Adding EN signal on $auto$ff.cc:262:slice$31944 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [20], Q = \P2.reg1 [20]).
Adding EN signal on $auto$ff.cc:262:slice$31774 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [26], Q = \P2.reg1 [26]).
Adding EN signal on $auto$ff.cc:262:slice$38690 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [29], Q = \P2.reg0 [29]).
Adding EN signal on $auto$ff.cc:262:slice$38605 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [30], Q = \P2.reg0 [30]).
Adding EN signal on $auto$ff.cc:262:slice$38520 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [31], Q = \P2.reg0 [31]).
Adding EN signal on $auto$ff.cc:262:slice$38435 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [1], Q = \P2.reg0 [1]).
Adding EN signal on $auto$ff.cc:262:slice$38350 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [2], Q = \P2.reg0 [2]).
Adding EN signal on $auto$ff.cc:262:slice$38265 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [3], Q = \P2.reg0 [3]).
Adding EN signal on $auto$ff.cc:262:slice$38180 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [4], Q = \P2.reg0 [4]).
Adding EN signal on $auto$ff.cc:262:slice$38095 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [5], Q = \P2.reg0 [5]).
Adding EN signal on $auto$ff.cc:262:slice$38010 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [6], Q = \P2.reg0 [6]).
Adding EN signal on $auto$ff.cc:262:slice$37925 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [7], Q = \P2.reg0 [7]).
Adding EN signal on $auto$ff.cc:262:slice$37840 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [8], Q = \P2.reg0 [8]).
Adding EN signal on $auto$ff.cc:262:slice$37755 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [9], Q = \P2.reg0 [9]).
Adding EN signal on $auto$ff.cc:262:slice$37670 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [10], Q = \P2.reg0 [10]).
Adding EN signal on $auto$ff.cc:262:slice$37585 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [11], Q = \P2.reg0 [11]).
Adding EN signal on $auto$ff.cc:262:slice$37500 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [12], Q = \P2.reg0 [12]).
Adding EN signal on $auto$ff.cc:262:slice$37415 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [13], Q = \P2.reg0 [13]).
Adding EN signal on $auto$ff.cc:262:slice$37330 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [14], Q = \P2.reg0 [14]).
Adding EN signal on $auto$ff.cc:262:slice$37245 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [15], Q = \P2.reg0 [15]).
Adding EN signal on $auto$ff.cc:262:slice$37160 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [16], Q = \P2.reg0 [16]).
Adding EN signal on $auto$ff.cc:262:slice$37075 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [17], Q = \P2.reg0 [17]).
Adding EN signal on $auto$ff.cc:262:slice$36990 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [18], Q = \P2.reg0 [18]).
Adding EN signal on $auto$ff.cc:262:slice$36905 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [19], Q = \P2.reg0 [19]).
Adding EN signal on $auto$ff.cc:262:slice$36820 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [20], Q = \P2.reg0 [20]).
Adding EN signal on $auto$ff.cc:262:slice$36735 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [21], Q = \P2.reg0 [21]).
Adding EN signal on $auto$ff.cc:262:slice$36650 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [22], Q = \P2.reg0 [22]).
Adding EN signal on $auto$ff.cc:262:slice$36565 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [23], Q = \P2.reg0 [23]).
Adding EN signal on $auto$ff.cc:262:slice$36480 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [24], Q = \P2.reg0 [24]).
Adding EN signal on $auto$ff.cc:262:slice$36395 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [25], Q = \P2.reg0 [25]).
Adding EN signal on $auto$ff.cc:262:slice$31689 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13026 [29], Q = \P2.reg1 [29]).
Adding EN signal on $auto$ff.cc:262:slice$31604 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [0], Q = \P2.reg0 [0]).
Adding EN signal on $auto$ff.cc:262:slice$31519 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [28], Q = \P2.reg0 [28]).
Adding EN signal on $auto$ff.cc:262:slice$31434 ($_DFFE_PP0P_) from module b20 (D = $auto$simplemap.cc:309:simplemap_bmux$13510 [27], Q = \P2.reg0 [27]).

yosys> opt_clean

3.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 156 unused wires.
<suppressed ~1 debug messages>

3.24.5. Rerunning OPT passes. (Removed registers in this run.)

yosys> opt_expr -full

3.24.6. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.
<suppressed ~270 debug messages>

yosys> opt_merge

3.24.7. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
<suppressed ~756 debug messages>
Removed a total of 252 cells.

yosys> opt_dff

3.24.8. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.24.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 318 unused wires.
<suppressed ~1 debug messages>

3.24.10. Finished fast OPT passes.

yosys> memory_map

3.25. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

yosys> opt_merge -nomux

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.26.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.26.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.26.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_share

3.26.6. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14870 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14890
        $auto$simplemap.cc:86:simplemap_bitop$14891

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14871 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14888
        $auto$simplemap.cc:86:simplemap_bitop$14889

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14872 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14886
        $auto$simplemap.cc:86:simplemap_bitop$14887

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14873 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14884
        $auto$simplemap.cc:86:simplemap_bitop$14885

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$7349 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$7369
        $auto$simplemap.cc:86:simplemap_bitop$7370

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$7350 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$7367
        $auto$simplemap.cc:86:simplemap_bitop$7368

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$7351 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$7365
        $auto$simplemap.cc:86:simplemap_bitop$7366

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$7352 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$7363
        $auto$simplemap.cc:86:simplemap_bitop$7364

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$9040 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$16716
        $auto$simplemap.cc:86:simplemap_bitop$16817


yosys> opt_dff

3.26.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 16 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.26.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.
<suppressed ~9 debug messages>

3.26.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.26.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~9 debug messages>

yosys> opt_reduce -full

3.26.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.26.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_share

3.26.14. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14877 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14888
        $auto$simplemap.cc:86:simplemap_bitop$14890

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14878 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14884
        $auto$simplemap.cc:86:simplemap_bitop$14886

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$7356 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$7367
        $auto$simplemap.cc:86:simplemap_bitop$7369

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$7357 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$7363
        $auto$simplemap.cc:86:simplemap_bitop$7365


yosys> opt_dff

3.26.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 8 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.26.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.
<suppressed ~4 debug messages>

3.26.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.26.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce -full

3.26.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.26.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_share

3.26.22. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14881 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14884
        $auto$simplemap.cc:86:simplemap_bitop$14888

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$7360 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$7363
        $auto$simplemap.cc:86:simplemap_bitop$7367


yosys> opt_dff

3.26.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.26.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.
<suppressed ~2 debug messages>

3.26.26. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.26.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce -full

3.26.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.26.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_share

3.26.30. Executing OPT_SHARE pass.

yosys> opt_dff

3.26.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..

yosys> opt_expr -full

3.26.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.26.34. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.27. Executing ABC pass (technology mapping using ABC).

3.27.1. Extracting gate netlist of module `\b20' to `<abc-temp-dir>/input.blif'..
Extracted 10036 gates and 10509 wires to a netlist network with 471 inputs and 499 outputs.

3.27.1.1. Executing ABC.
Running ABC command: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/result_23-03-2022T14-57-36/All_lut_synth_rs_ade.json/b20/abc_tmp.scr 
ABC:   #Luts =  3102  Max Lvl =  23  Avg Lvl =  15.29  [   2.06 sec. at Pass 0]
ABC:   #Luts =  2044  Max Lvl =  38  Avg Lvl =  18.77  [  86.39 sec. at Pass 1]
ABC:   #Luts =  1989  Max Lvl =  35  Avg Lvl =  17.35  [  14.39 sec. at Pass 2]
ABC:   #Luts =  1957  Max Lvl =  37  Avg Lvl =  18.05  [  22.99 sec. at Pass 3]
ABC:   #Luts =  1933  Max Lvl =  35  Avg Lvl =  17.67  [  17.32 sec. at Pass 4]
ABC:   #Luts =  1877  Max Lvl =  35  Avg Lvl =  17.79  [  32.59 sec. at Pass 5]
ABC:   #Luts =  1861  Max Lvl =  35  Avg Lvl =  18.20  [  19.57 sec. at Pass 6]
ABC:   #Luts =  1855  Max Lvl =  37  Avg Lvl =  17.99  [  28.70 sec. at Pass 7]
ABC:   #Luts =  1845  Max Lvl =  35  Avg Lvl =  18.01  [  14.49 sec. at Pass 8]
ABC:   #Luts =  1839  Max Lvl =  35  Avg Lvl =  18.04  [  22.55 sec. at Pass 9]
ABC:   #Luts =  1839  Max Lvl =  35  Avg Lvl =  18.04  [  13.22 sec. at Pass 10]
ABC:   #Luts =  1834  Max Lvl =  36  Avg Lvl =  18.20  [  24.63 sec. at Pass 11]
ABC:   #Luts =  1826  Max Lvl =  37  Avg Lvl =  18.21  [  13.14 sec. at Pass 12]
ABC:   #Luts =  1814  Max Lvl =  37  Avg Lvl =  18.28  [  32.60 sec. at Pass 13]
ABC:   #Luts =  1814  Max Lvl =  37  Avg Lvl =  18.28  [  15.89 sec. at Pass 14]
ABC:   #Luts =  1806  Max Lvl =  36  Avg Lvl =  17.58  [  28.71 sec. at Pass 15]
ABC:   #Luts =  1802  Max Lvl =  38  Avg Lvl =  18.51  [  15.16 sec. at Pass 16]
ABC:   #Luts =  1789  Max Lvl =  37  Avg Lvl =  18.35  [  29.27 sec. at Pass 17]
ABC:   #Luts =  1786  Max Lvl =  38  Avg Lvl =  18.43  [  18.21 sec. at Pass 18]
ABC:   #Luts =  1774  Max Lvl =  35  Avg Lvl =  17.38  [  24.22 sec. at Pass 19]
ABC:   #Luts =  1765  Max Lvl =  40  Avg Lvl =  18.61  [  12.98 sec. at Pass 20]
ABC:   #Luts =  1758  Max Lvl =  40  Avg Lvl =  18.80  [  22.85 sec. at Pass 21]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.27.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     1772
ABC RESULTS:        internal signals:     9539
ABC RESULTS:           input signals:      471
ABC RESULTS:          output signals:      499
Removing temp directory.

yosys> opt

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 3280 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.28.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.28.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.28.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce

3.28.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.28.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..

yosys> opt_expr

3.28.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.28.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.29. Printing statistics.

=== b20 ===

   Number of wires:               1747
   Number of wire bits:           2789
   Number of public wires:          46
   Number of public wire bits:     736
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2219
     $_DFFE_PP0N_                    2
     $_DFFE_PP0P_                  356
     $_DFF_PP0_                     78
     $lut                         1768
     $mux                           15


yosys> shregmap -minlen 8 -maxlen 20

3.30. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.31. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.32. Printing statistics.

=== b20 ===

   Number of wires:               1747
   Number of wire bits:           2789
   Number of public wires:          46
   Number of public wire bits:     736
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2219
     $_DFFE_PP0N_                    2
     $_DFFE_PP0P_                  356
     $_DFF_PP0_                     78
     $lut                         1768
     $mux                           15


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.33. Executing TECHMAP pass (map to technology primitives).

3.33.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.33.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Successfully finished Verilog frontend.

3.33.3. Continuing TECHMAP pass.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP0N_ for cells of type $_DFFE_PP0N_.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~2785 debug messages>

yosys> opt_expr -mux_undef

3.34. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.
<suppressed ~41307 debug messages>

yosys> simplemap

3.35. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
<suppressed ~33129 debug messages>
Removed a total of 11043 cells.

yosys> opt_dff -nodffe -nosdff

3.38. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 5928 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.
<suppressed ~1821 debug messages>

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
<suppressed ~18 debug messages>
Removed a total of 6 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 542 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.41. Executing ABC pass (technology mapping using ABC).

3.41.1. Extracting gate netlist of module `\b20' to `<abc-temp-dir>/input.blif'..
Extracted 8684 gates and 9155 wires to a netlist network with 469 inputs and 473 outputs.

3.41.1.1. Executing ABC.
Running ABC command: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/result_23-03-2022T14-57-36/All_lut_synth_rs_ade.json/b20/abc_tmp.scr 
ABC:   #Luts =  1748  Max Lvl =  40  Avg Lvl =  18.09  [   2.04 sec. at Pass 0]
ABC:   #Luts =  1748  Max Lvl =  40  Avg Lvl =  18.09  [  67.92 sec. at Pass 1]
ABC:   #Luts =  1746  Max Lvl =  38  Avg Lvl =  17.70  [   9.27 sec. at Pass 2]
ABC:   #Luts =  1744  Max Lvl =  39  Avg Lvl =  17.85  [  16.36 sec. at Pass 3]
ABC:   #Luts =  1743  Max Lvl =  38  Avg Lvl =  17.67  [  11.59 sec. at Pass 4]
ABC:   #Luts =  1742  Max Lvl =  39  Avg Lvl =  17.94  [  20.00 sec. at Pass 5]
ABC:   #Luts =  1741  Max Lvl =  39  Avg Lvl =  18.10  [  11.11 sec. at Pass 6]
ABC:   #Luts =  1741  Max Lvl =  39  Avg Lvl =  18.10  [  17.14 sec. at Pass 7]
ABC:   #Luts =  1739  Max Lvl =  38  Avg Lvl =  17.66  [  11.40 sec. at Pass 8]
ABC:   #Luts =  1738  Max Lvl =  38  Avg Lvl =  17.72  [  16.31 sec. at Pass 9]
ABC:   #Luts =  1728  Max Lvl =  39  Avg Lvl =  17.83  [   8.29 sec. at Pass 10]
ABC:   #Luts =  1728  Max Lvl =  39  Avg Lvl =  17.83  [  17.96 sec. at Pass 11]
ABC:   #Luts =  1728  Max Lvl =  39  Avg Lvl =  17.83  [  11.81 sec. at Pass 12]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.41.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     1731
ABC RESULTS:        internal signals:     8213
ABC RESULTS:           input signals:      469
ABC RESULTS:          output signals:      473
Removing temp directory.

yosys> opt

3.42. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.42.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

yosys> opt_merge -nomux

3.42.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.42.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.42.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff

3.42.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 6614 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.42.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.42.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.42.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b20..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b20.
Performed a total of 0 changes.

yosys> opt_merge

3.42.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b20'.
Removed a total of 0 cells.

yosys> opt_dff

3.42.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..

yosys> opt_expr

3.42.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b20.

3.42.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.43. Executing HIERARCHY pass (managing design hierarchy).

3.43.1. Analyzing design hierarchy..
Top module:  \b20

3.43.2. Analyzing design hierarchy..
Top module:  \b20
Removed 0 unused modules.

yosys> stat

3.44. Printing statistics.

=== b20 ===

   Number of wires:               1697
   Number of wire bits:           2633
   Number of public wires:          46
   Number of public wire bits:     736
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2167
     $lut                         1731
     dffsre                        436


yosys> opt_clean -purge

3.45. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b20..
Removed 0 unused cells and 14 unused wires.
<suppressed ~14 debug messages>

yosys> write_verilog -noattr -nohex b20.verilog

3.46. Executing Verilog backend.

yosys> bmuxmap

3.46.1. Executing BMUXMAP pass.

yosys> demuxmap

3.46.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\b20'.

End of script. Logfile hash: 6e51518283, CPU: user 65.35s system 0.51s, MEM: 138.30 MB peak
Yosys 0.14+36 (git sha1 4cd3e3b51, gcc 7.1.0 -fPIC -Os)
Time spent: 98% 2x abc (4622 sec), 0% 55x opt_expr (23 sec), ...
real 872.48
user 4400.08
sys 287.28
