
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.70
 Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k gost89_sbox.v gost89_round.v gost89_ecb_encrypt.v gost89_cfb_decrypt.v

yosys> verific -vlog2k gost89_sbox.v gost89_round.v gost89_ecb_encrypt.v gost89_cfb_decrypt.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_sbox.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_round.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_ecb_encrypt.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_cfb_decrypt.v'
VERIFIC-INFO [VERI-2561] gost89_cfb_decrypt.v:17: undeclared symbol 'reset_ecb', assumed default net type 'wire'

yosys> synth_rs -top gost89_cfb_decrypt -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.69

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top gost89_cfb_decrypt

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] gost89_cfb_decrypt.v:1: compiling module 'gost89_cfb_decrypt'
VERIFIC-INFO [VERI-1018] gost89_ecb_encrypt.v:1: compiling module 'gost89_ecb_encrypt'
VERIFIC-INFO [VERI-1018] gost89_round.v:1: compiling module 'gost89_round'
VERIFIC-INFO [VERI-1018] gost89_sbox.v:1: compiling module 'gost89_sbox'
VERIFIC-WARNING [VERI-1209] gost89_ecb_encrypt.v:33: expression size 7 truncated to fit in target size 6
Importing module gost89_cfb_decrypt.
Importing module gost89_ecb_encrypt.
Importing module gost89_round.
Importing module gost89_sbox.

3.4.1. Analyzing design hierarchy..
Top module:  \gost89_cfb_decrypt
Used module:     \gost89_ecb_encrypt
Used module:         \gost89_round
Used module:             \gost89_sbox

3.4.2. Analyzing design hierarchy..
Top module:  \gost89_cfb_decrypt
Used module:     \gost89_ecb_encrypt
Used module:         \gost89_round
Used module:             \gost89_sbox
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_sbox.
Optimizing module gost89_round.
Optimizing module gost89_ecb_encrypt.
<suppressed ~3 debug messages>
Optimizing module gost89_cfb_decrypt.

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module gost89_ecb_encrypt.
Deleting now unused module gost89_round.
Deleting now unused module gost89_sbox.
<suppressed ~10 debug messages>

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 2344 unused wires.
<suppressed ~28 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module gost89_cfb_decrypt...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~3 debug messages>

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
    New ctrl vector for $pmux cell $flatten\ecb_encrypt.$verific$select_114$gost89_ecb_encrypt.v:80$1811: { $auto$opt_reduce.cc:134:opt_pmux$2452 $auto$opt_reduce.cc:134:opt_pmux$2450 $auto$opt_reduce.cc:134:opt_pmux$2448 $auto$opt_reduce.cc:134:opt_pmux$2446 $auto$opt_reduce.cc:134:opt_pmux$2444 $auto$opt_reduce.cc:134:opt_pmux$2442 $auto$opt_reduce.cc:134:opt_pmux$2440 $auto$opt_reduce.cc:134:opt_pmux$2438 $flatten\ecb_encrypt.$verific$n1897$1004 }
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 1 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$out_reg$gost89_cfb_decrypt.v:38$954 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $verific$in_value_reg$gost89_cfb_decrypt.v:38$953 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $verific$gamma_reg$gost89_cfb_decrypt.v:38$951 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$round_num_reg$gost89_ecb_encrypt.v:44$1774 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$round_key_reg$gost89_ecb_encrypt.v:80$1812 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$out_reg$gost89_ecb_encrypt.v:44$1775 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$n2_reg$gost89_ecb_encrypt.v:44$1772 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$n1_reg$gost89_ecb_encrypt.v:44$1771 ($aldff) from module gost89_cfb_decrypt.

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~6 debug messages>

yosys> opt_muxtree

3.25. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.26. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.28. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.29. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 1 unused cells and 2 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.31. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_muxtree

3.32. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.33. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.34. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.35. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.36. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> opt_expr

3.38. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
MAX OPT ITERATION = 3

yosys> fsm -encoding binary

3.39. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.39.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.39.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.39.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.39.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> fsm_opt

3.39.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.39.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.39.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.39.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.40. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_merge -nomux

3.41. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.42. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.43. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.44. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.45. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.46. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$out_reg$gost89_cfb_decrypt.v:38$954 ($dff) from module gost89_cfb_decrypt (D = $verific$n413$21, Q = \out).
Adding EN signal on $verific$in_value_reg$gost89_cfb_decrypt.v:38$953 ($dff) from module gost89_cfb_decrypt (D = \in, Q = \in_value).
Adding EN signal on $verific$gamma_reg$gost89_cfb_decrypt.v:38$951 ($dff) from module gost89_cfb_decrypt (D = $verific$n544$23, Q = \gamma).
Adding EN signal on $verific$busy_reg$gost89_cfb_decrypt.v:38$952 ($dff) from module gost89_cfb_decrypt (D = $verific$n674$16, Q = \busy).
Adding EN signal on $flatten\ecb_encrypt.$verific$round_key_reg$gost89_ecb_encrypt.v:80$1812 ($dff) from module gost89_cfb_decrypt (D = $flatten\ecb_encrypt.$verific$n1898$1059, Q = \ecb_encrypt.round_key).
Adding EN signal on $flatten\ecb_encrypt.$verific$out_reg$gost89_ecb_encrypt.v:44$1775 ($dff) from module gost89_cfb_decrypt (D = { \ecb_encrypt.n1 \ecb_encrypt.out1 }, Q = \ecb_encrypt.out).

yosys> opt_clean

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 4 unused cells and 4 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~6 debug messages>
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.49. Executing WREDUCE pass (reducing word size of cells).
Removed top 5 bits (of 6) from port A of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$LessThan_25$gost89_ecb_encrypt.v:34$1756 ($lt).
Removed top 5 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$add_22$gost89_ecb_encrypt.v:33$1753 ($add).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_100$gost89_ecb_encrypt.v:67$1795 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_101$gost89_ecb_encrypt.v:68$1796 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_102$gost89_ecb_encrypt.v:69$1797 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_103$gost89_ecb_encrypt.v:70$1798 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_104$gost89_ecb_encrypt.v:71$1799 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_105$gost89_ecb_encrypt.v:72$1800 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_106$gost89_ecb_encrypt.v:73$1801 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_107$gost89_ecb_encrypt.v:74$1802 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_108$gost89_ecb_encrypt.v:75$1803 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_109$gost89_ecb_encrypt.v:76$1804 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_110$gost89_ecb_encrypt.v:77$1805 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_111$gost89_ecb_encrypt.v:78$1806 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_112$gost89_ecb_encrypt.v:79$1807 ($eq).
Removed top 5 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_82$gost89_ecb_encrypt.v:49$1777 ($eq).
Removed top 4 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_83$gost89_ecb_encrypt.v:50$1778 ($eq).
Removed top 4 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_84$gost89_ecb_encrypt.v:51$1779 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_85$gost89_ecb_encrypt.v:52$1780 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_86$gost89_ecb_encrypt.v:53$1781 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_87$gost89_ecb_encrypt.v:54$1782 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_88$gost89_ecb_encrypt.v:55$1783 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_89$gost89_ecb_encrypt.v:56$1784 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_90$gost89_ecb_encrypt.v:57$1785 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_91$gost89_ecb_encrypt.v:58$1786 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_92$gost89_ecb_encrypt.v:59$1787 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_93$gost89_ecb_encrypt.v:60$1788 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_94$gost89_ecb_encrypt.v:61$1789 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_95$gost89_ecb_encrypt.v:62$1790 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_96$gost89_ecb_encrypt.v:63$1791 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_97$gost89_ecb_encrypt.v:64$1792 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_98$gost89_ecb_encrypt.v:65$1793 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_99$gost89_ecb_encrypt.v:66$1794 ($eq).

yosys> peepopt

3.50. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.51. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> bmuxmap

3.52. Executing BMUXMAP pass.

yosys> demuxmap

3.53. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.54. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module gost89_cfb_decrypt:
  creating $macc model for $flatten\ecb_encrypt.$verific$add_22$gost89_ecb_encrypt.v:33$1753 ($add).
  creating $macc model for $flatten\ecb_encrypt.\rnd.$verific$add_3$gost89_round.v:12$1819 ($add).
  creating $alu model for $macc $flatten\ecb_encrypt.\rnd.$verific$add_3$gost89_round.v:12$1819.
  creating $alu model for $macc $flatten\ecb_encrypt.$verific$add_22$gost89_ecb_encrypt.v:33$1753.
  creating $alu model for $flatten\ecb_encrypt.$verific$LessThan_21$gost89_ecb_encrypt.v:32$1752 ($lt): new $alu
  creating $alu model for $flatten\ecb_encrypt.$verific$LessThan_25$gost89_ecb_encrypt.v:34$1756 ($lt): new $alu
  creating $alu model for $flatten\ecb_encrypt.$verific$equal_32$gost89_ecb_encrypt.v:38$1762 ($eq): merged with $flatten\ecb_encrypt.$verific$LessThan_21$gost89_ecb_encrypt.v:32$1752.
  creating $alu cell for $flatten\ecb_encrypt.$verific$LessThan_25$gost89_ecb_encrypt.v:34$1756: $auto$alumacc.cc:485:replace_alu$2471
  creating $alu cell for $flatten\ecb_encrypt.$verific$LessThan_21$gost89_ecb_encrypt.v:32$1752, $flatten\ecb_encrypt.$verific$equal_32$gost89_ecb_encrypt.v:38$1762: $auto$alumacc.cc:485:replace_alu$2476
  creating $alu cell for $flatten\ecb_encrypt.$verific$add_22$gost89_ecb_encrypt.v:33$1753: $auto$alumacc.cc:485:replace_alu$2487
  creating $alu cell for $flatten\ecb_encrypt.\rnd.$verific$add_3$gost89_round.v:12$1819: $auto$alumacc.cc:485:replace_alu$2490
  created 4 $alu and 0 $macc cells.

yosys> opt_expr

3.55. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.56. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.57. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~19 debug messages>

yosys> opt_reduce

3.58. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
    New input vector for $reduce_and cell $auto$opt_dff.cc:220:make_patterns_logic$2468: { $auto$alumacc.cc:501:replace_alu$2477 $auto$rtlil.cc:2369:Not$2466 }
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 1 changes.

yosys> opt_merge

3.59. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.60. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.61. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.62. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.63. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
MAX OPT ITERATION = 1

yosys> stat

3.64. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                174
   Number of wire bits:           4539
   Number of public wires:          61
   Number of public wire bits:    3474
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                214
     $alu                            4
     $and                            6
     $dff                            4
     $dffe                           6
     $eq                            31
     $logic_not                      1
     $mux                          137
     $not                            8
     $or                             1
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    2
     $reduce_or                      9
     $xor                            2


yosys> memory -nomap

3.65. Executing MEMORY pass.

yosys> opt_mem

3.65.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.65.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.65.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.65.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.65.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.65.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> memory_share

3.65.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.65.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.65.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> memory_collect

3.65.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.66. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                174
   Number of wire bits:           4539
   Number of public wires:          61
   Number of public wire bits:    3474
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                214
     $alu                            4
     $and                            6
     $dff                            4
     $dffe                           6
     $eq                            31
     $logic_not                      1
     $mux                          137
     $not                            8
     $or                             1
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    2
     $reduce_or                      9
     $xor                            2


yosys> muxpack

3.67. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~138 debug messages>

yosys> opt_clean

3.68. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> pmuxtree

3.69. Executing PMUXTREE pass.

yosys> muxpack

3.70. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting gost89_cfb_decrypt.$auto$pmuxtree.cc:65:recursive_mux_generator$2509 ... gost89_cfb_decrypt.$auto$pmuxtree.cc:65:recursive_mux_generator$2511 to a pmux with 2 cases.
Converting gost89_cfb_decrypt.$auto$pmuxtree.cc:65:recursive_mux_generator$2499 ... gost89_cfb_decrypt.$auto$pmuxtree.cc:65:recursive_mux_generator$2501 to a pmux with 2 cases.
Converted 4 (p)mux cells into 2 pmux cells.
<suppressed ~146 debug messages>

yosys> memory_map

3.71. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.72. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                188
   Number of wire bits:           4832
   Number of public wires:          61
   Number of public wire bits:    3474
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                225
     $alu                            4
     $and                            6
     $dff                            4
     $dffe                           6
     $eq                            31
     $logic_not                      1
     $mux                          142
     $not                            9
     $or                             3
     $pmux                           2
     $reduce_and                     2
     $reduce_bool                    2
     $reduce_or                     11
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.73. Executing TECHMAP pass (map to technology primitives).

3.73.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.73.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.73.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $or.
Using template $paramod$8fabc56b80a569262acfc42757a02ca0b8e91278\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $reduce_bool.
Using template $paramod$32efbfac1c4dc57230cf86180788fdfd12e3b511\_90_alu for cells of type $alu.
Using template $paramod$00298f3f8094950cb9a5ff2fda48d0d8bde8806c\_90_alu for cells of type $alu.
Using template $paramod$be80489e44a49c29884f59fd81c31ed03229cfc1\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $logic_not.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000110 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
No more expansions possible.
<suppressed ~804 debug messages>

yosys> stat

3.74. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                729
   Number of wire bits:          10294
   Number of public wires:          61
   Number of public wire bits:    3474
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2453
     $_AND_                        193
     $_DFFE_PP_                    289
     $_DFF_P_                       71
     $_MUX_                       1100
     $_NOT_                         91
     $_OR_                         322
     $_XOR_                        355
     adder_carry                    32


yosys> opt_expr

3.75. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~345 debug messages>

yosys> opt_merge -nomux

3.76. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
<suppressed ~636 debug messages>
Removed a total of 212 cells.

yosys> opt_muxtree

3.77. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.78. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.79. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.80. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.81. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 50 unused cells and 556 unused wires.
<suppressed ~51 debug messages>

yosys> opt_expr

3.83. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_muxtree

3.84. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.85. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.86. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.87. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.88. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.89. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> opt_expr

3.90. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.91. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~131 debug messages>

yosys> techmap -map +/techmap.v

3.92. Executing TECHMAP pass (map to technology primitives).

3.92.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.92.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.93. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_merge -nomux

3.94. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.95. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.96. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.97. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.98. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.99. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.100. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
MAX OPT ITERATION = 1

yosys> abc -dff

3.101. Executing ABC pass (technology mapping using ABC).

3.101.1. Summary of detected clock domains:
  647 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$2467, arst={ }, srst={ }
  356 cells in clk=\clk, en={ }, arst={ }, srst={ }
  67 cells in clk=\clk, en=$verific$n347$15, arst={ }, srst={ }
  130 cells in clk=\clk, en=\ecb_encrypt.load_data, arst={ }, srst={ }
  67 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$2456, arst={ }, srst={ }
  594 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$2462, arst={ }, srst={ }
  3 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$2459, arst={ }, srst={ }

3.101.2. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2467
Extracted 647 gates and 1326 wires to a netlist network with 679 inputs and 97 outputs.

3.101.2.1. Executing ABC.

3.101.3. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 356 gates and 486 wires to a netlist network with 129 inputs and 110 outputs.

3.101.3.1. Executing ABC.

3.101.4. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $verific$n347$15
Extracted 67 gates and 135 wires to a netlist network with 68 inputs and 65 outputs.

3.101.4.1. Executing ABC.

3.101.5. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \ecb_encrypt.load_data
Extracted 130 gates and 197 wires to a netlist network with 67 inputs and 130 outputs.

3.101.5.1. Executing ABC.

3.101.6. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2456
Extracted 67 gates and 134 wires to a netlist network with 67 inputs and 66 outputs.

3.101.6.1. Executing ABC.

3.101.7. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2462
Extracted 562 gates and 832 wires to a netlist network with 270 inputs and 34 outputs.

3.101.7.1. Executing ABC.

3.101.8. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2459
Extracted 3 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.101.8.1. Executing ABC.

yosys> abc -dff

3.102. Executing ABC pass (technology mapping using ABC).

3.102.1. Summary of detected clock domains:
  176 cells in clk=\clk, en=$abc$7136$ecb_encrypt.load_data, arst={ }, srst={ }
  84 cells in clk=\clk, en=$abc$6940$verific$n347$15, arst={ }, srst={ }
  76 cells in clk=\clk, en=$abc$5722$auto$opt_dff.cc:219:make_patterns_logic$2467, arst={ }, srst={ }
  86 cells in clk=\clk, en=$abc$7395$auto$opt_dff.cc:194:make_patterns_logic$2456, arst={ }, srst={ }
  958 cells in clk=\clk, en={ }, arst={ }, srst={ }
  619 cells in clk=\clk, en=$abc$7591$auto$opt_dff.cc:194:make_patterns_logic$2462, arst={ }, srst={ }
  4 cells in clk=\clk, en=$abc$8209$auto$opt_dff.cc:194:make_patterns_logic$2459, arst={ }, srst={ }

3.102.2. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7136$ecb_encrypt.load_data
Extracted 176 gates and 290 wires to a netlist network with 114 inputs and 129 outputs.

3.102.2.1. Executing ABC.

3.102.3. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$6940$verific$n347$15
Extracted 84 gates and 167 wires to a netlist network with 83 inputs and 65 outputs.

3.102.3.1. Executing ABC.

3.102.4. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$5722$auto$opt_dff.cc:219:make_patterns_logic$2467
Extracted 76 gates and 153 wires to a netlist network with 77 inputs and 65 outputs.

3.102.4.1. Executing ABC.

3.102.5. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7395$auto$opt_dff.cc:194:make_patterns_logic$2456
Extracted 86 gates and 174 wires to a netlist network with 88 inputs and 65 outputs.

3.102.5.1. Executing ABC.

3.102.6. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 958 gates and 1597 wires to a netlist network with 639 inputs and 136 outputs.

3.102.6.1. Executing ABC.

3.102.7. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7591$auto$opt_dff.cc:194:make_patterns_logic$2462
Extracted 587 gates and 859 wires to a netlist network with 272 inputs and 36 outputs.

3.102.7.1. Executing ABC.

3.102.8. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8209$auto$opt_dff.cc:194:make_patterns_logic$2459
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.102.8.1. Executing ABC.

yosys> abc -dff

3.103. Executing ABC pass (technology mapping using ABC).

3.103.1. Summary of detected clock domains:
  1002 cells in clk=\clk, en={ }, arst={ }, srst={ }
  171 cells in clk=\clk, en=$abc$8667$abc$5722$auto$opt_dff.cc:219:make_patterns_logic$2467, arst={ }, srst={ }
  163 cells in clk=\clk, en=$abc$8214$abc$7136$ecb_encrypt.load_data, arst={ }, srst={ }
  96 cells in clk=\clk, en=$abc$8863$abc$7395$auto$opt_dff.cc:194:make_patterns_logic$2456, arst={ }, srst={ }
  72 cells in clk=\clk, en=$abc$8472$abc$6940$verific$n347$15, arst={ }, srst={ }
  563 cells in clk=\clk, en=$abc$10205$abc$7591$auto$opt_dff.cc:194:make_patterns_logic$2462, arst={ }, srst={ }
  4 cells in clk=\clk, en=$abc$10767$abc$8209$auto$opt_dff.cc:194:make_patterns_logic$2459, arst={ }, srst={ }

3.103.2. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1002 gates and 1595 wires to a netlist network with 593 inputs and 113 outputs.

3.103.2.1. Executing ABC.

3.103.3. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8667$abc$5722$auto$opt_dff.cc:219:make_patterns_logic$2467
Extracted 171 gates and 316 wires to a netlist network with 145 inputs and 68 outputs.

3.103.3.1. Executing ABC.

3.103.4. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8214$abc$7136$ecb_encrypt.load_data
Extracted 163 gates and 268 wires to a netlist network with 105 inputs and 125 outputs.

3.103.4.1. Executing ABC.

3.103.5. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8863$abc$7395$auto$opt_dff.cc:194:make_patterns_logic$2456
Extracted 96 gates and 173 wires to a netlist network with 77 inputs and 65 outputs.

3.103.5.1. Executing ABC.

3.103.6. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8472$abc$6940$verific$n347$15
Extracted 72 gates and 145 wires to a netlist network with 73 inputs and 65 outputs.

3.103.6.1. Executing ABC.

3.103.7. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10205$abc$7591$auto$opt_dff.cc:194:make_patterns_logic$2462
Extracted 531 gates and 805 wires to a netlist network with 274 inputs and 37 outputs.

3.103.7.1. Executing ABC.

3.103.8. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10767$abc$8209$auto$opt_dff.cc:194:make_patterns_logic$2459
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.103.8.1. Executing ABC.

yosys> abc -dff

3.104. Executing ABC pass (technology mapping using ABC).

3.104.1. Summary of detected clock domains:
  901 cells in clk=\clk, en={ }, arst={ }, srst={ }
  287 cells in clk=\clk, en=$abc$11832$abc$8667$abc$5722$auto$opt_dff.cc:219:make_patterns_logic$2467, arst={ }, srst={ }
  117 cells in clk=\clk, en=$abc$12098$abc$8214$abc$7136$ecb_encrypt.load_data, arst={ }, srst={ }
  121 cells in clk=\clk, en=$abc$12352$abc$8863$abc$7395$auto$opt_dff.cc:194:make_patterns_logic$2456, arst={ }, srst={ }
  90 cells in clk=\clk, en=$abc$12547$abc$8472$abc$6940$verific$n347$15, arst={ }, srst={ }
  552 cells in clk=\clk, en=$abc$12742$abc$10205$abc$7591$auto$opt_dff.cc:194:make_patterns_logic$2462, arst={ }, srst={ }
  4 cells in clk=\clk, en=$abc$13297$abc$10767$abc$8209$auto$opt_dff.cc:194:make_patterns_logic$2459, arst={ }, srst={ }

3.104.2. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 901 gates and 1437 wires to a netlist network with 536 inputs and 123 outputs.

3.104.2.1. Executing ABC.

3.104.3. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$11832$abc$8667$abc$5722$auto$opt_dff.cc:219:make_patterns_logic$2467
Extracted 287 gates and 524 wires to a netlist network with 237 inputs and 73 outputs.

3.104.3.1. Executing ABC.

3.104.4. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12098$abc$8214$abc$7136$ecb_encrypt.load_data
Extracted 117 gates and 187 wires to a netlist network with 70 inputs and 116 outputs.

3.104.4.1. Executing ABC.

3.104.5. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12352$abc$8863$abc$7395$auto$opt_dff.cc:194:make_patterns_logic$2456
Extracted 121 gates and 214 wires to a netlist network with 93 inputs and 65 outputs.

3.104.5.1. Executing ABC.

3.104.6. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12547$abc$8472$abc$6940$verific$n347$15
Extracted 90 gates and 181 wires to a netlist network with 91 inputs and 65 outputs.

3.104.6.1. Executing ABC.

3.104.7. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12742$abc$10205$abc$7591$auto$opt_dff.cc:194:make_patterns_logic$2462
Extracted 520 gates and 791 wires to a netlist network with 271 inputs and 34 outputs.

3.104.7.1. Executing ABC.

3.104.8. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$13297$abc$10767$abc$8209$auto$opt_dff.cc:194:make_patterns_logic$2459
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.104.8.1. Executing ABC.

yosys> opt_ffinv

3.105. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.106. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~38 debug messages>

yosys> opt_merge -nomux

3.107. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
<suppressed ~21 debug messages>
Removed a total of 7 cells.

yosys> opt_muxtree

3.108. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.109. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.110. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.111. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.112. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13371 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li67_li67, Q = $abc$13303$lo67).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13374 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li70_li70, Q = $abc$13303$lo70).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13364 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li60_li60, Q = $abc$13303$lo60).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13361 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li57_li57, Q = $abc$13303$lo57).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13358 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li54_li54, Q = $abc$13303$lo54).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13357 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li53_li53, Q = $abc$13303$lo53).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13356 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li52_li52, Q = $abc$13303$lo52).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13355 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li51_li51, Q = $abc$13303$lo51).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13354 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li50_li50, Q = $abc$13303$lo50).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13353 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li49_li49, Q = $abc$13303$lo49).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13352 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li48_li48, Q = $abc$13303$lo48).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13350 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li46_li46, Q = $abc$13303$lo46).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13347 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li43_li43, Q = $abc$13303$lo43).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13346 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li42_li42, Q = $abc$13303$lo42).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13345 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li41_li41, Q = $abc$13303$lo41).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13343 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li39_li39, Q = $abc$13303$lo39).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13342 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li38_li38, Q = $abc$13303$lo38).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13341 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li37_li37, Q = $abc$13303$lo37).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13334 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li30_li30, Q = $abc$13303$lo30).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13333 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li29_li29, Q = $abc$13303$lo29).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13324 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li20_li20, Q = $abc$13303$lo20).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13321 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li17_li17, Q = $abc$13303$lo17).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13317 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$13303$li13_li13, Q = $abc$13303$lo13).

yosys> opt_clean

3.113. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 1 unused cells and 13564 unused wires.
<suppressed ~16 debug messages>

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~46 debug messages>

yosys> opt_muxtree

3.115. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.116. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.117. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
<suppressed ~66 debug messages>
Removed a total of 22 cells.

yosys> opt_share

3.118. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.119. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13351 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$10773$li68_li68, Q = $abc$13303$lo47).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13335 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$10773$li29_li29, Q = $abc$10773$lo29).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13316 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$10773$abc$9058$li59_li59, Q = $abc$10773$lo10).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13315 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$10773$abc$9058$li60_li60, Q = $abc$13303$lo11).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13309 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$10773$abc$9058$li62_li62, Q = $abc$13303$lo05).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13305 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$10773$abc$9058$li65_li65, Q = $abc$10773$abc$9058$lo65).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13344 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$10773$li38_li38, Q = $abc$10773$lo38).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13348 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$10773$li42_li42, Q = $abc$13303$lo44).
Adding EN signal on $abc$13303$auto$blifparse.cc:362:parse_blif$13327 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$10773$li21_li21, Q = $abc$10773$lo21).

yosys> opt_clean

3.120. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 54 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.121. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~18 debug messages>

yosys> opt_muxtree

3.122. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.123. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.124. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
<suppressed ~27 debug messages>
Removed a total of 9 cells.

yosys> opt_share

3.125. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.126. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.127. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 18 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.128. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_muxtree

3.129. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.130. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.131. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.132. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.133. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.134. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> opt_expr

3.135. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
MAX OPT ITERATION = 4

yosys> bmuxmap

3.136. Executing BMUXMAP pass.

yosys> demuxmap

3.137. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_kJXlfO/abc_tmp_1.scr

3.138. Executing ABC pass (technology mapping using ABC).

3.138.1. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Extracted 1787 gates and 2949 wires to a netlist network with 1161 inputs and 301 outputs.

3.138.1.1. Executing ABC.
DE:   #PIs = 1161  #Luts =   605  Max Lvl =   5  Avg Lvl =   2.31  [   0.57 sec. at Pass 0]
DE:   #PIs = 1161  #Luts =   564  Max Lvl =   5  Avg Lvl =   2.22  [   3.94 sec. at Pass 1]
DE:   #PIs = 1161  #Luts =   564  Max Lvl =   5  Avg Lvl =   2.22  [   0.84 sec. at Pass 2]
DE:   #PIs = 1161  #Luts =   564  Max Lvl =   5  Avg Lvl =   2.22  [   1.13 sec. at Pass 3]
DE:   #PIs = 1161  #Luts =   564  Max Lvl =   5  Avg Lvl =   2.22  [   1.15 sec. at Pass 4]
DE:   #PIs = 1161  #Luts =   564  Max Lvl =   5  Avg Lvl =   2.22  [   1.81 sec. at Pass 5]
DE:   #PIs = 1161  #Luts =   564  Max Lvl =   5  Avg Lvl =   2.22  [   3.78 sec. at Pass 6]
DE:   #PIs = 1161  #Luts =   564  Max Lvl =   5  Avg Lvl =   2.22  [   0.61 sec. at Pass 7]

yosys> opt_expr

3.139. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_merge -nomux

3.140. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.141. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.142. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.144. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.145. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.146. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 2944 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.147. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.148. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.149. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                796
   Number of wire bits:           4024
   Number of public wires:          47
   Number of public wire bits:    3212
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                955
     $_DFFE_PP_                    321
     $_DFF_P_                       39
     $lut                          563
     adder_carry                    32


yosys> shregmap -minlen 8 -maxlen 20

3.150. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.151. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.152. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                796
   Number of wire bits:           4024
   Number of public wires:          47
   Number of public wire bits:    3212
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                955
     $_DFFE_PP0P_                  321
     $_DFF_P_                       39
     $lut                          563
     adder_carry                    32


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.153. Executing TECHMAP pass (map to technology primitives).

3.153.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.153.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.153.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~1380 debug messages>

yosys> opt_expr -mux_undef

3.154. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~11889 debug messages>

yosys> simplemap

3.155. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.156. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_merge

3.157. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
<suppressed ~8646 debug messages>
Removed a total of 2882 cells.

yosys> opt_dff -nodffe -nosdff

3.158. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.159. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 3099 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.160. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~1009 debug messages>

yosys> opt_merge -nomux

3.161. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.162. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.163. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.164. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.165. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.166. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.167. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 53 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.168. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_kJXlfO/abc_tmp_2.scr

3.169. Executing ABC pass (technology mapping using ABC).

3.169.1. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Extracted 2214 gates and 3377 wires to a netlist network with 1161 inputs and 300 outputs.

3.169.1.1. Executing ABC.
DE:   #PIs = 1161  #Luts =   563  Max Lvl =   5  Avg Lvl =   2.22  [   0.13 sec. at Pass 0]
DE:   #PIs = 1161  #Luts =   557  Max Lvl =   5  Avg Lvl =   2.20  [   1.96 sec. at Pass 1]
DE:   #PIs = 1161  #Luts =   557  Max Lvl =   5  Avg Lvl =   2.20  [   0.65 sec. at Pass 2]
DE:   #PIs = 1161  #Luts =   557  Max Lvl =   5  Avg Lvl =   2.20  [   0.85 sec. at Pass 3]
DE:   #PIs = 1161  #Luts =   557  Max Lvl =   5  Avg Lvl =   2.20  [   0.78 sec. at Pass 4]
DE:   #PIs = 1161  #Luts =   557  Max Lvl =   5  Avg Lvl =   2.20  [   1.55 sec. at Pass 5]
DE:   #PIs = 1161  #Luts =   557  Max Lvl =   5  Avg Lvl =   2.20  [   4.97 sec. at Pass 6]
DE:   #PIs = 1161  #Luts =   557  Max Lvl =   5  Avg Lvl =   2.20  [   1.06 sec. at Pass 7]

yosys> opt_expr

3.170. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_merge -nomux

3.171. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.172. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.173. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.174. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.175. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.176. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.177. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 3058 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.178. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.179. Executing HIERARCHY pass (managing design hierarchy).

3.179.1. Analyzing design hierarchy..
Top module:  \gost89_cfb_decrypt

3.179.2. Analyzing design hierarchy..
Top module:  \gost89_cfb_decrypt
Removed 0 unused modules.

yosys> stat

3.180. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                790
   Number of wire bits:           4018
   Number of public wires:          47
   Number of public wire bits:    3212
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                949
     $lut                          557
     adder_carry                    32
     dffsre                        360


yosys> opt_clean -purge

3.181. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 25 unused wires.
<suppressed ~25 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.182. Executing Verilog backend.
Dumping module `\gost89_cfb_decrypt'.

Warnings: 1 unique messages, 1 total
End of script. Logfile hash: c710909c62, CPU: user 9.43s system 0.20s, MEM: 58.44 MB peak
Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)
Time spent: 94% 6x abc (156 sec), 1% 31x opt_expr (3 sec), ...
real 47.19
user 154.50
sys 10.88
