
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.14+36 (git sha1 15a4e900b, gcc 7.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k demux.v io_reg_tc1.v mux.v

yosys> verific -vlog2k demux.v io_reg_tc1.v mux.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'demux.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'io_reg_tc1.v'
VERIFIC-INFO [VERI-2561] io_reg_tc1.v:8: undeclared symbol 'mux_out', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'mux.v'

yosys> synth_rs -top io_reg_tc1 -tech generic -goal area -no_dsp -no_bram -verilog io_reg_tc1.verilog

3. Executing synth_rs pass.

yosys> hierarchy -check -top io_reg_tc1

3.1. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] io_reg_tc1.v:1: compiling module 'io_reg_tc1'
VERIFIC-INFO [VERI-1018] mux.v:2: compiling module 'mux_512x1'
VERIFIC-INFO [VERI-1018] mux.v:16: compiling module 'mux_256x1'
VERIFIC-INFO [VERI-1018] mux.v:30: compiling module 'mux_128x1'
VERIFIC-INFO [VERI-1018] mux.v:44: compiling module 'mux_64x1'
VERIFIC-INFO [VERI-1018] mux.v:58: compiling module 'mux_32x1'
VERIFIC-INFO [VERI-1018] mux.v:72: compiling module 'mux_16x1'
VERIFIC-INFO [VERI-1018] mux.v:86: compiling module 'mux_8x1'
VERIFIC-INFO [VERI-1018] mux.v:100: compiling module 'mux_4x1'
VERIFIC-INFO [VERI-1018] mux.v:114: compiling module 'mux_2x1_reg'
VERIFIC-INFO [VERI-1018] mux.v:132: compiling module 'mux_2x1'
VERIFIC-INFO [VERI-1018] demux.v:2: compiling module 'demux_1x512'
VERIFIC-INFO [VERI-1018] demux.v:116: compiling module 'demux_1x2'
VERIFIC-INFO [VERI-1018] demux.v:16: compiling module 'demux_1x256'
VERIFIC-INFO [VERI-1018] demux.v:30: compiling module 'demux_1x128'
VERIFIC-INFO [VERI-1018] demux.v:44: compiling module 'demux_1x64'
VERIFIC-INFO [VERI-1018] demux.v:58: compiling module 'demux_1x32'
VERIFIC-INFO [VERI-1018] demux.v:73: compiling module 'demux_1x16'
VERIFIC-INFO [VERI-1018] demux.v:87: compiling module 'demux_1x8'
VERIFIC-INFO [VERI-1018] demux.v:101: compiling module 'demux_1x4'
VERIFIC-INFO [VERI-1018] demux.v:125: compiling module 'demux_1x2_reg'
Importing module io_reg_tc1.
Importing module mux_512x1.
Importing module mux_256x1.
Importing module mux_128x1.
Importing module mux_64x1.
Importing module mux_32x1.
Importing module mux_16x1.
Importing module mux_8x1.
Importing module mux_4x1.
Importing module mux_2x1_reg.
Importing module mux_2x1.
Importing module demux_1x512.
Importing module demux_1x2.
Importing module demux_1x256.
Importing module demux_1x128.
Importing module demux_1x64.
Importing module demux_1x32.
Importing module demux_1x16.
Importing module demux_1x8.
Importing module demux_1x4.
Importing module demux_1x2_reg.

3.1.1. Analyzing design hierarchy..
Top module:  \io_reg_tc1
Used module:     \demux_1x512
Used module:         \demux_1x256
Used module:             \demux_1x128
Used module:                 \demux_1x64
Used module:                     \demux_1x32
Used module:                         \demux_1x16
Used module:                             \demux_1x8
Used module:                                 \demux_1x4
Used module:                                     \demux_1x2_reg
Used module:                                     \demux_1x2
Used module:     \mux_512x1
Used module:         \mux_2x1
Used module:         \mux_256x1
Used module:             \mux_128x1
Used module:                 \mux_64x1
Used module:                     \mux_32x1
Used module:                         \mux_16x1
Used module:                             \mux_8x1
Used module:                                 \mux_4x1
Used module:                                     \mux_2x1_reg

3.1.2. Analyzing design hierarchy..
Top module:  \io_reg_tc1
Used module:     \demux_1x512
Used module:         \demux_1x256
Used module:             \demux_1x128
Used module:                 \demux_1x64
Used module:                     \demux_1x32
Used module:                         \demux_1x16
Used module:                             \demux_1x8
Used module:                                 \demux_1x4
Used module:                                     \demux_1x2_reg
Used module:                                     \demux_1x2
Used module:     \mux_512x1
Used module:         \mux_2x1
Used module:         \mux_256x1
Used module:             \mux_128x1
Used module:                 \mux_64x1
Used module:                     \mux_32x1
Used module:                         \mux_16x1
Used module:                             \mux_8x1
Used module:                                 \mux_4x1
Used module:                                     \mux_2x1_reg
Removed 0 unused modules.

yosys> proc

3.2. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.2.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.2.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.2.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.2.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.2.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.2.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.2.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.2.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.2.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.2.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.2.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module demux_1x2_reg.
Optimizing module demux_1x4.
Optimizing module demux_1x8.
Optimizing module demux_1x16.
Optimizing module demux_1x32.
Optimizing module demux_1x64.
Optimizing module demux_1x128.
Optimizing module demux_1x256.
Optimizing module demux_1x2.
Optimizing module demux_1x512.
Optimizing module mux_2x1.
Optimizing module mux_2x1_reg.
Optimizing module mux_4x1.
Optimizing module mux_8x1.
Optimizing module mux_16x1.
Optimizing module mux_32x1.
Optimizing module mux_64x1.
Optimizing module mux_128x1.
Optimizing module mux_256x1.
Optimizing module mux_512x1.
Optimizing module io_reg_tc1.

yosys> flatten

3.3. Executing FLATTEN pass (flatten design).
Deleting now unused module demux_1x2_reg.
Deleting now unused module demux_1x4.
Deleting now unused module demux_1x8.
Deleting now unused module demux_1x16.
Deleting now unused module demux_1x32.
Deleting now unused module demux_1x64.
Deleting now unused module demux_1x128.
Deleting now unused module demux_1x256.
Deleting now unused module demux_1x2.
Deleting now unused module demux_1x512.
Deleting now unused module mux_2x1.
Deleting now unused module mux_2x1_reg.
Deleting now unused module mux_4x1.
Deleting now unused module mux_8x1.
Deleting now unused module mux_16x1.
Deleting now unused module mux_32x1.
Deleting now unused module mux_64x1.
Deleting now unused module mux_128x1.
Deleting now unused module mux_256x1.
Deleting now unused module mux_512x1.
<suppressed ~50 debug messages>

yosys> tribuf -logic

3.4. Executing TRIBUF pass.

yosys> opt_expr

3.5. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_clean

3.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..
Removed 0 unused cells and 18395 unused wires.
<suppressed ~1791 debug messages>

yosys> check

3.7. Executing CHECK pass (checking for obvious problems).
Checking module io_reg_tc1...
Found and reported 0 problems.

yosys> deminout

3.8. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt -nodffe -nosdff

3.9. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.9.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.9.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.9.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~573 debug messages>

yosys> opt_reduce

3.9.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.9.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.9.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($aldff) from module io_reg_tc1.

yosys> opt_clean

3.9.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.9.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.9.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.9.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~573 debug messages>

yosys> opt_reduce

3.9.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.9.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.9.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.9.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.9.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.9.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

3.10. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.10.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.10.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.10.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.10.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> fsm_opt

3.10.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode

3.10.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.10.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.10.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~573 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3388 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..
Removed 256 unused cells and 256 unused wires.
<suppressed ~512 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~285 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.12. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

3.13. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.14. Executing PMUXTREE pass.

yosys> opt_clean

3.15. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> techmap

3.16. Executing TECHMAP pass (map to technology primitives).

3.16.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.16.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $sdff.
No more expansions possible.
<suppressed ~1861 debug messages>

yosys> alumacc

3.17. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module io_reg_tc1:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.18. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.18.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.18.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.18.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.18.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff

3.18.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.18.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.18.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.18.9. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.19. Executing MEMORY pass.

yosys> opt_mem

3.19.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.19.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.19.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.19.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.19.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> memory_share

3.19.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.19.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.19.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> memory_collect

3.19.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.20. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr -mux_undef

3.21. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> simplemap

3.22. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge

3.24. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.25. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt -nodffe -nosdff

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.27.9. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.
<suppressed ~255 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.30.10. Finished OPT passes. (There is nothing left to do.)

yosys> techmap

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.32.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Extracting gate netlist of module `\io_reg_tc1' to `<abc-temp-dir>/input.blif'..
Extracted 1021 gates and 1551 wires to a netlist network with 529 inputs and 256 outputs.

3.33.1.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/yosys_verific_rs/result_09-03-2022T20-36-44/All_lut_synth_rs_area.json/io_reg_tc1/abc_tmp.scr 
ABC: netlist  : i/o =    529/    256  and =    2043  lev =   26 (26.00)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    699  edge =    2081  lev =   14 (14.00)  mem = 0.02 MB
ABC: netlist  : i/o =    529/    256  and =    2403  lev =   22 (20.59)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    477  edge =    2207  lev =    7 (6.40)  mem = 0.02 MB
ABC: netlist  : i/o =    529/    256  and =    2424  lev =   22 (22.00)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    466  edge =    2209  lev =    7 (6.37)  mem = 0.02 MB
ABC: netlist  : i/o =    529/    256  and =    2405  lev =   20 (18.80)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    469  edge =    2192  lev =    7 (6.40)  mem = 0.02 MB
ABC: netlist  : i/o =    529/    256  and =    2831  lev =   26 (23.00)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    439  edge =    2590  lev =    8 (8.00)  mem = 0.03 MB
ABC: netlist  : i/o =    529/    256  and =    2403  lev =   22 (20.59)  mem = 0.06 MB
ABC: Mapping (K=6)  :  lut =    468  edge =    2192  lev =    8 (7.40)  mem = 0.02 MB
ABC: netlist  : i/o =    529/    256  and =    2403  lev =   22 (22.00)  mem = 0.06 MB
ABC: Mapping (K=6)  :  lut =    468  edge =    2191  lev =    7 (6.40)  mem = 0.02 MB
ABC: netlist  : i/o =    529/    256  and =    2424  lev =   22 (20.55)  mem = 0.06 MB
ABC: Mapping (K=6)  :  lut =    467  edge =    2211  lev =    8 (7.37)  mem = 0.02 MB
ABC: netlist  : i/o =    529/    256  and =    2724  lev =   22 (21.46)  mem = 0.07 MB
ABC: Mapping (K=6)  :  lut =    445  edge =    2498  lev =    9 (8.46)  mem = 0.03 MB
ABC: netlist  : i/o =    529/    256  and =    2427  lev =   22 (22.00)  mem = 0.06 MB
ABC: Mapping (K=6)  :  lut =    467  edge =    2214  lev =    8 (7.36)  mem = 0.02 MB
ABC: netlist  : i/o =    529/    256  and =    2403  lev =   22 (22.00)  mem = 0.06 MB
ABC: Mapping (K=6)  :  lut =    469  edge =    2195  lev =    7 (6.40)  mem = 0.02 MB
ABC: netlist  : i/o =    529/    256  and =    2403  lev =   22 (20.59)  mem = 0.06 MB
ABC: Mapping (K=6)  :  lut =    468  edge =    2191  lev =    8 (7.40)  mem = 0.02 MB
ABC: netlist  : i/o =    529/    256  and =    2403  lev =   22 (22.00)  mem = 0.06 MB
ABC: Mapping (K=6)  :  lut =    468  edge =    2191  lev =    8 (7.40)  mem = 0.02 MB
ABC: netlist  : i/o =    529/    256  and =    2831  lev =   26 (23.00)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    439  edge =    2590  lev =    8 (8.00)  mem = 0.03 MB
ABC: netlist  : i/o =    529/    256  and =    2831  lev =   26 (23.00)  mem = 0.07 MB
ABC: Mapping (K=6)  :  lut =    437  edge =    2587  lev =    8 (8.00)  mem = 0.03 MB
ABC: netlist  : i/o =    529/    256  and =    2831  lev =   26 (23.00)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    437  edge =    2587  lev =    8 (8.00)  mem = 0.03 MB
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      437
ABC RESULTS:        internal signals:      766
ABC RESULTS:           input signals:      529
ABC RESULTS:          output signals:      256
Removing temp directory.

yosys> opt

3.34. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.34.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.34.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.34.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.34.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.34.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff

3.34.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.34.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..
Removed 0 unused cells and 3336 unused wires.
<suppressed ~2552 debug messages>

yosys> opt_expr

3.34.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.34.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.34.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.34.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.34.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff

3.34.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.34.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.34.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.34.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.35. Executing HIERARCHY pass (managing design hierarchy).

3.35.1. Analyzing design hierarchy..
Top module:  \io_reg_tc1

3.35.2. Analyzing design hierarchy..
Top module:  \io_reg_tc1
Removed 0 unused modules.

yosys> stat

3.36. Printing statistics.

=== io_reg_tc1 ===

   Number of wires:               5042
   Number of wire bits:          15278
   Number of public wires:        4861
   Number of public wire bits:   15097
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1461
     $_DFF_P_                      512
     $_SDFF_PN0_                   256
     $_SDFF_PP0_                   256
     $lut                          437


yosys> opt_clean -purge

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..
Removed 0 unused cells and 4088 unused wires.
<suppressed ~4088 debug messages>

yosys> write_verilog -noattr -nohex io_reg_tc1.verilog

3.38. Executing Verilog backend.

yosys> bmuxmap

3.38.1. Executing BMUXMAP pass.

yosys> demuxmap

3.38.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\io_reg_tc1'.

End of script. Logfile hash: 845402f41e, CPU: user 8.75s system 0.08s, MEM: 72.32 MB peak
Yosys 0.14+36 (git sha1 15a4e900b, gcc 7.1.0 -fPIC -Os)
Time spent: 52% 1x abc (9 sec), 15% 19x opt_clean (2 sec), ...
