
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.16+6 (git sha1 0c82fb7e3, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k demux.v io_reg_tc1.v mux.v

yosys> verific -vlog2k demux.v io_reg_tc1.v mux.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'demux.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'io_reg_tc1.v'
VERIFIC-INFO [VERI-2561] io_reg_tc1.v:8: undeclared symbol 'mux_out', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'mux.v'

yosys> synth_rs -top io_reg_tc1 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.2.36

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top io_reg_tc1

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] io_reg_tc1.v:1: compiling module 'io_reg_tc1'
VERIFIC-INFO [VERI-1018] mux.v:2: compiling module 'mux_512x1'
VERIFIC-INFO [VERI-1018] mux.v:16: compiling module 'mux_256x1'
VERIFIC-INFO [VERI-1018] mux.v:30: compiling module 'mux_128x1'
VERIFIC-INFO [VERI-1018] mux.v:44: compiling module 'mux_64x1'
VERIFIC-INFO [VERI-1018] mux.v:58: compiling module 'mux_32x1'
VERIFIC-INFO [VERI-1018] mux.v:72: compiling module 'mux_16x1'
VERIFIC-INFO [VERI-1018] mux.v:86: compiling module 'mux_8x1'
VERIFIC-INFO [VERI-1018] mux.v:100: compiling module 'mux_4x1'
VERIFIC-INFO [VERI-1018] mux.v:114: compiling module 'mux_2x1_reg'
VERIFIC-INFO [VERI-1018] mux.v:132: compiling module 'mux_2x1'
VERIFIC-INFO [VERI-1018] demux.v:2: compiling module 'demux_1x512'
VERIFIC-INFO [VERI-1018] demux.v:116: compiling module 'demux_1x2'
VERIFIC-INFO [VERI-1018] demux.v:16: compiling module 'demux_1x256'
VERIFIC-INFO [VERI-1018] demux.v:30: compiling module 'demux_1x128'
VERIFIC-INFO [VERI-1018] demux.v:44: compiling module 'demux_1x64'
VERIFIC-INFO [VERI-1018] demux.v:58: compiling module 'demux_1x32'
VERIFIC-INFO [VERI-1018] demux.v:73: compiling module 'demux_1x16'
VERIFIC-INFO [VERI-1018] demux.v:87: compiling module 'demux_1x8'
VERIFIC-INFO [VERI-1018] demux.v:101: compiling module 'demux_1x4'
VERIFIC-INFO [VERI-1018] demux.v:125: compiling module 'demux_1x2_reg'
Importing module io_reg_tc1.
Importing module demux_1x512.
Importing module demux_1x2.
Importing module demux_1x256.
Importing module demux_1x128.
Importing module demux_1x64.
Importing module demux_1x32.
Importing module demux_1x16.
Importing module demux_1x8.
Importing module demux_1x4.
Importing module demux_1x2_reg.
Importing module mux_512x1.
Importing module mux_256x1.
Importing module mux_128x1.
Importing module mux_2x1.
Importing module mux_64x1.
Importing module mux_32x1.
Importing module mux_16x1.
Importing module mux_8x1.
Importing module mux_4x1.
Importing module mux_2x1_reg.

3.3.1. Analyzing design hierarchy..
Top module:  \io_reg_tc1
Used module:     \demux_1x512
Used module:         \demux_1x256
Used module:             \demux_1x128
Used module:                 \demux_1x64
Used module:                     \demux_1x32
Used module:                         \demux_1x16
Used module:                             \demux_1x8
Used module:                                 \demux_1x4
Used module:                                     \demux_1x2_reg
Used module:                                     \demux_1x2
Used module:     \mux_512x1
Used module:         \mux_2x1
Used module:         \mux_256x1
Used module:             \mux_128x1
Used module:                 \mux_64x1
Used module:                     \mux_32x1
Used module:                         \mux_16x1
Used module:                             \mux_8x1
Used module:                                 \mux_4x1
Used module:                                     \mux_2x1_reg

3.3.2. Analyzing design hierarchy..
Top module:  \io_reg_tc1
Used module:     \demux_1x512
Used module:         \demux_1x256
Used module:             \demux_1x128
Used module:                 \demux_1x64
Used module:                     \demux_1x32
Used module:                         \demux_1x16
Used module:                             \demux_1x8
Used module:                                 \demux_1x4
Used module:                                     \demux_1x2_reg
Used module:                                     \demux_1x2
Used module:     \mux_512x1
Used module:         \mux_2x1
Used module:         \mux_256x1
Used module:             \mux_128x1
Used module:                 \mux_64x1
Used module:                     \mux_32x1
Used module:                         \mux_16x1
Used module:                             \mux_8x1
Used module:                                 \mux_4x1
Used module:                                     \mux_2x1_reg
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module mux_2x1_reg.
Optimizing module mux_4x1.
Optimizing module mux_8x1.
Optimizing module mux_16x1.
Optimizing module mux_32x1.
Optimizing module mux_64x1.
Optimizing module mux_2x1.
Optimizing module mux_128x1.
Optimizing module mux_256x1.
Optimizing module mux_512x1.
Optimizing module demux_1x2_reg.
Optimizing module demux_1x4.
Optimizing module demux_1x8.
Optimizing module demux_1x16.
Optimizing module demux_1x32.
Optimizing module demux_1x64.
Optimizing module demux_1x128.
Optimizing module demux_1x256.
Optimizing module demux_1x2.
Optimizing module demux_1x512.
Optimizing module io_reg_tc1.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module mux_2x1_reg.
Deleting now unused module mux_4x1.
Deleting now unused module mux_8x1.
Deleting now unused module mux_16x1.
Deleting now unused module mux_32x1.
Deleting now unused module mux_64x1.
Deleting now unused module mux_2x1.
Deleting now unused module mux_128x1.
Deleting now unused module mux_256x1.
Deleting now unused module mux_512x1.
Deleting now unused module demux_1x2_reg.
Deleting now unused module demux_1x4.
Deleting now unused module demux_1x8.
Deleting now unused module demux_1x16.
Deleting now unused module demux_1x32.
Deleting now unused module demux_1x64.
Deleting now unused module demux_1x128.
Deleting now unused module demux_1x256.
Deleting now unused module demux_1x2.
Deleting now unused module demux_1x512.
<suppressed ~50 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..
Removed 0 unused cells and 18395 unused wires.
<suppressed ~1791 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module io_reg_tc1...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~573 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($aldff) from module io_reg_tc1.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~573 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~573 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$2216 ($dff) from module io_reg_tc1 (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..
Removed 256 unused cells and 256 unused wires.
<suppressed ~512 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~285 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.13.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module io_reg_tc1:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~285 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> stat

3.22. Printing statistics.

=== io_reg_tc1 ===

   Number of wires:               7412
   Number of wire bits:          17902
   Number of public wires:        7412
   Number of public wire bits:   17902
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1790
     $dff                          512
     $mux                          766
     $sdff                         512


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.23. Executing TECHMAP pass (map to technology primitives).

3.23.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.23.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.23.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $sdff.
No more expansions possible.
<suppressed ~1861 debug messages>

yosys> stat

3.24. Printing statistics.

=== io_reg_tc1 ===

   Number of wires:               7412
   Number of wire bits:          17902
   Number of public wires:        7412
   Number of public wire bits:   17902
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2045
     $_DFF_P_                      512
     $_MUX_                       1021
     $_SDFF_PN0_                   256
     $_SDFF_PP0_                   256


yosys> opt

3.25. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.25.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.25.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.25.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.25.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.25.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.25.9. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.
<suppressed ~255 debug messages>

yosys> opt_merge

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff

3.26.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

3.26.5. Finished fast OPT passes.

yosys> memory_map

3.27. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_share

3.28.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.28.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr -full

3.28.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.28.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.29. Executing ABC pass (technology mapping using ABC).

3.29.1. Summary of detected clock domains:
  466 cells in clk=\clk, en={ }, arst={ }, srst=!\demux_sel [0]
  768 cells in clk=\clk, en={ }, arst={ }, srst={ }
  811 cells in clk=\clk, en={ }, arst={ }, srst=\demux_sel [0]

3.29.2. Extracting gate netlist of module `\io_reg_tc1' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, synchronously reset by !\demux_sel [0]
Extracted 466 gates and 688 wires to a netlist network with 221 inputs and 424 outputs.

3.29.2.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/build/logic_synthesis-rs/bin/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.2.2. Re-integrating ABC results.
ABC RESULTS:               AND cells:      153
ABC RESULTS:            ANDNOT cells:      166
ABC RESULTS:               BUF cells:      403
ABC RESULTS:               DFF cells:      256
ABC RESULTS:        internal signals:       43
ABC RESULTS:           input signals:      221
ABC RESULTS:          output signals:      424
Removing temp directory.

3.29.3. Extracting gate netlist of module `\io_reg_tc1' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 768 gates and 1281 wires to a netlist network with 513 inputs and 256 outputs.

3.29.3.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/build/logic_synthesis-rs/bin/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: Warning: 512 registers in this network have don't-care init values.
ABC: The don't-care are assumed to be 0. The result may not verify.
ABC: Use command "print_latch" to see the init values of registers.
ABC: Use command "zero" to convert or "init" to change the values.
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.3.2. Re-integrating ABC results.
ABC RESULTS:               BUF cells:      512
ABC RESULTS:               DFF cells:      512
ABC RESULTS:               MUX cells:      256
ABC RESULTS:        internal signals:      512
ABC RESULTS:           input signals:      513
ABC RESULTS:          output signals:      256
Removing temp directory.

3.29.4. Extracting gate netlist of module `\io_reg_tc1' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, synchronously reset by \demux_sel [0]
Extracted 811 gates and 1252 wires to a netlist network with 440 inputs and 470 outputs.

3.29.4.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/build/logic_synthesis-rs/bin/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.4.2. Re-integrating ABC results.
ABC RESULTS:               AND cells:      322
ABC RESULTS:            ANDNOT cells:      229
ABC RESULTS:               BUF cells:      365
ABC RESULTS:               DFF cells:      256
ABC RESULTS:               MUX cells:      129
ABC RESULTS:              NAND cells:      115
ABC RESULTS:               NOR cells:       43
ABC RESULTS:                OR cells:       47
ABC RESULTS:             ORNOT cells:       69
ABC RESULTS:        internal signals:      342
ABC RESULTS:           input signals:      440
ABC RESULTS:          output signals:      470
Removing temp directory.

yosys> abc -script abc_tmp.scr

3.30. Executing ABC pass (technology mapping using ABC).

3.30.1. Extracting gate netlist of module `\io_reg_tc1' to `<abc-temp-dir>/input.blif'..
Extracted 1529 gates and 2058 wires to a netlist network with 529 inputs and 512 outputs.

3.30.1.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/build/logic_synthesis-rs/bin/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/clean_repo/yosys_verific_rs/result_20-04-2022T11-33-54/All_lut_synth_rs_ade.json/io_reg_tc1/abc_tmp.scr 
ABC:   #Luts =   984  Max Lvl =  15  Avg Lvl =  15.00  [   0.11 sec. at Pass 0]
ABC:   #Luts =   732  Max Lvl =   8  Avg Lvl =   7.39  [   4.18 sec. at Pass 1]
ABC:   #Luts =   709  Max Lvl =   9  Avg Lvl =   8.96  [   1.11 sec. at Pass 2]
ABC:   #Luts =   705  Max Lvl =   9  Avg Lvl =   8.14  [   3.56 sec. at Pass 3]
ABC:   #Luts =   697  Max Lvl =   8  Avg Lvl =   7.50  [   1.35 sec. at Pass 4]
ABC:   #Luts =   697  Max Lvl =   8  Avg Lvl =   7.50  [   3.38 sec. at Pass 5]
ABC:   #Luts =   697  Max Lvl =   8  Avg Lvl =   7.50  [   1.98 sec. at Pass 6]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.30.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      697
ABC RESULTS:        internal signals:     1017
ABC RESULTS:           input signals:      529
ABC RESULTS:          output signals:      512
Removing temp directory.

yosys> opt

3.31. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.31.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.31.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
<suppressed ~384 debug messages>
Removed a total of 128 cells.

yosys> opt_muxtree

3.31.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.31.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.31.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff

3.31.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..
Removed 0 unused cells and 8599 unused wires.
<suppressed ~3064 debug messages>

yosys> opt_expr

3.31.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.31.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.31.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.31.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.31.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff

3.31.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.31.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.31.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.32. Printing statistics.

=== io_reg_tc1 ===

   Number of wires:               5046
   Number of wire bits:          15282
   Number of public wires:        4349
   Number of public wire bits:   14585
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1465
     $_DFF_P_                      512
     $_SDFF_PN0_                   256
     $_SDFF_PP0_                   256
     $lut                          441


yosys> shregmap -minlen 8 -maxlen 20

3.33. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.34. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.35. Printing statistics.

=== io_reg_tc1 ===

   Number of wires:               5558
   Number of wire bits:          15794
   Number of public wires:        4349
   Number of public wire bits:   14585
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1977
     $_DFF_P_                     1024
     $_MUX_                        512
     $lut                          441


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.36. Executing TECHMAP pass (map to technology primitives).

3.36.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.36.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.36.3. Continuing TECHMAP pass.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~1601 debug messages>

yosys> opt_expr -mux_undef

3.37. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.
<suppressed ~21830 debug messages>

yosys> simplemap

3.38. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.39. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge

3.40. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
<suppressed ~8265 debug messages>
Removed a total of 2755 cells.

yosys> opt_dff -nodffe -nosdff

3.41. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..
Removed 0 unused cells and 4500 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.43. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.43.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.
<suppressed ~740 debug messages>

yosys> opt_merge -nomux

3.43.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.43.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.43.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.43.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.43.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.43.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..
Removed 0 unused cells and 9 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.43.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.43.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.43.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.43.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.43.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.43.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.43.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.43.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.43.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.44. Executing ABC pass (technology mapping using ABC).

3.44.1. Extracting gate netlist of module `\io_reg_tc1' to `<abc-temp-dir>/input.blif'..
Extracted 2298 gates and 2830 wires to a netlist network with 530 inputs and 512 outputs.

3.44.1.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/build/logic_synthesis-rs/bin/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/clean_repo/yosys_verific_rs/result_20-04-2022T11-33-54/All_lut_synth_rs_ade.json/io_reg_tc1/abc_tmp.scr 
ABC:   #Luts =   787  Max Lvl =  10  Avg Lvl =   8.52  [   0.12 sec. at Pass 0]
ABC:   #Luts =   731  Max Lvl =  10  Avg Lvl =   9.38  [   8.09 sec. at Pass 1]
ABC:   #Luts =   721  Max Lvl =  10  Avg Lvl =   9.24  [   1.75 sec. at Pass 2]
ABC:   #Luts =   710  Max Lvl =  11  Avg Lvl =  10.88  [   3.52 sec. at Pass 3]
ABC:   #Luts =   710  Max Lvl =  11  Avg Lvl =  10.88  [   2.36 sec. at Pass 4]
ABC:   #Luts =   701  Max Lvl =   8  Avg Lvl =   8.00  [   3.66 sec. at Pass 5]
ABC:   #Luts =   701  Max Lvl =   8  Avg Lvl =   8.00  [   2.53 sec. at Pass 6]
ABC:   #Luts =   701  Max Lvl =   8  Avg Lvl =   8.00  [   4.26 sec. at Pass 7]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.44.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      701
ABC RESULTS:        internal signals:     1788
ABC RESULTS:           input signals:      530
ABC RESULTS:          output signals:      512
Removing temp directory.

yosys> opt

3.45. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.45.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

yosys> opt_merge -nomux

3.45.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.45.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.45.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff

3.45.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..
Removed 0 unused cells and 2914 unused wires.
<suppressed ~513 debug messages>

yosys> opt_expr

3.45.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.45.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.45.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_tc1..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_tc1.
Performed a total of 0 changes.

yosys> opt_merge

3.45.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_tc1'.
Removed a total of 0 cells.

yosys> opt_dff

3.45.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..

yosys> opt_expr

3.45.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_tc1.

3.45.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.46. Executing HIERARCHY pass (managing design hierarchy).

3.46.1. Analyzing design hierarchy..
Top module:  \io_reg_tc1

3.46.2. Analyzing design hierarchy..
Top module:  \io_reg_tc1
Removed 0 unused modules.

yosys> stat

3.47. Printing statistics.

=== io_reg_tc1 ===

   Number of wires:               5050
   Number of wire bits:          15030
   Number of public wires:        3837
   Number of public wire bits:   13817
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1725
     $lut                          701
     dffsre                       1024


yosys> opt_clean -purge

3.48. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_tc1..
Removed 0 unused cells and 3832 unused wires.
<suppressed ~3832 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.49. Executing Verilog backend.

yosys> bmuxmap

3.49.1. Executing BMUXMAP pass.

yosys> demuxmap

3.49.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\io_reg_tc1'.

End of script. Logfile hash: 2965e0979f, CPU: user 15.42s system 0.24s, MEM: 85.53 MB peak
Yosys 0.16+6 (git sha1 0c82fb7e3, gcc 9.1.0 -fPIC -Os)
Time spent: 95% 3x abc (327 sec), 1% 22x opt_clean (4 sec), ...
real 59.20
user 327.88
sys 14.61
