
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.8
 Yosys 0.16+6 (git sha1 7f5477eb1, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k wb_conmax_defines.vh wb_conmax.v wb_conmax_arb.v wb_conmax_master_if.v wb_conmax_msel.v wb_conmax_pri_dec.v wb_conmax_pri_enc.v wb_conmax_rf.v wb_conmax_slave_if.v

yosys> verific -vlog2k wb_conmax_defines.vh wb_conmax.v wb_conmax_arb.v wb_conmax_master_if.v wb_conmax_msel.v wb_conmax_pri_dec.v wb_conmax_pri_enc.v wb_conmax_rf.v wb_conmax_slave_if.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wb_conmax_defines.vh'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wb_conmax.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wb_conmax_arb.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wb_conmax_master_if.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wb_conmax_msel.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wb_conmax_pri_dec.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wb_conmax_pri_enc.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wb_conmax_rf.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wb_conmax_slave_if.v'

yosys> read -sv wrapper_top.sv

yosys> verific -sv wrapper_top.sv

3. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wrapper_top.sv'
VERIFIC-WARNING [VERI-2418] wrapper_top.sv:3: parameter 'dw' declared inside compilation unit '$unit_wrapper_top_sv' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] wrapper_top.sv:4: parameter 'aw' declared inside compilation unit '$unit_wrapper_top_sv' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] wrapper_top.sv:5: parameter 'sw' declared inside compilation unit '$unit_wrapper_top_sv' shall be treated as localparam

yosys> synth_rs -top wb_conmax_top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

4. Executing synth_rs pass: v0.2.37

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

4.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

4.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top wb_conmax_top

4.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] wb_conmax.v:60: compiling module 'wb_conmax_top'
VERIFIC-INFO [VERI-1018] wb_conmax_master_if.v:60: compiling module 'wb_conmax_master_if(sw=4)'
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:501: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:502: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:505: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:506: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:509: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:510: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:513: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:514: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:517: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:518: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:521: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:522: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:525: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:526: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:529: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:530: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:533: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:534: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:537: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:538: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:541: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:542: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:545: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:546: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:549: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:550: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:553: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:554: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:557: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:558: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:561: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_master_if.v:562: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] wb_conmax_slave_if.v:60: compiling module 'wb_conmax_slave_if(sw=4)'
VERIFIC-WARNING [VERI-2371] wb_conmax_slave_if.v:252: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] wb_conmax_arb.v:62: compiling module 'wb_conmax_arb'
VERIFIC-WARNING [VERI-2371] wb_conmax_arb.v:100: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_arb.v:101: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] wb_conmax_msel.v:60: compiling module 'wb_conmax_msel(pri_sel=2'b10)'
VERIFIC-INFO [VERI-1018] wb_conmax_pri_enc.v:60: compiling module 'wb_conmax_pri_enc(pri_sel=2'b10)'
VERIFIC-INFO [VERI-1018] wb_conmax_pri_dec.v:60: compiling module 'wb_conmax_pri_dec(pri_sel=2'b10)'
VERIFIC-WARNING [VERI-2371] wb_conmax_msel.v:143: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_msel.v:145: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_slave_if.v:364: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_slave_if.v:367: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_slave_if.v:370: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_slave_if.v:373: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_slave_if.v:376: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_slave_if.v:379: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_slave_if.v:382: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_slave_if.v:385: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] wb_conmax_rf.v:60: compiling module 'wb_conmax_rf(sw=4)'
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:180: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:183: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:187: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:189: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:192: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:194: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:197: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:199: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:202: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:204: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:207: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:209: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:212: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:214: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:217: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:219: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:222: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:224: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:227: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:229: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:232: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:234: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:237: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:239: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:242: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:244: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:247: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:249: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:252: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:254: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:257: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:259: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:262: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:264: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:268: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:271: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:272: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:273: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:274: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:275: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:276: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:277: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:278: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:279: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:280: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:281: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:282: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:283: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:284: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:285: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_conmax_rf.v:286: delay control is not supported for synthesis
Importing module wb_conmax_top.
Importing module wb_conmax_master_if(sw=4).
Importing module wb_conmax_rf(sw=4).
Importing module wb_conmax_slave_if(sw=4).
Importing module wb_conmax_arb.
Importing module wb_conmax_msel(pri_sel=2'b10).
Importing module wb_conmax_pri_enc(pri_sel=2'b10).
Importing module wb_conmax_pri_dec(pri_sel=2'b10).

4.3.1. Analyzing design hierarchy..
Top module:  \wb_conmax_top
Used module:     \wb_conmax_rf(sw=4)
Used module:     \wb_conmax_slave_if(sw=4)
Used module:         \wb_conmax_msel(pri_sel=2'b10)
Used module:             \wb_conmax_arb
Used module:             \wb_conmax_pri_enc(pri_sel=2'b10)
Used module:                 \wb_conmax_pri_dec(pri_sel=2'b10)
Used module:     \wb_conmax_master_if(sw=4)

4.3.2. Analyzing design hierarchy..
Top module:  \wb_conmax_top
Used module:     \wb_conmax_rf(sw=4)
Used module:     \wb_conmax_slave_if(sw=4)
Used module:         \wb_conmax_msel(pri_sel=2'b10)
Used module:             \wb_conmax_arb
Used module:             \wb_conmax_pri_enc(pri_sel=2'b10)
Used module:                 \wb_conmax_pri_dec(pri_sel=2'b10)
Used module:     \wb_conmax_master_if(sw=4)
Removed 0 unused modules.

yosys> proc

4.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

4.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

4.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

4.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

4.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

4.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

4.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

4.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

4.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

4.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

4.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

4.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_pri_dec(pri_sel=2'b10).
<suppressed ~4 debug messages>
Optimizing module wb_conmax_pri_enc(pri_sel=2'b10).
Optimizing module wb_conmax_msel(pri_sel=2'b10).
<suppressed ~9 debug messages>
Optimizing module wb_conmax_arb.
<suppressed ~1 debug messages>
Optimizing module wb_conmax_slave_if(sw=4).
<suppressed ~1 debug messages>
Optimizing module wb_conmax_rf(sw=4).
<suppressed ~2 debug messages>
Optimizing module wb_conmax_master_if(sw=4).
<suppressed ~1 debug messages>
Optimizing module wb_conmax_top.

yosys> flatten

4.5. Executing FLATTEN pass (flatten design).
Deleting now unused module wb_conmax_pri_dec(pri_sel=2'b10).
Deleting now unused module wb_conmax_pri_enc(pri_sel=2'b10).
Deleting now unused module wb_conmax_msel(pri_sel=2'b10).
Deleting now unused module wb_conmax_arb.
Deleting now unused module wb_conmax_slave_if(sw=4).
Deleting now unused module wb_conmax_rf(sw=4).
Deleting now unused module wb_conmax_master_if(sw=4).
<suppressed ~40 debug messages>

yosys> tribuf -logic

4.6. Executing TRIBUF pass.

yosys> deminout

4.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

4.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.
<suppressed ~1280 debug messages>

yosys> opt_clean

4.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..
Removed 2112 unused cells and 39243 unused wires.
<suppressed ~5288 debug messages>

yosys> check

4.10. Executing CHECK pass (checking for obvious problems).
Checking module wb_conmax_top...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

4.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

yosys> opt_merge -nomux

4.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
<suppressed ~1152 debug messages>
Removed a total of 384 cells.

yosys> opt_muxtree

4.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~934 debug messages>

yosys> opt_reduce

4.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

4.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\s9.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s9.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s9.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s9.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s9.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s8.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s8.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s8.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s8.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s8.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m3.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s7.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s7.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s7.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s7.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s7.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s6.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s6.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s6.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s6.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s6.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s5.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s5.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s5.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s5.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s5.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m2.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s4.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s4.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s4.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s4.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s4.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s3.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s3.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s3.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s3.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s3.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s2.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s2.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s2.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s2.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s2.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s15.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s15.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s15.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s15.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s15.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m1.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s14.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s14.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s14.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s14.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s14.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s13.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s13.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s13.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s13.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s13.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s12.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s12.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s12.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s12.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s12.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s11.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s11.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s11.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s11.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s11.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m0.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s10.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s10.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s10.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s10.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s10.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s1.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s1.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s1.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s1.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s1.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s0.\msel.\arb3.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s0.\msel.\arb2.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s0.\msel.\arb1.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\s0.\msel.\arb0.$verific$state_reg$wb_conmax_arb.v:101$31405 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\s0.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($aldff) from module wb_conmax_top.
Removing never-active async load on $flatten\rf.$verific$rf_dout_reg$wb_conmax_rf.v:287$31025 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf9_reg$wb_conmax_rf.v:234$30998 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf8_reg$wb_conmax_rf.v:229$30994 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf7_reg$wb_conmax_rf.v:224$30990 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf6_reg$wb_conmax_rf.v:219$30986 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf5_reg$wb_conmax_rf.v:214$30982 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf4_reg$wb_conmax_rf.v:209$30978 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf3_reg$wb_conmax_rf.v:204$30974 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf2_reg$wb_conmax_rf.v:199$30970 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf1_reg$wb_conmax_rf.v:194$30966 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf15_reg$wb_conmax_rf.v:264$31022 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf14_reg$wb_conmax_rf.v:259$31018 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf13_reg$wb_conmax_rf.v:254$31014 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf12_reg$wb_conmax_rf.v:249$31010 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf11_reg$wb_conmax_rf.v:244$31006 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf10_reg$wb_conmax_rf.v:239$31002 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\rf.$verific$conf0_reg$wb_conmax_rf.v:189$30962 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m7.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m6.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m5.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($aldff) from module wb_conmax_top.
Changing const-value async load to async reset on $flatten\m4.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($aldff) from module wb_conmax_top.

yosys> opt_clean

4.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..
Removed 0 unused cells and 384 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

4.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~934 debug messages>

yosys> opt_reduce

4.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

4.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..

yosys> opt_expr

4.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

4.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

4.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

4.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

4.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

4.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..

yosys> fsm_opt

4.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

4.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

4.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

4.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

4.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

yosys> opt_merge -nomux

4.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

4.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~934 debug messages>

yosys> opt_reduce

4.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

4.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $flatten\s9.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s9.\msel.$verific$n29$31525, Q = \s9.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31785 ($sdff) from module wb_conmax_top (D = \s9.msel.pri_enc.pri_out1, Q = \s9.msel.pri_out).
Adding SRST signal on $flatten\s8.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s8.\msel.$verific$n29$31525, Q = \s8.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31787 ($sdff) from module wb_conmax_top (D = \s8.msel.pri_enc.pri_out1, Q = \s8.msel.pri_out).
Adding SRST signal on $flatten\s7.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s7.\msel.$verific$n29$31525, Q = \s7.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31789 ($sdff) from module wb_conmax_top (D = \s7.msel.pri_enc.pri_out1, Q = \s7.msel.pri_out).
Adding SRST signal on $flatten\s6.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s6.\msel.$verific$n29$31525, Q = \s6.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31791 ($sdff) from module wb_conmax_top (D = \s6.msel.pri_enc.pri_out1, Q = \s6.msel.pri_out).
Adding SRST signal on $flatten\s5.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s5.\msel.$verific$n29$31525, Q = \s5.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31793 ($sdff) from module wb_conmax_top (D = \s5.msel.pri_enc.pri_out1, Q = \s5.msel.pri_out).
Adding SRST signal on $flatten\s4.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s4.\msel.$verific$n29$31525, Q = \s4.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31795 ($sdff) from module wb_conmax_top (D = \s4.msel.pri_enc.pri_out1, Q = \s4.msel.pri_out).
Adding SRST signal on $flatten\s3.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s3.\msel.$verific$n29$31525, Q = \s3.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31797 ($sdff) from module wb_conmax_top (D = \s3.msel.pri_enc.pri_out1, Q = \s3.msel.pri_out).
Adding SRST signal on $flatten\s2.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s2.\msel.$verific$n29$31525, Q = \s2.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31799 ($sdff) from module wb_conmax_top (D = \s2.msel.pri_enc.pri_out1, Q = \s2.msel.pri_out).
Adding SRST signal on $flatten\s15.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s15.\msel.$verific$n29$31525, Q = \s15.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31801 ($sdff) from module wb_conmax_top (D = \s15.msel.pri_enc.pri_out1, Q = \s15.msel.pri_out).
Adding SRST signal on $flatten\s14.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s14.\msel.$verific$n29$31525, Q = \s14.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31803 ($sdff) from module wb_conmax_top (D = \s14.msel.pri_enc.pri_out1, Q = \s14.msel.pri_out).
Adding SRST signal on $flatten\s13.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s13.\msel.$verific$n29$31525, Q = \s13.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31805 ($sdff) from module wb_conmax_top (D = \s13.msel.pri_enc.pri_out1, Q = \s13.msel.pri_out).
Adding SRST signal on $flatten\s12.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s12.\msel.$verific$n29$31525, Q = \s12.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31807 ($sdff) from module wb_conmax_top (D = \s12.msel.pri_enc.pri_out1, Q = \s12.msel.pri_out).
Adding SRST signal on $flatten\s11.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s11.\msel.$verific$n29$31525, Q = \s11.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31809 ($sdff) from module wb_conmax_top (D = \s11.msel.pri_enc.pri_out1, Q = \s11.msel.pri_out).
Adding SRST signal on $flatten\s10.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s10.\msel.$verific$n29$31525, Q = \s10.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31811 ($sdff) from module wb_conmax_top (D = \s10.msel.pri_enc.pri_out1, Q = \s10.msel.pri_out).
Adding SRST signal on $flatten\s1.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s1.\msel.$verific$n29$31525, Q = \s1.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31813 ($sdff) from module wb_conmax_top (D = \s1.msel.pri_enc.pri_out1, Q = \s1.msel.pri_out).
Adding SRST signal on $flatten\s0.\msel.$verific$pri_out_reg$wb_conmax_msel.v:145$31578 ($dff) from module wb_conmax_top (D = $flatten\s0.\msel.$verific$n29$31525, Q = \s0.msel.pri_out, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$31815 ($sdff) from module wb_conmax_top (D = \s0.msel.pri_enc.pri_out1, Q = \s0.msel.pri_out).
Adding SRST signal on $flatten\rf.$verific$rf_dout_reg$wb_conmax_rf.v:287$31025 ($dff) from module wb_conmax_top (D = $flatten\rf.$verific$n1446$30938, Q = \rf.rf_dout, rval = 16'0000000000000000).
Adding EN signal on $flatten\rf.$verific$conf9_reg$wb_conmax_rf.v:234$30998 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf9).
Adding EN signal on $flatten\rf.$verific$conf8_reg$wb_conmax_rf.v:229$30994 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf8).
Adding EN signal on $flatten\rf.$verific$conf7_reg$wb_conmax_rf.v:224$30990 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf7).
Adding EN signal on $flatten\rf.$verific$conf6_reg$wb_conmax_rf.v:219$30986 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf6).
Adding EN signal on $flatten\rf.$verific$conf5_reg$wb_conmax_rf.v:214$30982 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf5).
Adding EN signal on $flatten\rf.$verific$conf4_reg$wb_conmax_rf.v:209$30978 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf4).
Adding EN signal on $flatten\rf.$verific$conf3_reg$wb_conmax_rf.v:204$30974 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf3).
Adding EN signal on $flatten\rf.$verific$conf2_reg$wb_conmax_rf.v:199$30970 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf2).
Adding EN signal on $flatten\rf.$verific$conf1_reg$wb_conmax_rf.v:194$30966 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf1).
Adding EN signal on $flatten\rf.$verific$conf15_reg$wb_conmax_rf.v:264$31022 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf15).
Adding EN signal on $flatten\rf.$verific$conf14_reg$wb_conmax_rf.v:259$31018 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf14).
Adding EN signal on $flatten\rf.$verific$conf13_reg$wb_conmax_rf.v:254$31014 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf13).
Adding EN signal on $flatten\rf.$verific$conf12_reg$wb_conmax_rf.v:249$31010 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf12).
Adding EN signal on $flatten\rf.$verific$conf11_reg$wb_conmax_rf.v:244$31006 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf11).
Adding EN signal on $flatten\rf.$verific$conf10_reg$wb_conmax_rf.v:239$31002 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf10).
Adding EN signal on $flatten\rf.$verific$conf0_reg$wb_conmax_rf.v:189$30962 ($adff) from module wb_conmax_top (D = \s15.wb_data_o [15:0], Q = \rf.conf0).
Adding EN signal on $flatten\m7.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1779$30487, Q = \m7.s9_cyc_o).
Adding EN signal on $flatten\m7.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1773$30484, Q = \m7.s8_cyc_o).
Adding EN signal on $flatten\m7.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1767$30481, Q = \m7.s7_cyc_o).
Adding EN signal on $flatten\m7.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1761$30478, Q = \m7.s6_cyc_o).
Adding EN signal on $flatten\m7.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1755$30475, Q = \m7.s5_cyc_o).
Adding EN signal on $flatten\m7.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1749$30472, Q = \m7.s4_cyc_o).
Adding EN signal on $flatten\m7.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1743$30469, Q = \m7.s3_cyc_o).
Adding EN signal on $flatten\m7.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1737$30466, Q = \m7.s2_cyc_o).
Adding EN signal on $flatten\m7.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1731$30463, Q = \m7.s1_cyc_o).
Adding EN signal on $flatten\m7.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1815$30505, Q = \m7.s15_cyc_o).
Adding EN signal on $flatten\m7.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1809$30502, Q = \m7.s14_cyc_o).
Adding EN signal on $flatten\m7.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1803$30499, Q = \m7.s13_cyc_o).
Adding EN signal on $flatten\m7.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1797$30496, Q = \m7.s12_cyc_o).
Adding EN signal on $flatten\m7.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1791$30493, Q = \m7.s11_cyc_o).
Adding EN signal on $flatten\m7.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1785$30490, Q = \m7.s10_cyc_o).
Adding EN signal on $flatten\m7.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($adff) from module wb_conmax_top (D = $flatten\m7.$verific$n1725$30460, Q = \m7.s0_cyc_o).
Adding EN signal on $flatten\m6.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1779$30487, Q = \m6.s9_cyc_o).
Adding EN signal on $flatten\m6.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1773$30484, Q = \m6.s8_cyc_o).
Adding EN signal on $flatten\m6.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1767$30481, Q = \m6.s7_cyc_o).
Adding EN signal on $flatten\m6.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1761$30478, Q = \m6.s6_cyc_o).
Adding EN signal on $flatten\m6.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1755$30475, Q = \m6.s5_cyc_o).
Adding EN signal on $flatten\m6.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1749$30472, Q = \m6.s4_cyc_o).
Adding EN signal on $flatten\m6.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1743$30469, Q = \m6.s3_cyc_o).
Adding EN signal on $flatten\m6.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1737$30466, Q = \m6.s2_cyc_o).
Adding EN signal on $flatten\m6.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1731$30463, Q = \m6.s1_cyc_o).
Adding EN signal on $flatten\m6.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1815$30505, Q = \m6.s15_cyc_o).
Adding EN signal on $flatten\m6.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1809$30502, Q = \m6.s14_cyc_o).
Adding EN signal on $flatten\m6.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1803$30499, Q = \m6.s13_cyc_o).
Adding EN signal on $flatten\m6.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1797$30496, Q = \m6.s12_cyc_o).
Adding EN signal on $flatten\m6.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1791$30493, Q = \m6.s11_cyc_o).
Adding EN signal on $flatten\m6.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1785$30490, Q = \m6.s10_cyc_o).
Adding EN signal on $flatten\m6.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($adff) from module wb_conmax_top (D = $flatten\m6.$verific$n1725$30460, Q = \m6.s0_cyc_o).
Adding EN signal on $flatten\m5.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1779$30487, Q = \m5.s9_cyc_o).
Adding EN signal on $flatten\m5.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1773$30484, Q = \m5.s8_cyc_o).
Adding EN signal on $flatten\m5.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1767$30481, Q = \m5.s7_cyc_o).
Adding EN signal on $flatten\m5.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1761$30478, Q = \m5.s6_cyc_o).
Adding EN signal on $flatten\m5.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1755$30475, Q = \m5.s5_cyc_o).
Adding EN signal on $flatten\m5.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1749$30472, Q = \m5.s4_cyc_o).
Adding EN signal on $flatten\m5.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1743$30469, Q = \m5.s3_cyc_o).
Adding EN signal on $flatten\m5.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1737$30466, Q = \m5.s2_cyc_o).
Adding EN signal on $flatten\m5.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1731$30463, Q = \m5.s1_cyc_o).
Adding EN signal on $flatten\m5.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1815$30505, Q = \m5.s15_cyc_o).
Adding EN signal on $flatten\m5.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1809$30502, Q = \m5.s14_cyc_o).
Adding EN signal on $flatten\m5.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1803$30499, Q = \m5.s13_cyc_o).
Adding EN signal on $flatten\m5.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1797$30496, Q = \m5.s12_cyc_o).
Adding EN signal on $flatten\m5.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1791$30493, Q = \m5.s11_cyc_o).
Adding EN signal on $flatten\m5.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1785$30490, Q = \m5.s10_cyc_o).
Adding EN signal on $flatten\m5.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($adff) from module wb_conmax_top (D = $flatten\m5.$verific$n1725$30460, Q = \m5.s0_cyc_o).
Adding EN signal on $flatten\m4.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1779$30487, Q = \m4.s9_cyc_o).
Adding EN signal on $flatten\m4.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1773$30484, Q = \m4.s8_cyc_o).
Adding EN signal on $flatten\m4.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1767$30481, Q = \m4.s7_cyc_o).
Adding EN signal on $flatten\m4.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1761$30478, Q = \m4.s6_cyc_o).
Adding EN signal on $flatten\m4.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1755$30475, Q = \m4.s5_cyc_o).
Adding EN signal on $flatten\m4.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1749$30472, Q = \m4.s4_cyc_o).
Adding EN signal on $flatten\m4.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1743$30469, Q = \m4.s3_cyc_o).
Adding EN signal on $flatten\m4.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1737$30466, Q = \m4.s2_cyc_o).
Adding EN signal on $flatten\m4.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1731$30463, Q = \m4.s1_cyc_o).
Adding EN signal on $flatten\m4.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1815$30505, Q = \m4.s15_cyc_o).
Adding EN signal on $flatten\m4.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1809$30502, Q = \m4.s14_cyc_o).
Adding EN signal on $flatten\m4.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1803$30499, Q = \m4.s13_cyc_o).
Adding EN signal on $flatten\m4.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1797$30496, Q = \m4.s12_cyc_o).
Adding EN signal on $flatten\m4.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1791$30493, Q = \m4.s11_cyc_o).
Adding EN signal on $flatten\m4.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1785$30490, Q = \m4.s10_cyc_o).
Adding EN signal on $flatten\m4.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($adff) from module wb_conmax_top (D = $flatten\m4.$verific$n1725$30460, Q = \m4.s0_cyc_o).
Adding EN signal on $flatten\m3.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1779$30487, Q = \m3.s9_cyc_o).
Adding EN signal on $flatten\m3.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1773$30484, Q = \m3.s8_cyc_o).
Adding EN signal on $flatten\m3.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1767$30481, Q = \m3.s7_cyc_o).
Adding EN signal on $flatten\m3.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1761$30478, Q = \m3.s6_cyc_o).
Adding EN signal on $flatten\m3.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1755$30475, Q = \m3.s5_cyc_o).
Adding EN signal on $flatten\m3.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1749$30472, Q = \m3.s4_cyc_o).
Adding EN signal on $flatten\m3.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1743$30469, Q = \m3.s3_cyc_o).
Adding EN signal on $flatten\m3.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1737$30466, Q = \m3.s2_cyc_o).
Adding EN signal on $flatten\m3.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1731$30463, Q = \m3.s1_cyc_o).
Adding EN signal on $flatten\m3.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1815$30505, Q = \m3.s15_cyc_o).
Adding EN signal on $flatten\m3.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1809$30502, Q = \m3.s14_cyc_o).
Adding EN signal on $flatten\m3.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1803$30499, Q = \m3.s13_cyc_o).
Adding EN signal on $flatten\m3.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1797$30496, Q = \m3.s12_cyc_o).
Adding EN signal on $flatten\m3.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1791$30493, Q = \m3.s11_cyc_o).
Adding EN signal on $flatten\m3.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1785$30490, Q = \m3.s10_cyc_o).
Adding EN signal on $flatten\m3.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($adff) from module wb_conmax_top (D = $flatten\m3.$verific$n1725$30460, Q = \m3.s0_cyc_o).
Adding EN signal on $flatten\m2.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1779$30487, Q = \m2.s9_cyc_o).
Adding EN signal on $flatten\m2.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1773$30484, Q = \m2.s8_cyc_o).
Adding EN signal on $flatten\m2.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1767$30481, Q = \m2.s7_cyc_o).
Adding EN signal on $flatten\m2.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1761$30478, Q = \m2.s6_cyc_o).
Adding EN signal on $flatten\m2.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1755$30475, Q = \m2.s5_cyc_o).
Adding EN signal on $flatten\m2.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1749$30472, Q = \m2.s4_cyc_o).
Adding EN signal on $flatten\m2.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1743$30469, Q = \m2.s3_cyc_o).
Adding EN signal on $flatten\m2.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1737$30466, Q = \m2.s2_cyc_o).
Adding EN signal on $flatten\m2.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1731$30463, Q = \m2.s1_cyc_o).
Adding EN signal on $flatten\m2.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1815$30505, Q = \m2.s15_cyc_o).
Adding EN signal on $flatten\m2.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1809$30502, Q = \m2.s14_cyc_o).
Adding EN signal on $flatten\m2.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1803$30499, Q = \m2.s13_cyc_o).
Adding EN signal on $flatten\m2.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1797$30496, Q = \m2.s12_cyc_o).
Adding EN signal on $flatten\m2.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1791$30493, Q = \m2.s11_cyc_o).
Adding EN signal on $flatten\m2.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1785$30490, Q = \m2.s10_cyc_o).
Adding EN signal on $flatten\m2.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($adff) from module wb_conmax_top (D = $flatten\m2.$verific$n1725$30460, Q = \m2.s0_cyc_o).
Adding EN signal on $flatten\m1.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1779$30487, Q = \m1.s9_cyc_o).
Adding EN signal on $flatten\m1.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1773$30484, Q = \m1.s8_cyc_o).
Adding EN signal on $flatten\m1.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1767$30481, Q = \m1.s7_cyc_o).
Adding EN signal on $flatten\m1.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1761$30478, Q = \m1.s6_cyc_o).
Adding EN signal on $flatten\m1.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1755$30475, Q = \m1.s5_cyc_o).
Adding EN signal on $flatten\m1.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1749$30472, Q = \m1.s4_cyc_o).
Adding EN signal on $flatten\m1.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1743$30469, Q = \m1.s3_cyc_o).
Adding EN signal on $flatten\m1.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1737$30466, Q = \m1.s2_cyc_o).
Adding EN signal on $flatten\m1.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1731$30463, Q = \m1.s1_cyc_o).
Adding EN signal on $flatten\m1.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1815$30505, Q = \m1.s15_cyc_o).
Adding EN signal on $flatten\m1.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1809$30502, Q = \m1.s14_cyc_o).
Adding EN signal on $flatten\m1.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1803$30499, Q = \m1.s13_cyc_o).
Adding EN signal on $flatten\m1.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1797$30496, Q = \m1.s12_cyc_o).
Adding EN signal on $flatten\m1.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1791$30493, Q = \m1.s11_cyc_o).
Adding EN signal on $flatten\m1.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1785$30490, Q = \m1.s10_cyc_o).
Adding EN signal on $flatten\m1.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($adff) from module wb_conmax_top (D = $flatten\m1.$verific$n1725$30460, Q = \m1.s0_cyc_o).
Adding EN signal on $flatten\m0.$verific$s9_cyc_o_reg$wb_conmax_master_if.v:538$30758 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1779$30487, Q = \m0.s9_cyc_o).
Adding EN signal on $flatten\m0.$verific$s8_cyc_o_reg$wb_conmax_master_if.v:534$30756 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1773$30484, Q = \m0.s8_cyc_o).
Adding EN signal on $flatten\m0.$verific$s7_cyc_o_reg$wb_conmax_master_if.v:530$30754 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1767$30481, Q = \m0.s7_cyc_o).
Adding EN signal on $flatten\m0.$verific$s6_cyc_o_reg$wb_conmax_master_if.v:526$30752 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1761$30478, Q = \m0.s6_cyc_o).
Adding EN signal on $flatten\m0.$verific$s5_cyc_o_reg$wb_conmax_master_if.v:522$30750 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1755$30475, Q = \m0.s5_cyc_o).
Adding EN signal on $flatten\m0.$verific$s4_cyc_o_reg$wb_conmax_master_if.v:518$30748 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1749$30472, Q = \m0.s4_cyc_o).
Adding EN signal on $flatten\m0.$verific$s3_cyc_o_reg$wb_conmax_master_if.v:514$30746 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1743$30469, Q = \m0.s3_cyc_o).
Adding EN signal on $flatten\m0.$verific$s2_cyc_o_reg$wb_conmax_master_if.v:510$30744 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1737$30466, Q = \m0.s2_cyc_o).
Adding EN signal on $flatten\m0.$verific$s1_cyc_o_reg$wb_conmax_master_if.v:506$30742 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1731$30463, Q = \m0.s1_cyc_o).
Adding EN signal on $flatten\m0.$verific$s15_cyc_o_reg$wb_conmax_master_if.v:562$30770 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1815$30505, Q = \m0.s15_cyc_o).
Adding EN signal on $flatten\m0.$verific$s14_cyc_o_reg$wb_conmax_master_if.v:558$30768 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1809$30502, Q = \m0.s14_cyc_o).
Adding EN signal on $flatten\m0.$verific$s13_cyc_o_reg$wb_conmax_master_if.v:554$30766 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1803$30499, Q = \m0.s13_cyc_o).
Adding EN signal on $flatten\m0.$verific$s12_cyc_o_reg$wb_conmax_master_if.v:550$30764 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1797$30496, Q = \m0.s12_cyc_o).
Adding EN signal on $flatten\m0.$verific$s11_cyc_o_reg$wb_conmax_master_if.v:546$30762 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1791$30493, Q = \m0.s11_cyc_o).
Adding EN signal on $flatten\m0.$verific$s10_cyc_o_reg$wb_conmax_master_if.v:542$30760 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1785$30490, Q = \m0.s10_cyc_o).
Adding EN signal on $flatten\m0.$verific$s0_cyc_o_reg$wb_conmax_master_if.v:502$30740 ($adff) from module wb_conmax_top (D = $flatten\m0.$verific$n1725$30460, Q = \m0.s0_cyc_o).

yosys> opt_clean

4.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..
Removed 177 unused cells and 177 unused wires.
<suppressed ~306 debug messages>

yosys> opt_expr

4.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~917 debug messages>

yosys> opt_reduce

4.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

4.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..

yosys> opt_expr

4.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.13.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

4.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m0.$verific$equal_129$wb_conmax_master_if.v:490$30702 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m0.$verific$equal_123$wb_conmax_master_if.v:489$30698 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m0.$verific$equal_117$wb_conmax_master_if.v:488$30694 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m0.$verific$equal_111$wb_conmax_master_if.v:487$30690 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m0.$verific$equal_105$wb_conmax_master_if.v:486$30686 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m0.$verific$equal_99$wb_conmax_master_if.v:485$30682 ($eq).
Removed top 3 bits (of 4) from port B of cell wb_conmax_top.$flatten\m0.$verific$equal_93$wb_conmax_master_if.v:484$30678 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m1.$verific$equal_129$wb_conmax_master_if.v:490$30702 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m1.$verific$equal_123$wb_conmax_master_if.v:489$30698 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m1.$verific$equal_117$wb_conmax_master_if.v:488$30694 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m1.$verific$equal_111$wb_conmax_master_if.v:487$30690 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m1.$verific$equal_105$wb_conmax_master_if.v:486$30686 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m1.$verific$equal_99$wb_conmax_master_if.v:485$30682 ($eq).
Removed top 3 bits (of 4) from port B of cell wb_conmax_top.$flatten\m1.$verific$equal_93$wb_conmax_master_if.v:484$30678 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m2.$verific$equal_129$wb_conmax_master_if.v:490$30702 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m2.$verific$equal_123$wb_conmax_master_if.v:489$30698 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m2.$verific$equal_117$wb_conmax_master_if.v:488$30694 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m2.$verific$equal_111$wb_conmax_master_if.v:487$30690 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m2.$verific$equal_105$wb_conmax_master_if.v:486$30686 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m2.$verific$equal_99$wb_conmax_master_if.v:485$30682 ($eq).
Removed top 3 bits (of 4) from port B of cell wb_conmax_top.$flatten\m2.$verific$equal_93$wb_conmax_master_if.v:484$30678 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m3.$verific$equal_129$wb_conmax_master_if.v:490$30702 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m3.$verific$equal_123$wb_conmax_master_if.v:489$30698 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m3.$verific$equal_117$wb_conmax_master_if.v:488$30694 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m3.$verific$equal_111$wb_conmax_master_if.v:487$30690 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m3.$verific$equal_105$wb_conmax_master_if.v:486$30686 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m3.$verific$equal_99$wb_conmax_master_if.v:485$30682 ($eq).
Removed top 3 bits (of 4) from port B of cell wb_conmax_top.$flatten\m3.$verific$equal_93$wb_conmax_master_if.v:484$30678 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m4.$verific$equal_129$wb_conmax_master_if.v:490$30702 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m4.$verific$equal_123$wb_conmax_master_if.v:489$30698 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m4.$verific$equal_117$wb_conmax_master_if.v:488$30694 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m4.$verific$equal_111$wb_conmax_master_if.v:487$30690 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m4.$verific$equal_105$wb_conmax_master_if.v:486$30686 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m4.$verific$equal_99$wb_conmax_master_if.v:485$30682 ($eq).
Removed top 3 bits (of 4) from port B of cell wb_conmax_top.$flatten\m4.$verific$equal_93$wb_conmax_master_if.v:484$30678 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m5.$verific$equal_129$wb_conmax_master_if.v:490$30702 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m5.$verific$equal_123$wb_conmax_master_if.v:489$30698 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m5.$verific$equal_117$wb_conmax_master_if.v:488$30694 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m5.$verific$equal_111$wb_conmax_master_if.v:487$30690 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m5.$verific$equal_105$wb_conmax_master_if.v:486$30686 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m5.$verific$equal_99$wb_conmax_master_if.v:485$30682 ($eq).
Removed top 3 bits (of 4) from port B of cell wb_conmax_top.$flatten\m5.$verific$equal_93$wb_conmax_master_if.v:484$30678 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m6.$verific$equal_129$wb_conmax_master_if.v:490$30702 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m6.$verific$equal_123$wb_conmax_master_if.v:489$30698 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m6.$verific$equal_117$wb_conmax_master_if.v:488$30694 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m6.$verific$equal_111$wb_conmax_master_if.v:487$30690 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m6.$verific$equal_105$wb_conmax_master_if.v:486$30686 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m6.$verific$equal_99$wb_conmax_master_if.v:485$30682 ($eq).
Removed top 3 bits (of 4) from port B of cell wb_conmax_top.$flatten\m6.$verific$equal_93$wb_conmax_master_if.v:484$30678 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m7.$verific$equal_129$wb_conmax_master_if.v:490$30702 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m7.$verific$equal_123$wb_conmax_master_if.v:489$30698 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m7.$verific$equal_117$wb_conmax_master_if.v:488$30694 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\m7.$verific$equal_111$wb_conmax_master_if.v:487$30690 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m7.$verific$equal_105$wb_conmax_master_if.v:486$30686 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\m7.$verific$equal_99$wb_conmax_master_if.v:485$30682 ($eq).
Removed top 3 bits (of 4) from port B of cell wb_conmax_top.$flatten\m7.$verific$equal_93$wb_conmax_master_if.v:484$30678 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s0.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s0.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s0.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s0.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s0.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s0.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s0.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s0.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s0.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s0.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s0.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s1.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s1.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s1.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s1.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s1.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s1.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s1.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s1.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s1.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s1.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s1.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s2.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s2.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s2.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s2.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s2.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s2.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s2.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s2.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s2.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s2.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s2.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s3.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s3.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s3.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s3.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s3.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s3.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s3.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s3.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s3.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s3.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s3.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s4.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s4.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s4.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s4.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s4.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s4.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s4.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s4.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s4.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s4.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s4.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s5.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s5.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s5.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s5.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s5.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s5.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s5.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s5.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s5.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s5.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s5.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s6.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s6.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s6.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s6.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s6.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s6.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s6.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s6.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s6.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s6.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s6.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s7.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s7.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s7.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s7.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s7.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s7.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s7.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s7.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s7.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s7.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s7.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s8.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s8.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s8.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s8.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s8.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s8.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s8.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s8.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s8.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s8.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s8.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s9.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s9.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s9.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s9.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s9.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s9.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s9.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s9.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s9.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s9.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s9.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s10.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s10.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s10.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s10.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s10.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s10.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s10.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s10.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s10.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s10.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s10.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s11.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s11.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s11.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s11.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s11.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s11.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s11.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s11.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s11.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s11.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s11.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s12.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s12.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s12.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s12.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s12.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s12.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s12.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s12.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s12.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s12.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s12.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s13.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s13.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s13.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s13.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s13.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s13.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s13.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s13.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s13.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s13.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s13.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s14.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s14.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s14.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s14.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s14.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s14.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s14.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s14.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s14.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s14.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s14.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s15.\msel.$verific$equal_49$wb_conmax_msel.v:161$31589 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s15.\msel.$verific$equal_52$wb_conmax_msel.v:162$31590 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s15.\msel.$verific$equal_55$wb_conmax_msel.v:163$31591 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s15.\msel.$verific$equal_58$wb_conmax_msel.v:164$31592 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s15.\msel.$verific$equal_61$wb_conmax_msel.v:165$31593 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s15.\msel.$verific$equal_64$wb_conmax_msel.v:166$31594 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s15.\msel.$verific$equal_67$wb_conmax_msel.v:167$31595 ($eq).
Removed top 1 bits (of 2) from port B of cell wb_conmax_top.$flatten\s15.\msel.$verific$equal_70$wb_conmax_msel.v:168$31596 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s15.$verific$equal_111$wb_conmax_slave_if.v:420$31267 ($eq).
Removed top 1 bits (of 3) from port B of cell wb_conmax_top.$flatten\s15.$verific$equal_108$wb_conmax_slave_if.v:419$31264 ($eq).
Removed top 2 bits (of 3) from port B of cell wb_conmax_top.$flatten\s15.$verific$equal_105$wb_conmax_slave_if.v:418$31261 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\rf.$verific$equal_69$wb_conmax_rf.v:224$30987 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\rf.$verific$equal_62$wb_conmax_rf.v:219$30983 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\rf.$verific$equal_55$wb_conmax_rf.v:214$30979 ($eq).
Removed top 1 bits (of 4) from port B of cell wb_conmax_top.$flatten\rf.$verific$equal_48$wb_conmax_rf.v:209$30975 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\rf.$verific$equal_41$wb_conmax_rf.v:204$30971 ($eq).
Removed top 2 bits (of 4) from port B of cell wb_conmax_top.$flatten\rf.$verific$equal_34$wb_conmax_rf.v:199$30967 ($eq).
Removed top 3 bits (of 4) from port B of cell wb_conmax_top.$flatten\rf.$verific$equal_27$wb_conmax_rf.v:194$30963 ($eq).

yosys> peepopt

4.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

4.16. Executing PMUXTREE pass.

yosys> opt_clean

4.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..

yosys> alumacc

4.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module wb_conmax_top:
  created 0 $alu and 0 $macc cells.

yosys> opt

4.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

yosys> opt_merge -nomux

4.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

4.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~917 debug messages>

yosys> opt_reduce

4.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff

4.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..

yosys> opt_expr

4.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

4.20. Executing MEMORY pass.

yosys> opt_mem

4.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

4.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

4.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

4.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

4.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..

yosys> memory_share

4.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

4.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

4.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..

yosys> memory_collect

4.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

4.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..

yosys> stat

4.22. Printing statistics.

=== wb_conmax_top ===

   Number of wires:              12214
   Number of wire bits:          68556
   Number of public wires:        6526
   Number of public wire bits:   53205
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               7009
     $adff                          64
     $adffe                        144
     $and                          605
     $bmux                         209
     $dff                          146
     $eq                           632
     $logic_not                    153
     $mux                         4773
     $not                          154
     $or                           112
     $sdff                           1
     $sdffe                         16


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

4.23. Executing TECHMAP pass (map to technology primitives).

4.23.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

4.23.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

4.23.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $sdff.
Using extmapper simplemap for cells of type $sdffe.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $dff.
No more expansions possible.
<suppressed ~7080 debug messages>

yosys> stat

4.24. Printing statistics.

=== wb_conmax_top ===

   Number of wires:              15180
   Number of wire bits:          85919
   Number of public wires:        6526
   Number of public wire bits:   53205
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              34121
     $_AND_                       1053
     $_DFFE_PP0N_                  128
     $_DFFE_PP0P_                  256
     $_DFF_PP0_                    192
     $_DFF_P_                      146
     $_MUX_                      28060
     $_NOT_                        939
     $_OR_                        1651
     $_SDFFE_PP0P_                  32
     $_SDFF_PN0_                    16
     $_XOR_                       1648


yosys> opt

4.25. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.25.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.
<suppressed ~3200 debug messages>

yosys> opt_merge -nomux

4.25.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
<suppressed ~3564 debug messages>
Removed a total of 1188 cells.

yosys> opt_muxtree

4.25.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

4.25.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.25.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff

4.25.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.25.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..
Removed 368 unused cells and 2526 unused wires.
<suppressed ~369 debug messages>

yosys> opt_expr

4.25.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.25.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.25.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

4.25.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.25.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff

4.25.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$69543 ($_DFF_PP0_) from module wb_conmax_top (D = \s15.msel.arb3.next_state [2], Q = \s15.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$69542 ($_DFF_PP0_) from module wb_conmax_top (D = \s15.msel.arb3.next_state [1], Q = \s15.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$69541 ($_DFF_PP0_) from module wb_conmax_top (D = \s15.msel.arb3.next_state [0], Q = \s15.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$69324 ($_DFF_PP0_) from module wb_conmax_top (D = \s15.msel.arb2.next_state [2], Q = \s15.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$69323 ($_DFF_PP0_) from module wb_conmax_top (D = \s15.msel.arb2.next_state [1], Q = \s15.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$69322 ($_DFF_PP0_) from module wb_conmax_top (D = \s15.msel.arb2.next_state [0], Q = \s15.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$69105 ($_DFF_PP0_) from module wb_conmax_top (D = \s15.msel.arb1.next_state [2], Q = \s15.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$69104 ($_DFF_PP0_) from module wb_conmax_top (D = \s15.msel.arb1.next_state [1], Q = \s15.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$69103 ($_DFF_PP0_) from module wb_conmax_top (D = \s15.msel.arb1.next_state [0], Q = \s15.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$68886 ($_DFF_PP0_) from module wb_conmax_top (D = \s15.msel.arb0.next_state [2], Q = \s15.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$68885 ($_DFF_PP0_) from module wb_conmax_top (D = \s15.msel.arb0.next_state [1], Q = \s15.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$68884 ($_DFF_PP0_) from module wb_conmax_top (D = \s15.msel.arb0.next_state [0], Q = \s15.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$67569 ($_DFF_PP0_) from module wb_conmax_top (D = \s14.msel.arb3.next_state [2], Q = \s14.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$67568 ($_DFF_PP0_) from module wb_conmax_top (D = \s14.msel.arb3.next_state [1], Q = \s14.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$67567 ($_DFF_PP0_) from module wb_conmax_top (D = \s14.msel.arb3.next_state [0], Q = \s14.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$67350 ($_DFF_PP0_) from module wb_conmax_top (D = \s14.msel.arb2.next_state [2], Q = \s14.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$67349 ($_DFF_PP0_) from module wb_conmax_top (D = \s14.msel.arb2.next_state [1], Q = \s14.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$67348 ($_DFF_PP0_) from module wb_conmax_top (D = \s14.msel.arb2.next_state [0], Q = \s14.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$67131 ($_DFF_PP0_) from module wb_conmax_top (D = \s14.msel.arb1.next_state [2], Q = \s14.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$67130 ($_DFF_PP0_) from module wb_conmax_top (D = \s14.msel.arb1.next_state [1], Q = \s14.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$67129 ($_DFF_PP0_) from module wb_conmax_top (D = \s14.msel.arb1.next_state [0], Q = \s14.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$66912 ($_DFF_PP0_) from module wb_conmax_top (D = \s14.msel.arb0.next_state [2], Q = \s14.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$66911 ($_DFF_PP0_) from module wb_conmax_top (D = \s14.msel.arb0.next_state [1], Q = \s14.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$66910 ($_DFF_PP0_) from module wb_conmax_top (D = \s14.msel.arb0.next_state [0], Q = \s14.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$65595 ($_DFF_PP0_) from module wb_conmax_top (D = \s13.msel.arb3.next_state [2], Q = \s13.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$65594 ($_DFF_PP0_) from module wb_conmax_top (D = \s13.msel.arb3.next_state [1], Q = \s13.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$65593 ($_DFF_PP0_) from module wb_conmax_top (D = \s13.msel.arb3.next_state [0], Q = \s13.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$65376 ($_DFF_PP0_) from module wb_conmax_top (D = \s13.msel.arb2.next_state [2], Q = \s13.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$65375 ($_DFF_PP0_) from module wb_conmax_top (D = \s13.msel.arb2.next_state [1], Q = \s13.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$65374 ($_DFF_PP0_) from module wb_conmax_top (D = \s13.msel.arb2.next_state [0], Q = \s13.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$65157 ($_DFF_PP0_) from module wb_conmax_top (D = \s13.msel.arb1.next_state [2], Q = \s13.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$65156 ($_DFF_PP0_) from module wb_conmax_top (D = \s13.msel.arb1.next_state [1], Q = \s13.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$65155 ($_DFF_PP0_) from module wb_conmax_top (D = \s13.msel.arb1.next_state [0], Q = \s13.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$64938 ($_DFF_PP0_) from module wb_conmax_top (D = \s13.msel.arb0.next_state [2], Q = \s13.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$64937 ($_DFF_PP0_) from module wb_conmax_top (D = \s13.msel.arb0.next_state [1], Q = \s13.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$64936 ($_DFF_PP0_) from module wb_conmax_top (D = \s13.msel.arb0.next_state [0], Q = \s13.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$63621 ($_DFF_PP0_) from module wb_conmax_top (D = \s12.msel.arb3.next_state [2], Q = \s12.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$63620 ($_DFF_PP0_) from module wb_conmax_top (D = \s12.msel.arb3.next_state [1], Q = \s12.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$63619 ($_DFF_PP0_) from module wb_conmax_top (D = \s12.msel.arb3.next_state [0], Q = \s12.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$63402 ($_DFF_PP0_) from module wb_conmax_top (D = \s12.msel.arb2.next_state [2], Q = \s12.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$63401 ($_DFF_PP0_) from module wb_conmax_top (D = \s12.msel.arb2.next_state [1], Q = \s12.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$63400 ($_DFF_PP0_) from module wb_conmax_top (D = \s12.msel.arb2.next_state [0], Q = \s12.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$63183 ($_DFF_PP0_) from module wb_conmax_top (D = \s12.msel.arb1.next_state [2], Q = \s12.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$63182 ($_DFF_PP0_) from module wb_conmax_top (D = \s12.msel.arb1.next_state [1], Q = \s12.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$63181 ($_DFF_PP0_) from module wb_conmax_top (D = \s12.msel.arb1.next_state [0], Q = \s12.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$62964 ($_DFF_PP0_) from module wb_conmax_top (D = \s12.msel.arb0.next_state [2], Q = \s12.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$62963 ($_DFF_PP0_) from module wb_conmax_top (D = \s12.msel.arb0.next_state [1], Q = \s12.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$62962 ($_DFF_PP0_) from module wb_conmax_top (D = \s12.msel.arb0.next_state [0], Q = \s12.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$61647 ($_DFF_PP0_) from module wb_conmax_top (D = \s11.msel.arb3.next_state [2], Q = \s11.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$61646 ($_DFF_PP0_) from module wb_conmax_top (D = \s11.msel.arb3.next_state [1], Q = \s11.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$61645 ($_DFF_PP0_) from module wb_conmax_top (D = \s11.msel.arb3.next_state [0], Q = \s11.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$61428 ($_DFF_PP0_) from module wb_conmax_top (D = \s11.msel.arb2.next_state [2], Q = \s11.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$61427 ($_DFF_PP0_) from module wb_conmax_top (D = \s11.msel.arb2.next_state [1], Q = \s11.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$61426 ($_DFF_PP0_) from module wb_conmax_top (D = \s11.msel.arb2.next_state [0], Q = \s11.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$61209 ($_DFF_PP0_) from module wb_conmax_top (D = \s11.msel.arb1.next_state [2], Q = \s11.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$61208 ($_DFF_PP0_) from module wb_conmax_top (D = \s11.msel.arb1.next_state [1], Q = \s11.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$61207 ($_DFF_PP0_) from module wb_conmax_top (D = \s11.msel.arb1.next_state [0], Q = \s11.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$60990 ($_DFF_PP0_) from module wb_conmax_top (D = \s11.msel.arb0.next_state [2], Q = \s11.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$60989 ($_DFF_PP0_) from module wb_conmax_top (D = \s11.msel.arb0.next_state [1], Q = \s11.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$60988 ($_DFF_PP0_) from module wb_conmax_top (D = \s11.msel.arb0.next_state [0], Q = \s11.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$59673 ($_DFF_PP0_) from module wb_conmax_top (D = \s10.msel.arb3.next_state [2], Q = \s10.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$59672 ($_DFF_PP0_) from module wb_conmax_top (D = \s10.msel.arb3.next_state [1], Q = \s10.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$59671 ($_DFF_PP0_) from module wb_conmax_top (D = \s10.msel.arb3.next_state [0], Q = \s10.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$59454 ($_DFF_PP0_) from module wb_conmax_top (D = \s10.msel.arb2.next_state [2], Q = \s10.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$59453 ($_DFF_PP0_) from module wb_conmax_top (D = \s10.msel.arb2.next_state [1], Q = \s10.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$59452 ($_DFF_PP0_) from module wb_conmax_top (D = \s10.msel.arb2.next_state [0], Q = \s10.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$59235 ($_DFF_PP0_) from module wb_conmax_top (D = \s10.msel.arb1.next_state [2], Q = \s10.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$59234 ($_DFF_PP0_) from module wb_conmax_top (D = \s10.msel.arb1.next_state [1], Q = \s10.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$59233 ($_DFF_PP0_) from module wb_conmax_top (D = \s10.msel.arb1.next_state [0], Q = \s10.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$59016 ($_DFF_PP0_) from module wb_conmax_top (D = \s10.msel.arb0.next_state [2], Q = \s10.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$59015 ($_DFF_PP0_) from module wb_conmax_top (D = \s10.msel.arb0.next_state [1], Q = \s10.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$59014 ($_DFF_PP0_) from module wb_conmax_top (D = \s10.msel.arb0.next_state [0], Q = \s10.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$57699 ($_DFF_PP0_) from module wb_conmax_top (D = \s9.msel.arb3.next_state [2], Q = \s9.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$57698 ($_DFF_PP0_) from module wb_conmax_top (D = \s9.msel.arb3.next_state [1], Q = \s9.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$57697 ($_DFF_PP0_) from module wb_conmax_top (D = \s9.msel.arb3.next_state [0], Q = \s9.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$57480 ($_DFF_PP0_) from module wb_conmax_top (D = \s9.msel.arb2.next_state [2], Q = \s9.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$57479 ($_DFF_PP0_) from module wb_conmax_top (D = \s9.msel.arb2.next_state [1], Q = \s9.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$57478 ($_DFF_PP0_) from module wb_conmax_top (D = \s9.msel.arb2.next_state [0], Q = \s9.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$57261 ($_DFF_PP0_) from module wb_conmax_top (D = \s9.msel.arb1.next_state [2], Q = \s9.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$57260 ($_DFF_PP0_) from module wb_conmax_top (D = \s9.msel.arb1.next_state [1], Q = \s9.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$57259 ($_DFF_PP0_) from module wb_conmax_top (D = \s9.msel.arb1.next_state [0], Q = \s9.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$57042 ($_DFF_PP0_) from module wb_conmax_top (D = \s9.msel.arb0.next_state [2], Q = \s9.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$57041 ($_DFF_PP0_) from module wb_conmax_top (D = \s9.msel.arb0.next_state [1], Q = \s9.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$57040 ($_DFF_PP0_) from module wb_conmax_top (D = \s9.msel.arb0.next_state [0], Q = \s9.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$55725 ($_DFF_PP0_) from module wb_conmax_top (D = \s8.msel.arb3.next_state [2], Q = \s8.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$55724 ($_DFF_PP0_) from module wb_conmax_top (D = \s8.msel.arb3.next_state [1], Q = \s8.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$55723 ($_DFF_PP0_) from module wb_conmax_top (D = \s8.msel.arb3.next_state [0], Q = \s8.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$55506 ($_DFF_PP0_) from module wb_conmax_top (D = \s8.msel.arb2.next_state [2], Q = \s8.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$55505 ($_DFF_PP0_) from module wb_conmax_top (D = \s8.msel.arb2.next_state [1], Q = \s8.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$55504 ($_DFF_PP0_) from module wb_conmax_top (D = \s8.msel.arb2.next_state [0], Q = \s8.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$55287 ($_DFF_PP0_) from module wb_conmax_top (D = \s8.msel.arb1.next_state [2], Q = \s8.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$55286 ($_DFF_PP0_) from module wb_conmax_top (D = \s8.msel.arb1.next_state [1], Q = \s8.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$55285 ($_DFF_PP0_) from module wb_conmax_top (D = \s8.msel.arb1.next_state [0], Q = \s8.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$55068 ($_DFF_PP0_) from module wb_conmax_top (D = \s8.msel.arb0.next_state [2], Q = \s8.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$55067 ($_DFF_PP0_) from module wb_conmax_top (D = \s8.msel.arb0.next_state [1], Q = \s8.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$55066 ($_DFF_PP0_) from module wb_conmax_top (D = \s8.msel.arb0.next_state [0], Q = \s8.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$53751 ($_DFF_PP0_) from module wb_conmax_top (D = \s7.msel.arb3.next_state [2], Q = \s7.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$53750 ($_DFF_PP0_) from module wb_conmax_top (D = \s7.msel.arb3.next_state [1], Q = \s7.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$53749 ($_DFF_PP0_) from module wb_conmax_top (D = \s7.msel.arb3.next_state [0], Q = \s7.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$53532 ($_DFF_PP0_) from module wb_conmax_top (D = \s7.msel.arb2.next_state [2], Q = \s7.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$53531 ($_DFF_PP0_) from module wb_conmax_top (D = \s7.msel.arb2.next_state [1], Q = \s7.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$53530 ($_DFF_PP0_) from module wb_conmax_top (D = \s7.msel.arb2.next_state [0], Q = \s7.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$53313 ($_DFF_PP0_) from module wb_conmax_top (D = \s7.msel.arb1.next_state [2], Q = \s7.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$53312 ($_DFF_PP0_) from module wb_conmax_top (D = \s7.msel.arb1.next_state [1], Q = \s7.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$53311 ($_DFF_PP0_) from module wb_conmax_top (D = \s7.msel.arb1.next_state [0], Q = \s7.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$53094 ($_DFF_PP0_) from module wb_conmax_top (D = \s7.msel.arb0.next_state [2], Q = \s7.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$53093 ($_DFF_PP0_) from module wb_conmax_top (D = \s7.msel.arb0.next_state [1], Q = \s7.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$53092 ($_DFF_PP0_) from module wb_conmax_top (D = \s7.msel.arb0.next_state [0], Q = \s7.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$51777 ($_DFF_PP0_) from module wb_conmax_top (D = \s6.msel.arb3.next_state [2], Q = \s6.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$51776 ($_DFF_PP0_) from module wb_conmax_top (D = \s6.msel.arb3.next_state [1], Q = \s6.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$51775 ($_DFF_PP0_) from module wb_conmax_top (D = \s6.msel.arb3.next_state [0], Q = \s6.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$51558 ($_DFF_PP0_) from module wb_conmax_top (D = \s6.msel.arb2.next_state [2], Q = \s6.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$51557 ($_DFF_PP0_) from module wb_conmax_top (D = \s6.msel.arb2.next_state [1], Q = \s6.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$51556 ($_DFF_PP0_) from module wb_conmax_top (D = \s6.msel.arb2.next_state [0], Q = \s6.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$51339 ($_DFF_PP0_) from module wb_conmax_top (D = \s6.msel.arb1.next_state [2], Q = \s6.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$51338 ($_DFF_PP0_) from module wb_conmax_top (D = \s6.msel.arb1.next_state [1], Q = \s6.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$51337 ($_DFF_PP0_) from module wb_conmax_top (D = \s6.msel.arb1.next_state [0], Q = \s6.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$51120 ($_DFF_PP0_) from module wb_conmax_top (D = \s6.msel.arb0.next_state [2], Q = \s6.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$51119 ($_DFF_PP0_) from module wb_conmax_top (D = \s6.msel.arb0.next_state [1], Q = \s6.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$51118 ($_DFF_PP0_) from module wb_conmax_top (D = \s6.msel.arb0.next_state [0], Q = \s6.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$49803 ($_DFF_PP0_) from module wb_conmax_top (D = \s5.msel.arb3.next_state [2], Q = \s5.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$49802 ($_DFF_PP0_) from module wb_conmax_top (D = \s5.msel.arb3.next_state [1], Q = \s5.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$49801 ($_DFF_PP0_) from module wb_conmax_top (D = \s5.msel.arb3.next_state [0], Q = \s5.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$49584 ($_DFF_PP0_) from module wb_conmax_top (D = \s5.msel.arb2.next_state [2], Q = \s5.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$49583 ($_DFF_PP0_) from module wb_conmax_top (D = \s5.msel.arb2.next_state [1], Q = \s5.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$49582 ($_DFF_PP0_) from module wb_conmax_top (D = \s5.msel.arb2.next_state [0], Q = \s5.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$49365 ($_DFF_PP0_) from module wb_conmax_top (D = \s5.msel.arb1.next_state [2], Q = \s5.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$49364 ($_DFF_PP0_) from module wb_conmax_top (D = \s5.msel.arb1.next_state [1], Q = \s5.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$49363 ($_DFF_PP0_) from module wb_conmax_top (D = \s5.msel.arb1.next_state [0], Q = \s5.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$49146 ($_DFF_PP0_) from module wb_conmax_top (D = \s5.msel.arb0.next_state [2], Q = \s5.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$49145 ($_DFF_PP0_) from module wb_conmax_top (D = \s5.msel.arb0.next_state [1], Q = \s5.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$49144 ($_DFF_PP0_) from module wb_conmax_top (D = \s5.msel.arb0.next_state [0], Q = \s5.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$47829 ($_DFF_PP0_) from module wb_conmax_top (D = \s4.msel.arb3.next_state [2], Q = \s4.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$47828 ($_DFF_PP0_) from module wb_conmax_top (D = \s4.msel.arb3.next_state [1], Q = \s4.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$47827 ($_DFF_PP0_) from module wb_conmax_top (D = \s4.msel.arb3.next_state [0], Q = \s4.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$47610 ($_DFF_PP0_) from module wb_conmax_top (D = \s4.msel.arb2.next_state [2], Q = \s4.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$47609 ($_DFF_PP0_) from module wb_conmax_top (D = \s4.msel.arb2.next_state [1], Q = \s4.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$47608 ($_DFF_PP0_) from module wb_conmax_top (D = \s4.msel.arb2.next_state [0], Q = \s4.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$47391 ($_DFF_PP0_) from module wb_conmax_top (D = \s4.msel.arb1.next_state [2], Q = \s4.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$47390 ($_DFF_PP0_) from module wb_conmax_top (D = \s4.msel.arb1.next_state [1], Q = \s4.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$47389 ($_DFF_PP0_) from module wb_conmax_top (D = \s4.msel.arb1.next_state [0], Q = \s4.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$47172 ($_DFF_PP0_) from module wb_conmax_top (D = \s4.msel.arb0.next_state [2], Q = \s4.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$47171 ($_DFF_PP0_) from module wb_conmax_top (D = \s4.msel.arb0.next_state [1], Q = \s4.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$47170 ($_DFF_PP0_) from module wb_conmax_top (D = \s4.msel.arb0.next_state [0], Q = \s4.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$45855 ($_DFF_PP0_) from module wb_conmax_top (D = \s3.msel.arb3.next_state [2], Q = \s3.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$45854 ($_DFF_PP0_) from module wb_conmax_top (D = \s3.msel.arb3.next_state [1], Q = \s3.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$45853 ($_DFF_PP0_) from module wb_conmax_top (D = \s3.msel.arb3.next_state [0], Q = \s3.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$45636 ($_DFF_PP0_) from module wb_conmax_top (D = \s3.msel.arb2.next_state [2], Q = \s3.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$45635 ($_DFF_PP0_) from module wb_conmax_top (D = \s3.msel.arb2.next_state [1], Q = \s3.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$45634 ($_DFF_PP0_) from module wb_conmax_top (D = \s3.msel.arb2.next_state [0], Q = \s3.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$45417 ($_DFF_PP0_) from module wb_conmax_top (D = \s3.msel.arb1.next_state [2], Q = \s3.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$45416 ($_DFF_PP0_) from module wb_conmax_top (D = \s3.msel.arb1.next_state [1], Q = \s3.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$45415 ($_DFF_PP0_) from module wb_conmax_top (D = \s3.msel.arb1.next_state [0], Q = \s3.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$45198 ($_DFF_PP0_) from module wb_conmax_top (D = \s3.msel.arb0.next_state [2], Q = \s3.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$45197 ($_DFF_PP0_) from module wb_conmax_top (D = \s3.msel.arb0.next_state [1], Q = \s3.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$45196 ($_DFF_PP0_) from module wb_conmax_top (D = \s3.msel.arb0.next_state [0], Q = \s3.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$43881 ($_DFF_PP0_) from module wb_conmax_top (D = \s2.msel.arb3.next_state [2], Q = \s2.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$43880 ($_DFF_PP0_) from module wb_conmax_top (D = \s2.msel.arb3.next_state [1], Q = \s2.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$43879 ($_DFF_PP0_) from module wb_conmax_top (D = \s2.msel.arb3.next_state [0], Q = \s2.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$43662 ($_DFF_PP0_) from module wb_conmax_top (D = \s2.msel.arb2.next_state [2], Q = \s2.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$43661 ($_DFF_PP0_) from module wb_conmax_top (D = \s2.msel.arb2.next_state [1], Q = \s2.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$43660 ($_DFF_PP0_) from module wb_conmax_top (D = \s2.msel.arb2.next_state [0], Q = \s2.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$43443 ($_DFF_PP0_) from module wb_conmax_top (D = \s2.msel.arb1.next_state [2], Q = \s2.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$43442 ($_DFF_PP0_) from module wb_conmax_top (D = \s2.msel.arb1.next_state [1], Q = \s2.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$43441 ($_DFF_PP0_) from module wb_conmax_top (D = \s2.msel.arb1.next_state [0], Q = \s2.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$43224 ($_DFF_PP0_) from module wb_conmax_top (D = \s2.msel.arb0.next_state [2], Q = \s2.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$43223 ($_DFF_PP0_) from module wb_conmax_top (D = \s2.msel.arb0.next_state [1], Q = \s2.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$43222 ($_DFF_PP0_) from module wb_conmax_top (D = \s2.msel.arb0.next_state [0], Q = \s2.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$41907 ($_DFF_PP0_) from module wb_conmax_top (D = \s1.msel.arb3.next_state [2], Q = \s1.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$41906 ($_DFF_PP0_) from module wb_conmax_top (D = \s1.msel.arb3.next_state [1], Q = \s1.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$41905 ($_DFF_PP0_) from module wb_conmax_top (D = \s1.msel.arb3.next_state [0], Q = \s1.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$41688 ($_DFF_PP0_) from module wb_conmax_top (D = \s1.msel.arb2.next_state [2], Q = \s1.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$41687 ($_DFF_PP0_) from module wb_conmax_top (D = \s1.msel.arb2.next_state [1], Q = \s1.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$41686 ($_DFF_PP0_) from module wb_conmax_top (D = \s1.msel.arb2.next_state [0], Q = \s1.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$41469 ($_DFF_PP0_) from module wb_conmax_top (D = \s1.msel.arb1.next_state [2], Q = \s1.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$41468 ($_DFF_PP0_) from module wb_conmax_top (D = \s1.msel.arb1.next_state [1], Q = \s1.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$41467 ($_DFF_PP0_) from module wb_conmax_top (D = \s1.msel.arb1.next_state [0], Q = \s1.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$41250 ($_DFF_PP0_) from module wb_conmax_top (D = \s1.msel.arb0.next_state [2], Q = \s1.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$41249 ($_DFF_PP0_) from module wb_conmax_top (D = \s1.msel.arb0.next_state [1], Q = \s1.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$41248 ($_DFF_PP0_) from module wb_conmax_top (D = \s1.msel.arb0.next_state [0], Q = \s1.msel.arb0.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$39933 ($_DFF_PP0_) from module wb_conmax_top (D = \s0.msel.arb3.next_state [2], Q = \s0.msel.arb3.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$39932 ($_DFF_PP0_) from module wb_conmax_top (D = \s0.msel.arb3.next_state [1], Q = \s0.msel.arb3.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$39931 ($_DFF_PP0_) from module wb_conmax_top (D = \s0.msel.arb3.next_state [0], Q = \s0.msel.arb3.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$39714 ($_DFF_PP0_) from module wb_conmax_top (D = \s0.msel.arb2.next_state [2], Q = \s0.msel.arb2.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$39713 ($_DFF_PP0_) from module wb_conmax_top (D = \s0.msel.arb2.next_state [1], Q = \s0.msel.arb2.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$39712 ($_DFF_PP0_) from module wb_conmax_top (D = \s0.msel.arb2.next_state [0], Q = \s0.msel.arb2.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$39495 ($_DFF_PP0_) from module wb_conmax_top (D = \s0.msel.arb1.next_state [2], Q = \s0.msel.arb1.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$39494 ($_DFF_PP0_) from module wb_conmax_top (D = \s0.msel.arb1.next_state [1], Q = \s0.msel.arb1.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$39493 ($_DFF_PP0_) from module wb_conmax_top (D = \s0.msel.arb1.next_state [0], Q = \s0.msel.arb1.state [0]).
Adding EN signal on $auto$ff.cc:262:slice$39276 ($_DFF_PP0_) from module wb_conmax_top (D = \s0.msel.arb0.next_state [2], Q = \s0.msel.arb0.state [2]).
Adding EN signal on $auto$ff.cc:262:slice$39275 ($_DFF_PP0_) from module wb_conmax_top (D = \s0.msel.arb0.next_state [1], Q = \s0.msel.arb0.state [1]).
Adding EN signal on $auto$ff.cc:262:slice$39274 ($_DFF_PP0_) from module wb_conmax_top (D = \s0.msel.arb0.next_state [0], Q = \s0.msel.arb0.state [0]).

yosys> opt_clean

4.25.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..
Removed 0 unused cells and 3264 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

4.25.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.
<suppressed ~23040 debug messages>

4.25.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.25.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

4.25.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.25.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
<suppressed ~75648 debug messages>
Removed a total of 25216 cells.

yosys> opt_dff

4.25.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.25.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..
Removed 0 unused cells and 15361 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

4.25.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.25.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.25.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

4.25.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.25.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff

4.25.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.25.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..

yosys> opt_expr

4.25.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.25.30. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

4.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

4.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.
<suppressed ~8511 debug messages>

yosys> opt_merge

4.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
<suppressed ~8640 debug messages>
Removed a total of 2880 cells.

yosys> opt_dff

4.26.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.26.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..
Removed 0 unused cells and 1536 unused wires.
<suppressed ~1 debug messages>

4.26.5. Finished fast OPT passes.

yosys> memory_map

4.27. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

4.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

4.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

yosys> opt_merge -nomux

4.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

4.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

4.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_share

4.28.6. Executing OPT_SHARE pass.

yosys> opt_dff

4.28.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.28.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..

yosys> opt_expr -full

4.28.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.28.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

4.29. Executing ABC pass (technology mapping using ABC).

4.29.1. Extracting gate netlist of module `\wb_conmax_top' to `<abc-temp-dir>/input.blif'..
Extracted 27927 gates and 29810 wires to a netlist network with 1882 inputs and 1891 outputs.

4.29.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/yosys_verific_rs/result_04-05-2022T15-08-45/Golden_synth_rs_ade.json/wb_conmax_wrapper/abc_tmp.scr 
ABC:   #Luts =  8998  Max Lvl =   8  Avg Lvl =   3.76  [   1.65 sec. at Pass 0]
ABC:   #Luts =  7812  Max Lvl =  10  Avg Lvl =   4.01  [  73.40 sec. at Pass 1]
ABC:   #Luts =  7736  Max Lvl =   9  Avg Lvl =   3.98  [  25.46 sec. at Pass 2]
ABC:   #Luts =  7724  Max Lvl =   9  Avg Lvl =   3.98  [  55.31 sec. at Pass 3]
ABC:   #Luts =  7682  Max Lvl =   9  Avg Lvl =   3.97  [  33.14 sec. at Pass 4]
ABC:   #Luts =  7660  Max Lvl =  10  Avg Lvl =   3.97  [  76.57 sec. at Pass 5]
ABC:   #Luts =  7643  Max Lvl =   9  Avg Lvl =   3.97  [  46.34 sec. at Pass 6]
ABC:   #Luts =  7630  Max Lvl =  10  Avg Lvl =   3.98  [  74.56 sec. at Pass 7]
ABC:   #Luts =  7618  Max Lvl =  10  Avg Lvl =   3.96  [  40.09 sec. at Pass 8]
ABC:   #Luts =  7600  Max Lvl =   9  Avg Lvl =   3.97  [  69.99 sec. at Pass 9]
ABC: + write_blif <abc-temp-dir>/output.blif 

4.29.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     7600
ABC RESULTS:        internal signals:    26037
ABC RESULTS:           input signals:     1882
ABC RESULTS:          output signals:     1891
Removing temp directory.

yosys> opt

4.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

yosys> opt_merge -nomux

4.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

4.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

4.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff

4.30.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.30.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..
Removed 0 unused cells and 14678 unused wires.
<suppressed ~1729 debug messages>

yosys> opt_expr

4.30.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.30.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.30.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

4.30.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.30.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff

4.30.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.30.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..

yosys> opt_expr

4.30.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.30.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

4.31. Printing statistics.

=== wb_conmax_top ===

   Number of wires:              10757
   Number of wire bits:          56412
   Number of public wires:        4798
   Number of public wire bits:   50453
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               8370
     $_DFFE_PP0N_                  128
     $_DFFE_PP0P_                  448
     $_DFF_P_                      146
     $_SDFFE_PP0P_                  32
     $_SDFF_PN0_                    16
     $lut                         7600


yosys> shregmap -minlen 8 -maxlen 20

4.32. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

4.33. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

4.34. Printing statistics.

=== wb_conmax_top ===

   Number of wires:              10837
   Number of wire bits:          56492
   Number of public wires:        4798
   Number of public wire bits:   50453
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               8450
     $_DFFE_PP0N_                  128
     $_DFFE_PP0P_                  448
     $_DFF_P_                      194
     $_MUX_                         80
     $lut                         7600


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

4.35. Executing TECHMAP pass (map to technology primitives).

4.35.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

4.35.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

4.35.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using template \$_DFFE_PP0N_ for cells of type $_DFFE_PP0N_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~9210 debug messages>

yosys> opt_expr -mux_undef

4.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.
<suppressed ~265731 debug messages>

yosys> simplemap

4.37. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

4.38. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

yosys> opt_merge

4.39. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
<suppressed ~91656 debug messages>
Removed a total of 30552 cells.

yosys> opt_dff -nodffe -nosdff

4.40. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.41. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..
Removed 0 unused cells and 29006 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

4.42. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.42.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.
<suppressed ~4525 debug messages>

yosys> opt_merge -nomux

4.42.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
<suppressed ~42 debug messages>
Removed a total of 14 cells.

yosys> opt_muxtree

4.42.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

4.42.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.42.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

4.42.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.42.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..
Removed 0 unused cells and 953 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

4.42.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.42.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.42.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

4.42.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.42.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

4.42.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.42.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..

yosys> opt_expr

4.42.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.42.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

4.43. Executing ABC pass (technology mapping using ABC).

4.43.1. Extracting gate netlist of module `\wb_conmax_top' to `<abc-temp-dir>/input.blif'..
Extracted 25364 gates and 27265 wires to a netlist network with 1899 inputs and 1891 outputs.

4.43.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/yosys_verific_rs/result_04-05-2022T15-08-45/Golden_synth_rs_ade.json/wb_conmax_wrapper/abc_tmp.scr 
ABC:   #Luts =  7682  Max Lvl =   9  Avg Lvl =   3.99  [   3.24 sec. at Pass 0]
ABC:   #Luts =  7682  Max Lvl =   9  Avg Lvl =   3.99  [ 146.26 sec. at Pass 1]
ABC:   #Luts =  7660  Max Lvl =   9  Avg Lvl =   4.01  [  29.14 sec. at Pass 2]
ABC:   #Luts =  7658  Max Lvl =   8  Avg Lvl =   3.85  [  62.43 sec. at Pass 3]
ABC:   #Luts =  7646  Max Lvl =   8  Avg Lvl =   3.85  [  53.00 sec. at Pass 4]
ABC:   #Luts =  7626  Max Lvl =   9  Avg Lvl =   3.99  [ 101.81 sec. at Pass 5]
ABC:   #Luts =  7616  Max Lvl =   9  Avg Lvl =   3.99  [  44.72 sec. at Pass 6]
ABC:   #Luts =  7613  Max Lvl =   9  Avg Lvl =   3.99  [  97.03 sec. at Pass 7]
ABC:   #Luts =  7613  Max Lvl =   9  Avg Lvl =   3.99  [  51.87 sec. at Pass 8]
ABC:   #Luts =  7608  Max Lvl =  10  Avg Lvl =   4.00  [  89.06 sec. at Pass 9]
ABC: + write_blif <abc-temp-dir>/output.blif 

4.43.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     7608
ABC RESULTS:        internal signals:    23475
ABC RESULTS:           input signals:     1899
ABC RESULTS:          output signals:     1891
Removing temp directory.

yosys> opt

4.44. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.44.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

yosys> opt_merge -nomux

4.44.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

4.44.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

4.44.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.44.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff

4.44.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.44.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..
Removed 0 unused cells and 21419 unused wires.
<suppressed ~50 debug messages>

yosys> opt_expr

4.44.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.44.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.44.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wb_conmax_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

4.44.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wb_conmax_top.
Performed a total of 0 changes.

yosys> opt_merge

4.44.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wb_conmax_top'.
Removed a total of 0 cells.

yosys> opt_dff

4.44.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.44.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..

yosys> opt_expr

4.44.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wb_conmax_top.

4.44.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

4.45. Executing HIERARCHY pass (managing design hierarchy).

4.45.1. Analyzing design hierarchy..
Top module:  \wb_conmax_top

4.45.2. Analyzing design hierarchy..
Top module:  \wb_conmax_top
Removed 0 unused modules.

yosys> stat

4.46. Printing statistics.

=== wb_conmax_top ===

   Number of wires:              10749
   Number of wire bits:          56356
   Number of public wires:        4749
   Number of public wire bits:   50356
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               8378
     $lut                         7608
     dffsre                        770


yosys> opt_clean -purge

4.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wb_conmax_top..
Removed 0 unused cells and 4072 unused wires.
<suppressed ~4072 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

4.48. Executing Verilog backend.

yosys> bmuxmap

4.48.1. Executing BMUXMAP pass.

yosys> demuxmap

4.48.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\wb_conmax_top'.

Warnings: 99 unique messages, 99 total
End of script. Logfile hash: 05ff9ad26a, CPU: user 150.72s system 1.28s, MEM: 659.48 MB peak
Yosys 0.16+6 (git sha1 7f5477eb1, gcc 9.1.0 -fPIC -Os)
Time spent: 97% 2x abc (5681 sec), 0% 29x opt_expr (57 sec), ...
real 1426.78
user 5440.83
sys 391.04
