
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.32
 Yosys 0.16+65 (git sha1 7987105a9, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k IR_Emitter_Carrier_Generator.v IR_Emitter_Interface.v IR_Emitter_Modulator.v IR_Emitter_Registers.v IR_Remote.v i2cSlave.v i2cSlaveSerialInterface.v i2cSlaveTop.v r1024x9_1024x9.v

yosys> verific -vlog2k IR_Emitter_Carrier_Generator.v IR_Emitter_Interface.v IR_Emitter_Modulator.v IR_Emitter_Registers.v IR_Remote.v i2cSlave.v i2cSlaveSerialInterface.v i2cSlaveTop.v r1024x9_1024x9.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Emitter_Carrier_Generator.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Emitter_Interface.v'
VERIFIC-INFO [VERI-2561] IR_Emitter_Interface.v:263: undeclared symbol 'IR_Emitter_MemRd_Stb', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Emitter_Modulator.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Emitter_Registers.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Remote.v'
VERIFIC-WARNING [VERI-1407] IR_Remote.v:125: attribute target identifier 'hierarchy' not found in this scope
VERIFIC-WARNING [VERI-1407] IR_Remote.v:124: attribute target identifier 'ql_pack' not found in this scope
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'i2cSlave.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'i2cSlaveSerialInterface.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'i2cSlaveTop.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'r1024x9_1024x9.v'

yosys> synth_rs -top top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.50

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top top

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] IR_Remote.v:29: compiling module 'top'
VERIFIC-INFO [VERI-1018] i2cSlaveTop.v:47: compiling module 'i2cSlaveTop(I2C_ADDRESS=7'b0101010)'
VERIFIC-INFO [VERI-1018] i2cSlave.v:48: compiling module 'i2cSlave(I2C_ADDRESS=7'b0101010)'
VERIFIC-INFO [VERI-1018] i2cSlaveSerialInterface.v:58: compiling module 'i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010)'
VERIFIC-INFO [VERI-1018] IR_Emitter_Interface.v:29: compiling module 'IR_Emitter_Interface'
VERIFIC-INFO [VERI-1018] IR_Emitter_Carrier_Generator.v:32: compiling module 'IR_Emitter_Carrier_Generator'
VERIFIC-WARNING [VERI-1209] IR_Emitter_Carrier_Generator.v:236: expression size 32 truncated to fit in target size 8
VERIFIC-WARNING [VERI-1209] IR_Emitter_Carrier_Generator.v:264: expression size 32 truncated to fit in target size 8
VERIFIC-WARNING [VERI-1209] IR_Emitter_Carrier_Generator.v:438: expression size 32 truncated to fit in target size 8
VERIFIC-WARNING [VERI-1209] IR_Emitter_Carrier_Generator.v:466: expression size 32 truncated to fit in target size 8
VERIFIC-INFO [VERI-1018] IR_Emitter_Modulator.v:32: compiling module 'IR_Emitter_Modulator'
VERIFIC-WARNING [VERI-1209] IR_Emitter_Modulator.v:478: expression size 14 truncated to fit in target size 13
VERIFIC-WARNING [VERI-1209] IR_Emitter_Modulator.v:508: expression size 32 truncated to fit in target size 16
VERIFIC-INFO [VERI-1018] IR_Emitter_Registers.v:31: compiling module 'IR_Emitter_Registers'
VERIFIC-INFO [VERI-1018] r1024x9_1024x9.v:17: compiling module 'r1024x9_1024x9'
VERIFIC-WARNING [VERI-1209] r1024x9_1024x9.v:40: expression size 22 truncated to fit in target size 9
Importing module top.
Importing module IR_Emitter_Interface.
Importing module IR_Emitter_Carrier_Generator.
Importing module IR_Emitter_Modulator.
Importing module IR_Emitter_Registers.
Importing module i2cSlaveTop(I2C_ADDRESS=7'b0101010).
Importing module i2cSlave(I2C_ADDRESS=7'b0101010).
Importing module i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010).
Importing module r1024x9_1024x9.

3.3.1. Analyzing design hierarchy..
Top module:  \top
Used module:     \IR_Emitter_Interface
Used module:         \r1024x9_1024x9
Used module:         \IR_Emitter_Registers
Used module:         \IR_Emitter_Modulator
Used module:         \IR_Emitter_Carrier_Generator
Used module:     \i2cSlaveTop(I2C_ADDRESS=7'b0101010)
Used module:         \i2cSlave(I2C_ADDRESS=7'b0101010)
Used module:             \i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010)

3.3.2. Analyzing design hierarchy..
Top module:  \top
Used module:     \IR_Emitter_Interface
Used module:         \r1024x9_1024x9
Used module:         \IR_Emitter_Registers
Used module:         \IR_Emitter_Modulator
Used module:         \IR_Emitter_Carrier_Generator
Used module:     \i2cSlaveTop(I2C_ADDRESS=7'b0101010)
Used module:         \i2cSlave(I2C_ADDRESS=7'b0101010)
Used module:             \i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010)
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module r1024x9_1024x9.
Optimizing module i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010).
<suppressed ~20 debug messages>
Optimizing module i2cSlave(I2C_ADDRESS=7'b0101010).
<suppressed ~3 debug messages>
Optimizing module i2cSlaveTop(I2C_ADDRESS=7'b0101010).
Optimizing module IR_Emitter_Registers.
<suppressed ~7 debug messages>
Optimizing module IR_Emitter_Modulator.
<suppressed ~8 debug messages>
Optimizing module IR_Emitter_Carrier_Generator.
<suppressed ~11 debug messages>
Optimizing module IR_Emitter_Interface.
<suppressed ~3 debug messages>
Optimizing module top.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module r1024x9_1024x9.
Deleting now unused module i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010).
Deleting now unused module i2cSlave(I2C_ADDRESS=7'b0101010).
Deleting now unused module i2cSlaveTop(I2C_ADDRESS=7'b0101010).
Deleting now unused module IR_Emitter_Registers.
Deleting now unused module IR_Emitter_Modulator.
Deleting now unused module IR_Emitter_Carrier_Generator.
Deleting now unused module IR_Emitter_Interface.
<suppressed ~15 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).
Demoting inout port top.IR_Emitter_Gpio_Port_io to output.
Demoting inout port top.CpuScl to input.
Demoting inout port top.CpuSda to output.

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~32 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1061 unused wires.
<suppressed ~181 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module top...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~57 debug messages>

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~126 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$Select_125$IR_Emitter_Carrier_Generator.v:383$955: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n318$807 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n326$812 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$select_122$IR_Emitter_Carrier_Generator.v:383$952: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n319$808 $auto$opt_reduce.cc:134:opt_pmux$1885 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$select_140$IR_Emitter_Carrier_Generator.v:409$962: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n203$787 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n347$816 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$Select_153$IR_Emitter_Modulator.v:442$1140: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n296$1022 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n298$1024 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$select_143$IR_Emitter_Modulator.v:442$1136: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n296$1022 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n298$1024 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$select_80$IR_Emitter_Registers.v:312$1323: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n207$1210 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n208$1211 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n209$1212 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n6$1184 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n9$1186 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n12$1188 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n15$1190 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n18$1192 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n21$1194 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n24$1196 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n27$1198 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n30$1200 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n33$1202 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n36$1204 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n39$1206 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n42$1208 }
    New ctrl vector for $pmux cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$Select_235$i2cSlaveSerialInterface.v:474$1852: { $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n956$1585 $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n957$1586 }
    New ctrl vector for $pmux cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$select_79$i2cSlaveSerialInterface.v:309$1757: { $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n323$1564 $auto$opt_reduce.cc:134:opt_pmux$1887 }
    New ctrl vector for $pmux cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$select_81$i2cSlaveSerialInterface.v:309$1758: $auto$opt_reduce.cc:134:opt_pmux$1889
    New ctrl vector for $pmux cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$select_94$i2cSlaveSerialInterface.v:322$1759: $auto$opt_reduce.cc:134:opt_pmux$1891
  Optimizing cells in module \top.
Performed a total of 12 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$txData_reg$i2cSlaveSerialInterface.v:449$1839 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$streamSt_reg$i2cSlaveSerialInterface.v:449$1838 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$rxData_reg$i2cSlaveSerialInterface.v:449$1840 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$regAddr_reg$i2cSlaveSerialInterface.v:449$1842 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$dataOut_reg$i2cSlaveSerialInterface.v:449$1836 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$bitCnt_reg$i2cSlaveSerialInterface.v:449$1841 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$CurrState_SISt_reg$i2cSlaveSerialInterface.v:424$1815 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$startStopDetState_reg$i2cSlave.v:245$1508 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaPipe_reg$i2cSlave.v:191$1482 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaDelayed_reg$i2cSlave.v:214$1491 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclPipe_reg$i2cSlave.v:191$1484 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclDelayed_reg$i2cSlave.v:214$1490 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$rstPipe_reg$i2cSlave.v:158$1464 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.$verific$RegAddr_i_1ff_reg$IR_Emitter_Interface.v:324$186 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.$verific$RegRd_En_i_1ff_reg$IR_Emitter_Interface.v:324$185 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$RegData_o_reg$IR_Emitter_Registers.v:408$1365 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$RegAddr_i_1ff_reg$IR_Emitter_Registers.v:408$1364 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_LED_Gpio_o_reg$IR_Emitter_Registers.v:408$1374 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_LED_Gpio_Polarity_o_reg$IR_Emitter_Registers.v:408$1373 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Run_Modulator_o_reg$IR_Emitter_Registers.v:408$1366 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Mode_Modulator_o_reg$IR_Emitter_Registers.v:408$1367 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Stop_o_reg$IR_Emitter_Registers.v:408$1371 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Start_o_reg$IR_Emitter_Registers.v:408$1370 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemAddr_Reg_o_reg$IR_Emitter_Registers.v:408$1372 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Interrupt_reg$IR_Emitter_Registers.v:408$1378 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Interrupt_Enable_reg$IR_Emitter_Registers.v:408$1379 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Gpio_Port_o_reg$IR_Emitter_Registers.v:408$1375 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Gpio_Dir_o_reg$IR_Emitter_Registers.v:408$1376 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Duty_Len_o_reg$IR_Emitter_Registers.v:408$1369 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Cycle_Len_o_reg$IR_Emitter_Registers.v:408$1368 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Busy_Modulator_i_1ff_reg$IR_Emitter_Registers.v:408$1377 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_LED_En_o_reg$IR_Emitter_Modulator.v:260$1113 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_tc_reg$IR_Emitter_Modulator.v:260$1109 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_reg$IR_Emitter_Modulator.v:260$1106 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_ld_upr_reg$IR_Emitter_Modulator.v:260$1108 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_ld_lwr_reg$IR_Emitter_Modulator.v:260$1107 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_Signal_reg$IR_Emitter_Modulator.v:260$1112 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Modulator_State_reg$IR_Emitter_Modulator.v:260$1114 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemData_lwr_reg$IR_Emitter_Modulator.v:260$1110 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_tc_upr_reg$IR_Emitter_Modulator.v:260$1105 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_tc_lwr_reg$IR_Emitter_Modulator.v:260$1104 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_reg$IR_Emitter_Modulator.v:260$1101 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_ld_reg$IR_Emitter_Modulator.v:260$1103 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_ce_reg$IR_Emitter_Modulator.v:260$1102 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Carrier_Enable_o_reg$IR_Emitter_Modulator.v:260$1099 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Busy_Modulator_o_reg$IR_Emitter_Modulator.v:260$1100 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Signal_o_reg$IR_Emitter_Carrier_Generator.v:216$910 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_ld_tc_reg$IR_Emitter_Carrier_Generator.v:216$908 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$907 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_cntr_ld_reg$IR_Emitter_Carrier_Generator.v:216$906 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_State_reg$IR_Emitter_Carrier_Generator.v:216$909 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_1_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$905 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_1_cntr_reg$IR_Emitter_Carrier_Generator.v:216$904 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_0_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$903 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_0_cntr_reg$IR_Emitter_Carrier_Generator.v:216$902 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_Enable_o_reg$IR_Emitter_Carrier_Generator.v:216$901 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_1_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$900 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_1_cntr_reg$IR_Emitter_Carrier_Generator.v:216$899 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_0_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$898 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_0_cntr_reg$IR_Emitter_Carrier_Generator.v:216$897 ($aldff) from module top.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 9 unused cells and 17 unused wires.
<suppressed ~10 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~128 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).
Found FSM state register top.u_i2cSlaveTop.u_i2cSlave.startStopDetState.

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).
Extracting FSM `\u_i2cSlaveTop.u_i2cSlave.startStopDetState' from module `\top'.
  found $dff cell for state register: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$startStopDetState_reg$i2cSlave.v:245$1508
  root of input selection tree: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n176$1457
  found reset state: 2'00 (guessed from mux tree)
  found ctrl input: \u_i2cSlaveTop.u_i2cSlave.rstPipe [1]
  found ctrl input: \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet
  found ctrl input: \u_i2cSlaveTop.u_i2cSlave.sclDeb
  found ctrl input: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n154$1431
  found ctrl input: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n160$1432
  found state code: 2'01
  found state code: 2'10
  found state code: 2'00
  found ctrl output: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n324$1565
  found ctrl output: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n323$1564
  found ctrl output: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n291$1559
  ctrl inputs: { \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet \u_i2cSlaveTop.u_i2cSlave.rstPipe [1] $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n160$1432 $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n154$1431 \u_i2cSlaveTop.u_i2cSlave.sclDeb }
  ctrl outputs: { $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n291$1559 $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n323$1564 $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n324$1565 $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n176$1457 }
  transition:       2'00 5'00--0 ->       2'00 5'01000
  transition:       2'00 5'00001 ->       2'00 5'01000
  transition:       2'00 5'00101 ->       2'01 5'01001
  transition:       2'00 5'00-11 ->       2'10 5'01010
  transition:       2'00 5'10--- ->       2'00 5'01000
  transition:       2'00 5'-1--- ->       2'00 5'01000
  transition:       2'10 5'00--0 ->       2'10 5'10010
  transition:       2'10 5'00001 ->       2'10 5'10010
  transition:       2'10 5'00101 ->       2'01 5'10001
  transition:       2'10 5'00-11 ->       2'10 5'10010
  transition:       2'10 5'10--- ->       2'00 5'10000
  transition:       2'10 5'-1--- ->       2'00 5'10000
  transition:       2'01 5'00--0 ->       2'01 5'00101
  transition:       2'01 5'00001 ->       2'01 5'00101
  transition:       2'01 5'00101 ->       2'01 5'00101
  transition:       2'01 5'00-11 ->       2'10 5'00110
  transition:       2'01 5'10--- ->       2'00 5'00100
  transition:       2'01 5'-1--- ->       2'00 5'00100

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$1892' from module `\top'.
  Merging pattern 5'00001 and 5'00101 from group (2 2 5'00101).
  Merging pattern 5'00101 and 5'00001 from group (2 2 5'00101).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 9 unused cells and 10 unused wires.
<suppressed ~11 debug messages>

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$1892' from module `\top'.
  Removing unused output signal $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n176$1457 [0].
  Removing unused output signal $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n176$1457 [1].

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).
Recoding FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$1892' from module `\top' using `auto' encoding:
  mapping auto encoding to `binary` for this FSM.
  existing encoding is already a packed binary encoding.

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$1892' from module `top':
-------------------------------------

  Information on FSM $fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$1892 (\u_i2cSlaveTop.u_i2cSlave.startStopDetState):

  Number of input signals:    5
  Number of output signals:   3
  Number of state bits:       2

  Input signals:
    0: \u_i2cSlaveTop.u_i2cSlave.sclDeb
    1: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n154$1431
    2: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n160$1432
    3: \u_i2cSlaveTop.u_i2cSlave.rstPipe [1]
    4: \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet

  Output signals:
    0: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n324$1565
    1: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n323$1564
    2: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n291$1559

  State encoding:
    0:       2'00  <RESET STATE>
    1:       2'10
    2:       2'01

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 5'00--0   ->     0 3'010
      1:     0 5'00001   ->     0 3'010
      2:     0 5'10---   ->     0 3'010
      3:     0 5'-1---   ->     0 3'010
      4:     0 5'00-11   ->     1 3'010
      5:     0 5'00101   ->     2 3'010
      6:     1 5'10---   ->     0 3'100
      7:     1 5'-1---   ->     0 3'100
      8:     1 5'00--0   ->     1 3'100
      9:     1 5'00001   ->     1 3'100
     10:     1 5'00-11   ->     1 3'100
     11:     1 5'00101   ->     2 3'100
     12:     2 5'10---   ->     0 3'001
     13:     2 5'-1---   ->     0 3'001
     14:     2 5'00-11   ->     1 3'001
     15:     2 5'00--0   ->     2 3'001
     16:     2 5'00-01   ->     2 3'001

-------------------------------------

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).
Mapping FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$1892' from module `\top'.

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~5 debug messages>

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~9 debug messages>
Removed a total of 3 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~128 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$writeEn_reg$i2cSlaveSerialInterface.v:449$1835 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_writeEn, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.writeEn, rval = 1'0).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$txData_reg$i2cSlaveSerialInterface.v:449$1839 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_txData, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.txData, rval = 8'00000000).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$streamSt_reg$i2cSlaveSerialInterface.v:449$1838 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_streamSt, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.streamSt, rval = 2'00).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$sdaOut_reg$i2cSlaveSerialInterface.v:449$1834 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_sdaOut, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.sdaOut, rval = 1'1).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$rxData_reg$i2cSlaveSerialInterface.v:449$1840 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData, rval = 8'00000000).
Adding EN signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$regAddr_reg$i2cSlaveSerialInterface.v:449$1842 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_regAddr, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$dataOut_reg$i2cSlaveSerialInterface.v:449$1836 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_dataOut, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, rval = 8'00000000).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$clearStartStopDet_reg$i2cSlaveSerialInterface.v:449$1837 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_clearStartStopDet, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet, rval = 1'0).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$bitCnt_reg$i2cSlaveSerialInterface.v:449$1841 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_bitCnt, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.bitCnt, rval = 3'000).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$I2CReadDataLatchedOut_reg$i2cSlaveSerialInterface.v:476$1854 ($dff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n959$1588, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.I2CReadDataLatchedOut, rval = 1'0).
Adding EN signal on $auto$ff.cc:262:slice$1949 ($sdff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n959$1588, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.I2CReadDataLatchedOut).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$CurrState_SISt_reg$i2cSlaveSerialInterface.v:424$1815 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.NextState_SISt, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.CurrState_SISt, rval = 4'0000).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$startEdgeDet_reg$i2cSlave.v:245$1509 ($dff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n146$1429, Q = \u_i2cSlaveTop.u_i2cSlave.startEdgeDet, rval = 1'0).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaPipe_reg$i2cSlave.v:191$1482 ($dff) from module top (D = { \u_i2cSlaveTop.u_i2cSlave.sdaPipe [3:0] \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.sdaOut }, Q = \u_i2cSlaveTop.u_i2cSlave.sdaPipe, rval = 5'11111).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaDelayed_reg$i2cSlave.v:214$1491 ($dff) from module top (D = { \u_i2cSlaveTop.u_i2cSlave.sdaDelayed [0] \u_i2cSlaveTop.u_i2cSlave.sdaDeb }, Q = \u_i2cSlaveTop.u_i2cSlave.sdaDelayed, rval = 2'11).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaDeb_reg$i2cSlave.v:191$1483 ($dff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n65$1422, Q = \u_i2cSlaveTop.u_i2cSlave.sdaDeb, rval = 1'1).
Adding EN signal on $auto$ff.cc:262:slice$1961 ($sdff) from module top (D = 1'0, Q = \u_i2cSlaveTop.u_i2cSlave.sdaDeb).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclPipe_reg$i2cSlave.v:191$1484 ($dff) from module top (D = { \u_i2cSlaveTop.u_i2cSlave.sclPipe [3:0] \CpuScl }, Q = \u_i2cSlaveTop.u_i2cSlave.sclPipe, rval = 5'11111).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclDelayed_reg$i2cSlave.v:214$1490 ($dff) from module top (D = { \u_i2cSlaveTop.u_i2cSlave.sclDelayed [3:0] \u_i2cSlaveTop.u_i2cSlave.sclDeb }, Q = \u_i2cSlaveTop.u_i2cSlave.sclDelayed, rval = 5'11111).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclDeb_reg$i2cSlave.v:191$1485 ($dff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n57$1418, Q = \u_i2cSlaveTop.u_i2cSlave.sclDeb, rval = 1'1).
Adding EN signal on $auto$ff.cc:262:slice$1967 ($sdff) from module top (D = 1'0, Q = \u_i2cSlaveTop.u_i2cSlave.sclDeb).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$rstPipe_reg$i2cSlave.v:158$1464 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.rstPipe [0], Q = \u_i2cSlaveTop.u_i2cSlave.rstPipe [1], rval = 1'1).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_LED_Gpio_o_reg$IR_Emitter_Registers.v:408$1374 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [2], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_LED_Gpio_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_LED_Gpio_Polarity_o_reg$IR_Emitter_Registers.v:408$1373 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [3], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_LED_Gpio_Polarity_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Mode_Modulator_o_reg$IR_Emitter_Registers.v:408$1367 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [1:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Mode_Modulator_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Stop_o_reg$IR_Emitter_Registers.v:408$1371 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_o [7:0]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Stop_o_reg$IR_Emitter_Registers.v:408$1371 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [4:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_o [12:8]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Start_o_reg$IR_Emitter_Registers.v:408$1370 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_o [7:0]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Start_o_reg$IR_Emitter_Registers.v:408$1370 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [4:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_o [12:8]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemAddr_Reg_o_reg$IR_Emitter_Registers.v:408$1372 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [5:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Interrupt_reg$IR_Emitter_Registers.v:408$1378 ($adff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n386$1229, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Interrupt).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Interrupt_Enable_reg$IR_Emitter_Registers.v:408$1379 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [5], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Interrupt_Enable).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Gpio_Port_o_reg$IR_Emitter_Registers.v:408$1375 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Gpio_Dir_o_reg$IR_Emitter_Registers.v:408$1376 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Duty_Len_o_reg$IR_Emitter_Registers.v:408$1369 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_o [7:0]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Duty_Len_o_reg$IR_Emitter_Registers.v:408$1369 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_o [15:8]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Cycle_Len_o_reg$IR_Emitter_Registers.v:408$1368 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_o [7:0]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Cycle_Len_o_reg$IR_Emitter_Registers.v:408$1368 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_o [15:8]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_tc_reg$IR_Emitter_Modulator.v:260$1109 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_tc_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_tc).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_reg$IR_Emitter_Modulator.v:260$1106 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemData_lwr_reg$IR_Emitter_Modulator.v:260$1110 ($adff) from module top (D = \u_IR_Emitter_Interface.IR_Emitter_MemData_o, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemData_lwr).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_tc_upr_reg$IR_Emitter_Modulator.v:260$1105 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_tc_lwr, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_tc_upr).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_tc_lwr_reg$IR_Emitter_Modulator.v:260$1104 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_tc_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_tc_lwr).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_reg$IR_Emitter_Modulator.v:260$1101 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_1_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$905 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Duty_1_cntr_tc_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Duty_1_cntr_tc).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_1_cntr_reg$IR_Emitter_Carrier_Generator.v:216$904 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Duty_1_cntr_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Duty_1_cntr).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_1_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$900 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Cycle_1_cntr_tc_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Cycle_1_cntr_tc).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_1_cntr_reg$IR_Emitter_Carrier_Generator.v:216$899 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Cycle_1_cntr_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Cycle_1_cntr).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 56 unused cells and 63 unused wires.
<suppressed ~57 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~7 debug messages>

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~86 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~86 debug messages>

yosys> opt_reduce

3.13.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.13.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 3 bits (of 4) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$1935 ($eq).
Removed top 1 bits (of 2) from port B of cell top.$auto$fsm_map.cc:215:map_fsm$1902 ($eq).
Removed top 2 bits (of 4) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$1926 ($eq).
Removed top 1 bits (of 2) from mux cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$mux_11$i2cSlave.v:156$1463 ($mux).
Removed top 2 bits (of 5) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$1933 ($eq).
Removed top 1 bits (of 4) from mux cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$mux_138$i2cSlaveSerialInterface.v:366$1786 ($mux).
Removed top 1 bits (of 7) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$equal_115$i2cSlaveSerialInterface.v:342$1772 ($eq).
Removed top 1 bits (of 4) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$equal_232$i2cSlaveSerialInterface.v:462$1847 ($eq).
Removed top 1 bits (of 4) from mux cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$mux_50$i2cSlaveSerialInterface.v:282$1739 ($mux).
Removed top 2 bits (of 3) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_48$i2cSlaveSerialInterface.v:280$1737 ($add).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_25$i2cSlaveSerialInterface.v:245$1721 ($add).
Removed top 1 bits (of 2) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$equal_22$i2cSlaveSerialInterface.v:241$1719 ($eq).
Removed top 4 bits (of 5) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$1922 ($eq).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$1954 ($ne).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 5 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_5$IR_Emitter_Registers.v:239$1277 ($eq).
Removed top 5 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_8$IR_Emitter_Registers.v:240$1280 ($eq).
Removed top 5 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_11$IR_Emitter_Registers.v:242$1283 ($eq).
Removed top 5 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_14$IR_Emitter_Registers.v:243$1286 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_17$IR_Emitter_Registers.v:245$1289 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_20$IR_Emitter_Registers.v:246$1292 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_23$IR_Emitter_Registers.v:248$1295 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_26$IR_Emitter_Registers.v:249$1298 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_29$IR_Emitter_Registers.v:251$1301 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_32$IR_Emitter_Registers.v:252$1304 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_35$IR_Emitter_Registers.v:254$1307 ($eq).
Removed top 3 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_38$IR_Emitter_Registers.v:256$1310 ($eq).
Removed top 3 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_41$IR_Emitter_Registers.v:257$1313 ($eq).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_63$IR_Emitter_Registers.v:283$1317 ($eq).
Removed top 6 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_64$IR_Emitter_Registers.v:285$1318 ($eq).
Removed top 2 bits (of 3) from mux cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$mux_79$IR_Emitter_Modulator.v:339$1124 ($mux).
Removed top 14 bits (of 16) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$equal_196$IR_Emitter_Modulator.v:529$1176 ($eq).
Removed top 12 bits (of 13) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$add_173$IR_Emitter_Modulator.v:478$1152 ($add).
Removed top 1 bits (of 2) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$equal_176$IR_Emitter_Modulator.v:477$1153 ($eq).
Removed top 1 bits (of 17) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164 ($sub).
Removed top 16 bits (of 17) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164 ($sub).
Removed top 1 bits (of 17) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164 ($sub).
Removed top 1 bits (of 2) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$equal_188$IR_Emitter_Modulator.v:507$1166 ($eq).
Removed top 15 bits (of 16) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$equal_193$IR_Emitter_Modulator.v:528$1173 ($eq).
Removed top 1 bits (of 9) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911 ($sub).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911 ($sub).
Removed top 1 bits (of 9) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911 ($sub).
Removed top 6 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_62$IR_Emitter_Carrier_Generator.v:243$917 ($eq).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_65$IR_Emitter_Carrier_Generator.v:245$920 ($eq).
Removed top 1 bits (of 9) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924 ($sub).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924 ($sub).
Removed top 1 bits (of 9) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924 ($sub).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_77$IR_Emitter_Carrier_Generator.v:272$928 ($eq).
Removed top 15 bits (of 16) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_89$IR_Emitter_Carrier_Generator.v:302$937 ($eq).
Removed top 1 bits (of 2) from mux cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$mux_99$IR_Emitter_Carrier_Generator.v:338$941 ($mux).
Removed top 1 bits (of 9) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968 ($sub).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968 ($sub).
Removed top 1 bits (of 9) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968 ($sub).
Removed top 6 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_155$IR_Emitter_Carrier_Generator.v:445$974 ($eq).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_158$IR_Emitter_Carrier_Generator.v:447$977 ($eq).
Removed top 1 bits (of 9) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981 ($sub).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981 ($sub).
Removed top 1 bits (of 9) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981 ($sub).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_170$IR_Emitter_Carrier_Generator.v:474$987 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_75$IR_Emitter_Interface.v:296$166 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_72$IR_Emitter_Interface.v:295$165 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_69$IR_Emitter_Interface.v:294$164 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_51$IR_Emitter_Interface.v:282$157 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_48$IR_Emitter_Interface.v:281$156 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_45$IR_Emitter_Interface.v:280$155 ($eq).
Removed top 1 bits (of 9) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n175$843.
Removed top 1 bits (of 9) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n223$846.
Removed top 1 bits (of 2) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n288$851.
Removed top 1 bits (of 9) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n364$862.
Removed top 1 bits (of 9) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n412$865.
Removed top 2 bits (of 3) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n214$1056.
Removed top 1 bits (of 17) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n432$1070.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$n37$1865.
Removed top 1 bits (of 2) from wire top.$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n16$1437.
Removed top 1 bits (of 4) from wire top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n247$1624.
Removed top 1 bits (of 4) from wire top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n559$1665.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 32 unused cells and 71 unused wires.
<suppressed ~33 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module top:
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968 ($sub).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981 ($sub).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911 ($sub).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924 ($sub).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$add_173$IR_Emitter_Modulator.v:478$1152 ($add).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164 ($sub).
  creating $macc model for $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_25$i2cSlaveSerialInterface.v:245$1721 ($add).
  creating $macc model for $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_48$i2cSlaveSerialInterface.v:280$1737 ($add).
  creating $alu model for $macc $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_48$i2cSlaveSerialInterface.v:280$1737.
  creating $alu model for $macc $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_25$i2cSlaveSerialInterface.v:245$1721.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$add_173$IR_Emitter_Modulator.v:478$1152.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968.
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968: $auto$alumacc.cc:485:replace_alu$2215
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981: $auto$alumacc.cc:485:replace_alu$2218
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911: $auto$alumacc.cc:485:replace_alu$2221
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924: $auto$alumacc.cc:485:replace_alu$2224
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$add_173$IR_Emitter_Modulator.v:478$1152: $auto$alumacc.cc:485:replace_alu$2227
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164: $auto$alumacc.cc:485:replace_alu$2230
  creating $alu cell for $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_25$i2cSlaveSerialInterface.v:245$1721: $auto$alumacc.cc:485:replace_alu$2233
  creating $alu cell for $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_48$i2cSlaveSerialInterface.v:280$1737: $auto$alumacc.cc:485:replace_alu$2236
  created 8 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~9 debug messages>

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
    dead port 2/2 on $mux $auto$pmuxtree.cc:65:recursive_mux_generator$2069.
    dead port 2/2 on $mux $auto$pmuxtree.cc:65:recursive_mux_generator$2077.
    dead port 2/2 on $mux $auto$pmuxtree.cc:65:recursive_mux_generator$2085.
    dead port 2/2 on $mux $auto$pmuxtree.cc:65:recursive_mux_generator$2093.
Removed 4 multiplexer ports.
<suppressed ~86 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$2195: { $auto$rtlil.cc:2398:Or$2158 $auto$rtlil.cc:2398:Or$2166 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n36$1204 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n33$1202 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n24$1196 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n21$1194 }
  Optimizing cells in module \top.
Performed a total of 1 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $auto$fsm_map.cc:172:map_fsm$1898 ($dff) from module top (D = $auto$rtlil.cc:2464:Mux$2038, Q = \u_i2cSlaveTop.u_i2cSlave.startStopDetState, rval = 2'10).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 5 unused cells and 12 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~84 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== top ===

   Number of wires:                627
   Number of wire bits:           2370
   Number of public wires:         343
   Number of public wire bits:    1384
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                421
     $adff                          25
     $adffe                         26
     $alu                            8
     $and                           44
     $bmux                          28
     $dff                            1
     $dffe                           9
     $eq                            64
     $logic_not                     14
     $mux                          123
     $ne                             2
     $not                           12
     $or                            17
     $reduce_and                     3
     $reduce_bool                    1
     $reduce_or                     17
     $sdff                          16
     $sdffe                          3
     $xor                            8


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.21.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_share

3.21.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_collect

3.21.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== top ===

   Number of wires:                627
   Number of wire bits:           2370
   Number of public wires:         343
   Number of public wire bits:    1384
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                421
     $adff                          25
     $adffe                         26
     $alu                            8
     $and                           44
     $bmux                          28
     $dff                            1
     $dffe                           9
     $eq                            64
     $logic_not                     14
     $mux                          123
     $ne                             2
     $not                           12
     $or                            17
     $reduce_and                     3
     $reduce_bool                    1
     $reduce_or                     17
     $sdff                          16
     $sdffe                          3
     $xor                            8


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> stat

3.24. Printing statistics.

=== top ===

   Number of wires:                627
   Number of wire bits:           2370
   Number of public wires:         343
   Number of public wire bits:    1384
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                421
     $adff                          25
     $adffe                         26
     $alu                            8
     $and                           44
     $bmux                          28
     $dff                            1
     $dffe                           9
     $eq                            64
     $logic_not                     14
     $mux                          123
     $ne                             2
     $not                           12
     $or                            17
     $reduce_and                     3
     $reduce_bool                    1
     $reduce_or                     17
     $sdff                          16
     $sdffe                          3
     $xor                            8


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $sdff.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $sdffe.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $logic_not.
Using template $paramod$3ef7d3dd227da7627a99c5e5a6a4deb817573e39\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $ne.
Using template $paramod$403a3c2fa431a154c52a6a5429d7a6260b5d144f\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $adff.
Using template $paramod$a1665ef28c749ebcdbe9aecd466e644647b56463\_90_alu for cells of type $alu.
Using template $paramod$c3cd1564c35d873179656addd6052d7ea8b6d991\_90_alu for cells of type $alu.
Using template $paramod$215440792383f7884e57d9c95f84e9552d0bf4ac\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000011 for cells of type $lcu.
No more expansions possible.
<suppressed ~1734 debug messages>

yosys> stat

3.26. Printing statistics.

=== top ===

   Number of wires:               1447
   Number of wire bits:          14291
   Number of public wires:         343
   Number of public wire bits:    1384
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3433
     $_AND_                        285
     $_DFFE_PN0P_                  135
     $_DFFE_PN1P_                    9
     $_DFFE_PN_                      8
     $_DFFE_PP_                     72
     $_DFF_PN0_                     62
     $_DFF_P_                        1
     $_MUX_                       1525
     $_NOT_                        162
     $_OR_                         530
     $_SDFFE_PP0P_                   1
     $_SDFFE_PP1N_                   2
     $_SDFF_PN1_                     1
     $_SDFF_PP0_                    37
     $_SDFF_PP1_                    19
     $_XOR_                        584


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~1284 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~1005 debug messages>
Removed a total of 335 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 62 unused cells and 654 unused wires.
<suppressed ~63 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$4672 ($_DFF_PN0_) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_Signal_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_Signal).
Adding EN signal on $auto$ff.cc:262:slice$2553 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [7], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [7]).
Adding EN signal on $auto$ff.cc:262:slice$2552 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [6], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [6]).
Adding EN signal on $auto$ff.cc:262:slice$2551 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [5], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [5]).
Adding EN signal on $auto$ff.cc:262:slice$2550 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [4], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [4]).
Adding EN signal on $auto$ff.cc:262:slice$2549 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [3], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [3]).
Adding EN signal on $auto$ff.cc:262:slice$2548 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [2], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [2]).
Adding EN signal on $auto$ff.cc:262:slice$2547 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [1], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [1]).
Adding EN signal on $auto$ff.cc:262:slice$2546 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [0], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [0]).
Adding EN signal on $auto$ff.cc:262:slice$2545 ($_SDFF_PP0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$2660 [7], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.txData [7]).
Adding EN signal on $auto$ff.cc:262:slice$2544 ($_SDFF_PP0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$2660 [6], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.txData [6]).
Adding EN signal on $auto$ff.cc:262:slice$2543 ($_SDFF_PP0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$2660 [5], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.txData [5]).
Adding EN signal on $auto$ff.cc:262:slice$2542 ($_SDFF_PP0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$2660 [4], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.txData [4]).
Adding EN signal on $auto$ff.cc:262:slice$2541 ($_SDFF_PP0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$2660 [3], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.txData [3]).
Adding EN signal on $auto$ff.cc:262:slice$2540 ($_SDFF_PP0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$2660 [2], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.txData [2]).
Adding EN signal on $auto$ff.cc:262:slice$2539 ($_SDFF_PP0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$2660 [1], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.txData [1]).
Adding EN signal on $auto$ff.cc:262:slice$2538 ($_SDFF_PP0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$2660 [0], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.txData [0]).
Adding EN signal on $auto$ff.cc:262:slice$2537 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_clearStartStopDet, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet).
Adding EN signal on $auto$ff.cc:262:slice$2536 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_bitCnt [2], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.bitCnt [2]).
Adding EN signal on $auto$ff.cc:262:slice$2535 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_bitCnt [1], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.bitCnt [1]).
Adding EN signal on $auto$ff.cc:262:slice$2534 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_bitCnt [0], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.bitCnt [0]).
Adding EN signal on $auto$ff.cc:262:slice$2533 ($_SDFF_PP1_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_sdaOut, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.sdaOut).
Adding EN signal on $auto$ff.cc:262:slice$2532 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_streamSt [1], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.streamSt [1]).
Adding EN signal on $auto$ff.cc:262:slice$2531 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_streamSt [0], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.streamSt [0]).
Adding EN signal on $auto$ff.cc:262:slice$2530 ($_DFFE_PN_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_regAddr [7], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr [7]).
Adding EN signal on $auto$ff.cc:262:slice$2529 ($_DFFE_PN_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_regAddr [6], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr [6]).
Adding EN signal on $auto$ff.cc:262:slice$2528 ($_DFFE_PN_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_regAddr [5], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr [5]).
Adding EN signal on $auto$ff.cc:262:slice$2527 ($_DFFE_PN_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_regAddr [4], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr [4]).
Adding EN signal on $auto$ff.cc:262:slice$2526 ($_DFFE_PN_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_regAddr [3], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr [3]).
Adding EN signal on $auto$ff.cc:262:slice$2525 ($_DFFE_PN_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_regAddr [2], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr [2]).
Adding EN signal on $auto$ff.cc:262:slice$2524 ($_DFFE_PN_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_regAddr [1], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr [1]).
Adding EN signal on $auto$ff.cc:262:slice$2523 ($_DFFE_PN_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_regAddr [0], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr [0]).
Adding EN signal on $auto$ff.cc:262:slice$2521 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.NextState_SISt [2], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.CurrState_SISt [2]).
Adding EN signal on $auto$ff.cc:262:slice$2519 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.NextState_SISt [0], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.CurrState_SISt [0]).
Adding EN signal on $auto$ff.cc:262:slice$2518 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_dataOut [7], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [7]).
Adding EN signal on $auto$ff.cc:262:slice$2517 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_dataOut [6], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [6]).
Adding EN signal on $auto$ff.cc:262:slice$2516 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_dataOut [5], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [5]).
Adding EN signal on $auto$ff.cc:262:slice$2515 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_dataOut [4], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [4]).
Adding EN signal on $auto$ff.cc:262:slice$2514 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_dataOut [3], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [3]).
Adding EN signal on $auto$ff.cc:262:slice$2513 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_dataOut [2], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [2]).
Adding EN signal on $auto$ff.cc:262:slice$2512 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_dataOut [1], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [1]).
Adding EN signal on $auto$ff.cc:262:slice$2511 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_dataOut [0], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [0]).
Adding EN signal on $auto$ff.cc:262:slice$2402 ($_SDFF_PP0_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_writeEn, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.writeEn).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 16 unused cells and 386 unused wires.
<suppressed ~18 debug messages>

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~1388 debug messages>

3.27.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.27.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~5934 debug messages>
Removed a total of 1978 cells.

yosys> opt_dff

3.27.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1829 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.27.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.27.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.27.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.27.30. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~482 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$7012 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [7], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [7]).
Adding EN signal on $auto$ff.cc:262:slice$7136 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [6], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [6]).
Adding EN signal on $auto$ff.cc:262:slice$7260 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [5], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [5]).
Adding EN signal on $auto$ff.cc:262:slice$7384 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [4], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [4]).
Adding EN signal on $auto$ff.cc:262:slice$7508 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [3], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [3]).
Adding EN signal on $auto$ff.cc:262:slice$7632 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [2], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [2]).
Adding EN signal on $auto$ff.cc:262:slice$7756 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [1], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [1]).
Adding EN signal on $auto$ff.cc:262:slice$7880 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData [0], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData [0]).
Adding EN signal on $auto$ff.cc:262:slice$8484 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_bitCnt [2], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.bitCnt [2]).
Adding EN signal on $auto$ff.cc:262:slice$8648 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_bitCnt [1], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.bitCnt [1]).
Adding EN signal on $auto$ff.cc:262:slice$8812 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_bitCnt [0], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.bitCnt [0]).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 78 unused wires.
<suppressed ~1 debug messages>

3.28.5. Rerunning OPT passes. (Removed registers in this run.)

yosys> opt_expr -full

3.28.6. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~66 debug messages>

yosys> opt_merge

3.28.7. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~117 debug messages>
Removed a total of 39 cells.

yosys> opt_dff

3.28.8. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 48 unused wires.
<suppressed ~1 debug messages>

3.28.10. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.30.10. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt -sat

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.32.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  44 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$9364, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  16 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$9117, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  18 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$8473, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  23 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$8042, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  8 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$7008, arst=!\Reset_i_N, srst={ }
  66 cells in clk=\Clock_i, en=$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n63$771, arst=!\Reset_i_N, srst={ }
  26 cells in clk=\Clock_i, en={ }, arst={ }, srst=$auto$fsm_map.cc:238:map_fsm$1903 [1]
  4 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_ld_upr, arst=!\Reset_i_N, srst={ }
  105 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_ld_lwr, arst=!\Reset_i_N, srst={ }
  98 cells in clk=\Clock_i, en=$auto$opt_dff.cc:194:make_patterns_logic$2009, arst=!\Reset_i_N, srst={ }
  65 cells in clk=\Clock_i, en=$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, arst=!\Reset_i_N, srst={ }
  5 cells in clk=\Clock_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1990, arst=!\Reset_i_N, srst={ }
  29 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, arst=!\Reset_i_N, srst={ }
  27 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  22 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  164 cells in clk=\Clock_i, en=$auto$opt_dff.cc:194:make_patterns_logic$2000, arst=!\Reset_i_N, srst={ }
  21 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, arst=!\Reset_i_N, srst={ }
  36 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  26 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  374 cells in clk=\Clock_i, en={ }, arst=!\Reset_i_N, srst={ }
  12 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  14 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, arst=!\Reset_i_N, srst={ }
  32 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL, arst={ }, srst={ }
  25 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL, arst={ }, srst={ }
  25 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL, arst={ }, srst={ }
  27 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL, arst={ }, srst={ }
  25 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL, arst={ }, srst={ }
  25 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL, arst={ }, srst={ }
  2 cells in clk=\Clock_i, en={ }, arst={ }, srst={ }
  9 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, arst=!\Reset_i_N, srst={ }
  15 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, arst=!\Reset_i_N, srst={ }
  16 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  16 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  8 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1955, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  99 cells in clk=\Clock_i, en={ }, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  9 cells in clk=\Clock_i, en={ }, arst={ }, srst=!\Reset_i_N
  4 cells in clk=\Clock_i, en=!$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, arst={ }, srst=$auto$opt_dff.cc:253:combine_resets$1968
  3 cells in clk=\Clock_i, en=!$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, arst={ }, srst=$auto$opt_dff.cc:253:combine_resets$1962
  40 cells in clk=\Clock_i, en={ }, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.rstPipe [1]
  25 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL, arst={ }, srst={ }
  25 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$14002, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  46 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$13885, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  20 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$12515, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  16 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$11390, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  74 cells in clk=\Clock_i, en=$auto$opt_dff.cc:194:make_patterns_logic$11227, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  51 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$10014, arst={ }, srst={ }

3.33.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$9364, synchronously reset by \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 44 gates and 71 wires to a netlist network with 26 inputs and 11 outputs.

3.33.2.1. Executing ABC.

3.33.3. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$9117, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 16 gates and 35 wires to a netlist network with 18 inputs and 3 outputs.

3.33.3.1. Executing ABC.

3.33.4. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$8473, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 18 gates and 37 wires to a netlist network with 19 inputs and 8 outputs.

3.33.4.1. Executing ABC.

3.33.5. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$8042, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 23 gates and 40 wires to a netlist network with 15 inputs and 3 outputs.

3.33.5.1. Executing ABC.

3.33.6. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$7008, asynchronously reset by !\Reset_i_N
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 4 outputs.

3.33.6.1. Executing ABC.

3.33.7. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n63$771, asynchronously reset by !\Reset_i_N
Extracted 66 gates and 83 wires to a netlist network with 17 inputs and 2 outputs.

3.33.7.1. Executing ABC.

3.33.8. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $auto$fsm_map.cc:238:map_fsm$1903 [1]
Extracted 26 gates and 34 wires to a netlist network with 7 inputs and 4 outputs.

3.33.8.1. Executing ABC.

3.33.9. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_ld_upr, asynchronously reset by !\Reset_i_N
Extracted 4 gates and 6 wires to a netlist network with 2 inputs and 3 outputs.

3.33.9.1. Executing ABC.

3.33.10. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_ld_lwr, asynchronously reset by !\Reset_i_N
Extracted 105 gates and 199 wires to a netlist network with 93 inputs and 22 outputs.

3.33.10.1. Executing ABC.

3.33.11. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2009, asynchronously reset by !\Reset_i_N
Extracted 98 gates and 137 wires to a netlist network with 39 inputs and 36 outputs.

3.33.11.1. Executing ABC.

3.33.12. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, asynchronously reset by !\Reset_i_N
Extracted 65 gates and 81 wires to a netlist network with 16 inputs and 3 outputs.

3.33.12.1. Executing ABC.

3.33.13. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1990, asynchronously reset by !\Reset_i_N
Extracted 5 gates and 12 wires to a netlist network with 6 inputs and 3 outputs.

3.33.13.1. Executing ABC.

3.33.14. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 29 gates and 52 wires to a netlist network with 22 inputs and 19 outputs.

3.33.14.1. Executing ABC.

3.33.15. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 27 gates and 43 wires to a netlist network with 15 inputs and 20 outputs.

3.33.15.1. Executing ABC.

3.33.16. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 22 gates and 37 wires to a netlist network with 14 inputs and 20 outputs.

3.33.16.1. Executing ABC.

3.33.17. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2000, asynchronously reset by !\Reset_i_N
Extracted 164 gates and 188 wires to a netlist network with 23 inputs and 2 outputs.

3.33.17.1. Executing ABC.

3.33.18. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 21 gates and 40 wires to a netlist network with 18 inputs and 19 outputs.

3.33.18.1. Executing ABC.

3.33.19. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 36 gates and 66 wires to a netlist network with 29 inputs and 20 outputs.

3.33.19.1. Executing ABC.

3.33.20. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 26 gates and 46 wires to a netlist network with 20 inputs and 23 outputs.

3.33.20.1. Executing ABC.

3.33.21. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, asynchronously reset by !\Reset_i_N
Extracted 374 gates and 486 wires to a netlist network with 110 inputs and 57 outputs.

3.33.21.1. Executing ABC.

3.33.22. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 12 gates and 24 wires to a netlist network with 12 inputs and 11 outputs.

3.33.22.1. Executing ABC.

3.33.23. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 14 gates and 29 wires to a netlist network with 15 inputs and 10 outputs.

3.33.23.1. Executing ABC.

3.33.24. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL
Extracted 32 gates and 53 wires to a netlist network with 21 inputs and 18 outputs.

3.33.24.1. Executing ABC.

3.33.25. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL
Extracted 25 gates and 40 wires to a netlist network with 15 inputs and 11 outputs.

3.33.25.1. Executing ABC.

3.33.26. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL
Extracted 25 gates and 40 wires to a netlist network with 15 inputs and 11 outputs.

3.33.26.1. Executing ABC.

3.33.27. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL
Extracted 27 gates and 42 wires to a netlist network with 15 inputs and 13 outputs.

3.33.27.1. Executing ABC.

3.33.28. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL
Extracted 26 gates and 41 wires to a netlist network with 15 inputs and 11 outputs.

3.33.28.1. Executing ABC.

3.33.29. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL
Extracted 25 gates and 40 wires to a netlist network with 15 inputs and 10 outputs.

3.33.29.1. Executing ABC.

3.33.30. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL
Extracted 25 gates and 40 wires to a netlist network with 15 inputs and 10 outputs.

3.33.30.1. Executing ABC.

3.33.31. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i
Extracted 2 gates and 3 wires to a netlist network with 1 inputs and 1 outputs.

3.33.31.1. Executing ABC.

3.33.32. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 9 gates and 18 wires to a netlist network with 9 inputs and 7 outputs.

3.33.32.1. Executing ABC.

3.33.33. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 15 gates and 27 wires to a netlist network with 11 inputs and 13 outputs.

3.33.33.1. Executing ABC.

3.33.34. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 28 wires to a netlist network with 12 inputs and 14 outputs.

3.33.34.1. Executing ABC.

3.33.35. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 28 wires to a netlist network with 12 inputs and 14 outputs.

3.33.35.1. Executing ABC.

3.33.36. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1955, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 8 gates and 15 wires to a netlist network with 6 inputs and 4 outputs.

3.33.36.1. Executing ABC.

3.33.37. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 99 gates and 190 wires to a netlist network with 89 inputs and 81 outputs.

3.33.37.1. Executing ABC.

3.33.38. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by !\Reset_i_N
Extracted 9 gates and 16 wires to a netlist network with 7 inputs and 6 outputs.

3.33.38.1. Executing ABC.

3.33.39. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, synchronously reset by $abc$15768$auto$opt_dff.cc:253:combine_resets$1968
Extracted 4 gates and 8 wires to a netlist network with 3 inputs and 4 outputs.

3.33.39.1. Executing ABC.

3.33.40. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, synchronously reset by $abc$15768$auto$opt_dff.cc:253:combine_resets$1962
Extracted 3 gates and 7 wires to a netlist network with 3 inputs and 3 outputs.

3.33.40.1. Executing ABC.

3.33.41. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$15768$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
Extracted 40 gates and 51 wires to a netlist network with 9 inputs and 22 outputs.

3.33.41.1. Executing ABC.

3.33.42. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL
Extracted 25 gates and 40 wires to a netlist network with 15 inputs and 10 outputs.

3.33.42.1. Executing ABC.

3.33.43. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$14002, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 25 gates and 43 wires to a netlist network with 18 inputs and 7 outputs.

3.33.43.1. Executing ABC.

3.33.44. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$13885, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 46 gates and 75 wires to a netlist network with 29 inputs and 33 outputs.

3.33.44.1. Executing ABC.

3.33.45. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$12515, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 20 gates and 37 wires to a netlist network with 17 inputs and 13 outputs.

3.33.45.1. Executing ABC.

3.33.46. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$11390, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 16 gates and 33 wires to a netlist network with 17 inputs and 11 outputs.

3.33.46.1. Executing ABC.

3.33.47. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15676$auto$opt_dff.cc:194:make_patterns_logic$11227, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 74 gates and 142 wires to a netlist network with 66 inputs and 68 outputs.

3.33.47.1. Executing ABC.

3.33.48. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$10014
Extracted 51 gates and 93 wires to a netlist network with 42 inputs and 28 outputs.

3.33.48.1. Executing ABC.

yosys> abc -dff

3.34. Executing ABC pass (technology mapping using ABC).

3.34.1. Summary of detected clock domains:
  28 cells in clk=\Clock_i, en=$abc$14625$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  8 cells in clk=\Clock_i, en=$abc$15667$auto$opt_dff.cc:219:make_patterns_logic$1955, arst={ }, srst=$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  3 cells in clk=\Clock_i, en={ }, arst={ }, srst={ }
  12 cells in clk=\Clock_i, en=$abc$15559$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, arst=!\Reset_i_N, srst={ }
  25 cells in clk=\Clock_i, en=$abc$15491$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL, arst={ }, srst={ }
  24 cells in clk=\Clock_i, en=$abc$15458$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL, arst={ }, srst={ }
  23 cells in clk=\Clock_i, en=$abc$15424$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL, arst={ }, srst={ }
  8 cells in clk=\Clock_i, en=$abc$14253$auto$opt_dff.cc:219:make_patterns_logic$7008, arst=!\Reset_i_N, srst={ }
  8 cells in clk=\Clock_i, en={ }, arst={ }, srst=!\Reset_i_N
  101 cells in clk=\Clock_i, en=$abc$14697$auto$opt_dff.cc:194:make_patterns_logic$2000, arst=!\Reset_i_N, srst={ }
  3 cells in clk=\Clock_i, en=$abc$14927$lo23, arst=!\Reset_i_N, srst={ }
  24 cells in clk=\Clock_i, en=$abc$15971$auto$opt_dff.cc:219:make_patterns_logic$12515, arst={ }, srst=$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  91 cells in clk=\Clock_i, en=$abc$15676$auto$opt_dff.cc:194:make_patterns_logic$11227, arst={ }, srst=$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  22 cells in clk=\Clock_i, en=$abc$14796$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, arst=!\Reset_i_N, srst={ }
  30 cells in clk=\Clock_i, en=$abc$14833$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  27 cells in clk=\Clock_i, en=$abc$14886$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  74 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  2 cells in clk=\Clock_i, en=$abc$14582$auto$opt_dff.cc:194:make_patterns_logic$1990, arst=!\Reset_i_N, srst={ }
  26 cells in clk=\Clock_i, en=$abc$15883$auto$opt_dff.cc:219:make_patterns_logic$14002, arst={ }, srst=$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  25 cells in clk=\Clock_i, en=$abc$15851$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL, arst={ }, srst={ }
  40 cells in clk=\Clock_i, en=$abc$15994$auto$opt_dff.cc:219:make_patterns_logic$11390, arst={ }, srst=$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  4 cells in clk=\Clock_i, en=!$abc$15786$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, arst={ }, srst=$abc$15768$auto$opt_dff.cc:253:combine_resets$1962
  5 cells in clk=\Clock_i, en=!$abc$15779$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, arst={ }, srst=$abc$15768$auto$opt_dff.cc:253:combine_resets$1968
  33 cells in clk=\Clock_i, en=$abc$14155$auto$opt_dff.cc:219:make_patterns_logic$9364, arst={ }, srst=$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  15 cells in clk=\Clock_i, en=$abc$14229$auto$opt_dff.cc:219:make_patterns_logic$8042, arst={ }, srst=$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  43 cells in clk=\Clock_i, en=$abc$15912$auto$opt_dff.cc:219:make_patterns_logic$13885, arst={ }, srst=$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  31 cells in clk=\Clock_i, en=$abc$15603$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  16 cells in clk=\Clock_i, en=$abc$15578$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, arst=!\Reset_i_N, srst={ }
  68 cells in clk=\Clock_i, en=$abc$14445$auto$opt_dff.cc:194:make_patterns_logic$2009, arst=!\Reset_i_N, srst={ }
  102 cells in clk=\Clock_i, en=$abc$14927$lo22, arst=!\Reset_i_N, srst={ }
  29 cells in clk=\Clock_i, en=$abc$14659$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  21 cells in clk=\Clock_i, en=$abc$15270$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  24 cells in clk=\Clock_i, en=$abc$15392$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL, arst={ }, srst={ }
  23 cells in clk=\Clock_i, en=$abc$15360$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL, arst={ }, srst={ }
  22 cells in clk=\Clock_i, en=$abc$15321$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL, arst={ }, srst={ }
  18 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$14311$auto$fsm_map.cc:238:map_fsm$1903[1]
  19 cells in clk=\Clock_i, en=$abc$14588$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, arst=!\Reset_i_N, srst={ }
  14 cells in clk=\Clock_i, en=$abc$15298$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, arst=!\Reset_i_N, srst={ }
  25 cells in clk=\Clock_i, en=$abc$15523$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL, arst={ }, srst={ }
  13 cells in clk=\Clock_i, en=$abc$14211$auto$opt_dff.cc:219:make_patterns_logic$8473, arst={ }, srst=$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  323 cells in clk=\Clock_i, en={ }, arst=!\Reset_i_N, srst={ }
  43 cells in clk=\Clock_i, en=$abc$14262$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n63$771, arst=!\Reset_i_N, srst={ }
  40 cells in clk=\Clock_i, en=$abc$14533$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, arst=!\Reset_i_N, srst={ }
  19 cells in clk=\Clock_i, en=$abc$14192$auto$opt_dff.cc:219:make_patterns_logic$9117, arst={ }, srst=$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  17 cells in clk=\Clock_i, en=$abc$15635$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  45 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$15768$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
  37 cells in clk=\Clock_i, en=$abc$16109$auto$opt_dff.cc:219:make_patterns_logic$10014, arst={ }, srst={ }

3.34.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14625$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 28 gates and 48 wires to a netlist network with 20 inputs and 21 outputs.

3.34.2.1. Executing ABC.

3.34.3. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15667$auto$opt_dff.cc:219:make_patterns_logic$1955, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 8 gates and 15 wires to a netlist network with 7 inputs and 6 outputs.

3.34.3.1. Executing ABC.

3.34.4. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i
Extracted 3 gates and 4 wires to a netlist network with 1 inputs and 1 outputs.

3.34.4.1. Executing ABC.

3.34.5. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15559$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 12 gates and 25 wires to a netlist network with 13 inputs and 11 outputs.

3.34.5.1. Executing ABC.

3.34.6. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15491$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL
Extracted 25 gates and 41 wires to a netlist network with 16 inputs and 12 outputs.

3.34.6.1. Executing ABC.

3.34.7. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15458$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL
Extracted 24 gates and 39 wires to a netlist network with 15 inputs and 11 outputs.

3.34.7.1. Executing ABC.

3.34.8. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15424$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL
Extracted 23 gates and 38 wires to a netlist network with 15 inputs and 11 outputs.

3.34.8.1. Executing ABC.

3.34.9. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14253$auto$opt_dff.cc:219:make_patterns_logic$7008, asynchronously reset by !\Reset_i_N
Extracted 8 gates and 17 wires to a netlist network with 9 inputs and 4 outputs.

3.34.9.1. Executing ABC.

3.34.10. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by !\Reset_i_N
Extracted 8 gates and 15 wires to a netlist network with 7 inputs and 6 outputs.

3.34.10.1. Executing ABC.

3.34.11. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14697$auto$opt_dff.cc:194:make_patterns_logic$2000, asynchronously reset by !\Reset_i_N
Extracted 101 gates and 129 wires to a netlist network with 28 inputs and 5 outputs.

3.34.11.1. Executing ABC.

3.34.12. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14927$lo23, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 5 wires to a netlist network with 2 inputs and 2 outputs.

3.34.12.1. Executing ABC.

3.34.13. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15971$auto$opt_dff.cc:219:make_patterns_logic$12515, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 24 gates and 46 wires to a netlist network with 22 inputs and 14 outputs.

3.34.13.1. Executing ABC.

3.34.14. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15676$auto$opt_dff.cc:194:make_patterns_logic$11227, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 91 gates and 163 wires to a netlist network with 72 inputs and 75 outputs.

3.34.14.1. Executing ABC.

3.34.15. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14796$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 22 gates and 42 wires to a netlist network with 20 inputs and 17 outputs.

3.34.15.1. Executing ABC.

3.34.16. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14833$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 30 gates and 48 wires to a netlist network with 18 inputs and 19 outputs.

3.34.16.1. Executing ABC.

3.34.17. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14886$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 27 gates and 51 wires to a netlist network with 24 inputs and 22 outputs.

3.34.17.1. Executing ABC.

3.34.18. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 74 gates and 157 wires to a netlist network with 83 inputs and 63 outputs.

3.34.18.1. Executing ABC.

3.34.19. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14582$auto$opt_dff.cc:194:make_patterns_logic$1990, asynchronously reset by !\Reset_i_N
Extracted 2 gates and 5 wires to a netlist network with 3 inputs and 2 outputs.

3.34.19.1. Executing ABC.

3.34.20. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15883$auto$opt_dff.cc:219:make_patterns_logic$14002, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 26 gates and 47 wires to a netlist network with 21 inputs and 8 outputs.

3.34.20.1. Executing ABC.

3.34.21. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15851$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL
Extracted 25 gates and 43 wires to a netlist network with 18 inputs and 14 outputs.

3.34.21.1. Executing ABC.

3.34.22. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15994$auto$opt_dff.cc:219:make_patterns_logic$11390, synchronously reset by $abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 40 gates and 71 wires to a netlist network with 31 inputs and 29 outputs.

3.34.22.1. Executing ABC.

3.34.23. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$15786$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, synchronously reset by $abc$16353$abc$15768$auto$opt_dff.cc:253:combine_resets$1962
Extracted 4 gates and 8 wires to a netlist network with 3 inputs and 3 outputs.

3.34.23.1. Executing ABC.

3.34.24. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$15779$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, synchronously reset by $abc$16353$abc$15768$auto$opt_dff.cc:253:combine_resets$1968
Extracted 5 gates and 10 wires to a netlist network with 4 inputs and 5 outputs.

3.34.24.1. Executing ABC.

3.34.25. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14155$auto$opt_dff.cc:219:make_patterns_logic$9364, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 33 gates and 59 wires to a netlist network with 26 inputs and 11 outputs.

3.34.25.1. Executing ABC.

3.34.26. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14229$auto$opt_dff.cc:219:make_patterns_logic$8042, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 15 gates and 30 wires to a netlist network with 15 inputs and 11 outputs.

3.34.26.1. Executing ABC.

3.34.27. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15912$auto$opt_dff.cc:219:make_patterns_logic$13885, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 43 gates and 69 wires to a netlist network with 26 inputs and 25 outputs.

3.34.27.1. Executing ABC.

3.34.28. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15603$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 31 gates and 58 wires to a netlist network with 27 inputs and 24 outputs.

3.34.28.1. Executing ABC.

3.34.29. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15578$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 30 wires to a netlist network with 14 inputs and 13 outputs.

3.34.29.1. Executing ABC.

3.34.30. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14445$auto$opt_dff.cc:194:make_patterns_logic$2009, asynchronously reset by !\Reset_i_N
Extracted 68 gates and 87 wires to a netlist network with 19 inputs and 29 outputs.

3.34.30.1. Executing ABC.

3.34.31. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14927$lo22, asynchronously reset by !\Reset_i_N
Extracted 102 gates and 195 wires to a netlist network with 93 inputs and 30 outputs.

3.34.31.1. Executing ABC.

3.34.32. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14659$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 29 gates and 52 wires to a netlist network with 23 inputs and 23 outputs.

3.34.32.1. Executing ABC.

3.34.33. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15270$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 21 gates and 44 wires to a netlist network with 23 inputs and 11 outputs.

3.34.33.1. Executing ABC.

3.34.34. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15392$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL
Extracted 24 gates and 39 wires to a netlist network with 15 inputs and 11 outputs.

3.34.34.1. Executing ABC.

3.34.35. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15360$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL
Extracted 23 gates and 38 wires to a netlist network with 15 inputs and 12 outputs.

3.34.35.1. Executing ABC.

3.34.36. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15321$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL
Extracted 22 gates and 37 wires to a netlist network with 15 inputs and 12 outputs.

3.34.36.1. Executing ABC.

3.34.37. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$14311$auto$fsm_map.cc:238:map_fsm$1903[1]
Extracted 18 gates and 28 wires to a netlist network with 9 inputs and 6 outputs.

3.34.37.1. Executing ABC.

3.34.38. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14588$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 19 gates and 32 wires to a netlist network with 13 inputs and 17 outputs.

3.34.38.1. Executing ABC.

3.34.39. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15298$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 14 gates and 30 wires to a netlist network with 16 inputs and 9 outputs.

3.34.39.1. Executing ABC.

3.34.40. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$15523$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL
Extracted 25 gates and 42 wires to a netlist network with 17 inputs and 12 outputs.

3.34.40.1. Executing ABC.

3.34.41. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14211$auto$opt_dff.cc:219:make_patterns_logic$8473, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 13 gates and 27 wires to a netlist network with 14 inputs and 6 outputs.

3.34.41.1. Executing ABC.

3.34.42. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, asynchronously reset by !\Reset_i_N
Extracted 323 gates and 464 wires to a netlist network with 141 inputs and 68 outputs.

3.34.42.1. Executing ABC.

3.34.43. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14262$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n63$771, asynchronously reset by !\Reset_i_N
Extracted 43 gates and 58 wires to a netlist network with 15 inputs and 7 outputs.

3.34.43.1. Executing ABC.

3.34.44. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14533$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, asynchronously reset by !\Reset_i_N
Extracted 40 gates and 55 wires to a netlist network with 15 inputs and 9 outputs.

3.34.44.1. Executing ABC.

3.34.45. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14192$auto$opt_dff.cc:219:make_patterns_logic$9117, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 19 gates and 36 wires to a netlist network with 17 inputs and 4 outputs.

3.34.45.1. Executing ABC.

3.34.46. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16471$abc$15635$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 17 gates and 32 wires to a netlist network with 15 inputs and 15 outputs.

3.34.46.1. Executing ABC.

3.34.47. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$15768$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
Extracted 45 gates and 58 wires to a netlist network with 13 inputs and 20 outputs.

3.34.47.1. Executing ABC.

3.34.48. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16109$auto$opt_dff.cc:219:make_patterns_logic$10014
Extracted 37 gates and 60 wires to a netlist network with 23 inputs and 19 outputs.

3.34.48.1. Executing ABC.

yosys> abc -dff

3.35. Executing ABC pass (technology mapping using ABC).

3.35.1. Summary of detected clock domains:
  9 cells in clk=\Clock_i, en=$abc$16207$abc$15667$auto$opt_dff.cc:219:make_patterns_logic$1955, arst={ }, srst=$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  3 cells in clk=\Clock_i, en={ }, arst={ }, srst={ }
  16 cells in clk=\Clock_i, en=$abc$16221$abc$15559$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, arst=!\Reset_i_N, srst={ }
  28 cells in clk=\Clock_i, en=$abc$16244$abc$15491$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=$abc$16278$abc$15458$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL, arst={ }, srst={ }
  10 cells in clk=\Clock_i, en=$abc$16343$abc$14253$auto$opt_dff.cc:219:make_patterns_logic$7008, arst=!\Reset_i_N, srst={ }
  8 cells in clk=\Clock_i, en={ }, arst={ }, srst=!\Reset_i_N
  3 cells in clk=\Clock_i, en=$abc$17585$lo19, arst=!\Reset_i_N, srst={ }
  22 cells in clk=\Clock_i, en=$abc$16471$abc$15971$auto$opt_dff.cc:219:make_patterns_logic$12515, arst={ }, srst=$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  69 cells in clk=\Clock_i, en=$abc$16496$abc$15676$auto$opt_dff.cc:194:make_patterns_logic$11227, arst={ }, srst=$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  21 cells in clk=\Clock_i, en=$abc$16590$abc$14796$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, arst=!\Reset_i_N, srst={ }
  22 cells in clk=\Clock_i, en=$abc$16172$abc$14625$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  31 cells in clk=\Clock_i, en=$abc$16625$abc$14833$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  30 cells in clk=\Clock_i, en=$abc$16661$abc$14886$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  87 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  2 cells in clk=\Clock_i, en=$abc$16779$abc$14582$auto$opt_dff.cc:194:make_patterns_logic$1990, arst=!\Reset_i_N, srst={ }
  27 cells in clk=\Clock_i, en=$abc$16784$abc$15883$auto$opt_dff.cc:219:make_patterns_logic$14002, arst={ }, srst=$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  3 cells in clk=\Clock_i, en=!$abc$16900$abc$15786$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, arst={ }, srst=$abc$16353$abc$15768$auto$opt_dff.cc:253:combine_resets$1962
  5 cells in clk=\Clock_i, en=!$abc$16906$abc$15779$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, arst={ }, srst=$abc$16353$abc$15768$auto$opt_dff.cc:253:combine_resets$1968
  27 cells in clk=\Clock_i, en=$abc$16814$abc$15851$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL, arst={ }, srst={ }
  24 cells in clk=\Clock_i, en=$abc$16471$abc$15635$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  19 cells in clk=\Clock_i, en=$abc$18036$abc$14192$auto$opt_dff.cc:219:make_patterns_logic$9117, arst={ }, srst=$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  41 cells in clk=\Clock_i, en=$abc$17988$abc$14533$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, arst=!\Reset_i_N, srst={ }
  30 cells in clk=\Clock_i, en=$abc$16914$abc$14155$auto$opt_dff.cc:219:make_patterns_logic$9364, arst={ }, srst=$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  14 cells in clk=\Clock_i, en=$abc$16949$abc$14229$auto$opt_dff.cc:219:make_patterns_logic$8042, arst={ }, srst=$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  101 cells in clk=\Clock_i, en=$abc$16364$abc$14697$auto$opt_dff.cc:194:make_patterns_logic$2000, arst=!\Reset_i_N, srst={ }
  54 cells in clk=\Clock_i, en=$abc$16981$abc$15912$auto$opt_dff.cc:219:make_patterns_logic$13885, arst={ }, srst=$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  30 cells in clk=\Clock_i, en=$abc$17034$abc$15603$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  28 cells in clk=\Clock_i, en=$abc$16849$abc$15994$auto$opt_dff.cc:219:make_patterns_logic$11390, arst={ }, srst=$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  11 cells in clk=\Clock_i, en=$abc$17079$abc$15578$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, arst=!\Reset_i_N, srst={ }
  102 cells in clk=\Clock_i, en=$abc$17585$lo23, arst=!\Reset_i_N, srst={ }
  41 cells in clk=\Clock_i, en=$abc$17940$abc$14262$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n63$771, arst=!\Reset_i_N, srst={ }
  28 cells in clk=\Clock_i, en=$abc$17289$abc$14659$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  22 cells in clk=\Clock_i, en=$abc$16311$abc$15424$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL, arst={ }, srst={ }
  21 cells in clk=\Clock_i, en=$abc$17330$abc$15270$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  22 cells in clk=\Clock_i, en=$abc$17365$abc$15392$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL, arst={ }, srst={ }
  22 cells in clk=\Clock_i, en=$abc$17397$abc$15360$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=$abc$17429$abc$15321$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL, arst={ }, srst={ }
  17 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$17461$abc$14311$auto$fsm_map.cc:238:map_fsm$1903[1]
  20 cells in clk=\Clock_i, en=$abc$17480$abc$14588$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, arst=!\Reset_i_N, srst={ }
  79 cells in clk=\Clock_i, en=$abc$17104$abc$14445$auto$opt_dff.cc:194:make_patterns_logic$2009, arst=!\Reset_i_N, srst={ }
  15 cells in clk=\Clock_i, en=$abc$17514$abc$15298$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, arst=!\Reset_i_N, srst={ }
  26 cells in clk=\Clock_i, en=$abc$17536$abc$15523$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL, arst={ }, srst={ }
  50 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$18089$abc$15768$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
  13 cells in clk=\Clock_i, en=$abc$17570$abc$14211$auto$opt_dff.cc:219:make_patterns_logic$8473, arst={ }, srst=$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  316 cells in clk=\Clock_i, en={ }, arst=!\Reset_i_N, srst={ }
  37 cells in clk=\Clock_i, en=$abc$18148$abc$16109$auto$opt_dff.cc:219:make_patterns_logic$10014, arst={ }, srst={ }

3.35.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16207$abc$15667$auto$opt_dff.cc:219:make_patterns_logic$1955, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 9 gates and 17 wires to a netlist network with 8 inputs and 7 outputs.

3.35.2.1. Executing ABC.

3.35.3. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i
Extracted 3 gates and 4 wires to a netlist network with 1 inputs and 1 outputs.

3.35.3.1. Executing ABC.

3.35.4. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16221$abc$15559$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 34 wires to a netlist network with 18 inputs and 12 outputs.

3.35.4.1. Executing ABC.

3.35.5. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16244$abc$15491$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL
Extracted 28 gates and 47 wires to a netlist network with 19 inputs and 14 outputs.

3.35.5.1. Executing ABC.

3.35.6. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16278$abc$15458$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL
Extracted 26 gates and 43 wires to a netlist network with 17 inputs and 12 outputs.

3.35.6.1. Executing ABC.

3.35.7. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16343$abc$14253$auto$opt_dff.cc:219:make_patterns_logic$7008, asynchronously reset by !\Reset_i_N
Extracted 10 gates and 20 wires to a netlist network with 10 inputs and 3 outputs.

3.35.7.1. Executing ABC.

3.35.8. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by !\Reset_i_N
Extracted 8 gates and 15 wires to a netlist network with 7 inputs and 6 outputs.

3.35.8.1. Executing ABC.

3.35.9. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17585$lo19, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 5 wires to a netlist network with 2 inputs and 2 outputs.

3.35.9.1. Executing ABC.

3.35.10. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16471$abc$15971$auto$opt_dff.cc:219:make_patterns_logic$12515, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 22 gates and 43 wires to a netlist network with 21 inputs and 11 outputs.

3.35.10.1. Executing ABC.

3.35.11. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16496$abc$15676$auto$opt_dff.cc:194:make_patterns_logic$11227, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 69 gates and 135 wires to a netlist network with 66 inputs and 60 outputs.

3.35.11.1. Executing ABC.

3.35.12. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16590$abc$14796$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 21 gates and 40 wires to a netlist network with 19 inputs and 17 outputs.

3.35.12.1. Executing ABC.

3.35.13. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16172$abc$14625$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 22 gates and 36 wires to a netlist network with 14 inputs and 20 outputs.

3.35.13.1. Executing ABC.

3.35.14. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16625$abc$14833$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 31 gates and 49 wires to a netlist network with 18 inputs and 19 outputs.

3.35.14.1. Executing ABC.

3.35.15. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16661$abc$14886$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 30 gates and 57 wires to a netlist network with 27 inputs and 23 outputs.

3.35.15.1. Executing ABC.

3.35.16. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 87 gates and 173 wires to a netlist network with 86 inputs and 65 outputs.

3.35.16.1. Executing ABC.

3.35.17. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16779$abc$14582$auto$opt_dff.cc:194:make_patterns_logic$1990, asynchronously reset by !\Reset_i_N
Extracted 2 gates and 5 wires to a netlist network with 3 inputs and 2 outputs.

3.35.17.1. Executing ABC.

3.35.18. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16784$abc$15883$auto$opt_dff.cc:219:make_patterns_logic$14002, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 27 gates and 48 wires to a netlist network with 21 inputs and 9 outputs.

3.35.18.1. Executing ABC.

3.35.19. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$16900$abc$15786$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, synchronously reset by $abc$18321$abc$16353$abc$15768$auto$opt_dff.cc:253:combine_resets$1962
Extracted 3 gates and 6 wires to a netlist network with 2 inputs and 3 outputs.

3.35.19.1. Executing ABC.

3.35.20. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$16906$abc$15779$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, synchronously reset by $abc$18321$abc$16353$abc$15768$auto$opt_dff.cc:253:combine_resets$1968
Extracted 5 gates and 10 wires to a netlist network with 4 inputs and 5 outputs.

3.35.20.1. Executing ABC.

3.35.21. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16814$abc$15851$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL
Extracted 27 gates and 46 wires to a netlist network with 19 inputs and 11 outputs.

3.35.21.1. Executing ABC.

3.35.22. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16471$abc$15635$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 24 gates and 46 wires to a netlist network with 22 inputs and 21 outputs.

3.35.22.1. Executing ABC.

3.35.23. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18036$abc$14192$auto$opt_dff.cc:219:make_patterns_logic$9117, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 19 gates and 36 wires to a netlist network with 17 inputs and 4 outputs.

3.35.23.1. Executing ABC.

3.35.24. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17988$abc$14533$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, asynchronously reset by !\Reset_i_N
Extracted 41 gates and 55 wires to a netlist network with 14 inputs and 9 outputs.

3.35.24.1. Executing ABC.

3.35.25. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16914$abc$14155$auto$opt_dff.cc:219:make_patterns_logic$9364, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 30 gates and 54 wires to a netlist network with 24 inputs and 12 outputs.

3.35.25.1. Executing ABC.

3.35.26. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16949$abc$14229$auto$opt_dff.cc:219:make_patterns_logic$8042, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 14 gates and 29 wires to a netlist network with 15 inputs and 10 outputs.

3.35.26.1. Executing ABC.

3.35.27. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16364$abc$14697$auto$opt_dff.cc:194:make_patterns_logic$2000, asynchronously reset by !\Reset_i_N
Extracted 101 gates and 129 wires to a netlist network with 28 inputs and 6 outputs.

3.35.27.1. Executing ABC.

3.35.28. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16981$abc$15912$auto$opt_dff.cc:219:make_patterns_logic$13885, synchronously reset by $abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 54 gates and 86 wires to a netlist network with 32 inputs and 31 outputs.

3.35.28.1. Executing ABC.

3.35.29. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17034$abc$15603$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 30 gates and 57 wires to a netlist network with 27 inputs and 24 outputs.

3.35.29.1. Executing ABC.

3.35.30. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16849$abc$15994$auto$opt_dff.cc:219:make_patterns_logic$11390, synchronously reset by $abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 28 gates and 54 wires to a netlist network with 26 inputs and 22 outputs.

3.35.30.1. Executing ABC.

3.35.31. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18337$abc$17079$abc$15578$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 11 gates and 19 wires to a netlist network with 8 inputs and 10 outputs.

3.35.31.1. Executing ABC.

3.35.32. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17585$lo23, asynchronously reset by !\Reset_i_N
Extracted 102 gates and 195 wires to a netlist network with 93 inputs and 30 outputs.

3.35.32.1. Executing ABC.

3.35.33. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17940$abc$14262$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n63$771, asynchronously reset by !\Reset_i_N
Extracted 41 gates and 56 wires to a netlist network with 15 inputs and 8 outputs.

3.35.33.1. Executing ABC.

3.35.34. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17289$abc$14659$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 28 gates and 51 wires to a netlist network with 23 inputs and 22 outputs.

3.35.34.1. Executing ABC.

3.35.35. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$16311$abc$15424$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL
Extracted 22 gates and 36 wires to a netlist network with 14 inputs and 10 outputs.

3.35.35.1. Executing ABC.

3.35.36. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17330$abc$15270$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 21 gates and 44 wires to a netlist network with 23 inputs and 11 outputs.

3.35.36.1. Executing ABC.

3.35.37. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17365$abc$15392$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL
Extracted 22 gates and 37 wires to a netlist network with 15 inputs and 12 outputs.

3.35.37.1. Executing ABC.

3.35.38. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17397$abc$15360$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL
Extracted 22 gates and 37 wires to a netlist network with 15 inputs and 12 outputs.

3.35.38.1. Executing ABC.

3.35.39. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17429$abc$15321$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL
Extracted 26 gates and 44 wires to a netlist network with 18 inputs and 11 outputs.

3.35.39.1. Executing ABC.

3.35.40. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$17461$abc$14311$auto$fsm_map.cc:238:map_fsm$1903[1]
Extracted 17 gates and 27 wires to a netlist network with 9 inputs and 6 outputs.

3.35.40.1. Executing ABC.

3.35.41. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17480$abc$14588$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 20 gates and 35 wires to a netlist network with 15 inputs and 17 outputs.

3.35.41.1. Executing ABC.

3.35.42. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17104$abc$14445$auto$opt_dff.cc:194:make_patterns_logic$2009, asynchronously reset by !\Reset_i_N
Extracted 79 gates and 110 wires to a netlist network with 31 inputs and 35 outputs.

3.35.42.1. Executing ABC.

3.35.43. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17514$abc$15298$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 15 gates and 29 wires to a netlist network with 14 inputs and 9 outputs.

3.35.43.1. Executing ABC.

3.35.44. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17536$abc$15523$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL
Extracted 26 gates and 43 wires to a netlist network with 17 inputs and 13 outputs.

3.35.44.1. Executing ABC.

3.35.45. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$18089$abc$15768$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
Extracted 50 gates and 65 wires to a netlist network with 15 inputs and 27 outputs.

3.35.45.1. Executing ABC.

3.35.46. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$17570$abc$14211$auto$opt_dff.cc:219:make_patterns_logic$8473, synchronously reset by $abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 13 gates and 27 wires to a netlist network with 14 inputs and 6 outputs.

3.35.46.1. Executing ABC.

3.35.47. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, asynchronously reset by !\Reset_i_N
Extracted 316 gates and 448 wires to a netlist network with 132 inputs and 73 outputs.

3.35.47.1. Executing ABC.

3.35.48. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18148$abc$16109$auto$opt_dff.cc:219:make_patterns_logic$10014
Extracted 37 gates and 60 wires to a netlist network with 23 inputs and 19 outputs.

3.35.48.1. Executing ABC.

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  14 cells in clk=\Clock_i, en=$abc$19812$abc$17570$abc$14211$auto$opt_dff.cc:219:make_patterns_logic$8473, arst={ }, srst=$abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  8 cells in clk=\Clock_i, en=$abc$18202$abc$16207$abc$15667$auto$opt_dff.cc:219:make_patterns_logic$1955, arst={ }, srst=$abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  3 cells in clk=\Clock_i, en={ }, arst={ }, srst={ }
  20 cells in clk=\Clock_i, en=$abc$18217$abc$16221$abc$15559$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, arst=!\Reset_i_N, srst={ }
  30 cells in clk=\Clock_i, en=$abc$18241$abc$16244$abc$15491$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL, arst={ }, srst={ }
  10 cells in clk=\Clock_i, en=$abc$18311$abc$16343$abc$14253$auto$opt_dff.cc:219:make_patterns_logic$7008, arst=!\Reset_i_N, srst={ }
  9 cells in clk=\Clock_i, en={ }, arst={ }, srst=!\Reset_i_N
  3 cells in clk=\Clock_i, en=$abc$19827$lo28, arst=!\Reset_i_N, srst={ }
  24 cells in clk=\Clock_i, en=$abc$18337$abc$16471$abc$15971$auto$opt_dff.cc:219:make_patterns_logic$12515, arst={ }, srst=$abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  79 cells in clk=\Clock_i, en=$abc$18361$abc$16496$abc$15676$auto$opt_dff.cc:194:make_patterns_logic$11227, arst={ }, srst=$abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  28 cells in clk=\Clock_i, en=$abc$18277$abc$16278$abc$15458$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL, arst={ }, srst={ }
  19 cells in clk=\Clock_i, en=$abc$18470$abc$16172$abc$14625$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  21 cells in clk=\Clock_i, en=$abc$18435$abc$16590$abc$14796$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, arst=!\Reset_i_N, srst={ }
  33 cells in clk=\Clock_i, en=$abc$18504$abc$16625$abc$14833$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  27 cells in clk=\Clock_i, en=$abc$18540$abc$16661$abc$14886$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  69 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  2 cells in clk=\Clock_i, en=$abc$18677$abc$16779$abc$14582$auto$opt_dff.cc:194:make_patterns_logic$1990, arst=!\Reset_i_N, srst={ }
  31 cells in clk=\Clock_i, en=$abc$18682$abc$16784$abc$15883$auto$opt_dff.cc:219:make_patterns_logic$14002, arst={ }, srst=$abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  3 cells in clk=\Clock_i, en=!$abc$18711$abc$16900$abc$15786$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, arst={ }, srst=$abc$18321$abc$16353$abc$15768$auto$opt_dff.cc:253:combine_resets$1962
  6 cells in clk=\Clock_i, en=!$abc$18717$abc$16906$abc$15779$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, arst={ }, srst=$abc$18321$abc$16353$abc$15768$auto$opt_dff.cc:253:combine_resets$1968
  26 cells in clk=\Clock_i, en=$abc$18725$abc$16814$abc$15851$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL, arst={ }, srst={ }
  22 cells in clk=\Clock_i, en=$abc$18797$abc$18036$abc$14192$auto$opt_dff.cc:219:make_patterns_logic$9117, arst={ }, srst=$abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  34 cells in clk=\Clock_i, en=$abc$18863$abc$16914$abc$14155$auto$opt_dff.cc:219:make_patterns_logic$9364, arst={ }, srst=$abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  20 cells in clk=\Clock_i, en=$abc$18897$abc$16949$abc$14229$auto$opt_dff.cc:219:make_patterns_logic$8042, arst={ }, srst=$abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  54 cells in clk=\Clock_i, en=$abc$19029$abc$16981$abc$15912$auto$opt_dff.cc:219:make_patterns_logic$13885, arst={ }, srst=$abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  25 cells in clk=\Clock_i, en=$abc$19088$abc$17034$abc$15603$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  32 cells in clk=\Clock_i, en=$abc$19132$abc$16849$abc$15994$auto$opt_dff.cc:219:make_patterns_logic$11390, arst={ }, srst=$abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  16 cells in clk=\Clock_i, en=$abc$18337$abc$17079$abc$15578$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, arst=!\Reset_i_N, srst={ }
  102 cells in clk=\Clock_i, en=$abc$19827$lo31, arst=!\Reset_i_N, srst={ }
  42 cells in clk=\Clock_i, en=$abc$19301$abc$17940$abc$14262$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n63$771, arst=!\Reset_i_N, srst={ }
  26 cells in clk=\Clock_i, en=$abc$19348$abc$17289$abc$14659$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  25 cells in clk=\Clock_i, en=$abc$19388$abc$16311$abc$15424$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL, arst={ }, srst={ }
  16 cells in clk=\Clock_i, en=$abc$19419$abc$17330$abc$15270$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  22 cells in clk=\Clock_i, en=$abc$19454$abc$17365$abc$15392$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL, arst={ }, srst={ }
  24 cells in clk=\Clock_i, en=$abc$18758$abc$16471$abc$15635$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  23 cells in clk=\Clock_i, en=$abc$19486$abc$17397$abc$15360$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL, arst={ }, srst={ }
  17 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$19549$abc$17461$abc$14311$auto$fsm_map.cc:238:map_fsm$1903[1]
  22 cells in clk=\Clock_i, en=$abc$19568$abc$17480$abc$14588$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, arst=!\Reset_i_N, srst={ }
  43 cells in clk=\Clock_i, en=$abc$18817$abc$17988$abc$14533$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, arst=!\Reset_i_N, srst={ }
  24 cells in clk=\Clock_i, en=$abc$19518$abc$17429$abc$15321$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL, arst={ }, srst={ }
  16 cells in clk=\Clock_i, en=$abc$19689$abc$17514$abc$15298$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, arst=!\Reset_i_N, srst={ }
  70 cells in clk=\Clock_i, en=$abc$19602$abc$17104$abc$14445$auto$opt_dff.cc:194:make_patterns_logic$2009, arst=!\Reset_i_N, srst={ }
  98 cells in clk=\Clock_i, en=$abc$18928$abc$16364$abc$14697$auto$opt_dff.cc:194:make_patterns_logic$2000, arst=!\Reset_i_N, srst={ }
  25 cells in clk=\Clock_i, en=$abc$19711$abc$17536$abc$15523$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL, arst={ }, srst={ }
  46 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$19746$abc$18089$abc$15768$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
  323 cells in clk=\Clock_i, en={ }, arst=!\Reset_i_N, srst={ }
  37 cells in clk=\Clock_i, en=$abc$20186$abc$18148$abc$16109$auto$opt_dff.cc:219:make_patterns_logic$10014, arst={ }, srst={ }

3.36.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19812$abc$17570$abc$14211$auto$opt_dff.cc:219:make_patterns_logic$8473, synchronously reset by $abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 14 gates and 30 wires to a netlist network with 16 inputs and 6 outputs.

3.36.2.1. Executing ABC.

3.36.3. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18202$abc$16207$abc$15667$auto$opt_dff.cc:219:make_patterns_logic$1955, synchronously reset by $abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 8 gates and 15 wires to a netlist network with 7 inputs and 6 outputs.

3.36.3.1. Executing ABC.

3.36.4. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i
Extracted 3 gates and 4 wires to a netlist network with 1 inputs and 1 outputs.

3.36.4.1. Executing ABC.

3.36.5. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18217$abc$16221$abc$15559$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 20 gates and 39 wires to a netlist network with 19 inputs and 14 outputs.

3.36.5.1. Executing ABC.

3.36.6. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18241$abc$16244$abc$15491$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL
Extracted 30 gates and 51 wires to a netlist network with 21 inputs and 12 outputs.

3.36.6.1. Executing ABC.

3.36.7. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18311$abc$16343$abc$14253$auto$opt_dff.cc:219:make_patterns_logic$7008, asynchronously reset by !\Reset_i_N
Extracted 10 gates and 19 wires to a netlist network with 9 inputs and 4 outputs.

3.36.7.1. Executing ABC.

3.36.8. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by !\Reset_i_N
Extracted 9 gates and 16 wires to a netlist network with 7 inputs and 6 outputs.

3.36.8.1. Executing ABC.

3.36.9. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19827$lo28, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 5 wires to a netlist network with 2 inputs and 2 outputs.

3.36.9.1. Executing ABC.

3.36.10. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18337$abc$16471$abc$15971$auto$opt_dff.cc:219:make_patterns_logic$12515, synchronously reset by $abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 24 gates and 44 wires to a netlist network with 20 inputs and 14 outputs.

3.36.10.1. Executing ABC.

3.36.11. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18361$abc$16496$abc$15676$auto$opt_dff.cc:194:make_patterns_logic$11227, synchronously reset by $abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 79 gates and 143 wires to a netlist network with 64 inputs and 68 outputs.

3.36.11.1. Executing ABC.

3.36.12. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18277$abc$16278$abc$15458$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL
Extracted 28 gates and 47 wires to a netlist network with 19 inputs and 13 outputs.

3.36.12.1. Executing ABC.

3.36.13. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18470$abc$16172$abc$14625$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 19 gates and 30 wires to a netlist network with 11 inputs and 17 outputs.

3.36.13.1. Executing ABC.

3.36.14. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18435$abc$16590$abc$14796$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 21 gates and 40 wires to a netlist network with 19 inputs and 15 outputs.

3.36.14.1. Executing ABC.

3.36.15. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18504$abc$16625$abc$14833$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 33 gates and 53 wires to a netlist network with 20 inputs and 19 outputs.

3.36.15.1. Executing ABC.

3.36.16. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18540$abc$16661$abc$14886$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 27 gates and 51 wires to a netlist network with 24 inputs and 21 outputs.

3.36.16.1. Executing ABC.

3.36.17. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 69 gates and 129 wires to a netlist network with 60 inputs and 53 outputs.

3.36.17.1. Executing ABC.

3.36.18. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18677$abc$16779$abc$14582$auto$opt_dff.cc:194:make_patterns_logic$1990, asynchronously reset by !\Reset_i_N
Extracted 2 gates and 5 wires to a netlist network with 3 inputs and 2 outputs.

3.36.18.1. Executing ABC.

3.36.19. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18682$abc$16784$abc$15883$auto$opt_dff.cc:219:make_patterns_logic$14002, synchronously reset by $abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 31 gates and 56 wires to a netlist network with 25 inputs and 8 outputs.

3.36.19.1. Executing ABC.

3.36.20. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$18711$abc$16900$abc$15786$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, synchronously reset by $abc$20341$abc$18321$abc$16353$abc$15768$auto$opt_dff.cc:253:combine_resets$1962
Extracted 3 gates and 6 wires to a netlist network with 2 inputs and 3 outputs.

3.36.20.1. Executing ABC.

3.36.21. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$18717$abc$16906$abc$15779$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, synchronously reset by $abc$20341$abc$18321$abc$16353$abc$15768$auto$opt_dff.cc:253:combine_resets$1968
Extracted 6 gates and 12 wires to a netlist network with 5 inputs and 5 outputs.

3.36.21.1. Executing ABC.

3.36.22. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18725$abc$16814$abc$15851$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL
Extracted 26 gates and 44 wires to a netlist network with 18 inputs and 12 outputs.

3.36.22.1. Executing ABC.

3.36.23. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18797$abc$18036$abc$14192$auto$opt_dff.cc:219:make_patterns_logic$9117, synchronously reset by $abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 22 gates and 43 wires to a netlist network with 21 inputs and 3 outputs.

3.36.23.1. Executing ABC.

3.36.24. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18863$abc$16914$abc$14155$auto$opt_dff.cc:219:make_patterns_logic$9364, synchronously reset by $abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 34 gates and 60 wires to a netlist network with 26 inputs and 12 outputs.

3.36.24.1. Executing ABC.

3.36.25. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18897$abc$16949$abc$14229$auto$opt_dff.cc:219:make_patterns_logic$8042, synchronously reset by $abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 20 gates and 36 wires to a netlist network with 16 inputs and 5 outputs.

3.36.25.1. Executing ABC.

3.36.26. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19029$abc$16981$abc$15912$auto$opt_dff.cc:219:make_patterns_logic$13885, synchronously reset by $abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 54 gates and 87 wires to a netlist network with 33 inputs and 30 outputs.

3.36.26.1. Executing ABC.

3.36.27. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19088$abc$17034$abc$15603$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 25 gates and 47 wires to a netlist network with 22 inputs and 22 outputs.

3.36.27.1. Executing ABC.

3.36.28. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19132$abc$16849$abc$15994$auto$opt_dff.cc:219:make_patterns_logic$11390, synchronously reset by $abc$20888$abc$19029$abc$16849$abc$14155$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 32 gates and 61 wires to a netlist network with 29 inputs and 26 outputs.

3.36.28.1. Executing ABC.

3.36.29. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18337$abc$17079$abc$15578$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 30 wires to a netlist network with 14 inputs and 12 outputs.

3.36.29.1. Executing ABC.

3.36.30. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19827$lo31, asynchronously reset by !\Reset_i_N
Extracted 102 gates and 195 wires to a netlist network with 93 inputs and 30 outputs.

3.36.30.1. Executing ABC.

3.36.31. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19301$abc$17940$abc$14262$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n63$771, asynchronously reset by !\Reset_i_N
Extracted 42 gates and 57 wires to a netlist network with 15 inputs and 7 outputs.

3.36.31.1. Executing ABC.

3.36.32. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19348$abc$17289$abc$14659$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 26 gates and 47 wires to a netlist network with 21 inputs and 21 outputs.

3.36.32.1. Executing ABC.

3.36.33. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19388$abc$16311$abc$15424$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL
Extracted 25 gates and 43 wires to a netlist network with 18 inputs and 13 outputs.

3.36.33.1. Executing ABC.

3.36.34. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$20357$abc$19419$abc$17330$abc$15270$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 33 wires to a netlist network with 17 inputs and 8 outputs.

3.36.34.1. Executing ABC.

3.36.35. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19454$abc$17365$abc$15392$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL
Extracted 22 gates and 37 wires to a netlist network with 15 inputs and 12 outputs.

3.36.35.1. Executing ABC.

3.36.36. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18758$abc$16471$abc$15635$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 24 gates and 46 wires to a netlist network with 22 inputs and 22 outputs.

3.36.36.1. Executing ABC.

3.36.37. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19486$abc$17397$abc$15360$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL
Extracted 23 gates and 38 wires to a netlist network with 15 inputs and 11 outputs.

3.36.37.1. Executing ABC.

3.36.38. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$19549$abc$17461$abc$14311$auto$fsm_map.cc:238:map_fsm$1903[1]
Extracted 17 gates and 27 wires to a netlist network with 9 inputs and 6 outputs.

3.36.38.1. Executing ABC.

3.36.39. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19568$abc$17480$abc$14588$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 22 gates and 37 wires to a netlist network with 15 inputs and 18 outputs.

3.36.39.1. Executing ABC.

3.36.40. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18817$abc$17988$abc$14533$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, asynchronously reset by !\Reset_i_N
Extracted 43 gates and 57 wires to a netlist network with 14 inputs and 5 outputs.

3.36.40.1. Executing ABC.

3.36.41. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19518$abc$17429$abc$15321$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL
Extracted 24 gates and 40 wires to a netlist network with 16 inputs and 11 outputs.

3.36.41.1. Executing ABC.

3.36.42. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19689$abc$17514$abc$15298$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 30 wires to a netlist network with 14 inputs and 10 outputs.

3.36.42.1. Executing ABC.

3.36.43. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19602$abc$17104$abc$14445$auto$opt_dff.cc:194:make_patterns_logic$2009, asynchronously reset by !\Reset_i_N
Extracted 70 gates and 92 wires to a netlist network with 22 inputs and 29 outputs.

3.36.43.1. Executing ABC.

3.36.44. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$18928$abc$16364$abc$14697$auto$opt_dff.cc:194:make_patterns_logic$2000, asynchronously reset by !\Reset_i_N
Extracted 98 gates and 125 wires to a netlist network with 27 inputs and 4 outputs.

3.36.44.1. Executing ABC.

3.36.45. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$19711$abc$17536$abc$15523$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL
Extracted 25 gates and 42 wires to a netlist network with 17 inputs and 12 outputs.

3.36.45.1. Executing ABC.

3.36.46. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$20341$abc$19746$abc$18089$abc$15768$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
Extracted 46 gates and 63 wires to a netlist network with 17 inputs and 23 outputs.

3.36.46.1. Executing ABC.

3.36.47. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, asynchronously reset by !\Reset_i_N
Extracted 323 gates and 465 wires to a netlist network with 142 inputs and 73 outputs.

3.36.47.1. Executing ABC.

3.36.48. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$20186$abc$18148$abc$16109$auto$opt_dff.cc:219:make_patterns_logic$10014
Extracted 37 gates and 60 wires to a netlist network with 23 inputs and 19 outputs.

3.36.48.1. Executing ABC.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 3 inverters.

yosys> opt -sat

3.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~28 debug messages>

yosys> opt_merge -nomux

3.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~144 debug messages>
Removed a total of 48 cells.

yosys> opt_muxtree

3.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 2 unused cells and 11535 unused wires.
<suppressed ~117 debug messages>

yosys> opt_expr

3.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.38.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_TaCBcZ/abc_tmp_1.scr

3.39. Executing ABC pass (technology mapping using ABC).

3.39.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 1288 gates and 1617 wires to a netlist network with 329 inputs and 223 outputs.

3.39.1.1. Executing ABC.
DE:   #PIs = 329  #Luts =   430  Max Lvl =   8  Avg Lvl =   2.50  [   0.18 sec. at Pass 0]
DE:   #PIs = 329  #Luts =   390  Max Lvl =   6  Avg Lvl =   2.38  [   2.76 sec. at Pass 1]
DE:   #PIs = 329  #Luts =   381  Max Lvl =   8  Avg Lvl =   2.49  [   0.86 sec. at Pass 2]
DE:   #PIs = 329  #Luts =   372  Max Lvl =   6  Avg Lvl =   2.32  [   1.08 sec. at Pass 3]
DE:   #PIs = 329  #Luts =   367  Max Lvl =   7  Avg Lvl =   2.38  [   0.93 sec. at Pass 4]
DE:   #PIs = 329  #Luts =   364  Max Lvl =   7  Avg Lvl =   2.32  [   1.41 sec. at Pass 5]
DE:   #PIs = 329  #Luts =   362  Max Lvl =   6  Avg Lvl =   2.32  [   0.85 sec. at Pass 6]
DE:   #PIs = 329  #Luts =   362  Max Lvl =   6  Avg Lvl =   2.32  [   2.88 sec. at Pass 7]
DE:   #PIs = 329  #Luts =   359  Max Lvl =   8  Avg Lvl =   2.34  [   1.24 sec. at Pass 8]
DE:   #PIs = 329  #Luts =   359  Max Lvl =   7  Avg Lvl =   2.29  [   3.03 sec. at Pass 9]
DE:   #PIs = 329  #Luts =   358  Max Lvl =   7  Avg Lvl =   2.37  [   1.33 sec. at Pass 10]
DE:   #PIs = 329  #Luts =   358  Max Lvl =   7  Avg Lvl =   2.37  [   2.27 sec. at Pass 11]
DE:   #PIs = 329  #Luts =   357  Max Lvl =   7  Avg Lvl =   2.32  [   1.21 sec. at Pass 12]
DE:   #PIs = 329  #Luts =   357  Max Lvl =   7  Avg Lvl =   2.32  [   1.97 sec. at Pass 13]
DE:   #PIs = 329  #Luts =   356  Max Lvl =   7  Avg Lvl =   2.28  [   0.96 sec. at Pass 14]
DE:   #PIs = 329  #Luts =   355  Max Lvl =   6  Avg Lvl =   2.27  [   2.26 sec. at Pass 15]
DE:   #PIs = 329  #Luts =   354  Max Lvl =   7  Avg Lvl =   2.35  [   0.95 sec. at Pass 16]
DE:   #PIs = 329  #Luts =   354  Max Lvl =   7  Avg Lvl =   2.35  [   1.89 sec. at Pass 17]
DE:   #PIs = 329  #Luts =   354  Max Lvl =   7  Avg Lvl =   2.35  [   0.96 sec. at Pass 18]
DE:   #PIs = 329  #Luts =   352  Max Lvl =   6  Avg Lvl =   2.26  [   1.67 sec. at Pass 19]
DE:   #PIs = 329  #Luts =   352  Max Lvl =   6  Avg Lvl =   2.26  [   1.17 sec. at Pass 20]
DE:   #PIs = 329  #Luts =   352  Max Lvl =   6  Avg Lvl =   2.26  [   2.83 sec. at Pass 21]
DE:   #PIs = 329  #Luts =   351  Max Lvl =   7  Avg Lvl =   2.24  [   1.62 sec. at Pass 22]
DE:   #PIs = 329  #Luts =   351  Max Lvl =   6  Avg Lvl =   2.20  [   2.03 sec. at Pass 23]
DE:   #PIs = 329  #Luts =   350  Max Lvl =   8  Avg Lvl =   2.26  [   1.23 sec. at Pass 24]
DE:   #PIs = 329  #Luts =   350  Max Lvl =   7  Avg Lvl =   2.22  [   1.48 sec. at Pass 25]
DE:   #PIs = 329  #Luts =   349  Max Lvl =   7  Avg Lvl =   2.16  [   1.07 sec. at Pass 26]
DE:   #PIs = 329  #Luts =   349  Max Lvl =   7  Avg Lvl =   2.16  [   1.62 sec. at Pass 27]
DE:   #PIs = 329  #Luts =   349  Max Lvl =   7  Avg Lvl =   2.16  [   0.68 sec. at Pass 28]
DE:   #PIs = 329  #Luts =   349  Max Lvl =   7  Avg Lvl =   2.16  [   1.54 sec. at Pass 29]
DE:   #PIs = 329  #Luts =   349  Max Lvl =   6  Avg Lvl =   2.17  [  11.90 sec. at Pass 30]
DE:   #PIs = 329  #Luts =   346  Max Lvl =   7  Avg Lvl =   2.19  [   1.40 sec. at Pass 31]
DE:   #PIs = 329  #Luts =   346  Max Lvl =   7  Avg Lvl =   2.19  [   2.15 sec. at Pass 32]
DE:   #PIs = 329  #Luts =   346  Max Lvl =   7  Avg Lvl =   2.19  [   1.36 sec. at Pass 33]
DE:   #PIs = 329  #Luts =   346  Max Lvl =   7  Avg Lvl =   2.19  [   2.06 sec. at Pass 34]
DE:   #PIs = 329  #Luts =   346  Max Lvl =   7  Avg Lvl =   2.19  [  14.44 sec. at Pass 35]
DE:   #PIs = 329  #Luts =   346  Max Lvl =   7  Avg Lvl =   2.19  [   0.51 sec. at Pass 36]

yosys> opt

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 9 unused cells and 1550 unused wires.
<suppressed ~38 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 7 inverters.

yosys> stat

3.42. Printing statistics.

=== top ===

   Number of wires:                775
   Number of wire bits:           1295
   Number of public wires:         200
   Number of public wire bits:     720
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                675
     $_DFFE_PN0P_                  137
     $_DFFE_PN1P_                    8
     $_DFFE_PP_                     72
     $_DFF_PN0_                     51
     $_DFF_PN1_                      1
     $_DFF_P_                        1
     $_SDFFE_PP0N_                   2
     $_SDFFE_PP0P_                  35
     $_SDFF_PN0_                    19
     $_SDFF_PP0_                     4
     $lut                          345


yosys> shregmap -minlen 8 -maxlen 20

3.43. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.45. Printing statistics.

=== top ===

   Number of wires:                872
   Number of wire bits:           1392
   Number of public wires:         200
   Number of public wire bits:     720
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                772
     $_DFFE_PN0P_                  137
     $_DFFE_PN1P_                    8
     $_DFFE_PP0P_                   72
     $_DFF_PN0_                     51
     $_DFF_PN1_                      1
     $_DFF_P_                       61
     $_MUX_                         97
     $lut                          345


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.46. Executing TECHMAP pass (map to technology primitives).

3.46.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.46.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.46.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_DFFE_PN1P_ for cells of type $_DFFE_PN1P_.
Using template \$_DFF_PN1_ for cells of type $_DFF_PN1_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~883 debug messages>

yosys> opt_expr -mux_undef

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~9338 debug messages>

yosys> simplemap

3.48. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.50. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~1740 debug messages>
Removed a total of 580 cells.

yosys> opt_dff -nodffe -nosdff

3.51. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 7 unused cells and 2237 unused wires.
<suppressed ~8 debug messages>

yosys> opt -nodffe -nosdff

3.53. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.53.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~157 debug messages>

yosys> opt_merge -nomux

3.53.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.53.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.53.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 47 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.53.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.53.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.53.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.53.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.53.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.53.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_TaCBcZ/abc_tmp_2.scr

3.54. Executing ABC pass (technology mapping using ABC).

3.54.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 1568 gates and 1899 wires to a netlist network with 329 inputs and 219 outputs.

3.54.1.1. Executing ABC.
DE:   #PIs = 329  #Luts =   377  Max Lvl =   7  Avg Lvl =   2.56  [   0.23 sec. at Pass 0]
DE:   #PIs = 329  #Luts =   372  Max Lvl =   7  Avg Lvl =   2.55  [   5.27 sec. at Pass 1]
DE:   #PIs = 329  #Luts =   368  Max Lvl =   8  Avg Lvl =   2.65  [   1.22 sec. at Pass 2]
DE:   #PIs = 329  #Luts =   368  Max Lvl =   8  Avg Lvl =   2.65  [   2.87 sec. at Pass 3]
DE:   #PIs = 329  #Luts =   368  Max Lvl =   8  Avg Lvl =   2.65  [   1.49 sec. at Pass 4]
DE:   #PIs = 329  #Luts =   368  Max Lvl =   8  Avg Lvl =   2.65  [   2.54 sec. at Pass 5]
DE:   #PIs = 329  #Luts =   367  Max Lvl =   6  Avg Lvl =   2.39  [  11.27 sec. at Pass 6]
DE:   #PIs = 329  #Luts =   365  Max Lvl =   7  Avg Lvl =   2.55  [   1.78 sec. at Pass 7]
DE:   #PIs = 329  #Luts =   365  Max Lvl =   7  Avg Lvl =   2.55  [   2.56 sec. at Pass 8]
DE:   #PIs = 329  #Luts =   365  Max Lvl =   7  Avg Lvl =   2.55  [   1.38 sec. at Pass 9]
DE:   #PIs = 329  #Luts =   365  Max Lvl =   7  Avg Lvl =   2.55  [   1.81 sec. at Pass 10]
DE:   #PIs = 329  #Luts =   364  Max Lvl =   6  Avg Lvl =   2.47  [  10.32 sec. at Pass 11]
DE:   #PIs = 329  #Luts =   364  Max Lvl =   6  Avg Lvl =   2.47  [   1.10 sec. at Pass 12]
DE:   #PIs = 329  #Luts =   364  Max Lvl =   6  Avg Lvl =   2.47  [   2.62 sec. at Pass 13]
DE:   #PIs = 329  #Luts =   364  Max Lvl =   6  Avg Lvl =   2.47  [   0.99 sec. at Pass 14]
DE:   #PIs = 329  #Luts =   362  Max Lvl =   6  Avg Lvl =   2.46  [  10.90 sec. at Pass 15]
DE:   #PIs = 329  #Luts =   362  Max Lvl =   6  Avg Lvl =   2.46  [   3.23 sec. at Pass 16]
DE:   #PIs = 329  #Luts =   362  Max Lvl =   6  Avg Lvl =   2.46  [   1.45 sec. at Pass 17]
DE:   #PIs = 329  #Luts =   362  Max Lvl =   6  Avg Lvl =   2.46  [   2.80 sec. at Pass 18]
DE:   #PIs = 329  #Luts =   362  Max Lvl =   6  Avg Lvl =   2.46  [   9.44 sec. at Pass 19]
DE:   #PIs = 329  #Luts =   361  Max Lvl =   6  Avg Lvl =   2.44  [   0.20 sec. at Pass 20]

yosys> opt

3.55. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.55.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.55.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.55.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.55.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1607 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.55.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.55.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.55.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.55.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.55.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.55.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.56. Executing HIERARCHY pass (managing design hierarchy).

3.56.1. Analyzing design hierarchy..
Top module:  \top

3.56.2. Analyzing design hierarchy..
Top module:  \top
Removed 0 unused modules.

yosys> stat

3.57. Printing statistics.

=== top ===

   Number of wires:                792
   Number of wire bits:           1305
   Number of public wires:         198
   Number of public wire bits:     711
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                691
     $lut                          361
     dffsre                        330


yosys> opt_clean -purge

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 147 unused wires.
<suppressed ~147 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.59. Executing Verilog backend.

yosys> bmuxmap

3.59.1. Executing BMUXMAP pass.

yosys> demuxmap

3.59.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\top'.

Warnings: 9 unique messages, 9 total
End of script. Logfile hash: 55c6fb93ef, CPU: user 14.35s system 0.81s, MEM: 44.19 MB peak
Yosys 0.16+65 (git sha1 7987105a9, gcc 9.1.0 -fPIC -Os)
Time spent: 98% 6x abc (1083 sec), 0% 45x opt_expr (3 sec), ...
real 233.65
user 1027.38
sys 68.10
