
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.49
 Yosys 0.18+10 (git sha1 7a7a25778, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k IR_Emitter_Carrier_Generator.v IR_Emitter_Interface.v IR_Emitter_Modulator.v IR_Emitter_Registers.v IR_Remote.v i2cSlave.v i2cSlaveSerialInterface.v i2cSlaveTop.v r1024x9_1024x9.v

yosys> verific -vlog2k IR_Emitter_Carrier_Generator.v IR_Emitter_Interface.v IR_Emitter_Modulator.v IR_Emitter_Registers.v IR_Remote.v i2cSlave.v i2cSlaveSerialInterface.v i2cSlaveTop.v r1024x9_1024x9.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Emitter_Carrier_Generator.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Emitter_Interface.v'
VERIFIC-INFO [VERI-2561] IR_Emitter_Interface.v:263: undeclared symbol 'IR_Emitter_MemRd_Stb', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Emitter_Modulator.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Emitter_Registers.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Remote.v'
VERIFIC-WARNING [VERI-1407] IR_Remote.v:125: attribute target identifier 'hierarchy' not found in this scope
VERIFIC-WARNING [VERI-1407] IR_Remote.v:124: attribute target identifier 'ql_pack' not found in this scope
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'i2cSlave.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'i2cSlaveSerialInterface.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'i2cSlaveTop.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'r1024x9_1024x9.v'

yosys> synth_rs -top top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.58

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top top

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] IR_Remote.v:29: compiling module 'top'
VERIFIC-INFO [VERI-1018] i2cSlaveTop.v:47: compiling module 'i2cSlaveTop(I2C_ADDRESS=7'b0101010)'
VERIFIC-INFO [VERI-1018] i2cSlave.v:48: compiling module 'i2cSlave(I2C_ADDRESS=7'b0101010)'
VERIFIC-INFO [VERI-1018] i2cSlaveSerialInterface.v:58: compiling module 'i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010)'
VERIFIC-INFO [VERI-1018] IR_Emitter_Interface.v:29: compiling module 'IR_Emitter_Interface'
VERIFIC-INFO [VERI-1018] IR_Emitter_Carrier_Generator.v:32: compiling module 'IR_Emitter_Carrier_Generator'
VERIFIC-WARNING [VERI-1209] IR_Emitter_Carrier_Generator.v:236: expression size 32 truncated to fit in target size 8
VERIFIC-WARNING [VERI-1209] IR_Emitter_Carrier_Generator.v:264: expression size 32 truncated to fit in target size 8
VERIFIC-WARNING [VERI-1209] IR_Emitter_Carrier_Generator.v:438: expression size 32 truncated to fit in target size 8
VERIFIC-WARNING [VERI-1209] IR_Emitter_Carrier_Generator.v:466: expression size 32 truncated to fit in target size 8
VERIFIC-INFO [VERI-1018] IR_Emitter_Modulator.v:32: compiling module 'IR_Emitter_Modulator'
VERIFIC-WARNING [VERI-1209] IR_Emitter_Modulator.v:478: expression size 14 truncated to fit in target size 13
VERIFIC-WARNING [VERI-1209] IR_Emitter_Modulator.v:508: expression size 32 truncated to fit in target size 16
VERIFIC-INFO [VERI-1018] IR_Emitter_Registers.v:31: compiling module 'IR_Emitter_Registers'
VERIFIC-INFO [VERI-1018] r1024x9_1024x9.v:17: compiling module 'r1024x9_1024x9'
VERIFIC-WARNING [VERI-1209] r1024x9_1024x9.v:40: expression size 22 truncated to fit in target size 9
Importing module top.
Importing module IR_Emitter_Interface.
Importing module IR_Emitter_Carrier_Generator.
Importing module IR_Emitter_Modulator.
Importing module IR_Emitter_Registers.
Importing module i2cSlaveTop(I2C_ADDRESS=7'b0101010).
Importing module i2cSlave(I2C_ADDRESS=7'b0101010).
Importing module i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010).
Importing module r1024x9_1024x9.

3.3.1. Analyzing design hierarchy..
Top module:  \top
Used module:     \IR_Emitter_Interface
Used module:         \r1024x9_1024x9
Used module:         \IR_Emitter_Registers
Used module:         \IR_Emitter_Modulator
Used module:         \IR_Emitter_Carrier_Generator
Used module:     \i2cSlaveTop(I2C_ADDRESS=7'b0101010)
Used module:         \i2cSlave(I2C_ADDRESS=7'b0101010)
Used module:             \i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010)

3.3.2. Analyzing design hierarchy..
Top module:  \top
Used module:     \IR_Emitter_Interface
Used module:         \r1024x9_1024x9
Used module:         \IR_Emitter_Registers
Used module:         \IR_Emitter_Modulator
Used module:         \IR_Emitter_Carrier_Generator
Used module:     \i2cSlaveTop(I2C_ADDRESS=7'b0101010)
Used module:         \i2cSlave(I2C_ADDRESS=7'b0101010)
Used module:             \i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010)
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module r1024x9_1024x9.
Optimizing module i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010).
<suppressed ~20 debug messages>
Optimizing module i2cSlave(I2C_ADDRESS=7'b0101010).
<suppressed ~3 debug messages>
Optimizing module i2cSlaveTop(I2C_ADDRESS=7'b0101010).
Optimizing module IR_Emitter_Registers.
<suppressed ~7 debug messages>
Optimizing module IR_Emitter_Modulator.
<suppressed ~8 debug messages>
Optimizing module IR_Emitter_Carrier_Generator.
<suppressed ~11 debug messages>
Optimizing module IR_Emitter_Interface.
<suppressed ~3 debug messages>
Optimizing module top.

yosys> bmuxmap

3.5. Executing BMUXMAP pass.

yosys> demuxmap

3.6. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.7. Executing FLATTEN pass (flatten design).
Deleting now unused module IR_Emitter_Carrier_Generator.
Deleting now unused module IR_Emitter_Interface.
Deleting now unused module IR_Emitter_Modulator.
Deleting now unused module IR_Emitter_Registers.
Deleting now unused module i2cSlave(I2C_ADDRESS=7'b0101010).
Deleting now unused module i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010).
Deleting now unused module i2cSlaveTop(I2C_ADDRESS=7'b0101010).
Deleting now unused module r1024x9_1024x9.
<suppressed ~15 debug messages>

yosys> bmuxmap

3.8. Executing BMUXMAP pass.

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).
Demoting inout port top.CpuScl to input.
Demoting inout port top.CpuSda to output.
Demoting inout port top.IR_Emitter_Gpio_Port_io to output.

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~108 debug messages>

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1092 unused wires.
<suppressed ~181 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module top...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.15. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.15.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~57 debug messages>

yosys> opt_merge -nomux

3.15.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.15.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
      Replacing known input bits on port B of cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$mux_96$i2cSlaveSerialInterface.v:323$1760: \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.CurrState_SISt -> 4'0111
      Replacing known input bits on port B of cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$auto$bmuxmap.cc:60:execute$2086: \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.streamSt -> 2'11
      Replacing known input bits on port B of cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$auto$bmuxmap.cc:60:execute$2085: \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.streamSt -> 2'01
      Replacing known input bits on port A of cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$mux_123$i2cSlaveSerialInterface.v:348$1776: \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.streamSt -> 2'00
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~102 debug messages>

yosys> opt_reduce

3.15.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$Select_125$IR_Emitter_Carrier_Generator.v:383$955: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n318$807 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n326$812 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$select_122$IR_Emitter_Carrier_Generator.v:383$952: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n319$808 $auto$opt_reduce.cc:134:opt_pmux$2224 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$select_140$IR_Emitter_Carrier_Generator.v:409$962: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n203$787 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n347$816 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$Select_153$IR_Emitter_Modulator.v:442$1140: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n296$1022 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n298$1024 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$select_143$IR_Emitter_Modulator.v:442$1136: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n296$1022 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n298$1024 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$select_80$IR_Emitter_Registers.v:312$1323: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n207$1210 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n208$1211 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n209$1212 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n6$1184 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n9$1186 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n12$1188 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n15$1190 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n18$1192 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n21$1194 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n24$1196 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n27$1198 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n30$1200 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n33$1202 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n36$1204 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n39$1206 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n42$1208 }
    New ctrl vector for $pmux cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$Select_235$i2cSlaveSerialInterface.v:474$1852: { $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n956$1585 $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n957$1586 }
    New ctrl vector for $pmux cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$select_79$i2cSlaveSerialInterface.v:309$1757: { $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n323$1564 $auto$opt_reduce.cc:134:opt_pmux$2226 }
    New ctrl vector for $pmux cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$select_81$i2cSlaveSerialInterface.v:309$1758: $auto$opt_reduce.cc:134:opt_pmux$2228
    New ctrl vector for $pmux cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$select_94$i2cSlaveSerialInterface.v:322$1759: $auto$opt_reduce.cc:134:opt_pmux$2230
  Optimizing cells in module \top.
Performed a total of 11 changes.

yosys> opt_merge

3.15.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~48 debug messages>
Removed a total of 16 cells.

yosys> opt_dff -nodffe -nosdff

3.15.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$txData_reg$i2cSlaveSerialInterface.v:449$1839 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$streamSt_reg$i2cSlaveSerialInterface.v:449$1838 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$rxData_reg$i2cSlaveSerialInterface.v:449$1840 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$regAddr_reg$i2cSlaveSerialInterface.v:449$1842 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$dataOut_reg$i2cSlaveSerialInterface.v:449$1836 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$bitCnt_reg$i2cSlaveSerialInterface.v:449$1841 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$CurrState_SISt_reg$i2cSlaveSerialInterface.v:424$1815 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$startStopDetState_reg$i2cSlave.v:245$1508 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaPipe_reg$i2cSlave.v:191$1482 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaDelayed_reg$i2cSlave.v:214$1491 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclPipe_reg$i2cSlave.v:191$1484 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclDelayed_reg$i2cSlave.v:214$1490 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$rstPipe_reg$i2cSlave.v:158$1464 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.$verific$RegAddr_i_1ff_reg$IR_Emitter_Interface.v:324$186 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$RegData_o_reg$IR_Emitter_Registers.v:408$1365 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$RegAddr_i_1ff_reg$IR_Emitter_Registers.v:408$1364 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_LED_Gpio_o_reg$IR_Emitter_Registers.v:408$1374 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_LED_Gpio_Polarity_o_reg$IR_Emitter_Registers.v:408$1373 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Run_Modulator_o_reg$IR_Emitter_Registers.v:408$1366 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Mode_Modulator_o_reg$IR_Emitter_Registers.v:408$1367 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Stop_o_reg$IR_Emitter_Registers.v:408$1371 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Start_o_reg$IR_Emitter_Registers.v:408$1370 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemAddr_Reg_o_reg$IR_Emitter_Registers.v:408$1372 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Interrupt_reg$IR_Emitter_Registers.v:408$1378 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Interrupt_Enable_reg$IR_Emitter_Registers.v:408$1379 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Gpio_Port_o_reg$IR_Emitter_Registers.v:408$1375 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Gpio_Dir_o_reg$IR_Emitter_Registers.v:408$1376 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Duty_Len_o_reg$IR_Emitter_Registers.v:408$1369 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Cycle_Len_o_reg$IR_Emitter_Registers.v:408$1368 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Busy_Modulator_i_1ff_reg$IR_Emitter_Registers.v:408$1377 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_LED_En_o_reg$IR_Emitter_Modulator.v:260$1113 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_tc_reg$IR_Emitter_Modulator.v:260$1109 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_reg$IR_Emitter_Modulator.v:260$1106 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_ld_upr_reg$IR_Emitter_Modulator.v:260$1108 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_ld_lwr_reg$IR_Emitter_Modulator.v:260$1107 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_Signal_reg$IR_Emitter_Modulator.v:260$1112 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Modulator_State_reg$IR_Emitter_Modulator.v:260$1114 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemData_lwr_reg$IR_Emitter_Modulator.v:260$1110 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_tc_upr_reg$IR_Emitter_Modulator.v:260$1105 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_tc_lwr_reg$IR_Emitter_Modulator.v:260$1104 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_reg$IR_Emitter_Modulator.v:260$1101 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_ld_reg$IR_Emitter_Modulator.v:260$1103 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_ce_reg$IR_Emitter_Modulator.v:260$1102 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Carrier_Enable_o_reg$IR_Emitter_Modulator.v:260$1099 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Busy_Modulator_o_reg$IR_Emitter_Modulator.v:260$1100 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.$verific$RegRd_En_i_1ff_reg$IR_Emitter_Interface.v:324$185 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Signal_o_reg$IR_Emitter_Carrier_Generator.v:216$910 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_ld_tc_reg$IR_Emitter_Carrier_Generator.v:216$908 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$907 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_cntr_ld_reg$IR_Emitter_Carrier_Generator.v:216$906 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_State_reg$IR_Emitter_Carrier_Generator.v:216$909 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_1_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$905 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_1_cntr_reg$IR_Emitter_Carrier_Generator.v:216$904 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_0_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$903 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_0_cntr_reg$IR_Emitter_Carrier_Generator.v:216$902 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_Enable_o_reg$IR_Emitter_Carrier_Generator.v:216$901 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_1_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$900 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_1_cntr_reg$IR_Emitter_Carrier_Generator.v:216$899 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_0_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$898 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_0_cntr_reg$IR_Emitter_Carrier_Generator.v:216$897 ($aldff) from module top.

yosys> opt_clean

3.15.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 9 unused cells and 21 unused wires.
<suppressed ~10 debug messages>

yosys> opt_expr

3.15.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~1 debug messages>

3.15.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.15.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~103 debug messages>

yosys> opt_reduce

3.15.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.15.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.15.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.15.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.15.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.15.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.15.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~103 debug messages>

yosys> opt_reduce

3.15.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.15.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.15.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.15.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.15.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.15.23. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.16. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.16.1. Executing FSM_DETECT pass (finding FSMs in design).
Not marking top.u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Duty_State as FSM state register:
    Users of register don't seem to benefit from recoding.
Not marking top.u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Modulator_State as FSM state register:
    Users of register don't seem to benefit from recoding.
Found FSM state register top.u_i2cSlaveTop.u_i2cSlave.startStopDetState.
Not marking top.u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.streamSt as FSM state register:
    Users of register don't seem to benefit from recoding.

yosys> fsm_extract

3.16.2. Executing FSM_EXTRACT pass (extracting FSM from design).
Extracting FSM `\u_i2cSlaveTop.u_i2cSlave.startStopDetState' from module `\top'.
  found $dff cell for state register: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$startStopDetState_reg$i2cSlave.v:245$1508
  root of input selection tree: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n176$1457
  found reset state: 2'00 (guessed from mux tree)
  found ctrl input: \u_i2cSlaveTop.u_i2cSlave.rstPipe [1]
  found ctrl input: \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet
  found ctrl input: \u_i2cSlaveTop.u_i2cSlave.sclDeb
  found ctrl input: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n154$1431
  found ctrl input: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n160$1432
  found state code: 2'01
  found state code: 2'10
  found state code: 2'00
  found ctrl output: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n291$1559
  found ctrl output: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n323$1564
  found ctrl output: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n324$1565
  ctrl inputs: { \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n154$1431 $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n160$1432 \u_i2cSlaveTop.u_i2cSlave.rstPipe [1] \u_i2cSlaveTop.u_i2cSlave.sclDeb }
  ctrl outputs: { $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n324$1565 $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n323$1564 $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n291$1559 $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n176$1457 }
  transition:       2'00 5'0--00 ->       2'00 5'01000
  transition:       2'00 5'00001 ->       2'00 5'01000
  transition:       2'00 5'00101 ->       2'01 5'01001
  transition:       2'00 5'01-01 ->       2'10 5'01010
  transition:       2'00 5'1--0- ->       2'00 5'01000
  transition:       2'00 5'---1- ->       2'00 5'01000
  transition:       2'10 5'0--00 ->       2'10 5'00110
  transition:       2'10 5'00001 ->       2'10 5'00110
  transition:       2'10 5'00101 ->       2'01 5'00101
  transition:       2'10 5'01-01 ->       2'10 5'00110
  transition:       2'10 5'1--0- ->       2'00 5'00100
  transition:       2'10 5'---1- ->       2'00 5'00100
  transition:       2'01 5'0--00 ->       2'01 5'10001
  transition:       2'01 5'00001 ->       2'01 5'10001
  transition:       2'01 5'00101 ->       2'01 5'10001
  transition:       2'01 5'01-01 ->       2'10 5'10010
  transition:       2'01 5'1--0- ->       2'00 5'10000
  transition:       2'01 5'---1- ->       2'00 5'10000

yosys> fsm_opt

3.16.3. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$2231' from module `\top'.
  Merging pattern 5'00001 and 5'00101 from group (2 2 5'10001).
  Merging pattern 5'00101 and 5'00001 from group (2 2 5'10001).

yosys> opt_clean

3.16.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 9 unused cells and 10 unused wires.
<suppressed ~11 debug messages>

yosys> fsm_opt

3.16.5. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$2231' from module `\top'.
  Removing unused output signal $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n176$1457 [0].
  Removing unused output signal $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n176$1457 [1].

yosys> fsm_recode -encoding binary

3.16.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).
Recoding FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$2231' from module `\top' using `auto' encoding:
  mapping auto encoding to `binary` for this FSM.
  existing encoding is already a packed binary encoding.

yosys> fsm_info

3.16.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$2231' from module `top':
-------------------------------------

  Information on FSM $fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$2231 (\u_i2cSlaveTop.u_i2cSlave.startStopDetState):

  Number of input signals:    5
  Number of output signals:   3
  Number of state bits:       2

  Input signals:
    0: \u_i2cSlaveTop.u_i2cSlave.sclDeb
    1: \u_i2cSlaveTop.u_i2cSlave.rstPipe [1]
    2: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n160$1432
    3: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n154$1431
    4: \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet

  Output signals:
    0: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n291$1559
    1: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n323$1564
    2: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n324$1565

  State encoding:
    0:       2'00  <RESET STATE>
    1:       2'10
    2:       2'01

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 5'0--00   ->     0 3'010
      1:     0 5'00001   ->     0 3'010
      2:     0 5'1--0-   ->     0 3'010
      3:     0 5'---1-   ->     0 3'010
      4:     0 5'01-01   ->     1 3'010
      5:     0 5'00101   ->     2 3'010
      6:     1 5'1--0-   ->     0 3'001
      7:     1 5'---1-   ->     0 3'001
      8:     1 5'0--00   ->     1 3'001
      9:     1 5'00001   ->     1 3'001
     10:     1 5'01-01   ->     1 3'001
     11:     1 5'00101   ->     2 3'001
     12:     2 5'1--0-   ->     0 3'100
     13:     2 5'---1-   ->     0 3'100
     14:     2 5'01-01   ->     1 3'100
     15:     2 5'0--00   ->     2 3'100
     16:     2 5'00-01   ->     2 3'100

-------------------------------------

yosys> fsm_map

3.16.8. Executing FSM_MAP pass (mapping FSMs to basic logic).
Mapping FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$2231' from module `\top'.

yosys> opt -sat

3.17. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.17.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~5 debug messages>

yosys> opt_merge -nomux

3.17.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~9 debug messages>
Removed a total of 3 cells.

yosys> opt_muxtree

3.17.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~103 debug messages>

yosys> opt_reduce

3.17.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.17.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.17.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$writeEn_reg$i2cSlaveSerialInterface.v:449$1835 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_writeEn, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.writeEn, rval = 1'0).
Adding EN signal on $auto$ff.cc:262:slice$2279 ($sdff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_writeEn, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.writeEn).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$txData_reg$i2cSlaveSerialInterface.v:449$1839 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_txData, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.txData, rval = 8'00000000).
Adding EN signal on $auto$ff.cc:262:slice$2299 ($sdff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$auto$bmuxmap.cc:58:execute$1893 [7:0], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.txData).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$streamSt_reg$i2cSlaveSerialInterface.v:449$1838 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_streamSt, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.streamSt, rval = 2'00).
Adding EN signal on $auto$ff.cc:262:slice$2313 ($sdff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_streamSt, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.streamSt).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$sdaOut_reg$i2cSlaveSerialInterface.v:449$1834 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_sdaOut, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.sdaOut, rval = 1'1).
Adding EN signal on $auto$ff.cc:262:slice$2339 ($sdff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_sdaOut, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.sdaOut).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$rxData_reg$i2cSlaveSerialInterface.v:449$1840 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData, rval = 8'00000000).
Adding EN signal on $auto$ff.cc:262:slice$2363 ($sdff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData).
Adding EN signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$regAddr_reg$i2cSlaveSerialInterface.v:449$1842 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_regAddr, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$dataOut_reg$i2cSlaveSerialInterface.v:449$1836 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_dataOut, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, rval = 8'00000000).
Adding EN signal on $auto$ff.cc:262:slice$2416 ($sdff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_dataOut, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$clearStartStopDet_reg$i2cSlaveSerialInterface.v:449$1837 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_clearStartStopDet, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet, rval = 1'0).
Adding EN signal on $auto$ff.cc:262:slice$2438 ($sdff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_clearStartStopDet, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$bitCnt_reg$i2cSlaveSerialInterface.v:449$1841 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_bitCnt, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.bitCnt, rval = 3'000).
Adding EN signal on $auto$ff.cc:262:slice$2456 ($sdff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_bitCnt, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.bitCnt).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$I2CReadDataLatchedOut_reg$i2cSlaveSerialInterface.v:476$1854 ($dff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n959$1588, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.I2CReadDataLatchedOut, rval = 1'0).
Adding EN signal on $auto$ff.cc:262:slice$2480 ($sdff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n959$1588, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.I2CReadDataLatchedOut).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$CurrState_SISt_reg$i2cSlaveSerialInterface.v:424$1815 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.NextState_SISt, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.CurrState_SISt, rval = 4'0000).
Adding EN signal on $auto$ff.cc:262:slice$2488 ($sdff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.NextState_SISt, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.CurrState_SISt).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$startEdgeDet_reg$i2cSlave.v:245$1509 ($dff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n146$1429, Q = \u_i2cSlaveTop.u_i2cSlave.startEdgeDet, rval = 1'0).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaPipe_reg$i2cSlave.v:191$1482 ($dff) from module top (D = { \u_i2cSlaveTop.u_i2cSlave.sdaPipe [3:0] \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.sdaOut }, Q = \u_i2cSlaveTop.u_i2cSlave.sdaPipe, rval = 5'11111).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaDelayed_reg$i2cSlave.v:214$1491 ($dff) from module top (D = { \u_i2cSlaveTop.u_i2cSlave.sdaDelayed [0] \u_i2cSlaveTop.u_i2cSlave.sdaDeb }, Q = \u_i2cSlaveTop.u_i2cSlave.sdaDelayed, rval = 2'11).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaDeb_reg$i2cSlave.v:191$1483 ($dff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n65$1422, Q = \u_i2cSlaveTop.u_i2cSlave.sdaDeb, rval = 1'1).
Adding EN signal on $auto$ff.cc:262:slice$2513 ($sdff) from module top (D = 1'0, Q = \u_i2cSlaveTop.u_i2cSlave.sdaDeb).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclPipe_reg$i2cSlave.v:191$1484 ($dff) from module top (D = { \u_i2cSlaveTop.u_i2cSlave.sclPipe [3:0] \CpuScl }, Q = \u_i2cSlaveTop.u_i2cSlave.sclPipe, rval = 5'11111).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclDelayed_reg$i2cSlave.v:214$1490 ($dff) from module top (D = { \u_i2cSlaveTop.u_i2cSlave.sclDelayed [3:0] \u_i2cSlaveTop.u_i2cSlave.sclDeb }, Q = \u_i2cSlaveTop.u_i2cSlave.sclDelayed, rval = 5'11111).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclDeb_reg$i2cSlave.v:191$1485 ($dff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n57$1418, Q = \u_i2cSlaveTop.u_i2cSlave.sclDeb, rval = 1'1).
Adding EN signal on $auto$ff.cc:262:slice$2519 ($sdff) from module top (D = 1'0, Q = \u_i2cSlaveTop.u_i2cSlave.sclDeb).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$rstPipe_reg$i2cSlave.v:158$1464 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.rstPipe [0], Q = \u_i2cSlaveTop.u_i2cSlave.rstPipe [1], rval = 1'1).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_LED_Gpio_o_reg$IR_Emitter_Registers.v:408$1374 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [2], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_LED_Gpio_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_LED_Gpio_Polarity_o_reg$IR_Emitter_Registers.v:408$1373 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [3], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_LED_Gpio_Polarity_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Mode_Modulator_o_reg$IR_Emitter_Registers.v:408$1367 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [1:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Mode_Modulator_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Stop_o_reg$IR_Emitter_Registers.v:408$1371 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_o [7:0]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Stop_o_reg$IR_Emitter_Registers.v:408$1371 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [4:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_o [12:8]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Start_o_reg$IR_Emitter_Registers.v:408$1370 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_o [7:0]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Start_o_reg$IR_Emitter_Registers.v:408$1370 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [4:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_o [12:8]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemAddr_Reg_o_reg$IR_Emitter_Registers.v:408$1372 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [5:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Interrupt_reg$IR_Emitter_Registers.v:408$1378 ($adff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n386$1229, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Interrupt).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Interrupt_Enable_reg$IR_Emitter_Registers.v:408$1379 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [5], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Interrupt_Enable).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Gpio_Port_o_reg$IR_Emitter_Registers.v:408$1375 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Gpio_Dir_o_reg$IR_Emitter_Registers.v:408$1376 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Duty_Len_o_reg$IR_Emitter_Registers.v:408$1369 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_o [7:0]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Duty_Len_o_reg$IR_Emitter_Registers.v:408$1369 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_o [15:8]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Cycle_Len_o_reg$IR_Emitter_Registers.v:408$1368 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_o [7:0]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Cycle_Len_o_reg$IR_Emitter_Registers.v:408$1368 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_o [15:8]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_tc_reg$IR_Emitter_Modulator.v:260$1109 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_tc_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_tc).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_reg$IR_Emitter_Modulator.v:260$1106 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_Signal_reg$IR_Emitter_Modulator.v:260$1112 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_Signal_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_Signal).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemData_lwr_reg$IR_Emitter_Modulator.v:260$1110 ($adff) from module top (D = \u_IR_Emitter_Interface.IR_Emitter_MemData_o, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemData_lwr).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_tc_upr_reg$IR_Emitter_Modulator.v:260$1105 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_tc_lwr, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_tc_upr).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_tc_lwr_reg$IR_Emitter_Modulator.v:260$1104 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_tc_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_tc_lwr).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_reg$IR_Emitter_Modulator.v:260$1101 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_1_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$905 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Duty_1_cntr_tc_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Duty_1_cntr_tc).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_1_cntr_reg$IR_Emitter_Carrier_Generator.v:216$904 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Duty_1_cntr_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Duty_1_cntr).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_1_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$900 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Cycle_1_cntr_tc_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Cycle_1_cntr_tc).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_1_cntr_reg$IR_Emitter_Carrier_Generator.v:216$899 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Cycle_1_cntr_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Cycle_1_cntr).

yosys> opt_clean

3.17.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 58 unused cells and 65 unused wires.
<suppressed ~60 debug messages>

yosys> opt_expr

3.17.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~8 debug messages>

3.17.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.17.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~71 debug messages>

yosys> opt_reduce

3.17.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.17.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~129 debug messages>
Removed a total of 43 cells.

yosys> opt_dff -sat

3.17.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.17.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 46 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.17.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.17.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.17.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~71 debug messages>

yosys> opt_reduce

3.17.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.17.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.17.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.17.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.17.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.17.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.18. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 6) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2286 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$fsm_map.cc:215:map_fsm$2241 ($eq).
Removed top 1 bits (of 2) from mux cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$mux_11$i2cSlave.v:156$1463 ($mux).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_25$i2cSlaveSerialInterface.v:245$1721 ($add).
Removed top 2 bits (of 3) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_48$i2cSlaveSerialInterface.v:280$1737 ($add).
Removed top 1 bits (of 7) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$equal_115$i2cSlaveSerialInterface.v:342$1772 ($eq).
Removed top 1 bits (of 2) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$equal_22$i2cSlaveSerialInterface.v:241$1719 ($eq).
Removed top 1 bits (of 4) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$equal_232$i2cSlaveSerialInterface.v:462$1847 ($eq).
Removed top 1 bits (of 4) from mux cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$mux_138$i2cSlaveSerialInterface.v:366$1786 ($mux).
Removed top 1 bits (of 4) from mux cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$mux_50$i2cSlaveSerialInterface.v:282$1739 ($mux).
Removed top 4 bits (of 5) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$2261 ($eq).
Removed top 1 bits (of 4) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$2265 ($eq).
Removed top 1 bits (of 6) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2316 ($ne).
Removed top 1 bits (of 5) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2320 ($ne).
Removed top 1 bits (of 6) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2322 ($ne).
Removed top 3 bits (of 4) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2328 ($ne).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2330 ($ne).
Removed top 2 bits (of 5) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2342 ($ne).
Removed top 1 bits (of 4) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2348 ($ne).
Removed top 2 bits (of 4) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2354 ($ne).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2358 ($ne).
Removed top 3 bits (of 5) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2372 ($ne).
Removed top 1 bits (of 4) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2376 ($ne).
Removed top 3 bits (of 5) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2395 ($ne).
Removed top 1 bits (of 5) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2401 ($ne).
Removed top 1 bits (of 5) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2441 ($ne).
Removed top 1 bits (of 5) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2463 ($ne).
Removed top 1 bits (of 4) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2471 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2485 ($ne).
Removed top 2 bits (of 5) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2497 ($ne).
Removed top 1 bits (of 5) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2507 ($ne).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2561 ($ne).
Removed top 1 bits (of 9) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911 ($sub).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911 ($sub).
Removed top 1 bits (of 9) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911 ($sub).
Removed top 1 bits (of 9) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981 ($sub).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981 ($sub).
Removed top 1 bits (of 9) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981 ($sub).
Removed top 1 bits (of 9) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968 ($sub).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968 ($sub).
Removed top 1 bits (of 9) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968 ($sub).
Removed top 15 bits (of 16) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_89$IR_Emitter_Carrier_Generator.v:302$937 ($eq).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_77$IR_Emitter_Carrier_Generator.v:272$928 ($eq).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_65$IR_Emitter_Carrier_Generator.v:245$920 ($eq).
Removed top 6 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_62$IR_Emitter_Carrier_Generator.v:243$917 ($eq).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_170$IR_Emitter_Carrier_Generator.v:474$987 ($eq).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_158$IR_Emitter_Carrier_Generator.v:447$977 ($eq).
Removed top 6 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_155$IR_Emitter_Carrier_Generator.v:445$974 ($eq).
Removed top 1 bits (of 2) from mux cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$auto$bmuxmap.cc:60:execute$2212 ($mux).
Removed top 14 bits (of 16) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$equal_196$IR_Emitter_Modulator.v:529$1176 ($eq).
Removed top 15 bits (of 16) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$equal_193$IR_Emitter_Modulator.v:528$1173 ($eq).
Removed top 1 bits (of 2) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$equal_188$IR_Emitter_Modulator.v:507$1166 ($eq).
Removed top 1 bits (of 2) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$equal_176$IR_Emitter_Modulator.v:477$1153 ($eq).
Removed top 12 bits (of 13) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$add_173$IR_Emitter_Modulator.v:478$1152 ($add).
Removed top 2 bits (of 3) from mux cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$auto$bmuxmap.cc:60:execute$2190 ($mux).
Removed top 1 bits (of 3) from mux cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$auto$bmuxmap.cc:60:execute$2180 ($mux).
Removed top 2 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2292 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2296 ($ne).
Removed top 3 bits (of 4) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$2274 ($eq).
Removed top 5 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_8$IR_Emitter_Registers.v:240$1280 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$2272 ($eq).
Removed top 6 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_64$IR_Emitter_Registers.v:285$1318 ($eq).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_63$IR_Emitter_Registers.v:283$1317 ($eq).
Removed top 5 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_5$IR_Emitter_Registers.v:239$1277 ($eq).
Removed top 3 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_41$IR_Emitter_Registers.v:257$1313 ($eq).
Removed top 3 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_38$IR_Emitter_Registers.v:256$1310 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_35$IR_Emitter_Registers.v:254$1307 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_32$IR_Emitter_Registers.v:252$1304 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_29$IR_Emitter_Registers.v:251$1301 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_26$IR_Emitter_Registers.v:249$1298 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_23$IR_Emitter_Registers.v:248$1295 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_20$IR_Emitter_Registers.v:246$1292 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_17$IR_Emitter_Registers.v:245$1289 ($eq).
Removed top 5 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_14$IR_Emitter_Registers.v:243$1286 ($eq).
Removed top 5 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_11$IR_Emitter_Registers.v:242$1283 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$2304 ($ne).
Removed top 2 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_45$IR_Emitter_Interface.v:280$155 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_48$IR_Emitter_Interface.v:281$156 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_51$IR_Emitter_Interface.v:282$157 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_69$IR_Emitter_Interface.v:294$164 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_72$IR_Emitter_Interface.v:295$165 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_75$IR_Emitter_Interface.v:296$166 ($eq).
Removed top 1 bits (of 9) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924 ($sub).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924 ($sub).
Removed top 1 bits (of 9) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924 ($sub).
Removed top 1 bits (of 17) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164 ($sub).
Removed top 16 bits (of 17) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164 ($sub).
Removed top 1 bits (of 17) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164 ($sub).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 2) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$auto$bmuxmap.cc:58:execute$2211.
Removed top 1 bits (of 9) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n175$843.
Removed top 1 bits (of 9) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n223$846.
Removed top 1 bits (of 9) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n364$862.
Removed top 1 bits (of 9) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n412$865.
Removed top 1 bits (of 4) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$auto$bmuxmap.cc:58:execute$2099.
Removed top 1 bits (of 4) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$auto$bmuxmap.cc:58:execute$2109.
Removed top 2 bits (of 4) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$auto$bmuxmap.cc:58:execute$2119.
Removed top 1 bits (of 4) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$auto$bmuxmap.cc:58:execute$2129.
Removed top 3 bits (of 4) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$auto$bmuxmap.cc:58:execute$2139.
Removed top 1 bits (of 4) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$auto$bmuxmap.cc:58:execute$2149.
Removed top 3 bits (of 12) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$auto$bmuxmap.cc:58:execute$2179.
Removed top 2 bits (of 3) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$auto$bmuxmap.cc:58:execute$2189.
Removed top 1 bits (of 17) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n432$1070.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$n37$1865.
Removed top 1 bits (of 2) from wire top.$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n16$1437.
Removed top 1 bits (of 2) from wire top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$auto$bmuxmap.cc:58:execute$2074.
Removed top 2 bits (of 4) from wire top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$auto$bmuxmap.cc:58:execute$2084.
Removed top 1 bits (of 4) from wire top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n247$1624.
Removed top 1 bits (of 4) from wire top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n559$1665.

yosys> peepopt

3.19. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.20. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 32 unused wires.
<suppressed ~1 debug messages>

yosys> bmuxmap

3.21. Executing BMUXMAP pass.

yosys> demuxmap

3.22. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.23. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module top:
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968 ($sub).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981 ($sub).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911 ($sub).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924 ($sub).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$add_173$IR_Emitter_Modulator.v:478$1152 ($add).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164 ($sub).
  creating $macc model for $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_25$i2cSlaveSerialInterface.v:245$1721 ($add).
  creating $macc model for $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_48$i2cSlaveSerialInterface.v:280$1737 ($add).
  creating $alu model for $macc $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_48$i2cSlaveSerialInterface.v:280$1737.
  creating $alu model for $macc $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_25$i2cSlaveSerialInterface.v:245$1721.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$add_173$IR_Emitter_Modulator.v:478$1152.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968.
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968: $auto$alumacc.cc:485:replace_alu$2601
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981: $auto$alumacc.cc:485:replace_alu$2604
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911: $auto$alumacc.cc:485:replace_alu$2607
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924: $auto$alumacc.cc:485:replace_alu$2610
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$add_173$IR_Emitter_Modulator.v:478$1152: $auto$alumacc.cc:485:replace_alu$2613
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164: $auto$alumacc.cc:485:replace_alu$2616
  creating $alu cell for $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_25$i2cSlaveSerialInterface.v:245$1721: $auto$alumacc.cc:485:replace_alu$2619
  creating $alu cell for $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_48$i2cSlaveSerialInterface.v:280$1737: $auto$alumacc.cc:485:replace_alu$2622
  created 8 $alu and 0 $macc cells.

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.25. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.26. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~71 debug messages>

yosys> opt_reduce

3.27. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.28. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_share

3.29. Executing OPT_SHARE pass.

yosys> opt_dff

3.30. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 2 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.32. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_muxtree

3.33. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~73 debug messages>

yosys> opt_reduce

3.34. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.35. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.36. Executing OPT_SHARE pass.

yosys> opt_dff

3.37. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.39. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 2

yosys> stat

3.40. Printing statistics.

=== top ===

   Number of wires:                708
   Number of wire bits:           2980
   Number of public wires:         342
   Number of public wire bits:    1376
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                575
     $adff                          24
     $adffe                         27
     $alu                            8
     $and                           44
     $dff                            2
     $dffe                           9
     $eq                            64
     $logic_not                     14
     $mux                          232
     $ne                            49
     $not                           19
     $or                            11
     $pmux                          16
     $reduce_and                    14
     $reduce_bool                    2
     $reduce_or                     14
     $sdff                           6
     $sdffe                         12
     $xor                            8


yosys> memory -nomap

3.41. Executing MEMORY pass.

yosys> opt_mem

3.41.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.41.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.41.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.41.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.41.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.41.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_share

3.41.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.41.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.41.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_collect

3.41.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.42. Printing statistics.

=== top ===

   Number of wires:                708
   Number of wire bits:           2980
   Number of public wires:         342
   Number of public wire bits:    1376
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                575
     $adff                          24
     $adffe                         27
     $alu                            8
     $and                           44
     $dff                            2
     $dffe                           9
     $eq                            64
     $logic_not                     14
     $mux                          232
     $ne                            49
     $not                           19
     $or                            11
     $pmux                          16
     $reduce_and                    14
     $reduce_bool                    2
     $reduce_or                     14
     $sdff                           6
     $sdffe                         12
     $xor                            8


yosys> muxpack

3.43. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~197 debug messages>

yosys> opt_clean

3.44. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> pmuxtree

3.45. Executing PMUXTREE pass.

yosys> muxpack

3.46. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting top.$auto$pmuxtree.cc:65:recursive_mux_generator$2775 ... top.$auto$pmuxtree.cc:65:recursive_mux_generator$2777 to a pmux with 2 cases.
Converting top.$auto$pmuxtree.cc:65:recursive_mux_generator$2653 ... top.$auto$pmuxtree.cc:65:recursive_mux_generator$2655 to a pmux with 2 cases.
Converted 4 (p)mux cells into 2 pmux cells.
<suppressed ~238 debug messages>

yosys> memory_map

3.47. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.48. Printing statistics.

=== top ===

   Number of wires:                799
   Number of wire bits:           3334
   Number of public wires:         342
   Number of public wire bits:    1376
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                648
     $adff                          24
     $adffe                         27
     $alu                            8
     $and                           44
     $dff                            2
     $dffe                           9
     $eq                            64
     $logic_not                     14
     $mux                          277
     $ne                            49
     $not                           35
     $or                            18
     $pmux                           2
     $reduce_and                    14
     $reduce_bool                    2
     $reduce_or                     33
     $sdff                           6
     $sdffe                         12
     $xor                            8


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.49. Executing TECHMAP pass (map to technology primitives).

3.49.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.49.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.49.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $and.
Using template $paramod$fc16b9f758000d363d24f130038bd99b46b4fa1b\_90_pmux for cells of type $pmux.
Using template $paramod$403a3c2fa431a154c52a6a5429d7a6260b5d144f\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $sdff.
Using extmapper simplemap for cells of type $sdffe.
Using extmapper simplemap for cells of type $reduce_and.
Using template $paramod$3ef7d3dd227da7627a99c5e5a6a4deb817573e39\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $reduce_bool.
Using template $paramod$521ce43182eecb9f60c72393a788160d2c356bf5\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $adff.
Using template $paramod$a1665ef28c749ebcdbe9aecd466e644647b56463\_90_alu for cells of type $alu.
Using template $paramod$215440792383f7884e57d9c95f84e9552d0bf4ac\_90_alu for cells of type $alu.
Using template $paramod$c3cd1564c35d873179656addd6052d7ea8b6d991\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001000 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000011 for cells of type $lcu.
No more expansions possible.
<suppressed ~2042 debug messages>

yosys> stat

3.50. Printing statistics.

=== top ===

   Number of wires:               1806
   Number of wire bits:          15016
   Number of public wires:         342
   Number of public wire bits:    1376
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3649
     $_AND_                        388
     $_DFFE_PN0P_                  136
     $_DFFE_PN1P_                    9
     $_DFFE_PP_                     80
     $_DFF_PN0_                     61
     $_DFF_P_                        3
     $_MUX_                       1211
     $_NOT_                        185
     $_OR_                         732
     $_SDFFE_PP0P_                  36
     $_SDFFE_PP1N_                   2
     $_SDFFE_PP1P_                   1
     $_SDFF_PN1_                     1
     $_SDFF_PP0_                     1
     $_SDFF_PP1_                    17
     $_XOR_                        786


yosys> opt_expr

3.51. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~1233 debug messages>

yosys> opt_merge -nomux

3.52. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~1803 debug messages>
Removed a total of 601 cells.

yosys> opt_muxtree

3.53. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.55. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.56. Executing OPT_SHARE pass.

yosys> opt_dff

3.57. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 85 unused cells and 997 unused wires.
<suppressed ~86 debug messages>

yosys> opt_expr

3.59. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_muxtree

3.60. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.61. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.62. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.63. Executing OPT_SHARE pass.

yosys> opt_dff

3.64. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $auto$ff.cc:262:slice$6254 ($_DFF_P_) from module top (D = $auto$fsm_map.cc:238:map_fsm$2242 [2], Q = \u_i2cSlaveTop.u_i2cSlave.startStopDetState [0], rval = 1'0).

yosys> opt_clean

3.65. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 1 unused cells and 0 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.66. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_muxtree

3.67. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.69. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.70. Executing OPT_SHARE pass.

yosys> opt_dff

3.71. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.72. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.73. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 3

yosys> opt -fast -full

3.74. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.74.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~490 debug messages>

yosys> opt_merge

3.74.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~15 debug messages>
Removed a total of 5 cells.

yosys> opt_dff

3.74.3. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$3529 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_bitCnt [2], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.bitCnt [2]).
Adding EN signal on $auto$ff.cc:262:slice$3528 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_bitCnt [1], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.bitCnt [1]).
Adding EN signal on $auto$ff.cc:262:slice$3527 ($_SDFFE_PP0P_) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_bitCnt [0], Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.bitCnt [0]).

yosys> opt_clean

3.74.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 61 unused wires.
<suppressed ~1 debug messages>

3.74.5. Rerunning OPT passes. (Removed registers in this run.)

yosys> opt_expr -full

3.74.6. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~47 debug messages>

yosys> opt_merge

3.74.7. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~57 debug messages>
Removed a total of 19 cells.

yosys> opt_dff

3.74.8. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.74.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 18 unused wires.
<suppressed ~1 debug messages>

3.74.10. Finished fast OPT passes.

yosys> techmap -map +/techmap.v

3.75. Executing TECHMAP pass (map to technology primitives).

3.75.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.75.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt -sat

3.76. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.76.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.76.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.76.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.76.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.76.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.76.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.76.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.76.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.76.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.77. Executing ABC pass (technology mapping using ABC).

3.77.1. Summary of detected clock domains:
  28 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$8253, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  20 cells in clk=\Clock_i, en={ }, arst={ }, srst=$auto$fsm_map.cc:170:map_fsm$2236 [1]
  35 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL, arst={ }, srst={ }
  27 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL, arst={ }, srst={ }
  24 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL, arst={ }, srst={ }
  24 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL, arst={ }, srst={ }
  24 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL, arst={ }, srst={ }
  48 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  48 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  36 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  12 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  3 cells in clk=\Clock_i, en=$auto$opt_dff.cc:194:make_patterns_logic$2542, arst=!\Reset_i_N, srst={ }
  30 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  28 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, arst=!\Reset_i_N, srst={ }
  29 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, arst=!\Reset_i_N, srst={ }
  16 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, arst=!\Reset_i_N, srst={ }
  80 cells in clk=\Clock_i, en=$auto$opt_dff.cc:194:make_patterns_logic$2568, arst=!\Reset_i_N, srst={ }
  4 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_ld_upr, arst=!\Reset_i_N, srst={ }
  105 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_ld_lwr, arst=!\Reset_i_N, srst={ }
  6 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2562, arst=!\Reset_i_N, srst={ }
  165 cells in clk=\Clock_i, en=$auto$opt_dff.cc:194:make_patterns_logic$2552, arst=!\Reset_i_N, srst={ }
  71 cells in clk=\Clock_i, en=$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n63$771, arst=!\Reset_i_N, srst={ }
  73 cells in clk=\Clock_i, en=$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, arst=!\Reset_i_N, srst={ }
  363 cells in clk=\Clock_i, en={ }, arst=!\Reset_i_N, srst={ }
  17 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  16 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  14 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, arst=!\Reset_i_N, srst={ }
  9 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, arst=!\Reset_i_N, srst={ }
  5 cells in clk=\Clock_i, en={ }, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2297, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  23 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2311, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  35 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2337, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  15 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2361, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  71 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2385, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  13 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2436, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  20 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2454, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  9 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2486, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  138 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2508, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  24 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL, arst={ }, srst={ }
  7 cells in clk=\Clock_i, en=!$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, arst={ }, srst=$auto$opt_dff.cc:253:combine_resets$2520
  4 cells in clk=\Clock_i, en={ }, arst={ }, srst=!\Reset_i_N
  3 cells in clk=\Clock_i, en=!$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, arst={ }, srst=$auto$opt_dff.cc:253:combine_resets$2514
  39 cells in clk=\Clock_i, en={ }, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.rstPipe [1]
  40 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2414, arst={ }, srst={ }

3.77.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$8253, synchronously reset by \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 28 gates and 51 wires to a netlist network with 23 inputs and 9 outputs.

3.77.2.1. Executing ABC.

3.77.3. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $auto$fsm_map.cc:170:map_fsm$2236 [1]
Extracted 20 gates and 30 wires to a netlist network with 10 inputs and 5 outputs.

3.77.3.1. Executing ABC.

3.77.4. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL
Extracted 35 gates and 59 wires to a netlist network with 24 inputs and 20 outputs.

3.77.4.1. Executing ABC.

3.77.5. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL
Extracted 26 gates and 42 wires to a netlist network with 16 inputs and 11 outputs.

3.77.5.1. Executing ABC.

3.77.6. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL
Extracted 26 gates and 42 wires to a netlist network with 16 inputs and 11 outputs.

3.77.6.1. Executing ABC.

3.77.7. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL
Extracted 27 gates and 42 wires to a netlist network with 15 inputs and 13 outputs.

3.77.7.1. Executing ABC.

3.77.8. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL
Extracted 24 gates and 38 wires to a netlist network with 14 inputs and 10 outputs.

3.77.8.1. Executing ABC.

3.77.9. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL
Extracted 24 gates and 38 wires to a netlist network with 14 inputs and 10 outputs.

3.77.9.1. Executing ABC.

3.77.10. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL
Extracted 24 gates and 38 wires to a netlist network with 14 inputs and 10 outputs.

3.77.10.1. Executing ABC.

3.77.11. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 48 gates and 82 wires to a netlist network with 33 inputs and 25 outputs.

3.77.11.1. Executing ABC.

3.77.12. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 48 gates and 84 wires to a netlist network with 35 inputs and 23 outputs.

3.77.12.1. Executing ABC.

3.77.13. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 36 gates and 66 wires to a netlist network with 29 inputs and 20 outputs.

3.77.13.1. Executing ABC.

3.77.14. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 12 gates and 24 wires to a netlist network with 12 inputs and 11 outputs.

3.77.14.1. Executing ABC.

3.77.15. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2542, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.77.15.1. Executing ABC.

3.77.16. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 30 gates and 50 wires to a netlist network with 19 inputs and 20 outputs.

3.77.16.1. Executing ABC.

3.77.17. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 28 gates and 50 wires to a netlist network with 21 inputs and 18 outputs.

3.77.17.1. Executing ABC.

3.77.18. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 29 gates and 56 wires to a netlist network with 26 inputs and 19 outputs.

3.77.18.1. Executing ABC.

3.77.19. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 30 wires to a netlist network with 14 inputs and 9 outputs.

3.77.19.1. Executing ABC.

3.77.20. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2568, asynchronously reset by !\Reset_i_N
Extracted 80 gates and 100 wires to a netlist network with 20 inputs and 29 outputs.

3.77.20.1. Executing ABC.

3.77.21. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_ld_upr, asynchronously reset by !\Reset_i_N
Extracted 4 gates and 6 wires to a netlist network with 2 inputs and 3 outputs.

3.77.21.1. Executing ABC.

3.77.22. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_ld_lwr, asynchronously reset by !\Reset_i_N
Extracted 105 gates and 199 wires to a netlist network with 93 inputs and 22 outputs.

3.77.22.1. Executing ABC.

3.77.23. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2562, asynchronously reset by !\Reset_i_N
Extracted 6 gates and 12 wires to a netlist network with 6 inputs and 4 outputs.

3.77.23.1. Executing ABC.

3.77.24. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2552, asynchronously reset by !\Reset_i_N
Extracted 165 gates and 190 wires to a netlist network with 24 inputs and 2 outputs.

3.77.24.1. Executing ABC.

3.77.25. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n63$771, asynchronously reset by !\Reset_i_N
Extracted 71 gates and 85 wires to a netlist network with 13 inputs and 1 outputs.

3.77.25.1. Executing ABC.

3.77.26. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, asynchronously reset by !\Reset_i_N
Extracted 73 gates and 90 wires to a netlist network with 16 inputs and 3 outputs.

3.77.26.1. Executing ABC.

3.77.27. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, asynchronously reset by !\Reset_i_N
Extracted 363 gates and 487 wires to a netlist network with 122 inputs and 80 outputs.

3.77.27.1. Executing ABC.

3.77.28. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 17 gates and 30 wires to a netlist network with 13 inputs and 15 outputs.

3.77.28.1. Executing ABC.

3.77.29. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 28 wires to a netlist network with 12 inputs and 14 outputs.

3.77.29.1. Executing ABC.

3.77.30. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 14 gates and 25 wires to a netlist network with 10 inputs and 12 outputs.

3.77.30.1. Executing ABC.

3.77.31. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 9 gates and 18 wires to a netlist network with 9 inputs and 7 outputs.

3.77.31.1. Executing ABC.

3.77.32. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i
Extracted 5 gates and 8 wires to a netlist network with 3 inputs and 4 outputs.

3.77.32.1. Executing ABC.

3.77.33. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2297, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 26 gates and 47 wires to a netlist network with 21 inputs and 13 outputs.

3.77.33.1. Executing ABC.

3.77.34. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2311, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 23 gates and 40 wires to a netlist network with 15 inputs and 3 outputs.

3.77.34.1. Executing ABC.

3.77.35. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2337, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 35 gates and 54 wires to a netlist network with 18 inputs and 10 outputs.

3.77.35.1. Executing ABC.

3.77.36. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2361, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 15 gates and 33 wires to a netlist network with 17 inputs and 3 outputs.

3.77.36.1. Executing ABC.

3.77.37. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2385, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 71 gates and 105 wires to a netlist network with 34 inputs and 33 outputs.

3.77.37.1. Executing ABC.

3.77.38. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2436, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 13 gates and 27 wires to a netlist network with 14 inputs and 10 outputs.

3.77.38.1. Executing ABC.

3.77.39. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2454, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 20 gates and 35 wires to a netlist network with 15 inputs and 8 outputs.

3.77.39.1. Executing ABC.

3.77.40. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2486, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 9 gates and 17 wires to a netlist network with 7 inputs and 5 outputs.

3.77.40.1. Executing ABC.

3.77.41. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2508, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 138 gates and 193 wires to a netlist network with 53 inputs and 71 outputs.

3.77.41.1. Executing ABC.

3.77.42. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL
Extracted 24 gates and 39 wires to a netlist network with 15 inputs and 11 outputs.

3.77.42.1. Executing ABC.

3.77.43. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, synchronously reset by $auto$opt_dff.cc:253:combine_resets$2520
Extracted 7 gates and 14 wires to a netlist network with 6 inputs and 6 outputs.

3.77.43.1. Executing ABC.

3.77.44. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by !\Reset_i_N
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.77.44.1. Executing ABC.

3.77.45. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, synchronously reset by $abc$10232$auto$opt_dff.cc:253:combine_resets$2514
Extracted 3 gates and 7 wires to a netlist network with 3 inputs and 3 outputs.

3.77.45.1. Executing ABC.

3.77.46. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$10232$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
Extracted 39 gates and 48 wires to a netlist network with 9 inputs and 18 outputs.

3.77.46.1. Executing ABC.

3.77.47. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2414
Extracted 40 gates and 64 wires to a netlist network with 24 inputs and 17 outputs.

3.77.47.1. Executing ABC.

yosys> abc -dff

3.78. Executing ABC pass (technology mapping using ABC).

3.78.1. Summary of detected clock domains:
  19 cells in clk=\Clock_i, en=$abc$8957$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, arst=!\Reset_i_N, srst={ }
  40 cells in clk=\Clock_i, en=$abc$9836$auto$opt_dff.cc:219:make_patterns_logic$2297, arst={ }, srst=$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  5 cells in clk=\Clock_i, en=!$abc$10239$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, arst={ }, srst=$abc$10232$auto$opt_dff.cc:253:combine_resets$2514
  42 cells in clk=\Clock_i, en=$abc$9338$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, arst=!\Reset_i_N, srst={ }
  25 cells in clk=\Clock_i, en=$abc$8764$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  22 cells in clk=\Clock_i, en=$abc$8606$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL, arst={ }, srst={ }
  3 cells in clk=\Clock_i, en=$abc$8845$auto$opt_dff.cc:194:make_patterns_logic$2542, arst=!\Reset_i_N, srst={ }
  17 cells in clk=\Clock_i, en=$abc$9784$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, arst=!\Reset_i_N, srst={ }
  27 cells in clk=\Clock_i, en=$abc$9752$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  132 cells in clk=\Clock_i, en=$abc$10060$auto$opt_dff.cc:219:make_patterns_logic$2508, arst={ }, srst=$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  31 cells in clk=\Clock_i, en=$abc$8717$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  21 cells in clk=\Clock_i, en=$abc$8920$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, arst=!\Reset_i_N, srst={ }
  18 cells in clk=\Clock_i, en=$abc$9918$auto$opt_dff.cc:219:make_patterns_logic$2361, arst={ }, srst=$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  10 cells in clk=\Clock_i, en=$abc$9180$auto$opt_dff.cc:219:make_patterns_logic$2562, arst=!\Reset_i_N, srst={ }
  41 cells in clk=\Clock_i, en=$abc$9386$lo15, arst=!\Reset_i_N, srst={ }
  8 cells in clk=\Clock_i, en=$abc$10050$auto$opt_dff.cc:219:make_patterns_logic$2486, arst={ }, srst=$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  15 cells in clk=\Clock_i, en=$abc$10032$auto$opt_dff.cc:219:make_patterns_logic$2454, arst={ }, srst=$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  56 cells in clk=\Clock_i, en=$abc$9936$auto$opt_dff.cc:219:make_patterns_logic$2385, arst={ }, srst=$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  24 cells in clk=\Clock_i, en=$abc$8850$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  8 cells in clk=\Clock_i, en=$abc$9808$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, arst=!\Reset_i_N, srst={ }
  17 cells in clk=\Clock_i, en=$abc$8884$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, arst=!\Reset_i_N, srst={ }
  14 cells in clk=\Clock_i, en={ }, arst={ }, srst={ }
  32 cells in clk=\Clock_i, en=$abc$8668$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  21 cells in clk=\Clock_i, en=$abc$8637$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL, arst={ }, srst={ }
  25 cells in clk=\Clock_i, en=$abc$9719$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  3 cells in clk=\Clock_i, en=$abc$9386$lo25, arst=!\Reset_i_N, srst={ }
  72 cells in clk=\Clock_i, en=$abc$8981$auto$opt_dff.cc:194:make_patterns_logic$2568, arst=!\Reset_i_N, srst={ }
  14 cells in clk=\Clock_i, en=$abc$9863$auto$opt_dff.cc:219:make_patterns_logic$2311, arst={ }, srst=$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  10 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$8419$auto$fsm_map.cc:170:map_fsm$2236[1]
  29 cells in clk=\Clock_i, en=$abc$8433$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL, arst={ }, srst={ }
  24 cells in clk=\Clock_i, en=$abc$8541$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL, arst={ }, srst={ }
  28 cells in clk=\Clock_i, en=$abc$8508$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=$abc$8475$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL, arst={ }, srst={ }
  103 cells in clk=\Clock_i, en=$abc$9189$auto$opt_dff.cc:194:make_patterns_logic$2552, arst=!\Reset_i_N, srst={ }
  29 cells in clk=\Clock_i, en=$abc$8390$auto$opt_dff.cc:219:make_patterns_logic$8253, arst={ }, srst=$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  102 cells in clk=\Clock_i, en=$abc$9386$lo26, arst=!\Reset_i_N, srst={ }
  23 cells in clk=\Clock_i, en=$abc$8575$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL, arst={ }, srst={ }
  21 cells in clk=\Clock_i, en=$abc$8817$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  2 cells in clk=\Clock_i, en={ }, arst={ }, srst=!\Reset_i_N
  6 cells in clk=\Clock_i, en=!$abc$10222$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, arst={ }, srst=$abc$10222$auto$opt_dff.cc:253:combine_resets$2520
  24 cells in clk=\Clock_i, en=$abc$10190$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL, arst={ }, srst={ }
  23 cells in clk=\Clock_i, en=$abc$10002$auto$opt_dff.cc:219:make_patterns_logic$2436, arst={ }, srst=$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  49 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$10232$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
  311 cells in clk=\Clock_i, en={ }, arst=!\Reset_i_N, srst={ }
  25 cells in clk=\Clock_i, en=$abc$9887$auto$opt_dff.cc:219:make_patterns_logic$2337, arst={ }, srst=$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  38 cells in clk=\Clock_i, en=$abc$10302$auto$opt_dff.cc:219:make_patterns_logic$2414, arst={ }, srst={ }

3.78.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8957$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 19 gates and 36 wires to a netlist network with 17 inputs and 9 outputs.

3.78.2.1. Executing ABC.

3.78.3. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9836$auto$opt_dff.cc:219:make_patterns_logic$2297, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 40 gates and 73 wires to a netlist network with 33 inputs and 26 outputs.

3.78.3.1. Executing ABC.

3.78.4. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$10239$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, synchronously reset by $abc$10232$auto$opt_dff.cc:253:combine_resets$2514
Extracted 5 gates and 11 wires to a netlist network with 5 inputs and 4 outputs.

3.78.4.1. Executing ABC.

3.78.5. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9338$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, asynchronously reset by !\Reset_i_N
Extracted 42 gates and 56 wires to a netlist network with 14 inputs and 6 outputs.

3.78.5.1. Executing ABC.

3.78.6. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10379$abc$8764$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 25 gates and 35 wires to a netlist network with 10 inputs and 15 outputs.

3.78.6.1. Executing ABC.

3.78.7. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8606$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL
Extracted 22 gates and 36 wires to a netlist network with 14 inputs and 10 outputs.

3.78.7.1. Executing ABC.

3.78.8. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8845$auto$opt_dff.cc:194:make_patterns_logic$2542, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 2 outputs.

3.78.8.1. Executing ABC.

3.78.9. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9784$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 17 gates and 32 wires to a netlist network with 15 inputs and 12 outputs.

3.78.9.1. Executing ABC.

3.78.10. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9752$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 27 gates and 51 wires to a netlist network with 24 inputs and 22 outputs.

3.78.10.1. Executing ABC.

3.78.11. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10060$auto$opt_dff.cc:219:make_patterns_logic$2508, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 132 gates and 196 wires to a netlist network with 64 inputs and 62 outputs.

3.78.11.1. Executing ABC.

3.78.12. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10379$abc$8717$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 31 gates and 59 wires to a netlist network with 28 inputs and 21 outputs.

3.78.12.1. Executing ABC.

3.78.13. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10379$abc$8920$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 21 gates and 40 wires to a netlist network with 19 inputs and 16 outputs.

3.78.13.1. Executing ABC.

3.78.14. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9918$auto$opt_dff.cc:219:make_patterns_logic$2361, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 18 gates and 34 wires to a netlist network with 16 inputs and 3 outputs.

3.78.14.1. Executing ABC.

3.78.15. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9180$auto$opt_dff.cc:219:make_patterns_logic$2562, asynchronously reset by !\Reset_i_N
Extracted 10 gates and 17 wires to a netlist network with 7 inputs and 3 outputs.

3.78.15.1. Executing ABC.

3.78.16. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9386$lo15, asynchronously reset by !\Reset_i_N
Extracted 41 gates and 55 wires to a netlist network with 14 inputs and 6 outputs.

3.78.16.1. Executing ABC.

3.78.17. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10050$auto$opt_dff.cc:219:make_patterns_logic$2486, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 8 gates and 15 wires to a netlist network with 7 inputs and 6 outputs.

3.78.17.1. Executing ABC.

3.78.18. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10032$auto$opt_dff.cc:219:make_patterns_logic$2454, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 15 gates and 28 wires to a netlist network with 13 inputs and 9 outputs.

3.78.18.1. Executing ABC.

3.78.19. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9936$auto$opt_dff.cc:219:make_patterns_logic$2385, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 56 gates and 82 wires to a netlist network with 26 inputs and 31 outputs.

3.78.19.1. Executing ABC.

3.78.20. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10379$abc$8850$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 24 gates and 40 wires to a netlist network with 16 inputs and 18 outputs.

3.78.20.1. Executing ABC.

3.78.21. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10379$abc$9808$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 8 gates and 17 wires to a netlist network with 9 inputs and 7 outputs.

3.78.21.1. Executing ABC.

3.78.22. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10379$abc$8884$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 17 gates and 28 wires to a netlist network with 11 inputs and 16 outputs.

3.78.22.1. Executing ABC.

3.78.23. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i
Extracted 14 gates and 23 wires to a netlist network with 9 inputs and 5 outputs.

3.78.23.1. Executing ABC.

3.78.24. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10379$abc$8668$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 32 gates and 59 wires to a netlist network with 27 inputs and 22 outputs.

3.78.24.1. Executing ABC.

3.78.25. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8637$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL
Extracted 21 gates and 35 wires to a netlist network with 14 inputs and 11 outputs.

3.78.25.1. Executing ABC.

3.78.26. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9719$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 25 gates and 49 wires to a netlist network with 24 inputs and 20 outputs.

3.78.26.1. Executing ABC.

3.78.27. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9386$lo25, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 5 wires to a netlist network with 2 inputs and 2 outputs.

3.78.27.1. Executing ABC.

3.78.28. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8981$auto$opt_dff.cc:194:make_patterns_logic$2568, asynchronously reset by !\Reset_i_N
Extracted 72 gates and 96 wires to a netlist network with 24 inputs and 30 outputs.

3.78.28.1. Executing ABC.

3.78.29. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9863$auto$opt_dff.cc:219:make_patterns_logic$2311, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 14 gates and 28 wires to a netlist network with 14 inputs and 10 outputs.

3.78.29.1. Executing ABC.

3.78.30. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$11078$abc$8419$auto$fsm_map.cc:170:map_fsm$2236[1]
Extracted 10 gates and 16 wires to a netlist network with 6 inputs and 3 outputs.

3.78.30.1. Executing ABC.

3.78.31. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8433$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL
Extracted 29 gates and 48 wires to a netlist network with 19 inputs and 11 outputs.

3.78.31.1. Executing ABC.

3.78.32. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8541$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL
Extracted 24 gates and 40 wires to a netlist network with 16 inputs and 12 outputs.

3.78.32.1. Executing ABC.

3.78.33. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8508$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL
Extracted 28 gates and 49 wires to a netlist network with 21 inputs and 17 outputs.

3.78.33.1. Executing ABC.

3.78.34. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8475$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL
Extracted 26 gates and 43 wires to a netlist network with 17 inputs and 12 outputs.

3.78.34.1. Executing ABC.

3.78.35. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9189$auto$opt_dff.cc:194:make_patterns_logic$2552, asynchronously reset by !\Reset_i_N
Extracted 103 gates and 130 wires to a netlist network with 27 inputs and 4 outputs.

3.78.35.1. Executing ABC.

3.78.36. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8390$auto$opt_dff.cc:219:make_patterns_logic$8253, synchronously reset by $abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 29 gates and 53 wires to a netlist network with 24 inputs and 9 outputs.

3.78.36.1. Executing ABC.

3.78.37. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9386$lo26, asynchronously reset by !\Reset_i_N
Extracted 102 gates and 195 wires to a netlist network with 93 inputs and 30 outputs.

3.78.37.1. Executing ABC.

3.78.38. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8575$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL
Extracted 23 gates and 38 wires to a netlist network with 15 inputs and 11 outputs.

3.78.38.1. Executing ABC.

3.78.39. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10379$abc$8817$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 21 gates and 43 wires to a netlist network with 22 inputs and 8 outputs.

3.78.39.1. Executing ABC.

3.78.40. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by !\Reset_i_N
Extracted 2 gates and 4 wires to a netlist network with 2 inputs and 2 outputs.

3.78.40.1. Executing ABC.

3.78.41. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$10222$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, synchronously reset by $abc$10222$auto$opt_dff.cc:253:combine_resets$2520
Extracted 6 gates and 12 wires to a netlist network with 5 inputs and 5 outputs.

3.78.41.1. Executing ABC.

3.78.42. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10190$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL
Extracted 24 gates and 40 wires to a netlist network with 16 inputs and 13 outputs.

3.78.42.1. Executing ABC.

3.78.43. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10002$auto$opt_dff.cc:219:make_patterns_logic$2436, synchronously reset by $abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 23 gates and 44 wires to a netlist network with 21 inputs and 18 outputs.

3.78.43.1. Executing ABC.

3.78.44. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$10232$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
Extracted 49 gates and 66 wires to a netlist network with 17 inputs and 21 outputs.

3.78.44.1. Executing ABC.

3.78.45. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, asynchronously reset by !\Reset_i_N
Extracted 311 gates and 448 wires to a netlist network with 137 inputs and 86 outputs.

3.78.45.1. Executing ABC.

3.78.46. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9887$auto$opt_dff.cc:219:make_patterns_logic$2337, synchronously reset by $abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 25 gates and 43 wires to a netlist network with 18 inputs and 8 outputs.

3.78.46.1. Executing ABC.

3.78.47. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10302$auto$opt_dff.cc:219:make_patterns_logic$2414
Extracted 38 gates and 62 wires to a netlist network with 24 inputs and 17 outputs.

3.78.47.1. Executing ABC.

yosys> abc -dff

3.79. Executing ABC pass (technology mapping using ABC).

3.79.1. Summary of detected clock domains:
  24 cells in clk=\Clock_i, en=$abc$12288$abc$9887$auto$opt_dff.cc:219:make_patterns_logic$2337, arst={ }, srst=$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  43 cells in clk=\Clock_i, en=$abc$10379$abc$9836$auto$opt_dff.cc:219:make_patterns_logic$2297, arst={ }, srst=$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  6 cells in clk=\Clock_i, en=!$abc$10421$abc$10239$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, arst={ }, srst=$abc$10421$abc$10232$auto$opt_dff.cc:253:combine_resets$2514
  42 cells in clk=\Clock_i, en=$abc$10429$abc$9338$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, arst=!\Reset_i_N, srst={ }
  26 cells in clk=\Clock_i, en=$abc$10379$abc$8764$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  2 cells in clk=\Clock_i, en=$abc$10539$abc$8845$auto$opt_dff.cc:194:make_patterns_logic$2542, arst=!\Reset_i_N, srst={ }
  17 cells in clk=\Clock_i, en=$abc$10544$abc$9784$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, arst=!\Reset_i_N, srst={ }
  15 cells in clk=\Clock_i, en=$abc$10356$abc$8957$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, arst=!\Reset_i_N, srst={ }
  101 cells in clk=\Clock_i, en=$abc$10609$abc$10060$auto$opt_dff.cc:219:make_patterns_logic$2508, arst={ }, srst=$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  32 cells in clk=\Clock_i, en=$abc$10379$abc$8717$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  23 cells in clk=\Clock_i, en=$abc$10830$abc$9918$auto$opt_dff.cc:219:make_patterns_logic$2361, arst={ }, srst=$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  25 cells in clk=\Clock_i, en=$abc$10568$abc$9752$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  6 cells in clk=\Clock_i, en=$abc$10848$abc$9180$auto$opt_dff.cc:219:make_patterns_logic$2562, arst=!\Reset_i_N, srst={ }
  7 cells in clk=\Clock_i, en=$abc$10902$abc$10050$auto$opt_dff.cc:219:make_patterns_logic$2486, arst={ }, srst=$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  14 cells in clk=\Clock_i, en=$abc$10912$abc$10032$auto$opt_dff.cc:219:make_patterns_logic$2454, arst={ }, srst=$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  25 cells in clk=\Clock_i, en=$abc$10508$abc$8606$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL, arst={ }, srst={ }
  59 cells in clk=\Clock_i, en=$abc$10929$abc$9936$auto$opt_dff.cc:219:make_patterns_logic$2385, arst={ }, srst=$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  24 cells in clk=\Clock_i, en=$abc$10379$abc$8850$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  6 cells in clk=\Clock_i, en=$abc$10379$abc$9808$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, arst=!\Reset_i_N, srst={ }
  8 cells in clk=\Clock_i, en={ }, arst={ }, srst={ }
  31 cells in clk=\Clock_i, en=$abc$10379$abc$8668$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  23 cells in clk=\Clock_i, en=$abc$11138$abc$8637$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL, arst={ }, srst={ }
  15 cells in clk=\Clock_i, en=$abc$11169$abc$9719$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  3 cells in clk=\Clock_i, en=$abc$11929$lo00, arst=!\Reset_i_N, srst={ }
  22 cells in clk=\Clock_i, en=$abc$10379$abc$8884$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, arst=!\Reset_i_N, srst={ }
  72 cells in clk=\Clock_i, en=$abc$11212$abc$8981$auto$opt_dff.cc:194:make_patterns_logic$2568, arst=!\Reset_i_N, srst={ }
  34 cells in clk=\Clock_i, en=$abc$11294$abc$9863$auto$opt_dff.cc:219:make_patterns_logic$2311, arst={ }, srst=$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  15 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$11078$abc$8419$auto$fsm_map.cc:170:map_fsm$2236[1]
  27 cells in clk=\Clock_i, en=$abc$11335$abc$8433$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=$abc$11368$abc$8541$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL, arst={ }, srst={ }
  28 cells in clk=\Clock_i, en=$abc$11401$abc$8508$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL, arst={ }, srst={ }
  23 cells in clk=\Clock_i, en=$abc$11439$abc$8475$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL, arst={ }, srst={ }
  21 cells in clk=\Clock_i, en=$abc$10379$abc$8920$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, arst=!\Reset_i_N, srst={ }
  109 cells in clk=\Clock_i, en=$abc$11473$abc$9189$auto$opt_dff.cc:194:make_patterns_logic$2552, arst=!\Reset_i_N, srst={ }
  33 cells in clk=\Clock_i, en=$abc$11582$abc$8390$auto$opt_dff.cc:219:make_patterns_logic$8253, arst={ }, srst=$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  102 cells in clk=\Clock_i, en=$abc$11929$lo47, arst=!\Reset_i_N, srst={ }
  22 cells in clk=\Clock_i, en=$abc$11717$abc$8575$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL, arst={ }, srst={ }
  42 cells in clk=\Clock_i, en=$abc$11929$lo17, arst=!\Reset_i_N, srst={ }
  16 cells in clk=\Clock_i, en=$abc$10379$abc$8817$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  2 cells in clk=\Clock_i, en={ }, arst={ }, srst=!\Reset_i_N
  6 cells in clk=\Clock_i, en=!$abc$11786$abc$10222$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, arst={ }, srst=$abc$11786$abc$10222$auto$opt_dff.cc:253:combine_resets$2520
  49 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$11867$abc$10232$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
  23 cells in clk=\Clock_i, en=$abc$11795$abc$10190$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL, arst={ }, srst={ }
  38 cells in clk=\Clock_i, en=$abc$11829$abc$10002$auto$opt_dff.cc:219:make_patterns_logic$2436, arst={ }, srst=$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  325 cells in clk=\Clock_i, en={ }, arst=!\Reset_i_N, srst={ }
  38 cells in clk=\Clock_i, en=$abc$12315$abc$10302$auto$opt_dff.cc:219:make_patterns_logic$2414, arst={ }, srst={ }

3.79.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12288$abc$9887$auto$opt_dff.cc:219:make_patterns_logic$2337, synchronously reset by $abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 24 gates and 43 wires to a netlist network with 19 inputs and 8 outputs.

3.79.2.1. Executing ABC.

3.79.3. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10379$abc$9836$auto$opt_dff.cc:219:make_patterns_logic$2297, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 43 gates and 74 wires to a netlist network with 31 inputs and 28 outputs.

3.79.3.1. Executing ABC.

3.79.4. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$10421$abc$10239$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, synchronously reset by $abc$10421$abc$10232$auto$opt_dff.cc:253:combine_resets$2514
Extracted 6 gates and 13 wires to a netlist network with 6 inputs and 4 outputs.

3.79.4.1. Executing ABC.

3.79.5. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10429$abc$9338$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, asynchronously reset by !\Reset_i_N
Extracted 42 gates and 56 wires to a netlist network with 14 inputs and 8 outputs.

3.79.5.1. Executing ABC.

3.79.6. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12394$abc$10379$abc$8764$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 26 gates and 41 wires to a netlist network with 15 inputs and 15 outputs.

3.79.6.1. Executing ABC.

3.79.7. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10539$abc$8845$auto$opt_dff.cc:194:make_patterns_logic$2542, asynchronously reset by !\Reset_i_N
Extracted 2 gates and 5 wires to a netlist network with 3 inputs and 2 outputs.

3.79.7.1. Executing ABC.

3.79.8. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10544$abc$9784$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 17 gates and 32 wires to a netlist network with 15 inputs and 13 outputs.

3.79.8.1. Executing ABC.

3.79.9. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10356$abc$8957$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 15 gates and 30 wires to a netlist network with 15 inputs and 9 outputs.

3.79.9.1. Executing ABC.

3.79.10. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10609$abc$10060$auto$opt_dff.cc:219:make_patterns_logic$2508, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 101 gates and 132 wires to a netlist network with 31 inputs and 50 outputs.

3.79.10.1. Executing ABC.

3.79.11. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10379$abc$8717$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 32 gates and 61 wires to a netlist network with 29 inputs and 22 outputs.

3.79.11.1. Executing ABC.

3.79.12. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10830$abc$9918$auto$opt_dff.cc:219:make_patterns_logic$2361, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 23 gates and 44 wires to a netlist network with 21 inputs and 4 outputs.

3.79.12.1. Executing ABC.

3.79.13. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10568$abc$9752$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 25 gates and 48 wires to a netlist network with 23 inputs and 20 outputs.

3.79.13.1. Executing ABC.

3.79.14. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10848$abc$9180$auto$opt_dff.cc:219:make_patterns_logic$2562, asynchronously reset by !\Reset_i_N
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 4 outputs.

3.79.14.1. Executing ABC.

3.79.15. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10902$abc$10050$auto$opt_dff.cc:219:make_patterns_logic$2486, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 7 gates and 13 wires to a netlist network with 6 inputs and 5 outputs.

3.79.15.1. Executing ABC.

3.79.16. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10912$abc$10032$auto$opt_dff.cc:219:make_patterns_logic$2454, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 14 gates and 28 wires to a netlist network with 14 inputs and 7 outputs.

3.79.16.1. Executing ABC.

3.79.17. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10508$abc$8606$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL
Extracted 25 gates and 43 wires to a netlist network with 18 inputs and 15 outputs.

3.79.17.1. Executing ABC.

3.79.18. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10929$abc$9936$auto$opt_dff.cc:219:make_patterns_logic$2385, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 59 gates and 94 wires to a netlist network with 35 inputs and 30 outputs.

3.79.18.1. Executing ABC.

3.79.19. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12394$abc$10379$abc$8850$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 24 gates and 40 wires to a netlist network with 16 inputs and 19 outputs.

3.79.19.1. Executing ABC.

3.79.20. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12394$abc$10379$abc$9808$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 6 gates and 12 wires to a netlist network with 6 inputs and 6 outputs.

3.79.20.1. Executing ABC.

3.79.21. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i
Extracted 8 gates and 13 wires to a netlist network with 5 inputs and 4 outputs.

3.79.21.1. Executing ABC.

3.79.22. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12394$abc$10379$abc$8668$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 31 gates and 56 wires to a netlist network with 25 inputs and 20 outputs.

3.79.22.1. Executing ABC.

3.79.23. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11138$abc$8637$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL
Extracted 23 gates and 39 wires to a netlist network with 16 inputs and 13 outputs.

3.79.23.1. Executing ABC.

3.79.24. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12394$abc$11169$abc$9719$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 15 gates and 28 wires to a netlist network with 13 inputs and 14 outputs.

3.79.24.1. Executing ABC.

3.79.25. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11929$lo00, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 5 wires to a netlist network with 2 inputs and 2 outputs.

3.79.25.1. Executing ABC.

3.79.26. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10379$abc$8884$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 22 gates and 37 wires to a netlist network with 15 inputs and 18 outputs.

3.79.26.1. Executing ABC.

3.79.27. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11212$abc$8981$auto$opt_dff.cc:194:make_patterns_logic$2568, asynchronously reset by !\Reset_i_N
Extracted 72 gates and 96 wires to a netlist network with 24 inputs and 33 outputs.

3.79.27.1. Executing ABC.

3.79.28. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11294$abc$9863$auto$opt_dff.cc:219:make_patterns_logic$2311, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 34 gates and 53 wires to a netlist network with 19 inputs and 6 outputs.

3.79.28.1. Executing ABC.

3.79.29. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$11078$abc$8419$auto$fsm_map.cc:170:map_fsm$2236[1]
Extracted 15 gates and 22 wires to a netlist network with 7 inputs and 7 outputs.

3.79.29.1. Executing ABC.

3.79.30. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11335$abc$8433$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL
Extracted 27 gates and 46 wires to a netlist network with 19 inputs and 11 outputs.

3.79.30.1. Executing ABC.

3.79.31. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11368$abc$8541$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL
Extracted 26 gates and 44 wires to a netlist network with 18 inputs and 13 outputs.

3.79.31.1. Executing ABC.

3.79.32. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11401$abc$8508$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL
Extracted 28 gates and 49 wires to a netlist network with 21 inputs and 12 outputs.

3.79.32.1. Executing ABC.

3.79.33. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11439$abc$8475$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL
Extracted 23 gates and 38 wires to a netlist network with 15 inputs and 12 outputs.

3.79.33.1. Executing ABC.

3.79.34. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10379$abc$8920$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 21 gates and 40 wires to a netlist network with 19 inputs and 16 outputs.

3.79.34.1. Executing ABC.

3.79.35. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11473$abc$9189$auto$opt_dff.cc:194:make_patterns_logic$2552, asynchronously reset by !\Reset_i_N
Extracted 109 gates and 137 wires to a netlist network with 28 inputs and 6 outputs.

3.79.35.1. Executing ABC.

3.79.36. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11582$abc$8390$auto$opt_dff.cc:219:make_patterns_logic$8253, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 33 gates and 55 wires to a netlist network with 22 inputs and 7 outputs.

3.79.36.1. Executing ABC.

3.79.37. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11929$lo47, asynchronously reset by !\Reset_i_N
Extracted 102 gates and 195 wires to a netlist network with 93 inputs and 30 outputs.

3.79.37.1. Executing ABC.

3.79.38. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11717$abc$8575$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL
Extracted 22 gates and 37 wires to a netlist network with 15 inputs and 11 outputs.

3.79.38.1. Executing ABC.

3.79.39. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11929$lo17, asynchronously reset by !\Reset_i_N
Extracted 42 gates and 55 wires to a netlist network with 13 inputs and 4 outputs.

3.79.39.1. Executing ABC.

3.79.40. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12394$abc$10379$abc$8817$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 33 wires to a netlist network with 17 inputs and 8 outputs.

3.79.40.1. Executing ABC.

3.79.41. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by !\Reset_i_N
Extracted 2 gates and 4 wires to a netlist network with 2 inputs and 2 outputs.

3.79.41.1. Executing ABC.

3.79.42. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$11786$abc$10222$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, synchronously reset by $abc$11786$abc$10222$auto$opt_dff.cc:253:combine_resets$2520
Extracted 6 gates and 12 wires to a netlist network with 5 inputs and 5 outputs.

3.79.42.1. Executing ABC.

3.79.43. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$11867$abc$10232$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
Extracted 49 gates and 64 wires to a netlist network with 15 inputs and 25 outputs.

3.79.43.1. Executing ABC.

3.79.44. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11795$abc$10190$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL
Extracted 23 gates and 39 wires to a netlist network with 16 inputs and 12 outputs.

3.79.44.1. Executing ABC.

3.79.45. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11829$abc$10002$auto$opt_dff.cc:219:make_patterns_logic$2436, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 38 gates and 66 wires to a netlist network with 28 inputs and 31 outputs.

3.79.45.1. Executing ABC.

3.79.46. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, asynchronously reset by !\Reset_i_N
Extracted 325 gates and 468 wires to a netlist network with 143 inputs and 78 outputs.

3.79.46.1. Executing ABC.

3.79.47. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12315$abc$10302$auto$opt_dff.cc:219:make_patterns_logic$2414
Extracted 38 gates and 62 wires to a netlist network with 24 inputs and 18 outputs.

3.79.47.1. Executing ABC.

yosys> abc -dff

3.80. Executing ABC pass (technology mapping using ABC).

3.80.1. Summary of detected clock domains:
  29 cells in clk=\Clock_i, en=$abc$12394$abc$10379$abc$9836$auto$opt_dff.cc:219:make_patterns_logic$2297, arst={ }, srst=$abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  6 cells in clk=\Clock_i, en=!$abc$12439$abc$10421$abc$10239$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, arst={ }, srst=$abc$12439$abc$10421$abc$10232$auto$opt_dff.cc:253:combine_resets$2514
  42 cells in clk=\Clock_i, en=$abc$12447$abc$10429$abc$9338$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, arst=!\Reset_i_N, srst={ }
  31 cells in clk=\Clock_i, en=$abc$12394$abc$10379$abc$8764$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  2 cells in clk=\Clock_i, en=$abc$12526$abc$10539$abc$8845$auto$opt_dff.cc:194:make_patterns_logic$2542, arst=!\Reset_i_N, srst={ }
  18 cells in clk=\Clock_i, en=$abc$12531$abc$10544$abc$9784$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, arst=!\Reset_i_N, srst={ }
  17 cells in clk=\Clock_i, en=$abc$12556$abc$10356$abc$8957$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, arst=!\Reset_i_N, srst={ }
  100 cells in clk=\Clock_i, en=$abc$12579$abc$10609$abc$10060$auto$opt_dff.cc:219:make_patterns_logic$2508, arst={ }, srst=$abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  23 cells in clk=\Clock_i, en=$abc$12369$abc$12288$abc$9887$auto$opt_dff.cc:219:make_patterns_logic$2337, arst={ }, srst=$abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  21 cells in clk=\Clock_i, en=$abc$12728$abc$10830$abc$9918$auto$opt_dff.cc:219:make_patterns_logic$2361, arst={ }, srst=$abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  7 cells in clk=\Clock_i, en=$abc$12790$abc$10848$abc$9180$auto$opt_dff.cc:219:make_patterns_logic$2562, arst=!\Reset_i_N, srst={ }
  7 cells in clk=\Clock_i, en=$abc$12799$abc$10902$abc$10050$auto$opt_dff.cc:219:make_patterns_logic$2486, arst={ }, srst=$abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  14 cells in clk=\Clock_i, en=$abc$12808$abc$10912$abc$10032$auto$opt_dff.cc:219:make_patterns_logic$2454, arst={ }, srst=$abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  59 cells in clk=\Clock_i, en=$abc$12858$abc$10929$abc$9936$auto$opt_dff.cc:219:make_patterns_logic$2385, arst={ }, srst=$abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  22 cells in clk=\Clock_i, en=$abc$12394$abc$10379$abc$8850$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  8 cells in clk=\Clock_i, en=$abc$12394$abc$10379$abc$9808$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, arst=!\Reset_i_N, srst={ }
  8 cells in clk=\Clock_i, en={ }, arst={ }, srst={ }
  45 cells in clk=\Clock_i, en=$abc$13903$abc$11829$abc$10002$auto$opt_dff.cc:219:make_patterns_logic$2436, arst={ }, srst=$abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  29 cells in clk=\Clock_i, en=$abc$12394$abc$10379$abc$8668$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  22 cells in clk=\Clock_i, en=$abc$13026$abc$11138$abc$8637$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL, arst={ }, srst={ }
  25 cells in clk=\Clock_i, en=$abc$12394$abc$11169$abc$9719$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  3 cells in clk=\Clock_i, en=$abc$13954$lo37, arst=!\Reset_i_N, srst={ }
  19 cells in clk=\Clock_i, en=$abc$13095$abc$10379$abc$8884$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, arst=!\Reset_i_N, srst={ }
  81 cells in clk=\Clock_i, en=$abc$13130$abc$11212$abc$8981$auto$opt_dff.cc:194:make_patterns_logic$2568, arst=!\Reset_i_N, srst={ }
  25 cells in clk=\Clock_i, en=$abc$12823$abc$10508$abc$8606$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL, arst={ }, srst={ }
  32 cells in clk=\Clock_i, en=$abc$13215$abc$11294$abc$9863$auto$opt_dff.cc:219:make_patterns_logic$2311, arst={ }, srst=$abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  14 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$13253$abc$11078$abc$8419$auto$fsm_map.cc:170:map_fsm$2236[1]
  28 cells in clk=\Clock_i, en=$abc$13270$abc$11335$abc$8433$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=$abc$13303$abc$11368$abc$8541$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL, arst={ }, srst={ }
  24 cells in clk=\Clock_i, en=$abc$13337$abc$11401$abc$8508$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL, arst={ }, srst={ }
  24 cells in clk=\Clock_i, en=$abc$13370$abc$11439$abc$8475$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL, arst={ }, srst={ }
  15 cells in clk=\Clock_i, en=$abc$13403$abc$10379$abc$8920$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, arst=!\Reset_i_N, srst={ }
  105 cells in clk=\Clock_i, en=$abc$13437$abc$11473$abc$9189$auto$opt_dff.cc:194:make_patterns_logic$2552, arst=!\Reset_i_N, srst={ }
  39 cells in clk=\Clock_i, en=$abc$13542$abc$11582$abc$8390$auto$opt_dff.cc:219:make_patterns_logic$8253, arst={ }, srst=$abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  102 cells in clk=\Clock_i, en=$abc$13954$lo10, arst=!\Reset_i_N, srst={ }
  21 cells in clk=\Clock_i, en=$abc$13680$abc$11717$abc$8575$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL, arst={ }, srst={ }
  28 cells in clk=\Clock_i, en=$abc$12685$abc$10379$abc$8717$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  26 cells in clk=\Clock_i, en=$abc$12751$abc$10568$abc$9752$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  41 cells in clk=\Clock_i, en=$abc$13954$lo47, arst=!\Reset_i_N, srst={ }
  20 cells in clk=\Clock_i, en=$abc$12394$abc$10379$abc$8817$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  2 cells in clk=\Clock_i, en={ }, arst={ }, srst=!\Reset_i_N
  6 cells in clk=\Clock_i, en=!$abc$13796$abc$11786$abc$10222$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, arst={ }, srst=$abc$13796$abc$11786$abc$10222$auto$opt_dff.cc:253:combine_resets$2520
  47 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$13805$abc$11867$abc$10232$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
  26 cells in clk=\Clock_i, en=$abc$13870$abc$11795$abc$10190$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL, arst={ }, srst={ }
  338 cells in clk=\Clock_i, en={ }, arst=!\Reset_i_N, srst={ }
  37 cells in clk=\Clock_i, en=$abc$14324$abc$12315$abc$10302$auto$opt_dff.cc:219:make_patterns_logic$2414, arst={ }, srst={ }

3.80.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12394$abc$10379$abc$9836$auto$opt_dff.cc:219:make_patterns_logic$2297, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 29 gates and 55 wires to a netlist network with 26 inputs and 17 outputs.

3.80.2.1. Executing ABC.

3.80.3. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$12439$abc$10421$abc$10239$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, synchronously reset by $abc$12439$abc$10421$abc$10232$auto$opt_dff.cc:253:combine_resets$2514
Extracted 6 gates and 13 wires to a netlist network with 6 inputs and 4 outputs.

3.80.3.1. Executing ABC.

3.80.4. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12447$abc$10429$abc$9338$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, asynchronously reset by !\Reset_i_N
Extracted 42 gates and 56 wires to a netlist network with 14 inputs and 8 outputs.

3.80.4.1. Executing ABC.

3.80.5. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12394$abc$10379$abc$8764$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 31 gates and 49 wires to a netlist network with 18 inputs and 18 outputs.

3.80.5.1. Executing ABC.

3.80.6. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12526$abc$10539$abc$8845$auto$opt_dff.cc:194:make_patterns_logic$2542, asynchronously reset by !\Reset_i_N
Extracted 2 gates and 5 wires to a netlist network with 3 inputs and 2 outputs.

3.80.6.1. Executing ABC.

3.80.7. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12531$abc$10544$abc$9784$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 18 gates and 34 wires to a netlist network with 16 inputs and 12 outputs.

3.80.7.1. Executing ABC.

3.80.8. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12556$abc$10356$abc$8957$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 17 gates and 33 wires to a netlist network with 16 inputs and 10 outputs.

3.80.8.1. Executing ABC.

3.80.9. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12579$abc$10609$abc$10060$auto$opt_dff.cc:219:make_patterns_logic$2508, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 100 gates and 133 wires to a netlist network with 33 inputs and 53 outputs.

3.80.9.1. Executing ABC.

3.80.10. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12369$abc$12288$abc$9887$auto$opt_dff.cc:219:make_patterns_logic$2337, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 23 gates and 39 wires to a netlist network with 16 inputs and 9 outputs.

3.80.10.1. Executing ABC.

3.80.11. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12728$abc$10830$abc$9918$auto$opt_dff.cc:219:make_patterns_logic$2361, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 21 gates and 42 wires to a netlist network with 21 inputs and 3 outputs.

3.80.11.1. Executing ABC.

3.80.12. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12790$abc$10848$abc$9180$auto$opt_dff.cc:219:make_patterns_logic$2562, asynchronously reset by !\Reset_i_N
Extracted 7 gates and 14 wires to a netlist network with 7 inputs and 3 outputs.

3.80.12.1. Executing ABC.

3.80.13. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12799$abc$10902$abc$10050$auto$opt_dff.cc:219:make_patterns_logic$2486, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 7 gates and 14 wires to a netlist network with 7 inputs and 5 outputs.

3.80.13.1. Executing ABC.

3.80.14. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12808$abc$10912$abc$10032$auto$opt_dff.cc:219:make_patterns_logic$2454, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 14 gates and 28 wires to a netlist network with 14 inputs and 7 outputs.

3.80.14.1. Executing ABC.

3.80.15. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12858$abc$10929$abc$9936$auto$opt_dff.cc:219:make_patterns_logic$2385, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 59 gates and 93 wires to a netlist network with 34 inputs and 29 outputs.

3.80.15.1. Executing ABC.

3.80.16. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12394$abc$10379$abc$8850$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 22 gates and 35 wires to a netlist network with 13 inputs and 19 outputs.

3.80.16.1. Executing ABC.

3.80.17. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14379$abc$12394$abc$10379$abc$9808$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 8 gates and 17 wires to a netlist network with 9 inputs and 7 outputs.

3.80.17.1. Executing ABC.

3.80.18. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i
Extracted 8 gates and 13 wires to a netlist network with 5 inputs and 4 outputs.

3.80.18.1. Executing ABC.

3.80.19. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13903$abc$11829$abc$10002$auto$opt_dff.cc:219:make_patterns_logic$2436, synchronously reset by $abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 45 gates and 73 wires to a netlist network with 28 inputs and 35 outputs.

3.80.19.1. Executing ABC.

3.80.20. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12394$abc$10379$abc$8668$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 29 gates and 52 wires to a netlist network with 23 inputs and 23 outputs.

3.80.20.1. Executing ABC.

3.80.21. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13026$abc$11138$abc$8637$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL
Extracted 22 gates and 37 wires to a netlist network with 15 inputs and 12 outputs.

3.80.21.1. Executing ABC.

3.80.22. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12394$abc$11169$abc$9719$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 25 gates and 50 wires to a netlist network with 25 inputs and 22 outputs.

3.80.22.1. Executing ABC.

3.80.23. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13954$lo37, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 5 wires to a netlist network with 2 inputs and 2 outputs.

3.80.23.1. Executing ABC.

3.80.24. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14379$abc$13095$abc$10379$abc$8884$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 19 gates and 32 wires to a netlist network with 13 inputs and 17 outputs.

3.80.24.1. Executing ABC.

3.80.25. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13130$abc$11212$abc$8981$auto$opt_dff.cc:194:make_patterns_logic$2568, asynchronously reset by !\Reset_i_N
Extracted 81 gates and 114 wires to a netlist network with 33 inputs and 37 outputs.

3.80.25.1. Executing ABC.

3.80.26. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12823$abc$10508$abc$8606$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL
Extracted 25 gates and 42 wires to a netlist network with 17 inputs and 11 outputs.

3.80.26.1. Executing ABC.

3.80.27. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13215$abc$11294$abc$9863$auto$opt_dff.cc:219:make_patterns_logic$2311, synchronously reset by $abc$14860$abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 32 gates and 53 wires to a netlist network with 21 inputs and 9 outputs.

3.80.27.1. Executing ABC.

3.80.28. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$13253$abc$11078$abc$8419$auto$fsm_map.cc:170:map_fsm$2236[1]
Extracted 14 gates and 21 wires to a netlist network with 7 inputs and 6 outputs.

3.80.28.1. Executing ABC.

3.80.29. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13270$abc$11335$abc$8433$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL
Extracted 28 gates and 48 wires to a netlist network with 20 inputs and 11 outputs.

3.80.29.1. Executing ABC.

3.80.30. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13303$abc$11368$abc$8541$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL
Extracted 26 gates and 44 wires to a netlist network with 18 inputs and 11 outputs.

3.80.30.1. Executing ABC.

3.80.31. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13337$abc$11401$abc$8508$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL
Extracted 24 gates and 40 wires to a netlist network with 16 inputs and 12 outputs.

3.80.31.1. Executing ABC.

3.80.32. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13370$abc$11439$abc$8475$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL
Extracted 24 gates and 40 wires to a netlist network with 16 inputs and 11 outputs.

3.80.32.1. Executing ABC.

3.80.33. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14379$abc$13403$abc$10379$abc$8920$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 15 gates and 28 wires to a netlist network with 13 inputs and 13 outputs.

3.80.33.1. Executing ABC.

3.80.34. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13437$abc$11473$abc$9189$auto$opt_dff.cc:194:make_patterns_logic$2552, asynchronously reset by !\Reset_i_N
Extracted 105 gates and 135 wires to a netlist network with 30 inputs and 7 outputs.

3.80.34.1. Executing ABC.

3.80.35. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13542$abc$11582$abc$8390$auto$opt_dff.cc:219:make_patterns_logic$8253, synchronously reset by $abc$14860$abc$12369$abc$11582$abc$8390$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 39 gates and 60 wires to a netlist network with 21 inputs and 8 outputs.

3.80.35.1. Executing ABC.

3.80.36. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13954$lo10, asynchronously reset by !\Reset_i_N
Extracted 102 gates and 195 wires to a netlist network with 93 inputs and 30 outputs.

3.80.36.1. Executing ABC.

3.80.37. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13680$abc$11717$abc$8575$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL
Extracted 21 gates and 35 wires to a netlist network with 14 inputs and 11 outputs.

3.80.37.1. Executing ABC.

3.80.38. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12685$abc$10379$abc$8717$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 28 gates and 52 wires to a netlist network with 24 inputs and 21 outputs.

3.80.38.1. Executing ABC.

3.80.39. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12751$abc$10568$abc$9752$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 26 gates and 51 wires to a netlist network with 25 inputs and 21 outputs.

3.80.39.1. Executing ABC.

3.80.40. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13954$lo47, asynchronously reset by !\Reset_i_N
Extracted 41 gates and 55 wires to a netlist network with 14 inputs and 6 outputs.

3.80.40.1. Executing ABC.

3.80.41. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12394$abc$10379$abc$8817$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 20 gates and 42 wires to a netlist network with 22 inputs and 11 outputs.

3.80.41.1. Executing ABC.

3.80.42. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by !\Reset_i_N
Extracted 2 gates and 4 wires to a netlist network with 2 inputs and 2 outputs.

3.80.42.1. Executing ABC.

3.80.43. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$13796$abc$11786$abc$10222$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, synchronously reset by $abc$13796$abc$11786$abc$10222$auto$opt_dff.cc:253:combine_resets$2520
Extracted 6 gates and 12 wires to a netlist network with 5 inputs and 5 outputs.

3.80.43.1. Executing ABC.

3.80.44. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$13805$abc$11867$abc$10232$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
Extracted 47 gates and 63 wires to a netlist network with 16 inputs and 23 outputs.

3.80.44.1. Executing ABC.

3.80.45. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$13870$abc$11795$abc$10190$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL
Extracted 26 gates and 45 wires to a netlist network with 19 inputs and 15 outputs.

3.80.45.1. Executing ABC.

3.80.46. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, asynchronously reset by !\Reset_i_N
Extracted 338 gates and 475 wires to a netlist network with 137 inputs and 73 outputs.

3.80.46.1. Executing ABC.

3.80.47. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$14324$abc$12315$abc$10302$auto$opt_dff.cc:219:make_patterns_logic$2414
Extracted 37 gates and 61 wires to a netlist network with 24 inputs and 17 outputs.

3.80.47.1. Executing ABC.

yosys> opt_ffinv

3.81. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 3 inverters.

yosys> opt -sat

3.82. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.82.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~45 debug messages>

yosys> opt_merge -nomux

3.82.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~153 debug messages>
Removed a total of 51 cells.

yosys> opt_muxtree

3.82.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.82.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.82.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.82.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.82.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 5 unused cells and 11064 unused wires.
<suppressed ~108 debug messages>

yosys> opt_expr

3.82.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.82.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.82.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.82.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.82.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.82.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.82.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.82.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.82.16. Finished OPT passes. (There is nothing left to do.)

yosys> bmuxmap

3.83. Executing BMUXMAP pass.

yosys> demuxmap

3.84. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /home/users/temp_dir/yosys_DhcoHo/abc_tmp_1.scr

3.85. Executing ABC pass (technology mapping using ABC).

3.85.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 1255 gates and 1585 wires to a netlist network with 330 inputs and 223 outputs.

3.85.1.1. Executing ABC.
DE:   #PIs = 330  #Luts =   423  Max Lvl =   9  Avg Lvl =   2.56  [   0.30 sec. at Pass 0]
DE:   #PIs = 330  #Luts =   381  Max Lvl =   8  Avg Lvl =   2.52  [   2.80 sec. at Pass 1]
DE:   #PIs = 330  #Luts =   370  Max Lvl =   8  Avg Lvl =   2.53  [   0.63 sec. at Pass 2]
DE:   #PIs = 330  #Luts =   368  Max Lvl =   8  Avg Lvl =   2.53  [   1.14 sec. at Pass 3]
DE:   #PIs = 330  #Luts =   365  Max Lvl =   8  Avg Lvl =   2.43  [   1.10 sec. at Pass 4]
DE:   #PIs = 330  #Luts =   363  Max Lvl =   7  Avg Lvl =   2.34  [   1.43 sec. at Pass 5]
DE:   #PIs = 330  #Luts =   362  Max Lvl =   8  Avg Lvl =   2.46  [   1.07 sec. at Pass 6]
DE:   #PIs = 330  #Luts =   358  Max Lvl =   6  Avg Lvl =   2.35  [   1.70 sec. at Pass 7]
DE:   #PIs = 330  #Luts =   358  Max Lvl =   6  Avg Lvl =   2.35  [   0.91 sec. at Pass 8]
DE:   #PIs = 330  #Luts =   356  Max Lvl =   7  Avg Lvl =   2.32  [   1.16 sec. at Pass 9]
DE:   #PIs = 330  #Luts =   356  Max Lvl =   7  Avg Lvl =   2.32  [   0.69 sec. at Pass 10]
DE:   #PIs = 330  #Luts =   354  Max Lvl =   8  Avg Lvl =   2.42  [   1.00 sec. at Pass 11]
DE:   #PIs = 330  #Luts =   354  Max Lvl =   8  Avg Lvl =   2.42  [   0.74 sec. at Pass 12]
DE:   #PIs = 330  #Luts =   352  Max Lvl =   9  Avg Lvl =   2.40  [   1.05 sec. at Pass 13]
DE:   #PIs = 330  #Luts =   351  Max Lvl =   9  Avg Lvl =   2.39  [   0.76 sec. at Pass 14]
DE:   #PIs = 330  #Luts =   351  Max Lvl =   6  Avg Lvl =   2.28  [   1.56 sec. at Pass 15]
DE:   #PIs = 330  #Luts =   351  Max Lvl =   6  Avg Lvl =   2.28  [   0.97 sec. at Pass 16]
DE:   #PIs = 330  #Luts =   348  Max Lvl =   8  Avg Lvl =   2.35  [   1.04 sec. at Pass 17]
DE:   #PIs = 330  #Luts =   347  Max Lvl =   8  Avg Lvl =   2.36  [   1.04 sec. at Pass 18]
DE:   #PIs = 330  #Luts =   346  Max Lvl =   9  Avg Lvl =   2.37  [   1.56 sec. at Pass 19]
DE:   #PIs = 330  #Luts =   346  Max Lvl =   7  Avg Lvl =   2.29  [   1.03 sec. at Pass 20]
DE:   #PIs = 330  #Luts =   346  Max Lvl =   7  Avg Lvl =   2.29  [   1.58 sec. at Pass 21]
DE:   #PIs = 330  #Luts =   346  Max Lvl =   7  Avg Lvl =   2.29  [   1.15 sec. at Pass 22]
DE:   #PIs = 330  #Luts =   346  Max Lvl =   7  Avg Lvl =   2.29  [   1.62 sec. at Pass 23]
DE:   #PIs = 330  #Luts =   344  Max Lvl =   7  Avg Lvl =   2.26  [   8.13 sec. at Pass 24]
DE:   #PIs = 330  #Luts =   344  Max Lvl =   7  Avg Lvl =   2.26  [   1.32 sec. at Pass 25]
DE:   #PIs = 330  #Luts =   344  Max Lvl =   7  Avg Lvl =   2.26  [   1.65 sec. at Pass 26]
DE:   #PIs = 330  #Luts =   344  Max Lvl =   7  Avg Lvl =   2.26  [   0.89 sec. at Pass 27]
DE:   #PIs = 330  #Luts =   344  Max Lvl =   6  Avg Lvl =   2.26  [   8.04 sec. at Pass 28]
DE:   #PIs = 330  #Luts =   344  Max Lvl =   6  Avg Lvl =   2.26  [   2.13 sec. at Pass 29]
DE:   #PIs = 330  #Luts =   344  Max Lvl =   6  Avg Lvl =   2.26  [   1.02 sec. at Pass 30]
DE:   #PIs = 330  #Luts =   344  Max Lvl =   6  Avg Lvl =   2.26  [   2.01 sec. at Pass 31]
DE:   #PIs = 330  #Luts =   343  Max Lvl =   6  Avg Lvl =   2.21  [   7.58 sec. at Pass 32]
DE:   #PIs = 330  #Luts =   343  Max Lvl =   6  Avg Lvl =   2.21  [   1.06 sec. at Pass 33]
DE:   #PIs = 330  #Luts =   343  Max Lvl =   6  Avg Lvl =   2.21  [   1.93 sec. at Pass 34]
DE:   #PIs = 330  #Luts =   343  Max Lvl =   6  Avg Lvl =   2.21  [   1.03 sec. at Pass 35]
DE:   #PIs = 330  #Luts =   343  Max Lvl =   6  Avg Lvl =   2.21  [   7.83 sec. at Pass 36]
DE:   #PIs = 330  #Luts =   343  Max Lvl =   6  Avg Lvl =   2.21  [   0.47 sec. at Pass 37]

yosys> opt_expr

3.86. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.87. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.88. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.89. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.90. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.91. Executing OPT_SHARE pass.

yosys> opt_dff

3.92. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.93. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 9 unused cells and 1524 unused wires.
<suppressed ~47 debug messages>

yosys> opt_expr

3.94. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_muxtree

3.95. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.96. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.97. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.98. Executing OPT_SHARE pass.

yosys> opt_dff

3.99. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.100. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.101. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 2

yosys> opt_ffinv

3.102. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 8 inverters.

yosys> stat

3.103. Printing statistics.

=== top ===

   Number of wires:                778
   Number of wire bits:           1387
   Number of public wires:         203
   Number of public wire bits:     812
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                673
     $_DFFE_PN0P_                  137
     $_DFFE_PN1P_                    8
     $_DFFE_PP_                     72
     $_DFF_PN0_                     51
     $_DFF_PN1_                      2
     $_DFF_P_                        2
     $_SDFFE_PP0N_                   2
     $_SDFFE_PP0P_                  37
     $_SDFF_PN0_                    19
     $_SDFF_PP0_                     1
     $lut                          342


yosys> shregmap -minlen 8 -maxlen 20

3.104. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.105. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.106. Printing statistics.

=== top ===

   Number of wires:                876
   Number of wire bits:           1485
   Number of public wires:         203
   Number of public wire bits:     812
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                771
     $_DFFE_PN0P_                  137
     $_DFFE_PN1P_                    8
     $_DFFE_PP0P_                   72
     $_DFF_PN0_                     51
     $_DFF_PN1_                      2
     $_DFF_P_                       61
     $_MUX_                         98
     $lut                          342


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.107. Executing TECHMAP pass (map to technology primitives).

3.107.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.107.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.107.3. Continuing TECHMAP pass.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_DFFE_PN1P_ for cells of type $_DFFE_PN1P_.
Using template \$_DFF_PN1_ for cells of type $_DFF_PN1_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~881 debug messages>

yosys> opt_expr -mux_undef

3.108. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~9637 debug messages>

yosys> simplemap

3.109. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.110. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.111. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~2142 debug messages>
Removed a total of 714 cells.

yosys> opt_dff -nodffe -nosdff

3.112. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.113. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 8 unused cells and 2230 unused wires.
<suppressed ~9 debug messages>

yosys> opt -nodffe -nosdff

3.114. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.114.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~169 debug messages>

yosys> opt_merge -nomux

3.114.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_muxtree

3.114.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.114.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.114.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.114.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.114.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 60 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.114.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.114.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.114.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.114.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.114.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.114.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.114.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.114.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.114.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_DhcoHo/abc_tmp_2.scr

3.115. Executing ABC pass (technology mapping using ABC).

3.115.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 1562 gates and 1894 wires to a netlist network with 330 inputs and 218 outputs.

3.115.1.1. Executing ABC.
DE:   #PIs = 330  #Luts =   371  Max Lvl =   8  Avg Lvl =   2.54  [   0.23 sec. at Pass 0]
DE:   #PIs = 330  #Luts =   370  Max Lvl =   6  Avg Lvl =   2.53  [   3.32 sec. at Pass 1]
DE:   #PIs = 330  #Luts =   368  Max Lvl =   8  Avg Lvl =   2.55  [   0.96 sec. at Pass 2]
DE:   #PIs = 330  #Luts =   366  Max Lvl =   6  Avg Lvl =   2.50  [   1.58 sec. at Pass 3]
DE:   #PIs = 330  #Luts =   366  Max Lvl =   6  Avg Lvl =   2.50  [   1.17 sec. at Pass 4]
DE:   #PIs = 330  #Luts =   364  Max Lvl =   7  Avg Lvl =   2.50  [   1.76 sec. at Pass 5]
DE:   #PIs = 330  #Luts =   364  Max Lvl =   7  Avg Lvl =   2.50  [   1.35 sec. at Pass 6]
DE:   #PIs = 330  #Luts =   364  Max Lvl =   6  Avg Lvl =   2.46  [   2.21 sec. at Pass 7]
DE:   #PIs = 330  #Luts =   361  Max Lvl =   7  Avg Lvl =   2.50  [   1.46 sec. at Pass 8]
DE:   #PIs = 330  #Luts =   361  Max Lvl =   7  Avg Lvl =   2.50  [   1.84 sec. at Pass 9]
DE:   #PIs = 330  #Luts =   361  Max Lvl =   7  Avg Lvl =   2.50  [   0.90 sec. at Pass 10]
DE:   #PIs = 330  #Luts =   361  Max Lvl =   7  Avg Lvl =   2.50  [   2.66 sec. at Pass 11]
DE:   #PIs = 330  #Luts =   361  Max Lvl =   7  Avg Lvl =   2.50  [   9.95 sec. at Pass 12]
DE:   #PIs = 330  #Luts =   361  Max Lvl =   7  Avg Lvl =   2.50  [   0.53 sec. at Pass 13]

yosys> opt_expr

3.116. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.117. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.118. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.119. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.120. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.121. Executing OPT_SHARE pass.

yosys> opt_dff

3.122. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.123. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1606 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.124. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.125. Executing HIERARCHY pass (managing design hierarchy).

3.125.1. Analyzing design hierarchy..
Top module:  \top

3.125.2. Analyzing design hierarchy..
Top module:  \top
Removed 0 unused modules.

yosys> stat

3.126. Printing statistics.

=== top ===

   Number of wires:                797
   Number of wire bits:           1399
   Number of public wires:         201
   Number of public wire bits:     803
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                692
     $lut                          361
     dffsre                        331


yosys> opt_clean -purge

3.127. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 150 unused wires.
<suppressed ~150 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.128. Executing Verilog backend.
Dumping module `\top'.

Warnings: 9 unique messages, 9 total
End of script. Logfile hash: 9039554701, CPU: user 14.30s system 1.71s, MEM: 46.04 MB peak
Yosys 0.18+10 (git sha1 7a7a25778, gcc 9.1.0 -fPIC -Os)
Time spent: 98% 6x abc (762 sec), 0% 42x opt_expr (3 sec), ...
real 183.29
user 714.06
sys 59.88
