
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.8
 Yosys 0.16+6 (git sha1 7f5477eb1, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k clock_tree_design.v

yosys> verific -vlog2k clock_tree_design.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'clock_tree_design.v'

yosys> synth_rs -top clock_tree_design -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.2.37

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top clock_tree_design

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] clock_tree_design.v:5: compiling module 'clock_tree_design'
VERIFIC-INFO [VERI-1018] clock_tree_design.v:300: compiling module 'T_ff'
Importing module clock_tree_design.
Importing module T_ff.

3.3.1. Analyzing design hierarchy..
Top module:  \clock_tree_design
Used module:     \T_ff

3.3.2. Analyzing design hierarchy..
Top module:  \clock_tree_design
Used module:     \T_ff
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module T_ff.
<suppressed ~1 debug messages>
Optimizing module clock_tree_design.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module T_ff.
<suppressed ~80 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 80 unused cells and 724 unused wires.
<suppressed ~322 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module clock_tree_design...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\I9.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I8.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I79.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I78.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I77.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I76.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I75.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I74.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I73.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I72.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I71.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I70.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I7.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I69.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I68.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I67.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I66.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I65.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I64.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I63.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I62.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I61.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I60.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I6.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I59.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I58.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I57.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I56.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I55.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I54.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I53.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I52.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I51.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I50.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I5.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I49.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I48.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I47.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I46.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I45.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I44.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I43.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I42.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I41.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I40.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I4.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I39.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I38.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I37.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I36.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I35.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I34.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I33.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I32.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I31.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I30.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I3.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I29.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I28.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I27.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I26.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I25.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I24.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I23.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I22.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I21.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I20.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I2.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I19.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I18.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I17.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I16.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I15.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I14.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I13.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I12.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I11.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I10.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I1.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I0.$verific$Q_reg$clock_tree_design.v:323$353 ($aldff) from module clock_tree_design.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

3.13.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 20 bits (of 80) from wire clock_tree_design.$verific$n365$2.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module clock_tree_design:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> stat

3.22. Printing statistics.

=== clock_tree_design ===

   Number of wires:                428
   Number of wire bits:            710
   Number of public wires:         421
   Number of public wire bits:     510
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                170
     $adff                          80
     $and                            3
     $bmux                           1
     $or                             3
     $xor                           83


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.23. Executing TECHMAP pass (map to technology primitives).

3.23.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.23.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.23.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $adff.
No more expansions possible.
<suppressed ~241 debug messages>

yosys> stat

3.24. Printing statistics.

=== clock_tree_design ===

   Number of wires:                430
   Number of wire bits:            770
   Number of public wires:         421
   Number of public wire bits:     510
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                400
     $_AND_                         60
     $_DFF_PN0_                     80
     $_MUX_                         60
     $_OR_                          60
     $_XOR_                        140


yosys> opt

3.25. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.25.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.25.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.25.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.25.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.25.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

3.25.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.25.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.25.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr

3.25.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

3.25.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_dff

3.26.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

3.26.5. Finished fast OPT passes.

yosys> memory_map

3.27. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_share

3.28.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.28.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr -full

3.28.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

3.28.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.29. Executing ABC pass (technology mapping using ABC).

3.29.1. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Extracted 320 gates and 404 wires to a netlist network with 83 inputs and 100 outputs.

3.29.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/yosys_verific_rs/result_04-05-2022T15-08-45/Golden_synth_rs_ade.json/clock_tree_design/abc_tmp.scr 
ABC:   #Luts =   100  Max Lvl =   1  Avg Lvl =   1.00  [   0.06 sec. at Pass 0]
ABC:   #Luts =   100  Max Lvl =   1  Avg Lvl =   1.00  [   0.46 sec. at Pass 1]
ABC:   #Luts =   100  Max Lvl =   1  Avg Lvl =   1.00  [   0.11 sec. at Pass 2]
ABC:   #Luts =   100  Max Lvl =   1  Avg Lvl =   1.00  [   0.22 sec. at Pass 3]
ABC:   #Luts =   100  Max Lvl =   1  Avg Lvl =   1.00  [   0.17 sec. at Pass 4]
ABC:   #Luts =   100  Max Lvl =   1  Avg Lvl =   1.00  [   0.27 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      100
ABC RESULTS:        internal signals:      221
ABC RESULTS:           input signals:       83
ABC RESULTS:          output signals:      100
Removing temp directory.

yosys> opt

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_dff

3.30.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 0 unused cells and 191 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.30.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

3.30.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.30.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.30.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_dff

3.30.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr

3.30.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

3.30.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.31. Printing statistics.

=== clock_tree_design ===

   Number of wires:                421
   Number of wire bits:            510
   Number of public wires:         421
   Number of public wire bits:     510
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                180
     $_DFF_PN0_                     80
     $lut                          100


yosys> shregmap -minlen 8 -maxlen 20

3.32. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.33. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.34. Printing statistics.

=== clock_tree_design ===

   Number of wires:                421
   Number of wire bits:            510
   Number of public wires:         421
   Number of public wire bits:     510
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                180
     $_DFF_PN0_                     80
     $lut                          100


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.35. Executing TECHMAP pass (map to technology primitives).

3.35.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.35.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.35.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
No more expansions possible.
<suppressed ~316 debug messages>

yosys> opt_expr -mux_undef

3.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.
<suppressed ~940 debug messages>

yosys> simplemap

3.37. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.38. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge

3.39. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
<suppressed ~417 debug messages>
Removed a total of 139 cells.

yosys> opt_dff -nodffe -nosdff

3.40. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.41. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 0 unused cells and 439 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.42. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.42.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.42.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.42.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.42.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.42.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr

3.42.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

3.42.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.43. Executing ABC pass (technology mapping using ABC).

3.43.1. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Extracted 421 gates and 506 wires to a netlist network with 83 inputs and 100 outputs.

3.43.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/yosys_verific_rs/result_04-05-2022T15-08-45/Golden_synth_rs_ade.json/clock_tree_design/abc_tmp.scr 
ABC:   #Luts =   100  Max Lvl =   1  Avg Lvl =   1.00  [   0.05 sec. at Pass 0]
ABC:   #Luts =   100  Max Lvl =   1  Avg Lvl =   1.00  [   0.46 sec. at Pass 1]
ABC:   #Luts =   100  Max Lvl =   1  Avg Lvl =   1.00  [   0.18 sec. at Pass 2]
ABC:   #Luts =   100  Max Lvl =   1  Avg Lvl =   1.00  [   0.23 sec. at Pass 3]
ABC:   #Luts =   100  Max Lvl =   1  Avg Lvl =   1.00  [   0.14 sec. at Pass 4]
ABC:   #Luts =   100  Max Lvl =   1  Avg Lvl =   1.00  [   0.29 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.43.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      100
ABC RESULTS:        internal signals:      323
ABC RESULTS:           input signals:       83
ABC RESULTS:          output signals:      100
Removing temp directory.

yosys> opt

3.44. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.44.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.44.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.44.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.44.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.44.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_dff

3.44.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.44.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 0 unused cells and 344 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.44.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

3.44.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.44.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.44.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.44.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_dff

3.44.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.44.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr

3.44.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

3.44.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.45. Executing HIERARCHY pass (managing design hierarchy).

3.45.1. Analyzing design hierarchy..
Top module:  \clock_tree_design

3.45.2. Analyzing design hierarchy..
Top module:  \clock_tree_design
Removed 0 unused modules.

yosys> stat

3.46. Printing statistics.

=== clock_tree_design ===

   Number of wires:                421
   Number of wire bits:            510
   Number of public wires:         421
   Number of public wire bits:     510
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                180
     $lut                          100
     dffsre                         80


yosys> opt_clean -purge

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 0 unused cells and 256 unused wires.
<suppressed ~256 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.48. Executing Verilog backend.

yosys> bmuxmap

3.48.1. Executing BMUXMAP pass.

yosys> demuxmap

3.48.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\clock_tree_design'.

End of script. Logfile hash: 9a00e5aa7f, CPU: user 1.06s system 0.02s, MEM: 20.62 MB peak
Yosys 0.16+6 (git sha1 7f5477eb1, gcc 9.1.0 -fPIC -Os)
Time spent: 94% 2x abc (18 sec), 1% 25x opt_expr (0 sec), ...
real 4.49
user 14.81
sys 4.63
