
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.8
 Yosys 0.16+6 (git sha1 7f5477eb1, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -sv prim_mubi_pkg.sv prim_secded_pkg.sv tl_main_pkg.sv top_pkg.sv tlul_pkg.sv prim_arbiter_ppc.sv prim_arbiter_tree.sv prim_fifo_async.sv prim_fifo_sync.sv prim_flop_2sync.sv tlul_err_resp.sv tlul_fifo_async.sv tlul_fifo_sync.sv tlul_socket_1n.sv tlul_socket_m1.sv xbar_main.sv

yosys> verific -sv prim_mubi_pkg.sv prim_secded_pkg.sv tl_main_pkg.sv top_pkg.sv tlul_pkg.sv prim_arbiter_ppc.sv prim_arbiter_tree.sv prim_fifo_async.sv prim_fifo_sync.sv prim_flop_2sync.sv tlul_err_resp.sv tlul_fifo_async.sv tlul_fifo_sync.sv tlul_socket_1n.sv tlul_socket_m1.sv xbar_main.sv

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_mubi_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:19: parameter 'MuBi4Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:148: parameter 'MuBi8Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:277: parameter 'MuBi12Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:406: parameter 'MuBi16Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_secded_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:81: parameter 'Secded2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:82: parameter 'Secded2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:90: parameter 'Secded2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:91: parameter 'Secded2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:99: parameter 'Secded3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:100: parameter 'Secded3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:108: parameter 'Secded6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:109: parameter 'Secded6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:117: parameter 'Secded7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:118: parameter 'Secded7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:126: parameter 'SecdedHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:127: parameter 'SecdedHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:135: parameter 'SecdedHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:136: parameter 'SecdedHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:144: parameter 'SecdedHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:145: parameter 'SecdedHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:153: parameter 'SecdedHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:154: parameter 'SecdedHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:162: parameter 'SecdedInv2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:163: parameter 'SecdedInv2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:171: parameter 'SecdedInv2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:172: parameter 'SecdedInv2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:180: parameter 'SecdedInv3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:181: parameter 'SecdedInv3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:189: parameter 'SecdedInv6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:190: parameter 'SecdedInv6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:198: parameter 'SecdedInv7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:199: parameter 'SecdedInv7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:207: parameter 'SecdedInvHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:208: parameter 'SecdedInvHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:216: parameter 'SecdedInvHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:217: parameter 'SecdedInvHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:225: parameter 'SecdedInvHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:226: parameter 'SecdedInvHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:234: parameter 'SecdedInvHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:235: parameter 'SecdedInvHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tl_main_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'top_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_pkg.sv'
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:14: parameter 'ArbiterImpl' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:27: parameter 'H2DCmdMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:28: parameter 'H2DCmdIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:29: parameter 'H2DCmdFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:30: parameter 'D2HRspMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:31: parameter 'D2HRspIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:32: parameter 'D2HRspFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:33: parameter 'DataMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:34: parameter 'DataIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:35: parameter 'DataFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:44: parameter 'TL_A_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:84: parameter 'TL_D_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_arbiter_ppc.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_arbiter_tree.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_fifo_async.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_fifo_sync.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_flop_2sync.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_err_resp.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_fifo_async.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_fifo_sync.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_socket_1n.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_socket_m1.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'xbar_main.sv'

yosys> synth_rs -top xbar_main -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.2.37

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top xbar_main

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] xbar_main.sv:120: compiling module 'xbar_main'
VERIFIC-INFO [VERI-1018] tlul_socket_1n.sv:43: compiling module 'tlul_socket_1n(HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=16'b0,DRspDepth=16'b0)'
VERIFIC-INFO [VERI-1018] tlul_fifo_sync.sv:9: compiling module 'tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b011)'
VERIFIC-INFO [VERI-1018] prim_fifo_sync.sv:6: compiling module 'prim_fifo_sync(Width=32'b01101110,Depth=32'b0)'
VERIFIC-INFO [VERI-1018] prim_fifo_sync.sv:6: compiling module 'prim_fifo_sync(Width=32'b01000001,Depth=32'b0)'
VERIFIC-INFO [VERI-1018] tlul_fifo_sync.sv:9: compiling module 'tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0)'
VERIFIC-INFO [VERI-1018] prim_fifo_sync.sv:6: compiling module 'prim_fifo_sync(Width=32'b01101100,Depth=32'b0)'
VERIFIC-INFO [VERI-1018] tlul_err_resp.sv:9: compiling module 'tlul_err_resp'
VERIFIC-INFO [VERI-1018] tlul_socket_m1.sv:24: compiling module 'tlul_socket_m1(M=32'b011,HReqDepth=12'b0,HRspDepth=12'b0,DReqDepth=4'b0,DRspDepth=4'b0)'
VERIFIC-INFO [VERI-1018] prim_arbiter_ppc.sv:27: compiling module 'prim_arbiter_ppc(N=32'b011,DW=32'b01101101)'
VERIFIC-INFO [VERI-1018] tlul_socket_m1.sv:24: compiling module 'tlul_socket_m1(M=32'b010,HReqDepth=8'b0,HRspDepth=8'b0,DReqPass=1'b0,DRspPass=1'b0)'
VERIFIC-INFO [VERI-1018] tlul_fifo_sync.sv:9: compiling module 'tlul_fifo_sync(ReqPass=32'b0,RspPass=32'b0,ReqDepth=32'b010,RspDepth=32'b010)'
VERIFIC-INFO [VERI-1018] prim_fifo_sync.sv:6: compiling module 'prim_fifo_sync(Width=32'b01101100,Pass=1'b0,Depth=32'b010)'
VERIFIC-INFO [VERI-2571] prim_fifo_sync.sv:112: extracting RAM for identifier 'storage'
VERIFIC-INFO [VERI-1018] prim_fifo_sync.sv:6: compiling module 'prim_fifo_sync(Width=32'b01000001,Pass=1'b0,Depth=32'b010)'
VERIFIC-INFO [VERI-2571] prim_fifo_sync.sv:112: extracting RAM for identifier 'storage'
VERIFIC-INFO [VERI-1018] prim_arbiter_ppc.sv:27: compiling module 'prim_arbiter_ppc(N=32'b010,DW=32'b01101101)'
VERIFIC-INFO [VERI-1018] tlul_socket_m1.sv:24: compiling module 'tlul_socket_m1(M=32'b011,HReqDepth=12'b0,HRspDepth=12'b0,DReqPass=1'b0,DRspPass=1'b0)'
VERIFIC-INFO [VERI-1018] tlul_socket_1n.sv:43: compiling module 'tlul_socket_1n(N=32'b010111,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=92'b0,DRspDepth=92'b0)'
VERIFIC-INFO [VERI-1018] tlul_fifo_sync.sv:9: compiling module 'tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101)'
VERIFIC-INFO [VERI-1018] prim_fifo_sync.sv:6: compiling module 'prim_fifo_sync(Width=32'b01110000,Depth=32'b0)'
VERIFIC-INFO [VERI-1018] tlul_socket_m1.sv:24: compiling module 'tlul_socket_m1(M=32'b010,HReqDepth=8'b0,HRspDepth=8'b0,DReqDepth=4'b0,DRspDepth=4'b0)'
VERIFIC-INFO [VERI-1018] tlul_fifo_async.sv:9: compiling module 'tlul_fifo_async(ReqDepth=32'b0100,RspDepth=32'b0100)'
VERIFIC-INFO [VERI-1018] prim_fifo_async.sv:8: compiling module 'prim_fifo_async(Width=32'b01101011,Depth=32'b0100)'
VERIFIC-INFO [VERI-2571] prim_fifo_async.sv:164: extracting RAM for identifier 'storage'
VERIFIC-WARNING [VERI-1209] prim_fifo_async.sv:187: expression size 4 truncated to fit in target size 3
VERIFIC-INFO [VERI-1018] prim_flop_2sync.sv:7: compiling module 'prim_flop_2sync(Width=3)'
VERIFIC-WARNING [VERI-1209] prim_fifo_async.sv:187: expression size 4 truncated to fit in target size 3
VERIFIC-INFO [VERI-1018] prim_fifo_async.sv:8: compiling module 'prim_fifo_async(Width=32'b01000000,Depth=32'b0100)'
VERIFIC-INFO [VERI-2571] prim_fifo_async.sv:164: extracting RAM for identifier 'storage'
VERIFIC-WARNING [VERI-1209] prim_fifo_async.sv:187: expression size 4 truncated to fit in target size 3
VERIFIC-WARNING [VERI-1209] prim_fifo_async.sv:187: expression size 4 truncated to fit in target size 3
VERIFIC-INFO [VERI-1018] tlul_socket_1n.sv:43: compiling module 'tlul_socket_1n(N=32'b010110,HReqPass=1'b0,HRspPass=1'b0,DReqDepth=88'b0,DRspDepth=88'b0)'
VERIFIC-INFO [VERI-1018] tlul_fifo_sync.sv:9: compiling module 'tlul_fifo_sync(ReqPass=32'b0,RspPass=32'b0,ReqDepth=32'b010,RspDepth=32'b010,SpareReqW=32'b0101)'
VERIFIC-INFO [VERI-1018] prim_fifo_sync.sv:6: compiling module 'prim_fifo_sync(Width=32'b01110000,Pass=1'b0,Depth=32'b010)'
VERIFIC-INFO [VERI-2571] prim_fifo_sync.sv:112: extracting RAM for identifier 'storage'
Importing module xbar_main.
Importing module tlul_fifo_async(ReqDepth=32'b0100,RspDepth=32'b0100).
Importing module prim_fifo_async(Width=32'b01000000,Depth=32'b0100).
Importing module prim_fifo_async(Width=32'b01101011,Depth=32'b0100).
Importing module prim_flop_2sync(Width=3).
Importing module tlul_socket_1n(HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=16'b0,DRspDepth=16'b0).
Importing module tlul_err_resp.
Importing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0).
Importing module prim_fifo_sync(Width=32'b01000001,Depth=32'b0).
Importing module prim_fifo_sync(Width=32'b01101100,Depth=32'b0).
Importing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b011).
Importing module prim_fifo_sync(Width=32'b01101110,Depth=32'b0).
Importing module tlul_socket_1n(N=32'b010110,HReqPass=1'b0,HRspPass=1'b0,DReqDepth=88'b0,DRspDepth=88'b0).
Importing module tlul_fifo_sync(ReqPass=32'b0,RspPass=32'b0,ReqDepth=32'b010,RspDepth=32'b010,SpareReqW=32'b0101).
Importing module prim_fifo_sync(Width=32'b01000001,Pass=1'b0,Depth=32'b010).
Importing module prim_fifo_sync(Width=32'b01110000,Pass=1'b0,Depth=32'b010).
Importing module tlul_socket_1n(N=32'b010111,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=92'b0,DRspDepth=92'b0).
Importing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101).
Importing module prim_fifo_sync(Width=32'b01110000,Depth=32'b0).
Importing module tlul_socket_m1(M=32'b010,HReqDepth=8'b0,HRspDepth=8'b0,DReqDepth=4'b0,DRspDepth=4'b0).
Importing module prim_arbiter_ppc(N=32'b010,DW=32'b01101101).
Importing module tlul_socket_m1(M=32'b010,HReqDepth=8'b0,HRspDepth=8'b0,DReqPass=1'b0,DRspPass=1'b0).
Importing module tlul_fifo_sync(ReqPass=32'b0,RspPass=32'b0,ReqDepth=32'b010,RspDepth=32'b010).
Importing module prim_fifo_sync(Width=32'b01101100,Pass=1'b0,Depth=32'b010).
Importing module tlul_socket_m1(M=32'b011,HReqDepth=12'b0,HRspDepth=12'b0,DReqDepth=4'b0,DRspDepth=4'b0).
Importing module prim_arbiter_ppc(N=32'b011,DW=32'b01101101).
Importing module tlul_socket_m1(M=32'b011,HReqDepth=12'b0,HRspDepth=12'b0,DReqPass=1'b0,DRspPass=1'b0).

3.3.1. Analyzing design hierarchy..
Top module:  \xbar_main
Used module:     \tlul_socket_1n(N=32'b010110,HReqPass=1'b0,HRspPass=1'b0,DReqDepth=88'b0,DRspDepth=88'b0)
Used module:         \tlul_err_resp
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0)
Used module:             \prim_fifo_sync(Width=32'b01000001,Depth=32'b0)
Used module:             \prim_fifo_sync(Width=32'b01101100,Depth=32'b0)
Used module:         \tlul_fifo_sync(ReqPass=32'b0,RspPass=32'b0,ReqDepth=32'b010,RspDepth=32'b010,SpareReqW=32'b0101)
Used module:             \prim_fifo_sync(Width=32'b01000001,Pass=1'b0,Depth=32'b010)
Used module:             \prim_fifo_sync(Width=32'b01110000,Pass=1'b0,Depth=32'b010)
Used module:     \tlul_socket_m1(M=32'b010,HReqDepth=8'b0,HRspDepth=8'b0,DReqPass=1'b0,DRspPass=1'b0)
Used module:         \prim_arbiter_ppc(N=32'b010,DW=32'b01101101)
Used module:         \tlul_fifo_sync(ReqPass=32'b0,RspPass=32'b0,ReqDepth=32'b010,RspDepth=32'b010)
Used module:             \prim_fifo_sync(Width=32'b01101100,Pass=1'b0,Depth=32'b010)
Used module:     \tlul_socket_m1(M=32'b010,HReqDepth=8'b0,HRspDepth=8'b0,DReqDepth=4'b0,DRspDepth=4'b0)
Used module:     \tlul_fifo_async(ReqDepth=32'b0100,RspDepth=32'b0100)
Used module:         \prim_fifo_async(Width=32'b01000000,Depth=32'b0100)
Used module:             \prim_flop_2sync(Width=3)
Used module:         \prim_fifo_async(Width=32'b01101011,Depth=32'b0100)
Used module:     \tlul_socket_1n(N=32'b010111,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=92'b0,DRspDepth=92'b0)
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101)
Used module:             \prim_fifo_sync(Width=32'b01110000,Depth=32'b0)
Used module:     \tlul_socket_m1(M=32'b011,HReqDepth=12'b0,HRspDepth=12'b0,DReqPass=1'b0,DRspPass=1'b0)
Used module:         \prim_arbiter_ppc(N=32'b011,DW=32'b01101101)
Used module:     \tlul_socket_m1(M=32'b011,HReqDepth=12'b0,HRspDepth=12'b0,DReqDepth=4'b0,DRspDepth=4'b0)
Used module:     \tlul_socket_1n(HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=16'b0,DRspDepth=16'b0)
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b011)
Used module:             \prim_fifo_sync(Width=32'b01101110,Depth=32'b0)

3.3.2. Analyzing design hierarchy..
Top module:  \xbar_main
Used module:     \tlul_socket_1n(N=32'b010110,HReqPass=1'b0,HRspPass=1'b0,DReqDepth=88'b0,DRspDepth=88'b0)
Used module:         \tlul_err_resp
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0)
Used module:             \prim_fifo_sync(Width=32'b01000001,Depth=32'b0)
Used module:             \prim_fifo_sync(Width=32'b01101100,Depth=32'b0)
Used module:         \tlul_fifo_sync(ReqPass=32'b0,RspPass=32'b0,ReqDepth=32'b010,RspDepth=32'b010,SpareReqW=32'b0101)
Used module:             \prim_fifo_sync(Width=32'b01000001,Pass=1'b0,Depth=32'b010)
Used module:             \prim_fifo_sync(Width=32'b01110000,Pass=1'b0,Depth=32'b010)
Used module:     \tlul_socket_m1(M=32'b010,HReqDepth=8'b0,HRspDepth=8'b0,DReqPass=1'b0,DRspPass=1'b0)
Used module:         \prim_arbiter_ppc(N=32'b010,DW=32'b01101101)
Used module:         \tlul_fifo_sync(ReqPass=32'b0,RspPass=32'b0,ReqDepth=32'b010,RspDepth=32'b010)
Used module:             \prim_fifo_sync(Width=32'b01101100,Pass=1'b0,Depth=32'b010)
Used module:     \tlul_socket_m1(M=32'b010,HReqDepth=8'b0,HRspDepth=8'b0,DReqDepth=4'b0,DRspDepth=4'b0)
Used module:     \tlul_fifo_async(ReqDepth=32'b0100,RspDepth=32'b0100)
Used module:         \prim_fifo_async(Width=32'b01000000,Depth=32'b0100)
Used module:             \prim_flop_2sync(Width=3)
Used module:         \prim_fifo_async(Width=32'b01101011,Depth=32'b0100)
Used module:     \tlul_socket_1n(N=32'b010111,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=92'b0,DRspDepth=92'b0)
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101)
Used module:             \prim_fifo_sync(Width=32'b01110000,Depth=32'b0)
Used module:     \tlul_socket_m1(M=32'b011,HReqDepth=12'b0,HRspDepth=12'b0,DReqPass=1'b0,DRspPass=1'b0)
Used module:         \prim_arbiter_ppc(N=32'b011,DW=32'b01101101)
Used module:     \tlul_socket_m1(M=32'b011,HReqDepth=12'b0,HRspDepth=12'b0,DReqDepth=4'b0,DRspDepth=4'b0)
Used module:     \tlul_socket_1n(HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=16'b0,DRspDepth=16'b0)
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b011)
Used module:             \prim_fifo_sync(Width=32'b01101110,Depth=32'b0)
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module tlul_socket_m1(M=32'b011,HReqDepth=12'b0,HRspDepth=12'b0,DReqPass=1'b0,DRspPass=1'b0).
<suppressed ~4 debug messages>
Optimizing module prim_arbiter_ppc(N=32'b011,DW=32'b01101101).
<suppressed ~2 debug messages>
Optimizing module tlul_socket_m1(M=32'b011,HReqDepth=12'b0,HRspDepth=12'b0,DReqDepth=4'b0,DRspDepth=4'b0).
<suppressed ~4 debug messages>
Optimizing module prim_fifo_sync(Width=32'b01101100,Pass=1'b0,Depth=32'b010).
<suppressed ~3 debug messages>
Optimizing module tlul_fifo_sync(ReqPass=32'b0,RspPass=32'b0,ReqDepth=32'b010,RspDepth=32'b010).
Optimizing module tlul_socket_m1(M=32'b010,HReqDepth=8'b0,HRspDepth=8'b0,DReqPass=1'b0,DRspPass=1'b0).
Optimizing module prim_arbiter_ppc(N=32'b010,DW=32'b01101101).
<suppressed ~2 debug messages>
Optimizing module tlul_socket_m1(M=32'b010,HReqDepth=8'b0,HRspDepth=8'b0,DReqDepth=4'b0,DRspDepth=4'b0).
Optimizing module prim_fifo_sync(Width=32'b01110000,Depth=32'b0).
Optimizing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101).
Optimizing module tlul_socket_1n(N=32'b010111,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=92'b0,DRspDepth=92'b0).
<suppressed ~7 debug messages>
Optimizing module prim_fifo_sync(Width=32'b01110000,Pass=1'b0,Depth=32'b010).
<suppressed ~3 debug messages>
Optimizing module prim_fifo_sync(Width=32'b01000001,Pass=1'b0,Depth=32'b010).
<suppressed ~3 debug messages>
Optimizing module tlul_fifo_sync(ReqPass=32'b0,RspPass=32'b0,ReqDepth=32'b010,RspDepth=32'b010,SpareReqW=32'b0101).
Optimizing module tlul_socket_1n(N=32'b010110,HReqPass=1'b0,HRspPass=1'b0,DReqDepth=88'b0,DRspDepth=88'b0).
<suppressed ~7 debug messages>
Optimizing module prim_fifo_sync(Width=32'b01101110,Depth=32'b0).
Optimizing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b011).
Optimizing module prim_fifo_sync(Width=32'b01101100,Depth=32'b0).
Optimizing module prim_fifo_sync(Width=32'b01000001,Depth=32'b0).
Optimizing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0).
Optimizing module tlul_err_resp.
<suppressed ~11 debug messages>
Optimizing module tlul_socket_1n(HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=16'b0,DRspDepth=16'b0).
<suppressed ~7 debug messages>
Optimizing module prim_flop_2sync(Width=3).
<suppressed ~3 debug messages>
Optimizing module prim_fifo_async(Width=32'b01101011,Depth=32'b0100).
<suppressed ~8 debug messages>
Optimizing module prim_fifo_async(Width=32'b01000000,Depth=32'b0100).
<suppressed ~8 debug messages>
Optimizing module tlul_fifo_async(ReqDepth=32'b0100,RspDepth=32'b0100).
Optimizing module xbar_main.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module tlul_socket_m1(M=32'b011,HReqDepth=12'b0,HRspDepth=12'b0,DReqPass=1'b0,DRspPass=1'b0).
Deleting now unused module prim_arbiter_ppc(N=32'b011,DW=32'b01101101).
Deleting now unused module tlul_socket_m1(M=32'b011,HReqDepth=12'b0,HRspDepth=12'b0,DReqDepth=4'b0,DRspDepth=4'b0).
Deleting now unused module prim_fifo_sync(Width=32'b01101100,Pass=1'b0,Depth=32'b010).
Deleting now unused module tlul_fifo_sync(ReqPass=32'b0,RspPass=32'b0,ReqDepth=32'b010,RspDepth=32'b010).
Deleting now unused module tlul_socket_m1(M=32'b010,HReqDepth=8'b0,HRspDepth=8'b0,DReqPass=1'b0,DRspPass=1'b0).
Deleting now unused module prim_arbiter_ppc(N=32'b010,DW=32'b01101101).
Deleting now unused module tlul_socket_m1(M=32'b010,HReqDepth=8'b0,HRspDepth=8'b0,DReqDepth=4'b0,DRspDepth=4'b0).
Deleting now unused module prim_fifo_sync(Width=32'b01110000,Depth=32'b0).
Deleting now unused module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101).
Deleting now unused module tlul_socket_1n(N=32'b010111,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=92'b0,DRspDepth=92'b0).
Deleting now unused module prim_fifo_sync(Width=32'b01110000,Pass=1'b0,Depth=32'b010).
Deleting now unused module prim_fifo_sync(Width=32'b01000001,Pass=1'b0,Depth=32'b010).
Deleting now unused module tlul_fifo_sync(ReqPass=32'b0,RspPass=32'b0,ReqDepth=32'b010,RspDepth=32'b010,SpareReqW=32'b0101).
Deleting now unused module tlul_socket_1n(N=32'b010110,HReqPass=1'b0,HRspPass=1'b0,DReqDepth=88'b0,DRspDepth=88'b0).
Deleting now unused module prim_fifo_sync(Width=32'b01101110,Depth=32'b0).
Deleting now unused module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b011).
Deleting now unused module prim_fifo_sync(Width=32'b01101100,Depth=32'b0).
Deleting now unused module prim_fifo_sync(Width=32'b01000001,Depth=32'b0).
Deleting now unused module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0).
Deleting now unused module tlul_err_resp.
Deleting now unused module tlul_socket_1n(HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=16'b0,DRspDepth=16'b0).
Deleting now unused module prim_flop_2sync(Width=3).
Deleting now unused module prim_fifo_async(Width=32'b01101011,Depth=32'b0100).
Deleting now unused module prim_fifo_async(Width=32'b01000000,Depth=32'b0100).
Deleting now unused module tlul_fifo_async(ReqDepth=32'b0100,RspDepth=32'b0100).
<suppressed ~118 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.
<suppressed ~68 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 393 unused cells and 123712 unused wires.
<suppressed ~3898 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module xbar_main...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.
<suppressed ~39 debug messages>

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
<suppressed ~309 debug messages>
Removed a total of 103 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
      Replacing known input bits on port A of cell $flatten\u_asf_36.\reqfifo.$verific$mux_38$prim_fifo_async.sv:183$23872: $flatten\u_asf_36.\reqfifo.$verific$n26$23785 -> { 1'0 $flatten\u_asf_36.\reqfifo.$verific$n26$23785 [1:0] }
      Replacing known input bits on port A of cell $flatten\u_asf_36.\reqfifo.$verific$mux_85$prim_fifo_async.sv:183$23909: $flatten\u_asf_36.\reqfifo.$verific$n168$23809 -> { 1'0 $flatten\u_asf_36.\reqfifo.$verific$n168$23809 [1:0] }
      Replacing known input bits on port A of cell $flatten\u_asf_36.\rspfifo.$verific$mux_38$prim_fifo_async.sv:183$23663: $flatten\u_asf_36.\rspfifo.$verific$n26$23576 -> { 1'0 $flatten\u_asf_36.\rspfifo.$verific$n26$23576 [1:0] }
      Replacing known input bits on port A of cell $flatten\u_asf_36.\rspfifo.$verific$mux_85$prim_fifo_async.sv:183$23700: $flatten\u_asf_36.\rspfifo.$verific$n168$23600 -> { 1'0 $flatten\u_asf_36.\rspfifo.$verific$n168$23600 [1:0] }
      Replacing known input bits on port A of cell $flatten\u_asf_38.\reqfifo.$verific$mux_38$prim_fifo_async.sv:183$23872: $flatten\u_asf_38.\reqfifo.$verific$n26$23785 -> { 1'0 $flatten\u_asf_38.\reqfifo.$verific$n26$23785 [1:0] }
      Replacing known input bits on port A of cell $flatten\u_asf_38.\reqfifo.$verific$mux_85$prim_fifo_async.sv:183$23909: $flatten\u_asf_38.\reqfifo.$verific$n168$23809 -> { 1'0 $flatten\u_asf_38.\reqfifo.$verific$n168$23809 [1:0] }
      Replacing known input bits on port A of cell $flatten\u_asf_38.\rspfifo.$verific$mux_38$prim_fifo_async.sv:183$23663: $flatten\u_asf_38.\rspfifo.$verific$n26$23576 -> { 1'0 $flatten\u_asf_38.\rspfifo.$verific$n26$23576 [1:0] }
      Replacing known input bits on port A of cell $flatten\u_asf_38.\rspfifo.$verific$mux_85$prim_fifo_async.sv:183$23700: $flatten\u_asf_38.\rspfifo.$verific$n168$23600 -> { 1'0 $flatten\u_asf_38.\rspfifo.$verific$n168$23600 [1:0] }
      Replacing known input bits on port A of cell $flatten\u_asf_34.\reqfifo.$verific$mux_38$prim_fifo_async.sv:183$23872: $flatten\u_asf_34.\reqfifo.$verific$n26$23785 -> { 1'0 $flatten\u_asf_34.\reqfifo.$verific$n26$23785 [1:0] }
      Replacing known input bits on port A of cell $flatten\u_asf_34.\reqfifo.$verific$mux_85$prim_fifo_async.sv:183$23909: $flatten\u_asf_34.\reqfifo.$verific$n168$23809 -> { 1'0 $flatten\u_asf_34.\reqfifo.$verific$n168$23809 [1:0] }
      Replacing known input bits on port A of cell $flatten\u_asf_34.\rspfifo.$verific$mux_38$prim_fifo_async.sv:183$23663: $flatten\u_asf_34.\rspfifo.$verific$n26$23576 -> { 1'0 $flatten\u_asf_34.\rspfifo.$verific$n26$23576 [1:0] }
      Replacing known input bits on port A of cell $flatten\u_asf_34.\rspfifo.$verific$mux_85$prim_fifo_async.sv:183$23700: $flatten\u_asf_34.\rspfifo.$verific$n168$23600 -> { 1'0 $flatten\u_asf_34.\rspfifo.$verific$n168$23600 [1:0] }
  Analyzing evaluation results.
    dead port 2/2 on $mux $flatten\u_sm1_27.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_27.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_27.\gen_host_fifo[2].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_27.\u_devicefifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_28.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_28.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_29.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_29.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_29.\gen_host_fifo[2].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_29.\u_devicefifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_30.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_30.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_30.\gen_host_fifo[2].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_32.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_32.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_32.\u_devicefifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_33.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_33.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_35.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_35.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_35.\u_devicefifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_37.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_37.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_37.\u_devicefifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_39.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_39.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_39.\u_devicefifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_40.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_40.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_41.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_41.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_42.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_42.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_43.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_43.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_44.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_44.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_45.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_45.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_46.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_46.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_47.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_47.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_48.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_48.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_49.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_49.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_50.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_50.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_51.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_51.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_52.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_52.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_52.\u_devicefifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_53.\gen_host_fifo[0].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
    dead port 2/2 on $mux $flatten\u_sm1_53.\gen_host_fifo[1].u_hostfifo.$verific$mux_4$tlul_fifo_sync.sv:76$26540.
Removed 56 multiplexer ports.
<suppressed ~310 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
<suppressed ~78 debug messages>
Removed a total of 26 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_53.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_52.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_51.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\reqfifo.$verific$fifo_wptr_reg$prim_fifo_async.sv:64$23865 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_50.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\reqfifo.$verific$fifo_wptr_gray_reg$prim_fifo_async.sv:76$23879 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\reqfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23932 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\reqfifo.$verific$fifo_rptr_reg$prim_fifo_async.sv:99$23903 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_49.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\reqfifo.$verific$fifo_rptr_gray_reg$prim_fifo_async.sv:111$23915 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_48.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_47.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\rspfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_46.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\rspfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\rspfifo.$verific$fifo_wptr_reg$prim_fifo_async.sv:64$23656 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\rspfifo.\sync_rptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\rspfifo.$verific$fifo_wptr_gray_reg$prim_fifo_async.sv:76$23670 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\rspfifo.\sync_rptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\reqfifo.$verific$fifo_wptr_reg$prim_fifo_async.sv:64$23865 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_45.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\rspfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23723 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\rspfifo.$verific$fifo_rptr_reg$prim_fifo_async.sv:99$23694 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\reqfifo.$verific$fifo_wptr_gray_reg$prim_fifo_async.sv:76$23879 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_44.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\rspfifo.$verific$fifo_rptr_gray_reg$prim_fifo_async.sv:111$23706 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\reqfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23932 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_43.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\reqfifo.$verific$fifo_rptr_reg$prim_fifo_async.sv:99$23903 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_42.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\reqfifo.$verific$fifo_rptr_gray_reg$prim_fifo_async.sv:111$23915 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_41.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_40.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\reqfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\reqfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\reqfifo.\sync_rptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_39.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\reqfifo.\sync_rptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_37.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_35.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_33.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_32.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\rspfifo.$verific$fifo_wptr_reg$prim_fifo_async.sv:64$23656 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\rspfifo.$verific$fifo_wptr_gray_reg$prim_fifo_async.sv:76$23670 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\rspfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23723 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_30.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$51486 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\rspfifo.$verific$fifo_rptr_reg$prim_fifo_async.sv:99$23694 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\rspfifo.$verific$fifo_rptr_gray_reg$prim_fifo_async.sv:111$23706 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_29.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$51486 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_28.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\reqfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\reqfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_sm1_27.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$51486 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_54.\gen_err_resp.err_resp.$verific$err_source_reg$tlul_err_resp.sv:35$26150 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_54.\gen_err_resp.err_resp.$verific$err_size_reg$tlul_err_resp.sv:35$26152 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_54.\gen_err_resp.err_resp.$verific$err_rsp_pending_reg$tlul_err_resp.sv:56$26172 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_54.\gen_err_resp.err_resp.$verific$err_req_pending_reg$tlul_err_resp.sv:35$26149 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_54.\gen_err_resp.err_resp.$verific$err_opcode_reg$tlul_err_resp.sv:35$26151 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\reqfifo.\sync_rptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_34.\reqfifo.\sync_rptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\rspfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\rspfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\rspfifo.\sync_rptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_36.\rspfifo.\sync_rptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36424 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36430 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_54.$verific$num_req_outstanding_reg$tlul_socket_1n.sv:123$27510 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_54.$verific$dev_select_outstanding_reg$tlul_socket_1n.sv:123$27511 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_31.\gen_err_resp.err_resp.$verific$err_source_reg$tlul_err_resp.sv:35$26150 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_31.\gen_err_resp.err_resp.$verific$err_size_reg$tlul_err_resp.sv:35$26152 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_31.\gen_err_resp.err_resp.$verific$err_rsp_pending_reg$tlul_err_resp.sv:56$26172 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_31.\gen_err_resp.err_resp.$verific$err_req_pending_reg$tlul_err_resp.sv:35$26149 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_31.\gen_err_resp.err_resp.$verific$err_opcode_reg$tlul_err_resp.sv:35$26151 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_31.$verific$num_req_outstanding_reg$tlul_socket_1n.sv:123$37028 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_31.$verific$dev_select_outstanding_reg$tlul_socket_1n.sv:123$37029 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_26.\gen_err_resp.err_resp.$verific$err_source_reg$tlul_err_resp.sv:35$26150 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_26.\gen_err_resp.err_resp.$verific$err_size_reg$tlul_err_resp.sv:35$26152 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_26.\gen_err_resp.err_resp.$verific$err_rsp_pending_reg$tlul_err_resp.sv:56$26172 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_26.\gen_err_resp.err_resp.$verific$err_req_pending_reg$tlul_err_resp.sv:35$26149 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_26.\gen_err_resp.err_resp.$verific$err_opcode_reg$tlul_err_resp.sv:35$26151 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_26.$verific$num_req_outstanding_reg$tlul_socket_1n.sv:123$24408 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_s1n_26.$verific$dev_select_outstanding_reg$tlul_socket_1n.sv:123$24409 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\rspfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\rspfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\rspfifo.\sync_rptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\rspfifo.\sync_rptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\rspfifo.$verific$fifo_wptr_reg$prim_fifo_async.sv:64$23656 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\rspfifo.$verific$fifo_wptr_gray_reg$prim_fifo_async.sv:76$23670 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\rspfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23723 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\rspfifo.$verific$fifo_rptr_reg$prim_fifo_async.sv:99$23694 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\rspfifo.$verific$fifo_rptr_gray_reg$prim_fifo_async.sv:111$23706 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\reqfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\reqfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\reqfifo.\sync_rptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\reqfifo.\sync_rptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\reqfifo.$verific$fifo_wptr_reg$prim_fifo_async.sv:64$23865 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\reqfifo.$verific$fifo_wptr_gray_reg$prim_fifo_async.sv:76$23879 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\reqfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23932 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\reqfifo.$verific$fifo_rptr_reg$prim_fifo_async.sv:99$23903 ($aldff) from module xbar_main.
Changing const-value async load to async reset on $flatten\u_asf_38.\reqfifo.$verific$fifo_rptr_gray_reg$prim_fifo_async.sv:111$23915 ($aldff) from module xbar_main.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 0 unused cells and 121 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~326 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~326 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_53.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_53.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_53.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_52.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_52.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_52.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_51.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_51.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_51.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_50.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_50.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_50.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_49.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_49.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_49.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_48.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_48.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_48.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_47.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_47.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_47.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_46.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_46.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_46.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_45.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_45.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_45.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_44.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_44.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_44.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_43.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_43.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_43.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_42.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_42.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_42.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_41.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_41.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_41.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_40.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_40.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_40.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_39.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_39.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_39.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_37.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_37.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_37.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_35.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_35.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_35.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_33.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_33.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_33.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_32.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_32.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_32.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_30.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$51486 ($adff) from module xbar_main (D = $flatten\u_sm1_30.\gen_arb_ppc.u_reqarb.$verific$n103$51455, Q = \u_sm1_30.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_29.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$51486 ($adff) from module xbar_main (D = $flatten\u_sm1_29.\gen_arb_ppc.u_reqarb.$verific$n103$51455, Q = \u_sm1_29.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$n58$36301, Q = \u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$n91$36307, Q = \u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$49515 ($adff) from module xbar_main (D = $flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$n58$49474, Q = \u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$49521 ($adff) from module xbar_main (D = $flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$n91$49480, Q = \u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_sm1_28.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$47650 ($adff) from module xbar_main (D = $flatten\u_sm1_28.\gen_arb_ppc.u_reqarb.$verific$n88$47622, Q = \u_sm1_28.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_sm1_27.\gen_arb_ppc.u_reqarb.$verific$gen_normal_case.mask_reg$prim_arbiter_ppc.sv:100$51486 ($adff) from module xbar_main (D = $flatten\u_sm1_27.\gen_arb_ppc.u_reqarb.$verific$n103$51455, Q = \u_sm1_27.gen_arb_ppc.u_reqarb.gen_normal_case.mask).
Adding EN signal on $flatten\u_s1n_54.\gen_err_resp.err_resp.$verific$err_source_reg$tlul_err_resp.sv:35$26150 ($adff) from module xbar_main (D = \u_s1n_54.fifo_h.reqfifo.rdata_o [103:96], Q = \u_s1n_54.gen_err_resp.err_resp.err_source).
Adding EN signal on $flatten\u_s1n_54.\gen_err_resp.err_resp.$verific$err_size_reg$tlul_err_resp.sv:35$26152 ($adff) from module xbar_main (D = \u_s1n_54.fifo_h.reqfifo.rdata_o [105:104], Q = \u_s1n_54.gen_err_resp.err_resp.err_size).
Adding EN signal on $flatten\u_s1n_54.\gen_err_resp.err_resp.$verific$err_req_pending_reg$tlul_err_resp.sv:35$26149 ($adff) from module xbar_main (D = $flatten\u_s1n_54.\gen_err_resp.err_resp.$verific$n45$26113, Q = \u_s1n_54.gen_err_resp.err_resp.err_req_pending).
Adding EN signal on $flatten\u_s1n_54.\gen_err_resp.err_resp.$verific$err_opcode_reg$tlul_err_resp.sv:35$26151 ($adff) from module xbar_main (D = \u_s1n_54.fifo_h.reqfifo.rdata_o [111:109], Q = \u_s1n_54.gen_err_resp.err_resp.err_opcode).
Adding EN signal on $flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36342 ($adff) from module xbar_main (D = $flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$n58$36301, Q = \u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36348 ($adff) from module xbar_main (D = $flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$n91$36307, Q = \u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$gen_normal_fifo.fifo_wptr_reg$prim_fifo_sync.sv:89$36424 ($adff) from module xbar_main (D = $flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$n58$36383, Q = \u_s1n_54.fifo_h.reqfifo.gen_normal_fifo.fifo_wptr).
Adding EN signal on $flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$gen_normal_fifo.fifo_rptr_reg$prim_fifo_sync.sv:103$36430 ($adff) from module xbar_main (D = $flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$n91$36389, Q = \u_s1n_54.fifo_h.reqfifo.gen_normal_fifo.fifo_rptr).
Adding EN signal on $flatten\u_s1n_54.$verific$num_req_outstanding_reg$tlul_socket_1n.sv:123$27510 ($adff) from module xbar_main (D = $flatten\u_s1n_54.$verific$n215$27083, Q = \u_s1n_54.num_req_outstanding).
Adding EN signal on $flatten\u_s1n_54.$verific$dev_select_outstanding_reg$tlul_socket_1n.sv:123$27511 ($adff) from module xbar_main (D = \u_s1n_54.fifo_h.reqfifo.rdata_o [4:0], Q = \u_s1n_54.dev_select_outstanding).
Adding EN signal on $flatten\u_s1n_31.\gen_err_resp.err_resp.$verific$err_source_reg$tlul_err_resp.sv:35$26150 ($adff) from module xbar_main (D = \tl_rv_core_ibex__cored_i.a_source, Q = \u_s1n_31.gen_err_resp.err_resp.err_source).
Adding EN signal on $flatten\u_s1n_31.\gen_err_resp.err_resp.$verific$err_size_reg$tlul_err_resp.sv:35$26152 ($adff) from module xbar_main (D = \tl_rv_core_ibex__cored_i.a_size, Q = \u_s1n_31.gen_err_resp.err_resp.err_size).
Adding EN signal on $flatten\u_s1n_31.\gen_err_resp.err_resp.$verific$err_req_pending_reg$tlul_err_resp.sv:35$26149 ($adff) from module xbar_main (D = $flatten\u_s1n_31.\gen_err_resp.err_resp.$verific$n45$26113, Q = \u_s1n_31.gen_err_resp.err_resp.err_req_pending).
Adding EN signal on $flatten\u_s1n_31.\gen_err_resp.err_resp.$verific$err_opcode_reg$tlul_err_resp.sv:35$26151 ($adff) from module xbar_main (D = \tl_rv_core_ibex__cored_i.a_opcode, Q = \u_s1n_31.gen_err_resp.err_resp.err_opcode).
Adding EN signal on $flatten\u_s1n_31.$verific$num_req_outstanding_reg$tlul_socket_1n.sv:123$37028 ($adff) from module xbar_main (D = $flatten\u_s1n_31.$verific$n215$36599, Q = \u_s1n_31.num_req_outstanding).
Adding EN signal on $flatten\u_s1n_31.$verific$dev_select_outstanding_reg$tlul_socket_1n.sv:123$37029 ($adff) from module xbar_main (D = \u_s1n_31.dev_select_t, Q = \u_s1n_31.dev_select_outstanding).
Adding EN signal on $flatten\u_s1n_26.\gen_err_resp.err_resp.$verific$err_source_reg$tlul_err_resp.sv:35$26150 ($adff) from module xbar_main (D = \tl_rv_core_ibex__corei_i.a_source, Q = \u_s1n_26.gen_err_resp.err_resp.err_source).
Adding EN signal on $flatten\u_s1n_26.\gen_err_resp.err_resp.$verific$err_size_reg$tlul_err_resp.sv:35$26152 ($adff) from module xbar_main (D = \tl_rv_core_ibex__corei_i.a_size, Q = \u_s1n_26.gen_err_resp.err_resp.err_size).
Adding EN signal on $flatten\u_s1n_26.\gen_err_resp.err_resp.$verific$err_req_pending_reg$tlul_err_resp.sv:35$26149 ($adff) from module xbar_main (D = $flatten\u_s1n_26.\gen_err_resp.err_resp.$verific$n45$26113, Q = \u_s1n_26.gen_err_resp.err_resp.err_req_pending).
Adding EN signal on $flatten\u_s1n_26.\gen_err_resp.err_resp.$verific$err_opcode_reg$tlul_err_resp.sv:35$26151 ($adff) from module xbar_main (D = \tl_rv_core_ibex__corei_i.a_opcode, Q = \u_s1n_26.gen_err_resp.err_resp.err_opcode).
Adding EN signal on $flatten\u_s1n_26.$verific$num_req_outstanding_reg$tlul_socket_1n.sv:123$24408 ($adff) from module xbar_main (D = $flatten\u_s1n_26.$verific$n209$24021, Q = \u_s1n_26.num_req_outstanding).
Adding EN signal on $flatten\u_s1n_26.$verific$dev_select_outstanding_reg$tlul_socket_1n.sv:123$24409 ($adff) from module xbar_main (D = \u_s1n_26.dev_select_t, Q = \u_s1n_26.dev_select_outstanding).
Adding EN signal on $flatten\u_asf_38.\rspfifo.$verific$fifo_wptr_reg$prim_fifo_async.sv:64$23656 ($adff) from module xbar_main (D = $flatten\u_asf_38.\rspfifo.$verific$n34$23578, Q = \u_asf_38.rspfifo.fifo_wptr).
Adding EN signal on $flatten\u_asf_38.\rspfifo.$verific$fifo_wptr_gray_reg$prim_fifo_async.sv:76$23670 ($adff) from module xbar_main (D = $flatten\u_asf_38.\rspfifo.$verific$n112$23593, Q = \u_asf_38.rspfifo.fifo_wptr_gray).
Adding EN signal on $flatten\u_asf_38.\rspfifo.$verific$fifo_rptr_reg$prim_fifo_async.sv:99$23694 ($adff) from module xbar_main (D = $flatten\u_asf_38.\rspfifo.$verific$n176$23602, Q = \u_asf_38.rspfifo.fifo_rptr).
Adding EN signal on $flatten\u_asf_38.\rspfifo.$verific$fifo_rptr_gray_reg$prim_fifo_async.sv:111$23706 ($adff) from module xbar_main (D = $flatten\u_asf_38.\rspfifo.$verific$n254$23617, Q = \u_asf_38.rspfifo.fifo_rptr_gray).
Adding EN signal on $flatten\u_asf_38.\reqfifo.$verific$fifo_wptr_reg$prim_fifo_async.sv:64$23865 ($adff) from module xbar_main (D = $flatten\u_asf_38.\reqfifo.$verific$n34$23787, Q = \u_asf_38.reqfifo.fifo_wptr).
Adding EN signal on $flatten\u_asf_38.\reqfifo.$verific$fifo_wptr_gray_reg$prim_fifo_async.sv:76$23879 ($adff) from module xbar_main (D = $flatten\u_asf_38.\reqfifo.$verific$n112$23802, Q = \u_asf_38.reqfifo.fifo_wptr_gray).
Adding EN signal on $flatten\u_asf_38.\reqfifo.$verific$fifo_rptr_reg$prim_fifo_async.sv:99$23903 ($adff) from module xbar_main (D = $flatten\u_asf_38.\reqfifo.$verific$n176$23811, Q = \u_asf_38.reqfifo.fifo_rptr).
Adding EN signal on $flatten\u_asf_38.\reqfifo.$verific$fifo_rptr_gray_reg$prim_fifo_async.sv:111$23915 ($adff) from module xbar_main (D = $flatten\u_asf_38.\reqfifo.$verific$n254$23826, Q = \u_asf_38.reqfifo.fifo_rptr_gray).
Adding EN signal on $flatten\u_asf_36.\rspfifo.$verific$fifo_wptr_reg$prim_fifo_async.sv:64$23656 ($adff) from module xbar_main (D = $flatten\u_asf_36.\rspfifo.$verific$n34$23578, Q = \u_asf_36.rspfifo.fifo_wptr).
Adding EN signal on $flatten\u_asf_36.\rspfifo.$verific$fifo_wptr_gray_reg$prim_fifo_async.sv:76$23670 ($adff) from module xbar_main (D = $flatten\u_asf_36.\rspfifo.$verific$n112$23593, Q = \u_asf_36.rspfifo.fifo_wptr_gray).
Adding EN signal on $flatten\u_asf_36.\rspfifo.$verific$fifo_rptr_reg$prim_fifo_async.sv:99$23694 ($adff) from module xbar_main (D = $flatten\u_asf_36.\rspfifo.$verific$n176$23602, Q = \u_asf_36.rspfifo.fifo_rptr).
Adding EN signal on $flatten\u_asf_36.\rspfifo.$verific$fifo_rptr_gray_reg$prim_fifo_async.sv:111$23706 ($adff) from module xbar_main (D = $flatten\u_asf_36.\rspfifo.$verific$n254$23617, Q = \u_asf_36.rspfifo.fifo_rptr_gray).
Adding EN signal on $flatten\u_asf_36.\reqfifo.$verific$fifo_wptr_reg$prim_fifo_async.sv:64$23865 ($adff) from module xbar_main (D = $flatten\u_asf_36.\reqfifo.$verific$n34$23787, Q = \u_asf_36.reqfifo.fifo_wptr).
Adding EN signal on $flatten\u_asf_36.\reqfifo.$verific$fifo_wptr_gray_reg$prim_fifo_async.sv:76$23879 ($adff) from module xbar_main (D = $flatten\u_asf_36.\reqfifo.$verific$n112$23802, Q = \u_asf_36.reqfifo.fifo_wptr_gray).
Adding EN signal on $flatten\u_asf_36.\reqfifo.$verific$fifo_rptr_reg$prim_fifo_async.sv:99$23903 ($adff) from module xbar_main (D = $flatten\u_asf_36.\reqfifo.$verific$n176$23811, Q = \u_asf_36.reqfifo.fifo_rptr).
Adding EN signal on $flatten\u_asf_36.\reqfifo.$verific$fifo_rptr_gray_reg$prim_fifo_async.sv:111$23915 ($adff) from module xbar_main (D = $flatten\u_asf_36.\reqfifo.$verific$n254$23826, Q = \u_asf_36.reqfifo.fifo_rptr_gray).
Adding EN signal on $flatten\u_asf_34.\rspfifo.$verific$fifo_wptr_reg$prim_fifo_async.sv:64$23656 ($adff) from module xbar_main (D = $flatten\u_asf_34.\rspfifo.$verific$n34$23578, Q = \u_asf_34.rspfifo.fifo_wptr).
Adding EN signal on $flatten\u_asf_34.\rspfifo.$verific$fifo_wptr_gray_reg$prim_fifo_async.sv:76$23670 ($adff) from module xbar_main (D = $flatten\u_asf_34.\rspfifo.$verific$n112$23593, Q = \u_asf_34.rspfifo.fifo_wptr_gray).
Adding EN signal on $flatten\u_asf_34.\rspfifo.$verific$fifo_rptr_reg$prim_fifo_async.sv:99$23694 ($adff) from module xbar_main (D = $flatten\u_asf_34.\rspfifo.$verific$n176$23602, Q = \u_asf_34.rspfifo.fifo_rptr).
Adding EN signal on $flatten\u_asf_34.\rspfifo.$verific$fifo_rptr_gray_reg$prim_fifo_async.sv:111$23706 ($adff) from module xbar_main (D = $flatten\u_asf_34.\rspfifo.$verific$n254$23617, Q = \u_asf_34.rspfifo.fifo_rptr_gray).
Adding EN signal on $flatten\u_asf_34.\reqfifo.$verific$fifo_wptr_reg$prim_fifo_async.sv:64$23865 ($adff) from module xbar_main (D = $flatten\u_asf_34.\reqfifo.$verific$n34$23787, Q = \u_asf_34.reqfifo.fifo_wptr).
Adding EN signal on $flatten\u_asf_34.\reqfifo.$verific$fifo_wptr_gray_reg$prim_fifo_async.sv:76$23879 ($adff) from module xbar_main (D = $flatten\u_asf_34.\reqfifo.$verific$n112$23802, Q = \u_asf_34.reqfifo.fifo_wptr_gray).
Adding EN signal on $flatten\u_asf_34.\reqfifo.$verific$fifo_rptr_reg$prim_fifo_async.sv:99$23903 ($adff) from module xbar_main (D = $flatten\u_asf_34.\reqfifo.$verific$n176$23811, Q = \u_asf_34.reqfifo.fifo_rptr).
Adding EN signal on $flatten\u_asf_34.\reqfifo.$verific$fifo_rptr_gray_reg$prim_fifo_async.sv:111$23915 ($adff) from module xbar_main (D = $flatten\u_asf_34.\reqfifo.$verific$n254$23826, Q = \u_asf_34.reqfifo.fifo_rptr_gray).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$53593 ($adffe) from module xbar_main.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$53593 ($adffe) from module xbar_main.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$53593 ($adffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$53591 ($adffe) from module xbar_main.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$53591 ($adffe) from module xbar_main.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$53591 ($adffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$53589 ($adffe) from module xbar_main.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$53589 ($adffe) from module xbar_main.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$53589 ($adffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$53587 ($adffe) from module xbar_main.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$53587 ($adffe) from module xbar_main.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$53587 ($adffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$53585 ($adffe) from module xbar_main.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$53585 ($adffe) from module xbar_main.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$53585 ($adffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$53583 ($adffe) from module xbar_main.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$53583 ($adffe) from module xbar_main.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$53583 ($adffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$53581 ($adffe) from module xbar_main.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$53581 ($adffe) from module xbar_main.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$53581 ($adffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$53579 ($adffe) from module xbar_main.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$53579 ($adffe) from module xbar_main.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$53579 ($adffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$53577 ($adffe) from module xbar_main.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$53577 ($adffe) from module xbar_main.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$53577 ($adffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$53575 ($adffe) from module xbar_main.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$53575 ($adffe) from module xbar_main.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$53575 ($adffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$53573 ($adffe) from module xbar_main.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$53573 ($adffe) from module xbar_main.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$53573 ($adffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$53571 ($adffe) from module xbar_main.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$53571 ($adffe) from module xbar_main.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$53571 ($adffe) from module xbar_main.

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 182 unused cells and 224 unused wires.
<suppressed ~183 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.
<suppressed ~23 debug messages>

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~275 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
<suppressed ~156 debug messages>
Removed a total of 52 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $flatten\u_asf_34.\reqfifo.\sync_rptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($adff) from module xbar_main.
Setting constant 0-bit at position 1 on $flatten\u_asf_34.\reqfifo.\sync_rptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($adff) from module xbar_main.
Setting constant 0-bit at position 2 on $flatten\u_asf_34.\reqfifo.\sync_rptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($adff) from module xbar_main.
Setting constant 0-bit at position 0 on $flatten\u_asf_34.\reqfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($adff) from module xbar_main.
Setting constant 0-bit at position 1 on $flatten\u_asf_34.\reqfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($adff) from module xbar_main.
Setting constant 0-bit at position 2 on $flatten\u_asf_34.\reqfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($adff) from module xbar_main.
Setting constant 0-bit at position 0 on $flatten\u_asf_36.\reqfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($adff) from module xbar_main.
Setting constant 0-bit at position 1 on $flatten\u_asf_36.\reqfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($adff) from module xbar_main.
Setting constant 0-bit at position 2 on $flatten\u_asf_36.\reqfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($adff) from module xbar_main.
Setting constant 0-bit at position 0 on $flatten\u_asf_38.\reqfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($adff) from module xbar_main.
Setting constant 0-bit at position 1 on $flatten\u_asf_38.\reqfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($adff) from module xbar_main.
Setting constant 0-bit at position 2 on $flatten\u_asf_38.\reqfifo.\sync_wptr.$verific$intq_reg$prim_flop_2sync.sv:26$23978 ($adff) from module xbar_main.

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 0 unused cells and 40 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.13.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~267 debug messages>

yosys> opt_reduce

3.13.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.13.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.20. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $flatten\u_asf_34.\reqfifo.\sync_rptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($adff) from module xbar_main.
Setting constant 0-bit at position 1 on $flatten\u_asf_34.\reqfifo.\sync_rptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($adff) from module xbar_main.
Setting constant 0-bit at position 2 on $flatten\u_asf_34.\reqfifo.\sync_rptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($adff) from module xbar_main.
Setting constant 0-bit at position 0 on $flatten\u_asf_34.\reqfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($adff) from module xbar_main.
Setting constant 0-bit at position 1 on $flatten\u_asf_34.\reqfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($adff) from module xbar_main.
Setting constant 0-bit at position 2 on $flatten\u_asf_34.\reqfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($adff) from module xbar_main.
Setting constant 0-bit at position 0 on $flatten\u_asf_36.\reqfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($adff) from module xbar_main.
Setting constant 0-bit at position 1 on $flatten\u_asf_36.\reqfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($adff) from module xbar_main.
Setting constant 0-bit at position 2 on $flatten\u_asf_36.\reqfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($adff) from module xbar_main.
Setting constant 0-bit at position 0 on $flatten\u_asf_38.\reqfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($adff) from module xbar_main.
Setting constant 0-bit at position 1 on $flatten\u_asf_38.\reqfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($adff) from module xbar_main.
Setting constant 0-bit at position 2 on $flatten\u_asf_38.\reqfifo.\sync_wptr.$verific$q_reg$prim_flop_2sync.sv:26$23979 ($adff) from module xbar_main.

yosys> opt_clean

3.13.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> opt_expr

3.13.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.
<suppressed ~22 debug messages>

3.13.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~263 debug messages>

yosys> opt_reduce

3.13.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.13.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.27. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $flatten\u_asf_34.\reqfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23932 ($adff) from module xbar_main.
Setting constant 0-bit at position 1 on $flatten\u_asf_34.\reqfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23932 ($adff) from module xbar_main.
Setting constant 0-bit at position 2 on $flatten\u_asf_34.\reqfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23932 ($adff) from module xbar_main.
Setting constant 0-bit at position 0 on $flatten\u_asf_34.\rspfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23723 ($adff) from module xbar_main.
Setting constant 0-bit at position 1 on $flatten\u_asf_34.\rspfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23723 ($adff) from module xbar_main.
Setting constant 0-bit at position 2 on $flatten\u_asf_34.\rspfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23723 ($adff) from module xbar_main.
Setting constant 0-bit at position 0 on $flatten\u_asf_36.\rspfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23723 ($adff) from module xbar_main.
Setting constant 0-bit at position 1 on $flatten\u_asf_36.\rspfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23723 ($adff) from module xbar_main.
Setting constant 0-bit at position 2 on $flatten\u_asf_36.\rspfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23723 ($adff) from module xbar_main.
Setting constant 0-bit at position 0 on $flatten\u_asf_38.\rspfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23723 ($adff) from module xbar_main.
Setting constant 0-bit at position 1 on $flatten\u_asf_38.\rspfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23723 ($adff) from module xbar_main.
Setting constant 0-bit at position 2 on $flatten\u_asf_38.\rspfifo.$verific$fifo_rptr_sync_reg$prim_fifo_async.sv:124$23723 ($adff) from module xbar_main.

yosys> opt_clean

3.13.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 0 unused cells and 16 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.13.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.
<suppressed ~4 debug messages>

3.13.30. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.31. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~263 debug messages>

yosys> opt_reduce

3.13.32. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.13.33. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.34. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.35. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.13.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.13.37. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.38. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~263 debug messages>

yosys> opt_reduce

3.13.39. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.13.40. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.41. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.42. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> opt_expr

3.13.43. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.13.44. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 16 bits (of 17) from port B of cell xbar_main.$verific$equal_161$xbar_main.sv:643$264 ($eq).
Removed top 15 bits (of 20) from port B of cell xbar_main.$verific$equal_162$xbar_main.sv:647$265 ($eq).
Removed top 3 bits (of 15) from port B of cell xbar_main.$verific$equal_163$xbar_main.sv:651$266 ($eq).
Removed top 2 bits (of 12) from port B of cell xbar_main.$verific$equal_164$xbar_main.sv:655$267 ($eq).
Removed top 16 bits (of 17) from port B of cell xbar_main.$verific$equal_169$xbar_main.sv:664$272 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_170$xbar_main.sv:668$273 ($eq).
Removed top 15 bits (of 20) from port B of cell xbar_main.$verific$equal_171$xbar_main.sv:672$274 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_172$xbar_main.sv:676$275 ($eq).
Removed top 3 bits (of 15) from port B of cell xbar_main.$verific$equal_173$xbar_main.sv:680$276 ($eq).
Removed top 1 bits (of 11) from port B of cell xbar_main.$verific$equal_174$xbar_main.sv:684$277 ($eq).
Removed top 1 bits (of 10) from port B of cell xbar_main.$verific$equal_175$xbar_main.sv:685$278 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_177$xbar_main.sv:690$280 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_178$xbar_main.sv:694$281 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_179$xbar_main.sv:698$282 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_180$xbar_main.sv:702$283 ($eq).
Removed top 2 bits (of 12) from port B of cell xbar_main.$verific$equal_181$xbar_main.sv:706$284 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_182$xbar_main.sv:710$285 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_183$xbar_main.sv:714$286 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_184$xbar_main.sv:718$287 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_185$xbar_main.sv:722$288 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_186$xbar_main.sv:726$289 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_187$xbar_main.sv:730$290 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$verific$equal_188$xbar_main.sv:734$291 ($eq).
Removed top 1 bits (of 16) from port B of cell xbar_main.$verific$equal_189$xbar_main.sv:738$292 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_190$xbar_main.sv:742$293 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_191$xbar_main.sv:746$294 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_192$xbar_main.sv:750$295 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_193$xbar_main.sv:754$296 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_217$xbar_main.sv:763$320 ($eq).
Removed top 16 bits (of 17) from port B of cell xbar_main.$verific$equal_218$xbar_main.sv:767$321 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_219$xbar_main.sv:771$322 ($eq).
Removed top 1 bits (of 11) from port B of cell xbar_main.$verific$equal_220$xbar_main.sv:775$323 ($eq).
Removed top 1 bits (of 10) from port B of cell xbar_main.$verific$equal_221$xbar_main.sv:776$324 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_223$xbar_main.sv:781$326 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_224$xbar_main.sv:785$327 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_225$xbar_main.sv:789$328 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_226$xbar_main.sv:793$329 ($eq).
Removed top 2 bits (of 12) from port B of cell xbar_main.$verific$equal_227$xbar_main.sv:797$330 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_228$xbar_main.sv:801$331 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_229$xbar_main.sv:805$332 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_230$xbar_main.sv:809$333 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_231$xbar_main.sv:813$334 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_232$xbar_main.sv:817$335 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_233$xbar_main.sv:821$336 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_234$xbar_main.sv:825$337 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$verific$equal_235$xbar_main.sv:829$338 ($eq).
Removed top 1 bits (of 16) from port B of cell xbar_main.$verific$equal_236$xbar_main.sv:833$339 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_237$xbar_main.sv:837$340 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_238$xbar_main.sv:841$341 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_main.$verific$equal_239$xbar_main.sv:845$342 ($eq).
Removed top 3 bits (of 15) from port B of cell xbar_main.$verific$equal_240$xbar_main.sv:849$343 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_26.\gen_dfifo[3].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_26.\gen_dfifo[2].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_26.\gen_dfifo[1].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_26.\gen_dfifo[0].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_26.\fifo_h.$verific$equal_3$tlul_fifo_sync.sv:75$26925 ($eq).
Removed top 1 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_26.$verific$equal_104$tlul_socket_1n.sv:169$24483 ($eq).
Removed top 1 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_26.$verific$equal_101$tlul_socket_1n.sv:169$24480 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_26.$verific$equal_98$tlul_socket_1n.sv:169$24477 ($eq).
Removed top 1 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_26.$verific$equal_64$tlul_socket_1n.sv:138$24451 ($eq).
Removed top 1 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_26.$verific$equal_51$tlul_socket_1n.sv:138$24439 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_26.$verific$equal_38$tlul_socket_1n.sv:138$24427 ($eq).
Removed top 8 bits (of 9) from port B of cell xbar_main.$flatten\u_s1n_26.$verific$sub_14$tlul_socket_1n.sv:122$24403 ($sub).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_27.\gen_arb_ppc.u_reqarb.$verific$mux_38$prim_arbiter_ppc.sv:109$51492 ($mux).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_27.$verific$equal_31$tlul_socket_m1.sv:231$51428 ($eq).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_28.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_28.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_29.\gen_arb_ppc.u_reqarb.$verific$mux_38$prim_arbiter_ppc.sv:109$51492 ($mux).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_29.$verific$equal_31$tlul_socket_m1.sv:231$51428 ($eq).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_30.\gen_arb_ppc.u_reqarb.$verific$mux_38$prim_arbiter_ppc.sv:109$51492 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_30.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_30.$verific$equal_31$tlul_socket_m1.sv:231$53388 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[22].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[21].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[20].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[19].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[18].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[17].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[16].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[15].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[14].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[13].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[12].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[11].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[9].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[8].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[7].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[6].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[5].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[3].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\gen_dfifo[1].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$26539 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_31.\fifo_h.$verific$equal_3$tlul_fifo_sync.sv:75$46168 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_444$tlul_socket_1n.sv:169$37405 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_441$tlul_socket_1n.sv:169$37402 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_438$tlul_socket_1n.sv:169$37399 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_435$tlul_socket_1n.sv:169$37396 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_432$tlul_socket_1n.sv:169$37393 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_429$tlul_socket_1n.sv:169$37390 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_426$tlul_socket_1n.sv:169$37387 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_423$tlul_socket_1n.sv:169$37384 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_420$tlul_socket_1n.sv:169$37381 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_417$tlul_socket_1n.sv:169$37378 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_414$tlul_socket_1n.sv:169$37375 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_411$tlul_socket_1n.sv:169$37372 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_408$tlul_socket_1n.sv:169$37369 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_405$tlul_socket_1n.sv:169$37366 ($eq).
Removed top 4 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_402$tlul_socket_1n.sv:169$37363 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_220$tlul_socket_1n.sv:138$37215 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_207$tlul_socket_1n.sv:138$37203 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_194$tlul_socket_1n.sv:138$37191 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_181$tlul_socket_1n.sv:138$37179 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_168$tlul_socket_1n.sv:138$37167 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_155$tlul_socket_1n.sv:138$37155 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_142$tlul_socket_1n.sv:138$37143 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_129$tlul_socket_1n.sv:138$37131 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_116$tlul_socket_1n.sv:138$37119 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_103$tlul_socket_1n.sv:138$37107 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_90$tlul_socket_1n.sv:138$37095 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_77$tlul_socket_1n.sv:138$37083 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_64$tlul_socket_1n.sv:138$37071 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_51$tlul_socket_1n.sv:138$37059 ($eq).
Removed top 4 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$equal_38$tlul_socket_1n.sv:138$37047 ($eq).
Removed top 8 bits (of 9) from port B of cell xbar_main.$flatten\u_s1n_31.$verific$sub_14$tlul_socket_1n.sv:122$37023 ($sub).
Removed top 1 bits (of 2) from port B of cell xbar_main.$auto$opt_dff.cc:195:make_patterns_logic$53534 ($ne).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_32.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_33.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_33.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_asf_34.\rspfifo.$verific$add_18$prim_fifo_async.sv:62$23652 ($add).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_asf_34.\rspfifo.$verific$add_65$prim_fifo_async.sv:97$23690 ($add).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_asf_34.\reqfifo.$verific$add_18$prim_fifo_async.sv:62$23861 ($add).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_asf_34.\reqfifo.$verific$add_65$prim_fifo_async.sv:97$23899 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$auto$opt_dff.cc:195:make_patterns_logic$53550 ($ne).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_35.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_asf_36.\rspfifo.$verific$add_18$prim_fifo_async.sv:62$23652 ($add).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_asf_36.\rspfifo.$verific$add_65$prim_fifo_async.sv:97$23690 ($add).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_asf_36.\reqfifo.$verific$add_18$prim_fifo_async.sv:62$23861 ($add).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_asf_36.\reqfifo.$verific$add_65$prim_fifo_async.sv:97$23899 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$auto$opt_dff.cc:195:make_patterns_logic$53562 ($ne).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_37.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_asf_38.\rspfifo.$verific$add_18$prim_fifo_async.sv:62$23652 ($add).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_asf_38.\rspfifo.$verific$add_65$prim_fifo_async.sv:97$23690 ($add).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_asf_38.\reqfifo.$verific$add_18$prim_fifo_async.sv:62$23861 ($add).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_asf_38.\reqfifo.$verific$add_65$prim_fifo_async.sv:97$23899 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_39.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_40.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_40.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_41.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_41.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_42.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_42.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_43.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_43.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_44.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_44.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_45.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_45.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_46.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_46.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_47.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_47.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_48.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_48.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_49.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_49.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_50.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_50.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_51.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_51.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_52.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_53.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$47654 ($mux).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_sm1_53.\u_devicefifo.$verific$equal_3$tlul_fifo_sync.sv:75$49451 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 2 bits (of 3) from port B of cell xbar_main.$flatten\u_s1n_54.\fifo_h.$verific$equal_3$tlul_fifo_sync.sv:75$36278 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$36426 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$36419 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
Removed top 1 bits (of 2) from port B of cell xbar_main.$flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_428$tlul_socket_1n.sv:169$27873 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_425$tlul_socket_1n.sv:169$27870 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_422$tlul_socket_1n.sv:169$27867 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_419$tlul_socket_1n.sv:169$27864 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_416$tlul_socket_1n.sv:169$27861 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_413$tlul_socket_1n.sv:169$27858 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_410$tlul_socket_1n.sv:169$27855 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_407$tlul_socket_1n.sv:169$27852 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_404$tlul_socket_1n.sv:169$27849 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_401$tlul_socket_1n.sv:169$27846 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_398$tlul_socket_1n.sv:169$27843 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_395$tlul_socket_1n.sv:169$27840 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_392$tlul_socket_1n.sv:169$27837 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_389$tlul_socket_1n.sv:169$27834 ($eq).
Removed top 4 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_386$tlul_socket_1n.sv:169$27831 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_220$tlul_socket_1n.sv:138$27697 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_207$tlul_socket_1n.sv:138$27685 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_194$tlul_socket_1n.sv:138$27673 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_181$tlul_socket_1n.sv:138$27661 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_168$tlul_socket_1n.sv:138$27649 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_155$tlul_socket_1n.sv:138$27637 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_142$tlul_socket_1n.sv:138$27625 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_129$tlul_socket_1n.sv:138$27613 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_116$tlul_socket_1n.sv:138$27601 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_103$tlul_socket_1n.sv:138$27589 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_90$tlul_socket_1n.sv:138$27577 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_77$tlul_socket_1n.sv:138$27565 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_64$tlul_socket_1n.sv:138$27553 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_51$tlul_socket_1n.sv:138$27541 ($eq).
Removed top 4 bits (of 5) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$equal_38$tlul_socket_1n.sv:138$27529 ($eq).
Removed top 8 bits (of 9) from port B of cell xbar_main.$flatten\u_s1n_54.$verific$sub_14$tlul_socket_1n.sv:122$27505 ($sub).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_27.\gen_arb_ppc.u_reqarb.$verific$mux_36$prim_arbiter_ppc.sv:109$51490 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_28.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_29.\gen_arb_ppc.u_reqarb.$verific$mux_36$prim_arbiter_ppc.sv:109$51490 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_30.\gen_arb_ppc.u_reqarb.$verific$mux_36$prim_arbiter_ppc.sv:109$51490 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_32.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_33.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_35.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_37.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_39.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_40.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_41.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_42.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_43.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_44.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_45.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_46.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_47.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_48.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_49.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_50.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_51.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_52.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_53.\gen_arb_ppc.u_reqarb.$verific$mux_32$prim_arbiter_ppc.sv:109$47652 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_27.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$51488 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_29.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$51488 ($mux).
Removed top 1 bits (of 109) from mux cell xbar_main.$flatten\u_sm1_30.\gen_arb_ppc.u_reqarb.$verific$mux_34$prim_arbiter_ppc.sv:109$51488 ($mux).
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_27.\gen_arb_ppc.u_reqarb.$verific$n221$51457.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_27.\gen_arb_ppc.u_reqarb.$verific$n441$51459.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_28.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_29.\gen_arb_ppc.u_reqarb.$verific$n221$51457.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_29.\gen_arb_ppc.u_reqarb.$verific$n441$51459.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_30.\gen_arb_ppc.u_reqarb.$verific$n221$51457.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_30.\gen_arb_ppc.u_reqarb.$verific$n441$51459.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_32.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_33.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_35.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_37.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_39.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_40.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_41.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_42.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_43.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_44.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_45.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_46.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_47.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_48.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_49.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_50.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_51.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_52.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 1 bits (of 109) from wire xbar_main.$flatten\u_sm1_53.\gen_arb_ppc.u_reqarb.$verific$n204$47624.
Removed top 12 bits (of 32) from wire xbar_main.tl_asf_36_ds_h2d[a_address].
Removed top 1 bits (of 8) from wire xbar_main.tl_asf_38_us_h2d[a_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_s1n_26_ds_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_26_ds_d2h[1][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_s1n_26_ds_d2h[2][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_s1n_26_ds_d2h[3][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[0][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[10][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[11][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[12][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[14][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[16][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[17][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[18][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[1][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[20][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[21][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[22][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[2][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[3][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[4][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[5][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[6][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[7][d_source].
Removed top 19 bits (of 32) from wire xbar_main.tl_s1n_31_ds_d2h[8][d_data].
Removed top 5 bits (of 8) from wire xbar_main.tl_s1n_31_ds_d2h[9][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[10][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[11][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[12][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[14][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[16][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[17][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[19][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[1][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[20][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[21][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[2][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[3][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[4][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[5][d_source].
Removed top 19 bits (of 32) from wire xbar_main.tl_s1n_54_ds_d2h[6][d_data].
Removed top 5 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[7][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[8][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_s1n_54_ds_d2h[9][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_sm1_27_us_d2h[0][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_sm1_27_us_d2h[1][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_sm1_27_us_d2h[2][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_28_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_28_us_d2h[1][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_sm1_29_us_d2h[0][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_sm1_29_us_d2h[1][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_sm1_29_us_d2h[2][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_sm1_30_us_d2h[0][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_sm1_30_us_d2h[1][d_source].
Removed top 2 bits (of 8) from wire xbar_main.tl_sm1_30_us_d2h[2][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_32_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_32_us_d2h[1][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_33_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_33_us_d2h[1][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_35_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_35_us_d2h[1][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_37_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_37_us_d2h[1][d_source].
Removed top 25 bits (of 32) from wire xbar_main.tl_sm1_39_ds_h2d[a_address].
Removed top 7 bits (of 8) from wire xbar_main.tl_sm1_39_ds_h2d[a_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_39_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_39_us_d2h[1][d_source].
Removed top 19 bits (of 32) from wire xbar_main.tl_sm1_40_us_d2h[0][d_data].
Removed top 19 bits (of 32) from wire xbar_main.tl_sm1_40_us_d2h[1][d_data].
Removed top 5 bits (of 8) from wire xbar_main.tl_sm1_41_us_d2h[0][d_source].
Removed top 5 bits (of 8) from wire xbar_main.tl_sm1_41_us_d2h[1][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_42_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_42_us_d2h[1][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_43_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_43_us_d2h[1][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_45_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_45_us_d2h[1][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_47_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_47_us_d2h[1][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_48_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_48_us_d2h[1][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_49_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_49_us_d2h[1][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_51_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_51_us_d2h[1][d_source].
Removed top 10 bits (of 32) from wire xbar_main.tl_sm1_52_ds_h2d[a_address].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_52_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_52_us_d2h[1][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_53_us_d2h[0][d_source].
Removed top 1 bits (of 8) from wire xbar_main.tl_sm1_53_us_d2h[1][d_source].

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 0 unused cells and 117 unused wires.
<suppressed ~1 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module xbar_main:
  creating $macc model for $flatten\u_asf_34.\reqfifo.$verific$add_18$prim_fifo_async.sv:62$23861 ($add).
  creating $macc model for $flatten\u_asf_34.\reqfifo.$verific$add_65$prim_fifo_async.sv:97$23899 ($add).
  creating $macc model for $flatten\u_asf_34.\rspfifo.$verific$add_18$prim_fifo_async.sv:62$23652 ($add).
  creating $macc model for $flatten\u_asf_34.\rspfifo.$verific$add_65$prim_fifo_async.sv:97$23690 ($add).
  creating $macc model for $flatten\u_asf_36.\reqfifo.$verific$add_18$prim_fifo_async.sv:62$23861 ($add).
  creating $macc model for $flatten\u_asf_36.\reqfifo.$verific$add_65$prim_fifo_async.sv:97$23899 ($add).
  creating $macc model for $flatten\u_asf_36.\rspfifo.$verific$add_18$prim_fifo_async.sv:62$23652 ($add).
  creating $macc model for $flatten\u_asf_36.\rspfifo.$verific$add_65$prim_fifo_async.sv:97$23690 ($add).
  creating $macc model for $flatten\u_asf_38.\reqfifo.$verific$add_18$prim_fifo_async.sv:62$23861 ($add).
  creating $macc model for $flatten\u_asf_38.\reqfifo.$verific$add_65$prim_fifo_async.sv:97$23899 ($add).
  creating $macc model for $flatten\u_asf_38.\rspfifo.$verific$add_18$prim_fifo_async.sv:62$23652 ($add).
  creating $macc model for $flatten\u_asf_38.\rspfifo.$verific$add_65$prim_fifo_async.sv:97$23690 ($add).
  creating $macc model for $flatten\u_s1n_26.$verific$sub_14$tlul_socket_1n.sv:122$24403 ($sub).
  creating $macc model for $flatten\u_s1n_31.$verific$sub_14$tlul_socket_1n.sv:122$37023 ($sub).
  creating $macc model for $flatten\u_s1n_54.$verific$sub_14$tlul_socket_1n.sv:122$27505 ($sub).
  creating $macc model for $flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$36419 ($add).
  creating $macc model for $flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$36426 ($add).
  creating $macc model for $flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $macc model for $flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510 ($add).
  creating $macc model for $flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517 ($add).
  creating $macc model for $flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337 ($add).
  creating $macc model for $flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344 ($add).
  creating $alu model for $macc $flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517.
  creating $alu model for $macc $flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510.
  creating $alu model for $macc $flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344.
  creating $alu model for $macc $flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337.
  creating $alu model for $macc $flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$36426.
  creating $alu model for $macc $flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$36419.
  creating $alu model for $macc $flatten\u_s1n_54.$verific$sub_14$tlul_socket_1n.sv:122$27505.
  creating $alu model for $macc $flatten\u_s1n_31.$verific$sub_14$tlul_socket_1n.sv:122$37023.
  creating $alu model for $macc $flatten\u_s1n_26.$verific$sub_14$tlul_socket_1n.sv:122$24403.
  creating $alu model for $macc $flatten\u_asf_38.\rspfifo.$verific$add_65$prim_fifo_async.sv:97$23690.
  creating $alu model for $macc $flatten\u_asf_38.\rspfifo.$verific$add_18$prim_fifo_async.sv:62$23652.
  creating $alu model for $macc $flatten\u_asf_38.\reqfifo.$verific$add_65$prim_fifo_async.sv:97$23899.
  creating $alu model for $macc $flatten\u_asf_38.\reqfifo.$verific$add_18$prim_fifo_async.sv:62$23861.
  creating $alu model for $macc $flatten\u_asf_36.\rspfifo.$verific$add_65$prim_fifo_async.sv:97$23690.
  creating $alu model for $macc $flatten\u_asf_36.\rspfifo.$verific$add_18$prim_fifo_async.sv:62$23652.
  creating $alu model for $macc $flatten\u_asf_36.\reqfifo.$verific$add_65$prim_fifo_async.sv:97$23899.
  creating $alu model for $macc $flatten\u_asf_36.\reqfifo.$verific$add_18$prim_fifo_async.sv:62$23861.
  creating $alu model for $macc $flatten\u_asf_34.\rspfifo.$verific$add_65$prim_fifo_async.sv:97$23690.
  creating $alu model for $macc $flatten\u_asf_34.\rspfifo.$verific$add_18$prim_fifo_async.sv:62$23652.
  creating $alu model for $macc $flatten\u_asf_34.\reqfifo.$verific$add_65$prim_fifo_async.sv:97$23899.
  creating $alu model for $macc $flatten\u_asf_34.\reqfifo.$verific$add_18$prim_fifo_async.sv:62$23861.
  creating $alu model for $flatten\u_s1n_26.$verific$LessThan_122$tlul_socket_1n.sv:213$25916 ($le): new $alu
  creating $alu model for $flatten\u_s1n_31.$verific$LessThan_502$tlul_socket_1n.sv:213$45604 ($le): new $alu
  creating $alu model for $flatten\u_s1n_54.$verific$LessThan_482$tlul_socket_1n.sv:213$35714 ($le): new $alu
  creating $alu cell for $flatten\u_s1n_54.$verific$LessThan_482$tlul_socket_1n.sv:213$35714: $auto$alumacc.cc:485:replace_alu$53714
  creating $alu cell for $flatten\u_s1n_31.$verific$LessThan_502$tlul_socket_1n.sv:213$45604: $auto$alumacc.cc:485:replace_alu$53727
  creating $alu cell for $flatten\u_s1n_26.$verific$LessThan_122$tlul_socket_1n.sv:213$25916: $auto$alumacc.cc:485:replace_alu$53736
  creating $alu cell for $flatten\u_asf_34.\reqfifo.$verific$add_18$prim_fifo_async.sv:62$23861: $auto$alumacc.cc:485:replace_alu$53745
  creating $alu cell for $flatten\u_asf_34.\reqfifo.$verific$add_65$prim_fifo_async.sv:97$23899: $auto$alumacc.cc:485:replace_alu$53748
  creating $alu cell for $flatten\u_asf_34.\rspfifo.$verific$add_18$prim_fifo_async.sv:62$23652: $auto$alumacc.cc:485:replace_alu$53751
  creating $alu cell for $flatten\u_asf_34.\rspfifo.$verific$add_65$prim_fifo_async.sv:97$23690: $auto$alumacc.cc:485:replace_alu$53754
  creating $alu cell for $flatten\u_asf_36.\reqfifo.$verific$add_18$prim_fifo_async.sv:62$23861: $auto$alumacc.cc:485:replace_alu$53757
  creating $alu cell for $flatten\u_asf_36.\reqfifo.$verific$add_65$prim_fifo_async.sv:97$23899: $auto$alumacc.cc:485:replace_alu$53760
  creating $alu cell for $flatten\u_asf_36.\rspfifo.$verific$add_18$prim_fifo_async.sv:62$23652: $auto$alumacc.cc:485:replace_alu$53763
  creating $alu cell for $flatten\u_asf_36.\rspfifo.$verific$add_65$prim_fifo_async.sv:97$23690: $auto$alumacc.cc:485:replace_alu$53766
  creating $alu cell for $flatten\u_asf_38.\reqfifo.$verific$add_18$prim_fifo_async.sv:62$23861: $auto$alumacc.cc:485:replace_alu$53769
  creating $alu cell for $flatten\u_asf_38.\reqfifo.$verific$add_65$prim_fifo_async.sv:97$23899: $auto$alumacc.cc:485:replace_alu$53772
  creating $alu cell for $flatten\u_asf_38.\rspfifo.$verific$add_18$prim_fifo_async.sv:62$23652: $auto$alumacc.cc:485:replace_alu$53775
  creating $alu cell for $flatten\u_asf_38.\rspfifo.$verific$add_65$prim_fifo_async.sv:97$23690: $auto$alumacc.cc:485:replace_alu$53778
  creating $alu cell for $flatten\u_s1n_26.$verific$sub_14$tlul_socket_1n.sv:122$24403: $auto$alumacc.cc:485:replace_alu$53781
  creating $alu cell for $flatten\u_s1n_31.$verific$sub_14$tlul_socket_1n.sv:122$37023: $auto$alumacc.cc:485:replace_alu$53784
  creating $alu cell for $flatten\u_s1n_54.$verific$sub_14$tlul_socket_1n.sv:122$27505: $auto$alumacc.cc:485:replace_alu$53787
  creating $alu cell for $flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$36419: $auto$alumacc.cc:485:replace_alu$53790
  creating $alu cell for $flatten\u_s1n_54.\fifo_h.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$36426: $auto$alumacc.cc:485:replace_alu$53793
  creating $alu cell for $flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53796
  creating $alu cell for $flatten\u_s1n_54.\fifo_h.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53799
  creating $alu cell for $flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53802
  creating $alu cell for $flatten\u_sm1_28.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53805
  creating $alu cell for $flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53808
  creating $alu cell for $flatten\u_sm1_28.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53811
  creating $alu cell for $flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53814
  creating $alu cell for $flatten\u_sm1_30.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53817
  creating $alu cell for $flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53820
  creating $alu cell for $flatten\u_sm1_30.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53823
  creating $alu cell for $flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53826
  creating $alu cell for $flatten\u_sm1_33.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53829
  creating $alu cell for $flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53832
  creating $alu cell for $flatten\u_sm1_33.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53835
  creating $alu cell for $flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53838
  creating $alu cell for $flatten\u_sm1_40.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53841
  creating $alu cell for $flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53844
  creating $alu cell for $flatten\u_sm1_40.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53847
  creating $alu cell for $flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53850
  creating $alu cell for $flatten\u_sm1_41.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53853
  creating $alu cell for $flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53856
  creating $alu cell for $flatten\u_sm1_41.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53859
  creating $alu cell for $flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53862
  creating $alu cell for $flatten\u_sm1_42.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53865
  creating $alu cell for $flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53868
  creating $alu cell for $flatten\u_sm1_42.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53871
  creating $alu cell for $flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53874
  creating $alu cell for $flatten\u_sm1_43.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53877
  creating $alu cell for $flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53880
  creating $alu cell for $flatten\u_sm1_43.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53883
  creating $alu cell for $flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53886
  creating $alu cell for $flatten\u_sm1_44.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53889
  creating $alu cell for $flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53892
  creating $alu cell for $flatten\u_sm1_44.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53895
  creating $alu cell for $flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53898
  creating $alu cell for $flatten\u_sm1_45.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53901
  creating $alu cell for $flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53904
  creating $alu cell for $flatten\u_sm1_45.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53907
  creating $alu cell for $flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53910
  creating $alu cell for $flatten\u_sm1_46.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53913
  creating $alu cell for $flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53916
  creating $alu cell for $flatten\u_sm1_46.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53919
  creating $alu cell for $flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53922
  creating $alu cell for $flatten\u_sm1_47.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53925
  creating $alu cell for $flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53928
  creating $alu cell for $flatten\u_sm1_47.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53931
  creating $alu cell for $flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53934
  creating $alu cell for $flatten\u_sm1_48.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53937
  creating $alu cell for $flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53940
  creating $alu cell for $flatten\u_sm1_48.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53943
  creating $alu cell for $flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53946
  creating $alu cell for $flatten\u_sm1_49.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53949
  creating $alu cell for $flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53952
  creating $alu cell for $flatten\u_sm1_49.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53955
  creating $alu cell for $flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53958
  creating $alu cell for $flatten\u_sm1_50.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53961
  creating $alu cell for $flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53964
  creating $alu cell for $flatten\u_sm1_50.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53967
  creating $alu cell for $flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53970
  creating $alu cell for $flatten\u_sm1_51.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53973
  creating $alu cell for $flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53976
  creating $alu cell for $flatten\u_sm1_51.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53979
  creating $alu cell for $flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$add_31$prim_fifo_sync.sv:87$49510: $auto$alumacc.cc:485:replace_alu$53982
  creating $alu cell for $flatten\u_sm1_53.\u_devicefifo.\reqfifo.$verific$add_45$prim_fifo_sync.sv:101$49517: $auto$alumacc.cc:485:replace_alu$53985
  creating $alu cell for $flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$add_31$prim_fifo_sync.sv:87$36337: $auto$alumacc.cc:485:replace_alu$53988
  creating $alu cell for $flatten\u_sm1_53.\u_devicefifo.\rspfifo.$verific$add_45$prim_fifo_sync.sv:101$36344: $auto$alumacc.cc:485:replace_alu$53991
  created 86 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~263 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~263 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).
  Analyzing xbar_main.u_asf_34.reqfifo.storage write port 0.
  Analyzing xbar_main.u_asf_34.rspfifo.storage write port 0.
  Analyzing xbar_main.u_asf_36.reqfifo.storage write port 0.
  Analyzing xbar_main.u_asf_36.rspfifo.storage write port 0.
  Analyzing xbar_main.u_asf_38.reqfifo.storage write port 0.
  Analyzing xbar_main.u_asf_38.rspfifo.storage write port 0.
  Analyzing xbar_main.u_s1n_54.fifo_h.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.storage write port 0.
  Analyzing xbar_main.u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.storage write port 0.

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `\u_asf_34.reqfifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_asf_34.rspfifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_asf_36.reqfifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_asf_36.rspfifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_asf_38.reqfifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_asf_38.rspfifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_s1n_54.fifo_h.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port `\u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': no output FF found.
Checking read port address `\u_asf_34.reqfifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_asf_34.rspfifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_asf_36.reqfifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_asf_36.rspfifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_asf_38.reqfifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_asf_38.rspfifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_s1n_54.fifo_h.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.
Checking read port address `\u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.storage'[0] in module `\xbar_main': address FF has async set and/or reset, not supported.

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> stat

3.22. Printing statistics.

=== xbar_main ===

   Number of wires:              22938
   Number of wire bits:         197100
   Number of public wires:       21866
   Number of public wire bits:  189536
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1693
     $adff                           3
     $adffe                        121
     $alu                           86
     $and                          325
     $eq                           280
     $logic_not                     15
     $mem_v2                        40
     $mux                          453
     $ne                             6
     $not                          205
     $or                            32
     $reduce_and                     6
     $reduce_bool                   26
     $reduce_or                     72
     $xor                           23


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.23. Executing TECHMAP pass (map to technology primitives).

3.23.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.23.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.23.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $adffe.
Using template $paramod$3ef7d3dd227da7627a99c5e5a6a4deb817573e39\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $ne.
Using template $paramod$6f67705c43e5e94c02b6ebb52209ce5aa5ade4c1\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $xor.
Using template $paramod$175e67c02b86e96b1288b9dc100122520d7240d8\_90_alu for cells of type $alu.
Using template $paramod$78e969f2586efcf3a5b0b0440bcca0db83d5cca2\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_and.
Using template $paramod$b18e16801adf491a64caa0542270798e5d4ac6b6\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000011 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
No more expansions possible.
<suppressed ~3786 debug messages>

yosys> stat

3.24. Printing statistics.

=== xbar_main ===

   Number of wires:              26774
   Number of wire bits:         298724
   Number of public wires:       21866
   Number of public wire bits:  189536
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              19677
     $_AND_                        894
     $_DFFE_PN0P_                  300
     $_DFFE_PN1P_                    3
     $_DFF_PN0_                      3
     $_MUX_                      13655
     $_NOT_                        712
     $_OR_                        1823
     $_XOR_                       2247
     $mem_v2                        40


yosys> opt

3.25. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.25.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.
<suppressed ~10673 debug messages>

yosys> opt_merge -nomux

3.25.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
<suppressed ~3759 debug messages>
Removed a total of 1253 cells.

yosys> opt_muxtree

3.25.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.25.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 430 unused cells and 3954 unused wires.
<suppressed ~551 debug messages>

yosys> opt_expr

3.25.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.25.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.25.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.25.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> opt_expr

3.25.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.25.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.
<suppressed ~7510 debug messages>

yosys> opt_merge

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff

3.26.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 0 unused cells and 29 unused wires.
<suppressed ~1 debug messages>

3.26.5. Finished fast OPT passes.

yosys> memory_map

3.27. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory \u_asf_34.reqfifo.storage in module \xbar_main:
  created 4 $dff cells and 0 static cells of width 107.
  read interface: 0 $dff and 3 $mux cells.
  write interface: 4 write mux blocks.
Mapping memory \u_asf_34.rspfifo.storage in module \xbar_main:
  created 4 $dff cells and 0 static cells of width 64.
  read interface: 0 $dff and 3 $mux cells.
  write interface: 4 write mux blocks.
Mapping memory \u_asf_36.reqfifo.storage in module \xbar_main:
  created 4 $dff cells and 0 static cells of width 107.
  read interface: 0 $dff and 3 $mux cells.
  write interface: 4 write mux blocks.
Mapping memory \u_asf_36.rspfifo.storage in module \xbar_main:
  created 4 $dff cells and 0 static cells of width 64.
  read interface: 0 $dff and 3 $mux cells.
  write interface: 4 write mux blocks.
Mapping memory \u_asf_38.reqfifo.storage in module \xbar_main:
  created 4 $dff cells and 0 static cells of width 107.
  read interface: 0 $dff and 3 $mux cells.
  write interface: 4 write mux blocks.
Mapping memory \u_asf_38.rspfifo.storage in module \xbar_main:
  created 4 $dff cells and 0 static cells of width 64.
  read interface: 0 $dff and 3 $mux cells.
  write interface: 4 write mux blocks.
Mapping memory \u_s1n_54.fifo_h.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 112.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 108.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.
Mapping memory \u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.storage in module \xbar_main:
  created 2 $dff cells and 0 static cells of width 65.
  read interface: 0 $dff and 1 $mux cells.
  write interface: 2 write mux blocks.

yosys> opt -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.
<suppressed ~92 debug messages>

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~132 debug messages>

yosys> opt_reduce -full

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_share

3.28.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.28.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 0 unused cells and 230 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.28.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.28.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.28.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~132 debug messages>

yosys> opt_reduce -full

3.28.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.28.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_share

3.28.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.28.15. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $memory\u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$78273 ($dff) from module xbar_main (D = { \tl_rv_core_ibex__cfg_i.d_opcode \tl_rv_core_ibex__cfg_i.d_param \tl_rv_core_ibex__cfg_i.d_size \tl_rv_core_ibex__cfg_i.d_source \tl_rv_core_ibex__cfg_i.d_sink \u_sm1_53.u_devicefifo.rspfifo.wdata_i [47:16] \tl_rv_core_ibex__cfg_i.d_user.rsp_intg \tl_rv_core_ibex__cfg_i.d_user.data_intg \tl_rv_core_ibex__cfg_i.d_error 1'0 }, Q = \u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$78271 ($dff) from module xbar_main (D = { \tl_rv_core_ibex__cfg_i.d_opcode \tl_rv_core_ibex__cfg_i.d_param \tl_rv_core_ibex__cfg_i.d_size \tl_rv_core_ibex__cfg_i.d_source \tl_rv_core_ibex__cfg_i.d_sink \u_sm1_53.u_devicefifo.rspfifo.wdata_i [47:16] \tl_rv_core_ibex__cfg_i.d_user.rsp_intg \tl_rv_core_ibex__cfg_i.d_user.data_intg \tl_rv_core_ibex__cfg_i.d_error 1'0 }, Q = \u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$78254 ($dff) from module xbar_main (D = { \u_sm1_53.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$78252 ($dff) from module xbar_main (D = { \u_sm1_53.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$78235 ($dff) from module xbar_main (D = { \tl_kmac_i.d_opcode \tl_kmac_i.d_param \tl_kmac_i.d_size \tl_kmac_i.d_source \tl_kmac_i.d_sink \u_sm1_51.u_devicefifo.rspfifo.wdata_i [47:16] \tl_kmac_i.d_user.rsp_intg \tl_kmac_i.d_user.data_intg \tl_kmac_i.d_error 1'0 }, Q = \u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$78233 ($dff) from module xbar_main (D = { \tl_kmac_i.d_opcode \tl_kmac_i.d_param \tl_kmac_i.d_size \tl_kmac_i.d_source \tl_kmac_i.d_sink \u_sm1_51.u_devicefifo.rspfifo.wdata_i [47:16] \tl_kmac_i.d_user.rsp_intg \tl_kmac_i.d_user.data_intg \tl_kmac_i.d_error 1'0 }, Q = \u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$78216 ($dff) from module xbar_main (D = { \u_sm1_51.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$78214 ($dff) from module xbar_main (D = { \u_sm1_51.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$78197 ($dff) from module xbar_main (D = { \tl_keymgr_i.d_opcode \tl_keymgr_i.d_param \tl_keymgr_i.d_size \tl_keymgr_i.d_source \tl_keymgr_i.d_sink \u_sm1_50.u_devicefifo.rspfifo.wdata_i [47:16] \tl_keymgr_i.d_user.rsp_intg \tl_keymgr_i.d_user.data_intg \tl_keymgr_i.d_error 1'0 }, Q = \u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$78195 ($dff) from module xbar_main (D = { \tl_keymgr_i.d_opcode \tl_keymgr_i.d_param \tl_keymgr_i.d_size \tl_keymgr_i.d_source \tl_keymgr_i.d_sink \u_sm1_50.u_devicefifo.rspfifo.wdata_i [47:16] \tl_keymgr_i.d_user.rsp_intg \tl_keymgr_i.d_user.data_intg \tl_keymgr_i.d_error 1'0 }, Q = \u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$78178 ($dff) from module xbar_main (D = { \u_sm1_50.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$78176 ($dff) from module xbar_main (D = { \u_sm1_50.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$78159 ($dff) from module xbar_main (D = { \tl_otbn_i.d_opcode \tl_otbn_i.d_param \tl_otbn_i.d_size \tl_otbn_i.d_source \tl_otbn_i.d_sink \u_sm1_49.u_devicefifo.rspfifo.wdata_i [47:16] \tl_otbn_i.d_user.rsp_intg \tl_otbn_i.d_user.data_intg \tl_otbn_i.d_error 1'0 }, Q = \u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$78157 ($dff) from module xbar_main (D = { \tl_otbn_i.d_opcode \tl_otbn_i.d_param \tl_otbn_i.d_size \tl_otbn_i.d_source \tl_otbn_i.d_sink \u_sm1_49.u_devicefifo.rspfifo.wdata_i [47:16] \tl_otbn_i.d_user.rsp_intg \tl_otbn_i.d_user.data_intg \tl_otbn_i.d_error 1'0 }, Q = \u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$78140 ($dff) from module xbar_main (D = { \u_sm1_49.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$78138 ($dff) from module xbar_main (D = { \u_sm1_49.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$78121 ($dff) from module xbar_main (D = { \tl_rv_plic_i.d_opcode \tl_rv_plic_i.d_param \tl_rv_plic_i.d_size \tl_rv_plic_i.d_source \tl_rv_plic_i.d_sink \u_sm1_48.u_devicefifo.rspfifo.wdata_i [47:16] \tl_rv_plic_i.d_user.rsp_intg \tl_rv_plic_i.d_user.data_intg \tl_rv_plic_i.d_error 1'0 }, Q = \u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$78119 ($dff) from module xbar_main (D = { \tl_rv_plic_i.d_opcode \tl_rv_plic_i.d_param \tl_rv_plic_i.d_size \tl_rv_plic_i.d_source \tl_rv_plic_i.d_sink \u_sm1_48.u_devicefifo.rspfifo.wdata_i [47:16] \tl_rv_plic_i.d_user.rsp_intg \tl_rv_plic_i.d_user.data_intg \tl_rv_plic_i.d_error 1'0 }, Q = \u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$78102 ($dff) from module xbar_main (D = { \u_sm1_48.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$78100 ($dff) from module xbar_main (D = { \u_sm1_48.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$78083 ($dff) from module xbar_main (D = { \tl_hmac_i.d_opcode \tl_hmac_i.d_param \tl_hmac_i.d_size \tl_hmac_i.d_source \tl_hmac_i.d_sink \u_sm1_47.u_devicefifo.rspfifo.wdata_i [47:16] \tl_hmac_i.d_user.rsp_intg \tl_hmac_i.d_user.data_intg \tl_hmac_i.d_error 1'0 }, Q = \u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$78081 ($dff) from module xbar_main (D = { \tl_hmac_i.d_opcode \tl_hmac_i.d_param \tl_hmac_i.d_size \tl_hmac_i.d_source \tl_hmac_i.d_sink \u_sm1_47.u_devicefifo.rspfifo.wdata_i [47:16] \tl_hmac_i.d_user.rsp_intg \tl_hmac_i.d_user.data_intg \tl_hmac_i.d_error 1'0 }, Q = \u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$78064 ($dff) from module xbar_main (D = { \u_sm1_47.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$78062 ($dff) from module xbar_main (D = { \u_sm1_47.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$78045 ($dff) from module xbar_main (D = { \tl_edn1_i.d_opcode \tl_edn1_i.d_param \tl_edn1_i.d_size \tl_edn1_i.d_source \tl_edn1_i.d_sink \u_sm1_46.u_devicefifo.rspfifo.wdata_i [47:16] \tl_edn1_i.d_user.rsp_intg \tl_edn1_i.d_user.data_intg \tl_edn1_i.d_error 1'0 }, Q = \u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$78043 ($dff) from module xbar_main (D = { \tl_edn1_i.d_opcode \tl_edn1_i.d_param \tl_edn1_i.d_size \tl_edn1_i.d_source \tl_edn1_i.d_sink \u_sm1_46.u_devicefifo.rspfifo.wdata_i [47:16] \tl_edn1_i.d_user.rsp_intg \tl_edn1_i.d_user.data_intg \tl_edn1_i.d_error 1'0 }, Q = \u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$78026 ($dff) from module xbar_main (D = { \u_sm1_46.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$78024 ($dff) from module xbar_main (D = { \u_sm1_46.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$78007 ($dff) from module xbar_main (D = { \tl_edn0_i.d_opcode \tl_edn0_i.d_param \tl_edn0_i.d_size \tl_edn0_i.d_source \tl_edn0_i.d_sink \u_sm1_45.u_devicefifo.rspfifo.wdata_i [47:16] \tl_edn0_i.d_user.rsp_intg \tl_edn0_i.d_user.data_intg \tl_edn0_i.d_error 1'0 }, Q = \u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$78005 ($dff) from module xbar_main (D = { \tl_edn0_i.d_opcode \tl_edn0_i.d_param \tl_edn0_i.d_size \tl_edn0_i.d_source \tl_edn0_i.d_sink \u_sm1_45.u_devicefifo.rspfifo.wdata_i [47:16] \tl_edn0_i.d_user.rsp_intg \tl_edn0_i.d_user.data_intg \tl_edn0_i.d_error 1'0 }, Q = \u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$77988 ($dff) from module xbar_main (D = { \u_sm1_45.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$77986 ($dff) from module xbar_main (D = { \u_sm1_45.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$77969 ($dff) from module xbar_main (D = { \tl_csrng_i.d_opcode \tl_csrng_i.d_param \tl_csrng_i.d_size \tl_csrng_i.d_source \tl_csrng_i.d_sink \u_sm1_44.u_devicefifo.rspfifo.wdata_i [47:16] \tl_csrng_i.d_user.rsp_intg \tl_csrng_i.d_user.data_intg \tl_csrng_i.d_error 1'0 }, Q = \u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$77967 ($dff) from module xbar_main (D = { \tl_csrng_i.d_opcode \tl_csrng_i.d_param \tl_csrng_i.d_size \tl_csrng_i.d_source \tl_csrng_i.d_sink \u_sm1_44.u_devicefifo.rspfifo.wdata_i [47:16] \tl_csrng_i.d_user.rsp_intg \tl_csrng_i.d_user.data_intg \tl_csrng_i.d_error 1'0 }, Q = \u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$77950 ($dff) from module xbar_main (D = { \u_sm1_44.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$77948 ($dff) from module xbar_main (D = { \u_sm1_44.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$77931 ($dff) from module xbar_main (D = { \tl_entropy_src_i.d_opcode \tl_entropy_src_i.d_param \tl_entropy_src_i.d_size \tl_entropy_src_i.d_source \tl_entropy_src_i.d_sink \u_sm1_43.u_devicefifo.rspfifo.wdata_i [47:16] \tl_entropy_src_i.d_user.rsp_intg \tl_entropy_src_i.d_user.data_intg \tl_entropy_src_i.d_error 1'0 }, Q = \u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$77929 ($dff) from module xbar_main (D = { \tl_entropy_src_i.d_opcode \tl_entropy_src_i.d_param \tl_entropy_src_i.d_size \tl_entropy_src_i.d_source \tl_entropy_src_i.d_sink \u_sm1_43.u_devicefifo.rspfifo.wdata_i [47:16] \tl_entropy_src_i.d_user.rsp_intg \tl_entropy_src_i.d_user.data_intg \tl_entropy_src_i.d_error 1'0 }, Q = \u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$77912 ($dff) from module xbar_main (D = { \u_sm1_43.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$77910 ($dff) from module xbar_main (D = { \u_sm1_43.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$77893 ($dff) from module xbar_main (D = { \tl_aes_i.d_opcode \tl_aes_i.d_param \tl_aes_i.d_size \tl_aes_i.d_source \tl_aes_i.d_sink \u_sm1_42.u_devicefifo.rspfifo.wdata_i [47:16] \tl_aes_i.d_user.rsp_intg \tl_aes_i.d_user.data_intg \tl_aes_i.d_error 1'0 }, Q = \u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$77891 ($dff) from module xbar_main (D = { \tl_aes_i.d_opcode \tl_aes_i.d_param \tl_aes_i.d_size \tl_aes_i.d_source \tl_aes_i.d_sink \u_sm1_42.u_devicefifo.rspfifo.wdata_i [47:16] \tl_aes_i.d_user.rsp_intg \tl_aes_i.d_user.data_intg \tl_aes_i.d_error 1'0 }, Q = \u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$77874 ($dff) from module xbar_main (D = { \u_sm1_42.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$77872 ($dff) from module xbar_main (D = { \u_sm1_42.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$77855 ($dff) from module xbar_main (D = { \tl_flash_ctrl__prim_i.d_opcode \tl_flash_ctrl__prim_i.d_param \tl_flash_ctrl__prim_i.d_size \tl_flash_ctrl__prim_i.d_source \tl_flash_ctrl__prim_i.d_sink \u_sm1_41.u_devicefifo.rspfifo.wdata_i [47:16] \tl_flash_ctrl__prim_i.d_user.rsp_intg \tl_flash_ctrl__prim_i.d_user.data_intg \tl_flash_ctrl__prim_i.d_error 1'0 }, Q = \u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$77853 ($dff) from module xbar_main (D = { \tl_flash_ctrl__prim_i.d_opcode \tl_flash_ctrl__prim_i.d_param \tl_flash_ctrl__prim_i.d_size \tl_flash_ctrl__prim_i.d_source \tl_flash_ctrl__prim_i.d_sink \u_sm1_41.u_devicefifo.rspfifo.wdata_i [47:16] \tl_flash_ctrl__prim_i.d_user.rsp_intg \tl_flash_ctrl__prim_i.d_user.data_intg \tl_flash_ctrl__prim_i.d_error 1'0 }, Q = \u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$77836 ($dff) from module xbar_main (D = { \u_sm1_41.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$77834 ($dff) from module xbar_main (D = { \u_sm1_41.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$77817 ($dff) from module xbar_main (D = { \tl_flash_ctrl__core_i.d_opcode \tl_flash_ctrl__core_i.d_param \tl_flash_ctrl__core_i.d_size \tl_flash_ctrl__core_i.d_source \tl_flash_ctrl__core_i.d_sink \u_sm1_40.u_devicefifo.rspfifo.wdata_i [47:16] \tl_flash_ctrl__core_i.d_user.rsp_intg \tl_flash_ctrl__core_i.d_user.data_intg \tl_flash_ctrl__core_i.d_error 1'0 }, Q = \u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$77815 ($dff) from module xbar_main (D = { \tl_flash_ctrl__core_i.d_opcode \tl_flash_ctrl__core_i.d_param \tl_flash_ctrl__core_i.d_size \tl_flash_ctrl__core_i.d_source \tl_flash_ctrl__core_i.d_sink \u_sm1_40.u_devicefifo.rspfifo.wdata_i [47:16] \tl_flash_ctrl__core_i.d_user.rsp_intg \tl_flash_ctrl__core_i.d_user.data_intg \tl_flash_ctrl__core_i.d_error 1'0 }, Q = \u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$77798 ($dff) from module xbar_main (D = { \u_sm1_40.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$77796 ($dff) from module xbar_main (D = { \u_sm1_40.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$77779 ($dff) from module xbar_main (D = { \tl_rv_dm__regs_i.d_opcode \tl_rv_dm__regs_i.d_param \tl_rv_dm__regs_i.d_size \tl_rv_dm__regs_i.d_source \tl_rv_dm__regs_i.d_sink \u_sm1_33.u_devicefifo.rspfifo.wdata_i [47:16] \tl_rv_dm__regs_i.d_user.rsp_intg \tl_rv_dm__regs_i.d_user.data_intg \tl_rv_dm__regs_i.d_error 1'0 }, Q = \u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$77777 ($dff) from module xbar_main (D = { \tl_rv_dm__regs_i.d_opcode \tl_rv_dm__regs_i.d_param \tl_rv_dm__regs_i.d_size \tl_rv_dm__regs_i.d_source \tl_rv_dm__regs_i.d_sink \u_sm1_33.u_devicefifo.rspfifo.wdata_i [47:16] \tl_rv_dm__regs_i.d_user.rsp_intg \tl_rv_dm__regs_i.d_user.data_intg \tl_rv_dm__regs_i.d_error 1'0 }, Q = \u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$77760 ($dff) from module xbar_main (D = { \u_sm1_33.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$77758 ($dff) from module xbar_main (D = { \u_sm1_33.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$77741 ($dff) from module xbar_main (D = { \tl_flash_ctrl__mem_i.d_opcode \tl_flash_ctrl__mem_i.d_param \tl_flash_ctrl__mem_i.d_size \tl_flash_ctrl__mem_i.d_source \tl_flash_ctrl__mem_i.d_sink \u_sm1_30.u_devicefifo.rspfifo.wdata_i [47:16] \tl_flash_ctrl__mem_i.d_user.rsp_intg \tl_flash_ctrl__mem_i.d_user.data_intg \tl_flash_ctrl__mem_i.d_error 1'0 }, Q = \u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$77739 ($dff) from module xbar_main (D = { \tl_flash_ctrl__mem_i.d_opcode \tl_flash_ctrl__mem_i.d_param \tl_flash_ctrl__mem_i.d_size \tl_flash_ctrl__mem_i.d_source \tl_flash_ctrl__mem_i.d_sink \u_sm1_30.u_devicefifo.rspfifo.wdata_i [47:16] \tl_flash_ctrl__mem_i.d_user.rsp_intg \tl_flash_ctrl__mem_i.d_user.data_intg \tl_flash_ctrl__mem_i.d_error 1'0 }, Q = \u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$77722 ($dff) from module xbar_main (D = { \u_sm1_30.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$77720 ($dff) from module xbar_main (D = { \u_sm1_30.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]$77703 ($dff) from module xbar_main (D = { \tl_rv_dm__rom_i.d_opcode \tl_rv_dm__rom_i.d_param \tl_rv_dm__rom_i.d_size \tl_rv_dm__rom_i.d_source \tl_rv_dm__rom_i.d_sink \u_sm1_28.u_devicefifo.rspfifo.wdata_i [47:16] \tl_rv_dm__rom_i.d_user.rsp_intg \tl_rv_dm__rom_i.d_user.data_intg \tl_rv_dm__rom_i.d_error 1'0 }, Q = \u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]$77701 ($dff) from module xbar_main (D = { \tl_rv_dm__rom_i.d_opcode \tl_rv_dm__rom_i.d_param \tl_rv_dm__rom_i.d_size \tl_rv_dm__rom_i.d_source \tl_rv_dm__rom_i.d_sink \u_sm1_28.u_devicefifo.rspfifo.wdata_i [47:16] \tl_rv_dm__rom_i.d_user.rsp_intg \tl_rv_dm__rom_i.d_user.data_intg \tl_rv_dm__rom_i.d_error 1'0 }, Q = \u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]$77684 ($dff) from module xbar_main (D = { \u_sm1_28.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]$77682 ($dff) from module xbar_main (D = { \u_sm1_28.gen_arb_ppc.u_reqarb.data_o [107:1] 1'0 }, Q = \u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.storage[1]$77665 ($dff) from module xbar_main (D = { \u_s1n_54.fifo_h.tl_d_i.d_opcode \u_s1n_54.tl_t_p[d_param] \u_s1n_54.tl_t_p[d_size] \u_s1n_54.tl_t_p[d_source] \u_s1n_54.tl_t_p[d_sink] \u_s1n_54.fifo_h.rspfifo.wdata_i [47:16] \u_s1n_54.tl_t_p[d_user][rsp_intg] \u_s1n_54.tl_t_p[d_user][data_intg] \u_s1n_54.tl_t_p[d_error] 1'0 }, Q = \u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.storage[0]$77663 ($dff) from module xbar_main (D = { \u_s1n_54.fifo_h.tl_d_i.d_opcode \u_s1n_54.tl_t_p[d_param] \u_s1n_54.tl_t_p[d_size] \u_s1n_54.tl_t_p[d_source] \u_s1n_54.tl_t_p[d_sink] \u_s1n_54.fifo_h.rspfifo.wdata_i [47:16] \u_s1n_54.tl_t_p[d_user][rsp_intg] \u_s1n_54.tl_t_p[d_user][data_intg] \u_s1n_54.tl_t_p[d_error] 1'0 }, Q = \u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_s1n_54.fifo_h.reqfifo.gen_normal_fifo.storage[1]$77646 ($dff) from module xbar_main (D = { \tl_rv_dm__sba_i.a_opcode \tl_rv_dm__sba_i.a_param \tl_rv_dm__sba_i.a_size \tl_rv_dm__sba_i.a_source \tl_rv_dm__sba_i.a_address \tl_rv_dm__sba_i.a_mask \tl_rv_dm__sba_i.a_data \tl_rv_dm__sba_i.a_user.rsvd \tl_rv_dm__sba_i.a_user.instr_type \tl_rv_dm__sba_i.a_user.cmd_intg \tl_rv_dm__sba_i.a_user.data_intg \dev_sel_s1n_54 }, Q = \u_s1n_54.fifo_h.reqfifo.gen_normal_fifo.storage[1]).
Adding EN signal on $memory\u_s1n_54.fifo_h.reqfifo.gen_normal_fifo.storage[0]$77644 ($dff) from module xbar_main (D = { \tl_rv_dm__sba_i.a_opcode \tl_rv_dm__sba_i.a_param \tl_rv_dm__sba_i.a_size \tl_rv_dm__sba_i.a_source \tl_rv_dm__sba_i.a_address \tl_rv_dm__sba_i.a_mask \tl_rv_dm__sba_i.a_data \tl_rv_dm__sba_i.a_user.rsvd \tl_rv_dm__sba_i.a_user.instr_type \tl_rv_dm__sba_i.a_user.cmd_intg \tl_rv_dm__sba_i.a_user.data_intg \dev_sel_s1n_54 }, Q = \u_s1n_54.fifo_h.reqfifo.gen_normal_fifo.storage[0]).
Adding EN signal on $memory\u_asf_38.rspfifo.storage[3]$77601 ($dff) from module xbar_main (D = { \tl_spi_host1_i.d_opcode \tl_spi_host1_i.d_param \tl_spi_host1_i.d_size \tl_spi_host1_i.d_source \tl_spi_host1_i.d_sink \tl_spi_host1_i.d_data \tl_spi_host1_i.d_user.rsp_intg \tl_spi_host1_i.d_user.data_intg \tl_spi_host1_i.d_error }, Q = \u_asf_38.rspfifo.storage[3]).
Adding EN signal on $memory\u_asf_38.rspfifo.storage[2]$77599 ($dff) from module xbar_main (D = { \tl_spi_host1_i.d_opcode \tl_spi_host1_i.d_param \tl_spi_host1_i.d_size \tl_spi_host1_i.d_source \tl_spi_host1_i.d_sink \tl_spi_host1_i.d_data \tl_spi_host1_i.d_user.rsp_intg \tl_spi_host1_i.d_user.data_intg \tl_spi_host1_i.d_error }, Q = \u_asf_38.rspfifo.storage[2]).
Adding EN signal on $memory\u_asf_38.rspfifo.storage[1]$77597 ($dff) from module xbar_main (D = { \tl_spi_host1_i.d_opcode \tl_spi_host1_i.d_param \tl_spi_host1_i.d_size \tl_spi_host1_i.d_source \tl_spi_host1_i.d_sink \tl_spi_host1_i.d_data \tl_spi_host1_i.d_user.rsp_intg \tl_spi_host1_i.d_user.data_intg \tl_spi_host1_i.d_error }, Q = \u_asf_38.rspfifo.storage[1]).
Adding EN signal on $memory\u_asf_38.rspfifo.storage[0]$77595 ($dff) from module xbar_main (D = { \tl_spi_host1_i.d_opcode \tl_spi_host1_i.d_param \tl_spi_host1_i.d_size \tl_spi_host1_i.d_source \tl_spi_host1_i.d_sink \tl_spi_host1_i.d_data \tl_spi_host1_i.d_user.rsp_intg \tl_spi_host1_i.d_user.data_intg \tl_spi_host1_i.d_error }, Q = \u_asf_38.rspfifo.storage[0]).
Adding EN signal on $memory\u_asf_38.reqfifo.storage[3]$77552 ($dff) from module xbar_main (D = { \u_sm1_39.gen_arb_ppc.u_reqarb.data_o [107:93] \tl_sm1_39_ds_h2d[a_source] \u_sm1_39.gen_arb_ppc.u_reqarb.data_o [91:1] }, Q = \u_asf_38.reqfifo.storage[3]).
Adding EN signal on $memory\u_asf_38.reqfifo.storage[2]$77550 ($dff) from module xbar_main (D = { \u_sm1_39.gen_arb_ppc.u_reqarb.data_o [107:93] \tl_sm1_39_ds_h2d[a_source] \u_sm1_39.gen_arb_ppc.u_reqarb.data_o [91:1] }, Q = \u_asf_38.reqfifo.storage[2]).
Adding EN signal on $memory\u_asf_38.reqfifo.storage[1]$77548 ($dff) from module xbar_main (D = { \u_sm1_39.gen_arb_ppc.u_reqarb.data_o [107:93] \tl_sm1_39_ds_h2d[a_source] \u_sm1_39.gen_arb_ppc.u_reqarb.data_o [91:1] }, Q = \u_asf_38.reqfifo.storage[1]).
Adding EN signal on $memory\u_asf_38.reqfifo.storage[0]$77546 ($dff) from module xbar_main (D = { \u_sm1_39.gen_arb_ppc.u_reqarb.data_o [107:93] \tl_sm1_39_ds_h2d[a_source] \u_sm1_39.gen_arb_ppc.u_reqarb.data_o [91:1] }, Q = \u_asf_38.reqfifo.storage[0]).
Adding EN signal on $memory\u_asf_36.rspfifo.storage[3]$77503 ($dff) from module xbar_main (D = { \tl_spi_host0_i.d_opcode \tl_spi_host0_i.d_param \tl_spi_host0_i.d_size \tl_spi_host0_i.d_source \tl_spi_host0_i.d_sink \tl_spi_host0_i.d_data \tl_spi_host0_i.d_user.rsp_intg \tl_spi_host0_i.d_user.data_intg \tl_spi_host0_i.d_error }, Q = \u_asf_36.rspfifo.storage[3]).
Adding EN signal on $memory\u_asf_36.rspfifo.storage[2]$77501 ($dff) from module xbar_main (D = { \tl_spi_host0_i.d_opcode \tl_spi_host0_i.d_param \tl_spi_host0_i.d_size \tl_spi_host0_i.d_source \tl_spi_host0_i.d_sink \tl_spi_host0_i.d_data \tl_spi_host0_i.d_user.rsp_intg \tl_spi_host0_i.d_user.data_intg \tl_spi_host0_i.d_error }, Q = \u_asf_36.rspfifo.storage[2]).
Adding EN signal on $memory\u_asf_36.rspfifo.storage[1]$77499 ($dff) from module xbar_main (D = { \tl_spi_host0_i.d_opcode \tl_spi_host0_i.d_param \tl_spi_host0_i.d_size \tl_spi_host0_i.d_source \tl_spi_host0_i.d_sink \tl_spi_host0_i.d_data \tl_spi_host0_i.d_user.rsp_intg \tl_spi_host0_i.d_user.data_intg \tl_spi_host0_i.d_error }, Q = \u_asf_36.rspfifo.storage[1]).
Adding EN signal on $memory\u_asf_36.rspfifo.storage[0]$77497 ($dff) from module xbar_main (D = { \tl_spi_host0_i.d_opcode \tl_spi_host0_i.d_param \tl_spi_host0_i.d_size \tl_spi_host0_i.d_source \tl_spi_host0_i.d_sink \tl_spi_host0_i.d_data \tl_spi_host0_i.d_user.rsp_intg \tl_spi_host0_i.d_user.data_intg \tl_spi_host0_i.d_error }, Q = \u_asf_36.rspfifo.storage[0]).
Adding EN signal on $memory\u_asf_36.reqfifo.storage[3]$77454 ($dff) from module xbar_main (D = \u_sm1_37.gen_arb_ppc.u_reqarb.data_o [107:1], Q = \u_asf_36.reqfifo.storage[3]).
Adding EN signal on $memory\u_asf_36.reqfifo.storage[2]$77452 ($dff) from module xbar_main (D = \u_sm1_37.gen_arb_ppc.u_reqarb.data_o [107:1], Q = \u_asf_36.reqfifo.storage[2]).
Adding EN signal on $memory\u_asf_36.reqfifo.storage[1]$77450 ($dff) from module xbar_main (D = \u_sm1_37.gen_arb_ppc.u_reqarb.data_o [107:1], Q = \u_asf_36.reqfifo.storage[1]).
Adding EN signal on $memory\u_asf_36.reqfifo.storage[0]$77448 ($dff) from module xbar_main (D = \u_sm1_37.gen_arb_ppc.u_reqarb.data_o [107:1], Q = \u_asf_36.reqfifo.storage[0]).
Adding EN signal on $memory\u_asf_34.rspfifo.storage[3]$77405 ($dff) from module xbar_main (D = { \tl_peri_i.d_opcode \tl_peri_i.d_param \tl_peri_i.d_size \tl_peri_i.d_source \tl_peri_i.d_sink \tl_peri_i.d_data \tl_peri_i.d_user.rsp_intg \tl_peri_i.d_user.data_intg \tl_peri_i.d_error }, Q = \u_asf_34.rspfifo.storage[3]).
Adding EN signal on $memory\u_asf_34.rspfifo.storage[2]$77403 ($dff) from module xbar_main (D = { \tl_peri_i.d_opcode \tl_peri_i.d_param \tl_peri_i.d_size \tl_peri_i.d_source \tl_peri_i.d_sink \tl_peri_i.d_data \tl_peri_i.d_user.rsp_intg \tl_peri_i.d_user.data_intg \tl_peri_i.d_error }, Q = \u_asf_34.rspfifo.storage[2]).
Adding EN signal on $memory\u_asf_34.rspfifo.storage[1]$77401 ($dff) from module xbar_main (D = { \tl_peri_i.d_opcode \tl_peri_i.d_param \tl_peri_i.d_size \tl_peri_i.d_source \tl_peri_i.d_sink \tl_peri_i.d_data \tl_peri_i.d_user.rsp_intg \tl_peri_i.d_user.data_intg \tl_peri_i.d_error }, Q = \u_asf_34.rspfifo.storage[1]).
Adding EN signal on $memory\u_asf_34.rspfifo.storage[0]$77399 ($dff) from module xbar_main (D = { \tl_peri_i.d_opcode \tl_peri_i.d_param \tl_peri_i.d_size \tl_peri_i.d_source \tl_peri_i.d_sink \tl_peri_i.d_data \tl_peri_i.d_user.rsp_intg \tl_peri_i.d_user.data_intg \tl_peri_i.d_error }, Q = \u_asf_34.rspfifo.storage[0]).
Adding EN signal on $memory\u_asf_34.reqfifo.storage[3]$77356 ($dff) from module xbar_main (D = \u_sm1_35.gen_arb_ppc.u_reqarb.data_o [107:1], Q = \u_asf_34.reqfifo.storage[3]).
Adding EN signal on $memory\u_asf_34.reqfifo.storage[2]$77354 ($dff) from module xbar_main (D = \u_sm1_35.gen_arb_ppc.u_reqarb.data_o [107:1], Q = \u_asf_34.reqfifo.storage[2]).
Adding EN signal on $memory\u_asf_34.reqfifo.storage[1]$77352 ($dff) from module xbar_main (D = \u_sm1_35.gen_arb_ppc.u_reqarb.data_o [107:1], Q = \u_asf_34.reqfifo.storage[1]).
Adding EN signal on $memory\u_asf_34.reqfifo.storage[0]$77350 ($dff) from module xbar_main (D = \u_sm1_35.gen_arb_ppc.u_reqarb.data_o [107:1], Q = \u_asf_34.reqfifo.storage[0]).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78355 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78354 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78353 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78352 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78351 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78350 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78349 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78348 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78347 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78346 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78345 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78344 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78343 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78342 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78341 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78340 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78339 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78338 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78337 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78336 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78335 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78334 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78333 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78332 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78331 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78330 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78329 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78328 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78327 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78326 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78325 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78324 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78323 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78322 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78321 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78320 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78319 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78318 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78317 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78316 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78315 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78314 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78313 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78312 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78311 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78310 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78309 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78308 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78307 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78306 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78305 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78304 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78303 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78302 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78301 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78300 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78299 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78298 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78297 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78296 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78295 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78294 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78293 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78292 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78291 ($dffe) from module xbar_main.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$78290 ($dffe) from module xbar_main.

yosys> opt_clean

3.28.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 92 unused cells and 92 unused wires.
<suppressed ~93 debug messages>

yosys> opt_expr -full

3.28.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.28.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.28.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~40 debug messages>

yosys> opt_reduce -full

3.28.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
    Consolidated identical input bits for $mux cell $memory\u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77667:
      Old ports: A={ \u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_s1n_54.fifo_h.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77686:
      Old ports: A={ \u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_28.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77705:
      Old ports: A={ \u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_28.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77724:
      Old ports: A={ \u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_30.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77743:
      Old ports: A={ \u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_30.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77762:
      Old ports: A={ \u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_33.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77781:
      Old ports: A={ \u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_33.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77800:
      Old ports: A={ \u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_40.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77819:
      Old ports: A={ \u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_40.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77838:
      Old ports: A={ \u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_41.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77857:
      Old ports: A={ \u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_41.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77876:
      Old ports: A={ \u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_42.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77895:
      Old ports: A={ \u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_42.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77914:
      Old ports: A={ \u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_43.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77933:
      Old ports: A={ \u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_43.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77952:
      Old ports: A={ \u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_44.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77971:
      Old ports: A={ \u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_44.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$77990:
      Old ports: A={ \u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_45.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78009:
      Old ports: A={ \u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_45.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78028:
      Old ports: A={ \u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_46.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78047:
      Old ports: A={ \u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_46.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78066:
      Old ports: A={ \u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_47.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78085:
      Old ports: A={ \u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_47.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78104:
      Old ports: A={ \u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_48.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78123:
      Old ports: A={ \u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_48.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78142:
      Old ports: A={ \u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_49.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78161:
      Old ports: A={ \u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_49.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78180:
      Old ports: A={ \u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_50.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78199:
      Old ports: A={ \u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_50.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78218:
      Old ports: A={ \u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_51.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78237:
      Old ports: A={ \u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_51.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78256:
      Old ports: A={ \u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1] 1'0 }, B={ \u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1] 1'0 }, Y=\u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.storage[0] [107:1], B=\u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.storage[1] [107:1], Y=\u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [107:1]
      New connections: \u_sm1_53.u_devicefifo.reqfifo.gen_normal_fifo.rdata_int [0] = 1'0
    Consolidated identical input bits for $mux cell $memory\u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.storage$rdmux[0][0][0]$78275:
      Old ports: A={ \u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1] 1'0 }, B={ \u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1] 1'0 }, Y=\u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int
      New ports: A=\u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.storage[0] [64:1], B=\u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.storage[1] [64:1], Y=\u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [64:1]
      New connections: \u_sm1_53.u_devicefifo.rspfifo.gen_normal_fifo.rdata_int [0] = 1'0
  Optimizing cells in module \xbar_main.
Performed a total of 33 changes.

yosys> opt_merge

3.28.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_share

3.28.22. Executing OPT_SHARE pass.

yosys> opt_dff

3.28.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> opt_expr -full

3.28.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.28.26. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.28.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~40 debug messages>

yosys> opt_reduce -full

3.28.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.28.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_share

3.28.30. Executing OPT_SHARE pass.

yosys> opt_dff

3.28.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> opt_expr -full

3.28.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.28.34. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.29. Executing ABC pass (technology mapping using ABC).

3.29.1. Extracting gate netlist of module `\xbar_main' to `<abc-temp-dir>/input.blif'..
Extracted 15322 gates and 19834 wires to a netlist network with 4510 inputs and 5389 outputs.

3.29.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/yosys_verific_rs/result_04-05-2022T15-08-45/Golden_synth_rs_ade.json/xbar_main/abc_tmp.scr 
ABC:   #Luts =  8279  Max Lvl =  33  Avg Lvl =   8.40  [   1.79 sec. at Pass 0]
ABC:   #Luts =  7686  Max Lvl =  29  Avg Lvl =   7.68  [  88.66 sec. at Pass 1]
ABC:   #Luts =  7555  Max Lvl =  25  Avg Lvl =   7.22  [  14.82 sec. at Pass 2]
ABC:   #Luts =  7467  Max Lvl =  25  Avg Lvl =   6.68  [  22.12 sec. at Pass 3]
ABC:   #Luts =  7463  Max Lvl =  23  Avg Lvl =   6.57  [  21.64 sec. at Pass 4]
ABC:   #Luts =  7402  Max Lvl =  23  Avg Lvl =   6.57  [  39.16 sec. at Pass 5]
ABC:   #Luts =  7399  Max Lvl =  21  Avg Lvl =   6.57  [  25.78 sec. at Pass 6]
ABC:   #Luts =  7376  Max Lvl =  23  Avg Lvl =   6.55  [  39.90 sec. at Pass 7]
ABC:   #Luts =  7376  Max Lvl =  23  Avg Lvl =   6.55  [  25.89 sec. at Pass 8]
ABC:   #Luts =  7366  Max Lvl =  20  Avg Lvl =   6.61  [  42.96 sec. at Pass 9]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     7347
ABC RESULTS:        internal signals:     9935
ABC RESULTS:           input signals:     4510
ABC RESULTS:          output signals:     5389
Removing temp directory.

yosys> opt

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~40 debug messages>

yosys> opt_reduce

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff

3.30.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 0 unused cells and 11682 unused wires.
<suppressed ~427 debug messages>

yosys> opt_expr

3.30.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.30.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~40 debug messages>

yosys> opt_reduce

3.30.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.30.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff

3.30.13. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 71 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 72 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 73 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 74 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 76 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 77 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 78 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 79 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 80 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 81 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 82 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 83 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 84 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 85 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 86 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 87 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 88 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 89 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 90 on $auto$ff.cc:262:slice$78384 ($dffe) from module xbar_main.
Setting constant 0-bit at position 71 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 72 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 73 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 74 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 76 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 77 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 78 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 79 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 80 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 81 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 82 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 83 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 84 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 85 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 86 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 87 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 88 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 89 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.
Setting constant 0-bit at position 90 on $auto$ff.cc:262:slice$78385 ($dffe) from module xbar_main.

yosys> opt_clean

3.30.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> opt_expr

3.30.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.30.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~40 debug messages>

yosys> opt_reduce

3.30.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.30.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff

3.30.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> opt_expr

3.30.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.30.23. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.31. Printing statistics.

=== xbar_main ===

   Number of wires:              23817
   Number of wire bits:         199998
   Number of public wires:       21412
   Number of public wire bits:  196555
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               7952
     $_DFFE_PN0P_                  300
     $_DFFE_PN1P_                    3
     $_DFF_PN0_                      3
     $and                          116
     $dffe                          92
     $lut                         7340
     $mux                           52
     $not                           46


yosys> shregmap -minlen 8 -maxlen 20

3.32. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.33. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.34. Printing statistics.

=== xbar_main ===

   Number of wires:              23817
   Number of wire bits:         199998
   Number of public wires:       21412
   Number of public wire bits:  196555
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               7952
     $_DFFE_PN0P_                  300
     $_DFFE_PN1P_                    3
     $_DFF_PN0_                      3
     $and                          116
     $dffe                          92
     $lut                         7340
     $mux                           52
     $not                           46


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.35. Executing TECHMAP pass (map to technology primitives).

3.35.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.35.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.35.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $dffe.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PN1P_ for cells of type $_DFFE_PN1P_.
Using template \$_DFFE_PP_ for cells of type $_DFFE_PP_.
No more expansions possible.
<suppressed ~15926 debug messages>

yosys> opt_expr -mux_undef

3.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.
<suppressed ~107701 debug messages>

yosys> simplemap

3.37. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.38. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

yosys> opt_merge

3.39. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
<suppressed ~83973 debug messages>
Removed a total of 27991 cells.

yosys> opt_dff -nodffe -nosdff

3.40. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.41. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 0 unused cells and 47724 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.42. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.42.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.
<suppressed ~5195 debug messages>

yosys> opt_merge -nomux

3.42.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.42.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.42.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.42.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 0 unused cells and 1893 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.42.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.42.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.42.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.42.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.42.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> opt_expr

3.42.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.42.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.43. Executing ABC pass (technology mapping using ABC).

3.43.1. Extracting gate netlist of module `\xbar_main' to `<abc-temp-dir>/input.blif'..
Extracted 24330 gates and 33576 wires to a netlist network with 9244 inputs and 5757 outputs.

3.43.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/yosys_verific_rs/result_04-05-2022T15-08-45/Golden_synth_rs_ade.json/xbar_main/abc_tmp.scr 
ABC:   #Luts =  9015  Max Lvl =  23  Avg Lvl =   6.40  [   3.65 sec. at Pass 0]
ABC:   #Luts =  9015  Max Lvl =  23  Avg Lvl =   6.40  [ 147.35 sec. at Pass 1]
ABC:   #Luts =  8989  Max Lvl =  22  Avg Lvl =   5.98  [  36.03 sec. at Pass 2]
ABC:   #Luts =  8896  Max Lvl =  22  Avg Lvl =   6.45  [  46.95 sec. at Pass 3]
ABC:   #Luts =  8896  Max Lvl =  22  Avg Lvl =   6.45  [  31.83 sec. at Pass 4]
ABC:   #Luts =  8880  Max Lvl =  23  Avg Lvl =   5.60  [  55.83 sec. at Pass 5]
ABC:   #Luts =  8880  Max Lvl =  23  Avg Lvl =   5.60  [  39.86 sec. at Pass 6]
ABC:   #Luts =  8852  Max Lvl =  22  Avg Lvl =   7.41  [  46.01 sec. at Pass 7]
ABC:   #Luts =  8852  Max Lvl =  22  Avg Lvl =   7.41  [  29.77 sec. at Pass 8]
ABC:   #Luts =  8852  Max Lvl =  22  Avg Lvl =   7.41  [  57.14 sec. at Pass 9]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.43.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     8852
ABC RESULTS:        internal signals:    18575
ABC RESULTS:           input signals:     9244
ABC RESULTS:          output signals:     5757
Removing temp directory.

yosys> opt

3.44. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.44.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

yosys> opt_merge -nomux

3.44.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.44.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.44.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.44.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff

3.44.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.44.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 0 unused cells and 27763 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.44.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.44.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.44.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_main..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.44.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_main.
Performed a total of 0 changes.

yosys> opt_merge

3.44.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_main'.
Removed a total of 0 cells.

yosys> opt_dff

3.44.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.44.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..

yosys> opt_expr

3.44.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_main.

3.44.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.45. Executing HIERARCHY pass (managing design hierarchy).

3.45.1. Analyzing design hierarchy..
Top module:  \xbar_main

3.45.2. Analyzing design hierarchy..
Top module:  \xbar_main
Removed 0 unused modules.

yosys> stat

3.46. Printing statistics.

=== xbar_main ===

   Number of wires:              24850
   Number of wire bits:         199795
   Number of public wires:       21410
   Number of public wire bits:  196331
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              16995
     $lut                         8851
     dffsre                       8144


yosys> opt_clean -purge

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_main..
Removed 0 unused cells and 20196 unused wires.
<suppressed ~20196 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.48. Executing Verilog backend.

yosys> bmuxmap

3.48.1. Executing BMUXMAP pass.

yosys> demuxmap

3.48.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\xbar_main'.

Warnings: 53 unique messages, 56 total
End of script. Logfile hash: 6301ef64e1, CPU: user 168.08s system 1.61s, MEM: 495.88 MB peak
Yosys 0.16+6 (git sha1 7f5477eb1, gcc 9.1.0 -fPIC -Os)
Time spent: 96% 2x abc (4680 sec), 1% 36x opt_clean (58 sec), ...
real 1103.86
user 4593.07
sys 254.93
