
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.47
 Yosys 0.18+10 (git sha1 8217e4c48, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k key_update.v permutation.v present_encryptor_top.v sbox.v sub_per.v substitution.v

yosys> verific -vlog2k key_update.v permutation.v present_encryptor_top.v sbox.v sub_per.v substitution.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'key_update.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'permutation.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'present_encryptor_top.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sub_per.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'substitution.v'

yosys> synth_rs -top present_encryptor_top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.57

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top present_encryptor_top

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] present_encryptor_top.v:31: compiling module 'present_encryptor_top'
VERIFIC-INFO [VERI-1018] sub_per.v:31: compiling module 'sub_per'
VERIFIC-INFO [VERI-1018] substitution.v:31: compiling module 'substitution'
VERIFIC-INFO [VERI-1018] sbox.v:31: compiling module 'sbox'
VERIFIC-INFO [VERI-1018] permutation.v:31: compiling module 'permutation'
VERIFIC-INFO [VERI-1018] key_update.v:31: compiling module 'key_update'
Importing module present_encryptor_top.
Importing module key_update.
Importing module sbox.
Importing module sub_per.
Importing module permutation.
Importing module substitution.

3.3.1. Analyzing design hierarchy..
Top module:  \present_encryptor_top
Used module:     \key_update
Used module:         \sbox
Used module:     \sub_per
Used module:         \permutation
Used module:         \substitution

3.3.2. Analyzing design hierarchy..
Top module:  \present_encryptor_top
Used module:     \key_update
Used module:         \sbox
Used module:     \sub_per
Used module:         \permutation
Used module:         \substitution
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module substitution.
Optimizing module permutation.
Optimizing module sub_per.
Optimizing module sbox.
Optimizing module key_update.
Optimizing module present_encryptor_top.
<suppressed ~7 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module substitution.
Deleting now unused module permutation.
Deleting now unused module sub_per.
Deleting now unused module sbox.
Deleting now unused module key_update.
<suppressed ~21 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 2 unused cells and 732 unused wires.
<suppressed ~16 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module present_encryptor_top...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
    dead port 1/2 on $mux $verific$mux_17$present_encryptor_top.v:90$335.
    dead port 1/2 on $mux $verific$mux_18$present_encryptor_top.v:90$336.
    dead port 1/2 on $mux $verific$mux_19$present_encryptor_top.v:90$337.
    dead port 1/2 on $mux $verific$mux_23$present_encryptor_top.v:91$341.
    dead port 1/2 on $mux $verific$mux_24$present_encryptor_top.v:91$342.
    dead port 1/2 on $mux $verific$mux_25$present_encryptor_top.v:91$343.
Removed 6 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$state_reg$present_encryptor_top.v:92$348 ($aldff) from module present_encryptor_top.
Removing never-active async load on $verific$round_counter_reg$present_encryptor_top.v:92$349 ($aldff) from module present_encryptor_top.
Removing never-active async load on $verific$key_reg$present_encryptor_top.v:92$347 ($aldff) from module present_encryptor_top.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 0 unused cells and 6 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$state_reg$present_encryptor_top.v:92$348 ($dff) from module present_encryptor_top (D = $verific$n1026$20, Q = \state).
Adding EN signal on $verific$round_counter_reg$present_encryptor_top.v:92$349 ($dff) from module present_encryptor_top (D = $verific$n1091$21, Q = \round_counter).
Adding SRST signal on $auto$ff.cc:262:slice$755 ($dffe) from module present_encryptor_top (D = $verific$n564$10, Q = \round_counter, rval = 5'00001).
Adding EN signal on $verific$key_reg$present_encryptor_top.v:92$347 ($dff) from module present_encryptor_top (D = $verific$n1178$23, Q = \key).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 3 unused cells and 3 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.13.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 2) from port B of cell present_encryptor_top.$auto$opt_dff.cc:195:make_patterns_logic$759 ($ne).
Removed top 4 bits (of 5) from port B of cell present_encryptor_top.$verific$add_13$present_encryptor_top.v:87$331 ($add).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module present_encryptor_top:
  creating $macc model for $verific$add_13$present_encryptor_top.v:87$331 ($add).
  creating $alu model for $macc $verific$add_13$present_encryptor_top.v:87$331.
  creating $alu cell for $verific$add_13$present_encryptor_top.v:87$331: $auto$alumacc.cc:485:replace_alu$760
  created 1 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== present_encryptor_top ===

   Number of wires:                 66
   Number of wire bits:           1797
   Number of public wires:          59
   Number of public wire bits:    1557
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 27
     $alu                            1
     $bmux                          17
     $dffe                           2
     $mux                            3
     $ne                             1
     $sdffce                         1
     $xor                            2


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.21.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.21.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `$auto$memory_bmux2rom.cc:63:execute$811'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$808'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$805'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$802'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$799'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$796'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$793'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$790'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$787'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$784'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$781'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$778'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$775'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$772'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$769'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$766'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$763'[0] in module `\present_encryptor_top': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$811'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$808'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$805'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$802'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$799'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$796'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$793'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$790'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$787'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$784'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$781'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$778'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$775'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$772'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$769'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$766'[0] in module `\present_encryptor_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$763'[0] in module `\present_encryptor_top': merged address FF to cell.

yosys> opt_clean

3.21.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> memory_share

3.21.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> memory_collect

3.21.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== present_encryptor_top ===

   Number of wires:                 67
   Number of wire bits:           1801
   Number of public wires:          59
   Number of public wire bits:    1557
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 28
     $alu                            1
     $dffe                           2
     $mem_v2                        17
     $mux                            4
     $ne                             1
     $sdffce                         1
     $xor                            2


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> stat

3.24. Printing statistics.

=== present_encryptor_top ===

   Number of wires:                 67
   Number of wire bits:           1801
   Number of public wires:          59
   Number of public wire bits:    1557
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 28
     $alu                            1
     $dffe                           2
     $mem_v2                        17
     $mux                            4
     $ne                             1
     $sdffce                         1
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $ne.
Using template $paramod$672a140277c71df8314410f22acc08d55222c3c7\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $sdffce.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000101 for cells of type $lcu.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~319 debug messages>

yosys> stat

3.26. Printing statistics.

=== present_encryptor_top ===

   Number of wires:                102
   Number of wire bits:           2995
   Number of public wires:          59
   Number of public wire bits:    1557
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                505
     $_AND_                         12
     $_DFFE_PN_                     64
     $_DFFE_PP_                     80
     $_MUX_                        233
     $_NOT_                          5
     $_OR_                           7
     $_SDFFCE_PP0N_                  4
     $_SDFFCE_PP1N_                  1
     $_XOR_                         82
     $mem_v2                        17


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.
<suppressed ~27 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 5 unused cells and 35 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.27.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.
<suppressed ~80 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory $auto$memory_bmux2rom.cc:63:execute$763 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
Extracted data FF from read port 0 of present_encryptor_top.$auto$memory_bmux2rom.cc:63:execute$763: $$auto$memory_bmux2rom.cc:63:execute$763$rdreg[0]
  read interface: 1 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$766 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$769 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$772 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$775 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$778 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$781 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$784 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$787 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$790 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$793 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$796 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$799 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$802 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$805 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$808 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$811 in module \present_encryptor_top:
  created 16 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~17 debug messages>

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[0]$1460 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[1]$1462 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[2]$1464 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[3]$1466 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[4]$1468 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[5]$1470 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[6]$1472 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[7]$1474 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[8]$1476 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[9]$1478 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[10]$1480 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[11]$1482 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[12]$1484 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[13]$1486 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[14]$1488 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$763[15]$1490 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[0]$1537 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[1]$1539 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[2]$1541 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[3]$1543 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[4]$1545 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[5]$1547 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[6]$1549 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[7]$1551 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[8]$1553 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[9]$1555 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[10]$1557 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[11]$1559 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[12]$1561 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[13]$1563 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[14]$1565 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$766[15]$1567 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[0]$1614 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[1]$1616 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[2]$1618 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[3]$1620 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[4]$1622 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[5]$1624 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[6]$1626 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[7]$1628 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[8]$1630 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[9]$1632 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[10]$1634 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[11]$1636 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[12]$1638 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[13]$1640 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[14]$1642 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$769[15]$1644 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[0]$1691 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[1]$1693 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[2]$1695 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[3]$1697 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[4]$1699 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[5]$1701 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[6]$1703 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[7]$1705 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[8]$1707 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[9]$1709 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[10]$1711 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[11]$1713 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[12]$1715 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[13]$1717 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[14]$1719 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$772[15]$1721 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[0]$1768 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[1]$1770 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[2]$1772 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[3]$1774 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[4]$1776 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[5]$1778 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[6]$1780 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[7]$1782 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[8]$1784 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[9]$1786 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[10]$1788 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[11]$1790 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[12]$1792 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[13]$1794 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[14]$1796 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$775[15]$1798 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[0]$1845 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[1]$1847 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[2]$1849 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[3]$1851 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[4]$1853 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[5]$1855 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[6]$1857 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[7]$1859 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[8]$1861 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[9]$1863 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[10]$1865 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[11]$1867 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[12]$1869 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[13]$1871 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[14]$1873 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$778[15]$1875 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[0]$1922 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[1]$1924 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[2]$1926 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[3]$1928 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[4]$1930 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[5]$1932 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[6]$1934 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[7]$1936 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[8]$1938 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[9]$1940 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[10]$1942 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[11]$1944 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[12]$1946 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[13]$1948 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[14]$1950 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$781[15]$1952 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[0]$1999 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[1]$2001 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[2]$2003 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[3]$2005 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[4]$2007 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[5]$2009 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[6]$2011 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[7]$2013 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[8]$2015 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[9]$2017 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[10]$2019 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[11]$2021 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[12]$2023 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[13]$2025 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[14]$2027 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$784[15]$2029 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[0]$2076 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[1]$2078 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[2]$2080 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[3]$2082 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[4]$2084 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[5]$2086 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[6]$2088 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[7]$2090 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[8]$2092 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[9]$2094 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[10]$2096 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[11]$2098 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[12]$2100 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[13]$2102 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[14]$2104 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$787[15]$2106 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[0]$2153 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[1]$2155 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[2]$2157 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[3]$2159 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[4]$2161 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[5]$2163 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[6]$2165 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[7]$2167 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[8]$2169 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[9]$2171 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[10]$2173 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[11]$2175 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[12]$2177 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[13]$2179 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[14]$2181 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$790[15]$2183 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[0]$2230 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[1]$2232 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[2]$2234 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[3]$2236 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[4]$2238 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[5]$2240 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[6]$2242 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[7]$2244 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[8]$2246 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[9]$2248 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[10]$2250 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[11]$2252 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[12]$2254 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[13]$2256 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[14]$2258 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$793[15]$2260 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[0]$2307 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[1]$2309 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[2]$2311 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[3]$2313 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[4]$2315 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[5]$2317 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[6]$2319 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[7]$2321 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[8]$2323 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[9]$2325 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[10]$2327 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[11]$2329 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[12]$2331 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[13]$2333 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[14]$2335 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$796[15]$2337 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[0]$2384 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[1]$2386 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[2]$2388 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[3]$2390 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[4]$2392 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[5]$2394 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[6]$2396 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[7]$2398 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[8]$2400 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[9]$2402 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[10]$2404 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[11]$2406 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[12]$2408 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[13]$2410 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[14]$2412 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$799[15]$2414 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[0]$2461 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[1]$2463 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[2]$2465 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[3]$2467 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[4]$2469 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[5]$2471 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[6]$2473 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[7]$2475 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[8]$2477 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[9]$2479 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[10]$2481 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[11]$2483 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[12]$2485 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[13]$2487 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[14]$2489 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$802[15]$2491 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[0]$2538 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[1]$2540 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[2]$2542 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[3]$2544 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[4]$2546 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[5]$2548 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[6]$2550 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[7]$2552 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[8]$2554 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[9]$2556 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[10]$2558 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[11]$2560 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[12]$2562 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[13]$2564 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[14]$2566 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$805[15]$2568 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[0]$2615 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[1]$2617 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[2]$2619 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[3]$2621 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[4]$2623 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[5]$2625 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[6]$2627 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[7]$2629 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[8]$2631 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[9]$2633 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[10]$2635 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[11]$2637 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[12]$2639 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[13]$2641 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[14]$2643 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$808[15]$2645 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[0]$2692 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[1]$2694 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[2]$2696 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[3]$2698 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[4]$2700 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[5]$2702 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[6]$2704 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[7]$2706 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[8]$2708 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[9]$2710 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[10]$2712 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[11]$2714 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[12]$2716 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[13]$2718 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[14]$2720 ($dff) from module present_encryptor_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$811[15]$2722 ($dff) from module present_encryptor_top (removing D path).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 0 unused cells and 816 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.30.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~17 debug messages>

yosys> opt_reduce -full

3.30.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][3][0]$1513:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$a$1502
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$a$1502 [3] $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$a$1502 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$a$1502 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][3][1]$1516:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$b$1503
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$b$1503 [2] $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$b$1503 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$b$1503 [3] $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$b$1503 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$b$1503 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][3][2]$1519:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][1]$a$1505
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][1]$a$1505 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][1]$a$1505 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][1]$a$1505 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][3][3]$1522:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][1]$b$1506
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][1]$b$1506 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][1]$b$1506 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][1]$b$1506 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][3][4]$1525:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][2]$a$1508
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][2]$a$1508 [2] $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][2]$a$1508 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][2]$a$1508 [3] $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][2]$a$1508 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][2]$a$1508 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][3][5]$1528:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][2]$b$1509
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][2]$b$1509 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][2]$b$1509 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][2]$b$1509 [0] $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][2]$b$1509 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][3][6]$1531:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][3]$a$1511
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][3]$a$1511 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][3]$a$1511 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][3]$a$1511 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][3][7]$1534:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][3]$b$1512
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][3]$b$1512 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][3]$b$1512 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][3][0]$1590:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$a$1579
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$a$1579 [3] $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$a$1579 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$a$1579 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][3][1]$1593:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$b$1580
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$b$1580 [2] $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$b$1580 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$b$1580 [3] $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$b$1580 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$b$1580 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][3][2]$1596:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][1]$a$1582
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][1]$a$1582 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][1]$a$1582 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][1]$a$1582 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][3][3]$1599:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][1]$b$1583
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][1]$b$1583 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][1]$b$1583 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][1]$b$1583 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][3][4]$1602:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][2]$a$1585
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][2]$a$1585 [2] $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][2]$a$1585 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][2]$a$1585 [3] $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][2]$a$1585 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][2]$a$1585 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][3][5]$1605:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][2]$b$1586
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][2]$b$1586 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][2]$b$1586 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][2]$b$1586 [0] $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][2]$b$1586 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][3][6]$1608:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][3]$a$1588
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][3]$a$1588 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][3]$a$1588 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][3]$a$1588 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][3][7]$1611:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][3]$b$1589
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][3]$b$1589 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][3]$b$1589 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][3][0]$1667:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$a$1656
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$a$1656 [3] $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$a$1656 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$a$1656 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][3][1]$1670:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$b$1657
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$b$1657 [2] $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$b$1657 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$b$1657 [3] $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$b$1657 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$b$1657 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][3][2]$1673:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][1]$a$1659
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][1]$a$1659 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][1]$a$1659 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][1]$a$1659 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][3][3]$1676:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][1]$b$1660
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][1]$b$1660 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][1]$b$1660 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][1]$b$1660 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][3][4]$1679:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][2]$a$1662
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][2]$a$1662 [2] $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][2]$a$1662 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][2]$a$1662 [3] $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][2]$a$1662 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][2]$a$1662 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][3][5]$1682:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][2]$b$1663
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][2]$b$1663 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][2]$b$1663 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][2]$b$1663 [0] $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][2]$b$1663 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][3][6]$1685:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][3]$a$1665
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][3]$a$1665 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][3]$a$1665 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][3]$a$1665 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][3][7]$1688:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][3]$b$1666
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][3]$b$1666 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][3]$b$1666 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][3][0]$1744:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$a$1733
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$a$1733 [3] $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$a$1733 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$a$1733 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][3][1]$1747:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$b$1734
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$b$1734 [2] $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$b$1734 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$b$1734 [3] $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$b$1734 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$b$1734 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][3][2]$1750:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][1]$a$1736
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][1]$a$1736 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][1]$a$1736 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][1]$a$1736 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][3][3]$1753:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][1]$b$1737
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][1]$b$1737 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][1]$b$1737 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][1]$b$1737 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][3][4]$1756:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][2]$a$1739
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][2]$a$1739 [2] $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][2]$a$1739 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][2]$a$1739 [3] $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][2]$a$1739 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][2]$a$1739 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][3][5]$1759:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][2]$b$1740
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][2]$b$1740 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][2]$b$1740 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][2]$b$1740 [0] $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][2]$b$1740 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][3][6]$1762:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][3]$a$1742
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][3]$a$1742 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][3]$a$1742 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][3]$a$1742 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][3][7]$1765:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][3]$b$1743
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][3]$b$1743 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][3]$b$1743 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][3][0]$1821:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$a$1810
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$a$1810 [3] $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$a$1810 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$a$1810 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][3][1]$1824:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$b$1811
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$b$1811 [2] $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$b$1811 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$b$1811 [3] $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$b$1811 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$b$1811 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][3][2]$1827:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][1]$a$1813
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][1]$a$1813 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][1]$a$1813 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][1]$a$1813 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][3][3]$1830:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][1]$b$1814
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][1]$b$1814 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][1]$b$1814 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][1]$b$1814 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][3][4]$1833:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][2]$a$1816
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][2]$a$1816 [2] $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][2]$a$1816 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][2]$a$1816 [3] $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][2]$a$1816 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][2]$a$1816 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][3][5]$1836:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][2]$b$1817
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][2]$b$1817 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][2]$b$1817 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][2]$b$1817 [0] $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][2]$b$1817 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][3][6]$1839:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][3]$a$1819
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][3]$a$1819 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][3]$a$1819 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][3]$a$1819 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][3][7]$1842:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][3]$b$1820
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][3]$b$1820 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][3]$b$1820 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][3][0]$1898:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$a$1887
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$a$1887 [3] $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$a$1887 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$a$1887 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][3][1]$1901:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$b$1888
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$b$1888 [2] $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$b$1888 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$b$1888 [3] $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$b$1888 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$b$1888 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][3][2]$1904:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][1]$a$1890
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][1]$a$1890 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][1]$a$1890 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][1]$a$1890 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][3][3]$1907:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][1]$b$1891
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][1]$b$1891 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][1]$b$1891 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][1]$b$1891 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][3][4]$1910:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][2]$a$1893
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][2]$a$1893 [2] $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][2]$a$1893 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][2]$a$1893 [3] $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][2]$a$1893 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][2]$a$1893 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][3][5]$1913:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][2]$b$1894
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][2]$b$1894 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][2]$b$1894 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][2]$b$1894 [0] $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][2]$b$1894 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][3][6]$1916:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][3]$a$1896
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][3]$a$1896 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][3]$a$1896 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][3]$a$1896 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][3][7]$1919:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][3]$b$1897
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][3]$b$1897 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][3]$b$1897 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][3][0]$1975:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$a$1964
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$a$1964 [3] $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$a$1964 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$a$1964 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][3][1]$1978:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$b$1965
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$b$1965 [2] $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$b$1965 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$b$1965 [3] $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$b$1965 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$b$1965 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][3][2]$1981:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][1]$a$1967
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][1]$a$1967 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][1]$a$1967 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][1]$a$1967 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][3][3]$1984:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][1]$b$1968
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][1]$b$1968 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][1]$b$1968 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][1]$b$1968 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][3][4]$1987:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][2]$a$1970
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][2]$a$1970 [2] $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][2]$a$1970 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][2]$a$1970 [3] $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][2]$a$1970 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][2]$a$1970 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][3][5]$1990:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][2]$b$1971
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][2]$b$1971 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][2]$b$1971 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][2]$b$1971 [0] $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][2]$b$1971 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][3][6]$1993:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][3]$a$1973
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][3]$a$1973 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][3]$a$1973 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][3]$a$1973 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][3][7]$1996:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][3]$b$1974
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][3]$b$1974 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][3]$b$1974 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][3][0]$2052:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$a$2041
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$a$2041 [3] $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$a$2041 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$a$2041 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][3][1]$2055:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$b$2042
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$b$2042 [2] $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$b$2042 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$b$2042 [3] $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$b$2042 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$b$2042 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][3][2]$2058:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][1]$a$2044
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][1]$a$2044 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][1]$a$2044 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][1]$a$2044 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][3][3]$2061:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][1]$b$2045
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][1]$b$2045 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][1]$b$2045 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][1]$b$2045 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][3][4]$2064:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][2]$a$2047
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][2]$a$2047 [2] $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][2]$a$2047 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][2]$a$2047 [3] $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][2]$a$2047 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][2]$a$2047 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][3][5]$2067:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][2]$b$2048
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][2]$b$2048 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][2]$b$2048 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][2]$b$2048 [0] $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][2]$b$2048 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][3][6]$2070:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][3]$a$2050
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][3]$a$2050 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][3]$a$2050 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][3]$a$2050 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][3][7]$2073:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][3]$b$2051
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][3]$b$2051 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][3]$b$2051 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][3][0]$2129:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$a$2118
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$a$2118 [3] $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$a$2118 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$a$2118 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][3][1]$2132:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$b$2119
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$b$2119 [2] $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$b$2119 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$b$2119 [3] $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$b$2119 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$b$2119 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][3][2]$2135:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][1]$a$2121
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][1]$a$2121 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][1]$a$2121 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][1]$a$2121 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][3][3]$2138:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][1]$b$2122
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][1]$b$2122 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][1]$b$2122 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][1]$b$2122 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][3][4]$2141:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][2]$a$2124
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][2]$a$2124 [2] $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][2]$a$2124 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][2]$a$2124 [3] $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][2]$a$2124 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][2]$a$2124 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][3][5]$2144:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][2]$b$2125
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][2]$b$2125 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][2]$b$2125 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][2]$b$2125 [0] $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][2]$b$2125 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][3][6]$2147:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][3]$a$2127
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][3]$a$2127 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][3]$a$2127 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][3]$a$2127 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][3][7]$2150:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][3]$b$2128
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][3]$b$2128 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][3]$b$2128 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][3][0]$2206:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$a$2195
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$a$2195 [3] $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$a$2195 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$a$2195 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][3][1]$2209:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$b$2196
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$b$2196 [2] $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$b$2196 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$b$2196 [3] $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$b$2196 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$b$2196 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][3][2]$2212:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][1]$a$2198
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][1]$a$2198 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][1]$a$2198 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][1]$a$2198 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][3][3]$2215:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][1]$b$2199
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][1]$b$2199 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][1]$b$2199 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][1]$b$2199 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][3][4]$2218:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][2]$a$2201
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][2]$a$2201 [2] $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][2]$a$2201 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][2]$a$2201 [3] $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][2]$a$2201 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][2]$a$2201 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][3][5]$2221:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][2]$b$2202
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][2]$b$2202 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][2]$b$2202 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][2]$b$2202 [0] $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][2]$b$2202 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][3][6]$2224:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][3]$a$2204
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][3]$a$2204 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][3]$a$2204 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][3]$a$2204 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][3][7]$2227:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][3]$b$2205
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][3]$b$2205 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][3]$b$2205 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][3][0]$2283:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$a$2272
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$a$2272 [3] $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$a$2272 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$a$2272 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][3][1]$2286:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$b$2273
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$b$2273 [2] $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$b$2273 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$b$2273 [3] $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$b$2273 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$b$2273 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][3][2]$2289:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][1]$a$2275
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][1]$a$2275 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][1]$a$2275 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][1]$a$2275 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][3][3]$2292:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][1]$b$2276
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][1]$b$2276 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][1]$b$2276 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][1]$b$2276 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][3][4]$2295:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][2]$a$2278
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][2]$a$2278 [2] $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][2]$a$2278 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][2]$a$2278 [3] $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][2]$a$2278 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][2]$a$2278 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][3][5]$2298:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][2]$b$2279
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][2]$b$2279 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][2]$b$2279 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][2]$b$2279 [0] $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][2]$b$2279 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][3][6]$2301:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][3]$a$2281
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][3]$a$2281 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][3]$a$2281 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][3]$a$2281 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][3][7]$2304:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][3]$b$2282
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][3]$b$2282 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][3]$b$2282 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][3][0]$2360:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$a$2349
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$a$2349 [3] $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$a$2349 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$a$2349 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][3][1]$2363:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$b$2350
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$b$2350 [2] $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$b$2350 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$b$2350 [3] $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$b$2350 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$b$2350 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][3][2]$2366:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][1]$a$2352
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][1]$a$2352 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][1]$a$2352 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][1]$a$2352 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][3][3]$2369:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][1]$b$2353
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][1]$b$2353 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][1]$b$2353 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][1]$b$2353 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][3][4]$2372:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][2]$a$2355
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][2]$a$2355 [2] $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][2]$a$2355 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][2]$a$2355 [3] $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][2]$a$2355 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][2]$a$2355 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][3][5]$2375:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][2]$b$2356
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][2]$b$2356 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][2]$b$2356 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][2]$b$2356 [0] $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][2]$b$2356 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][3][6]$2378:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][3]$a$2358
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][3]$a$2358 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][3]$a$2358 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][3]$a$2358 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][3][7]$2381:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][3]$b$2359
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][3]$b$2359 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][3]$b$2359 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][3][0]$2437:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$a$2426
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$a$2426 [3] $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$a$2426 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$a$2426 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][3][1]$2440:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$b$2427
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$b$2427 [2] $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$b$2427 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$b$2427 [3] $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$b$2427 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$b$2427 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][3][2]$2443:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][1]$a$2429
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][1]$a$2429 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][1]$a$2429 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][1]$a$2429 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][3][3]$2446:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][1]$b$2430
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][1]$b$2430 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][1]$b$2430 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][1]$b$2430 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][3][4]$2449:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][2]$a$2432
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][2]$a$2432 [2] $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][2]$a$2432 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][2]$a$2432 [3] $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][2]$a$2432 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][2]$a$2432 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][3][5]$2452:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][2]$b$2433
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][2]$b$2433 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][2]$b$2433 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][2]$b$2433 [0] $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][2]$b$2433 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][3][6]$2455:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][3]$a$2435
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][3]$a$2435 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][3]$a$2435 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][3]$a$2435 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][3][7]$2458:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][3]$b$2436
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][3]$b$2436 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][3]$b$2436 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][3][0]$2514:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$a$2503
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$a$2503 [3] $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$a$2503 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$a$2503 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][3][1]$2517:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$b$2504
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$b$2504 [2] $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$b$2504 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$b$2504 [3] $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$b$2504 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$b$2504 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][3][2]$2520:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][1]$a$2506
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][1]$a$2506 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][1]$a$2506 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][1]$a$2506 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][3][3]$2523:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][1]$b$2507
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][1]$b$2507 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][1]$b$2507 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][1]$b$2507 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][3][4]$2526:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][2]$a$2509
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][2]$a$2509 [2] $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][2]$a$2509 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][2]$a$2509 [3] $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][2]$a$2509 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][2]$a$2509 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][3][5]$2529:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][2]$b$2510
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][2]$b$2510 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][2]$b$2510 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][2]$b$2510 [0] $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][2]$b$2510 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][3][6]$2532:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][3]$a$2512
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][3]$a$2512 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][3]$a$2512 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][3]$a$2512 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][3][7]$2535:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][3]$b$2513
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][3]$b$2513 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][3]$b$2513 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][3][0]$2591:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$a$2580
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$a$2580 [3] $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$a$2580 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$a$2580 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][3][1]$2594:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$b$2581
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$b$2581 [2] $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$b$2581 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$b$2581 [3] $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$b$2581 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$b$2581 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][3][2]$2597:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][1]$a$2583
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][1]$a$2583 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][1]$a$2583 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][1]$a$2583 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][3][3]$2600:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][1]$b$2584
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][1]$b$2584 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][1]$b$2584 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][1]$b$2584 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][3][4]$2603:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][2]$a$2586
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][2]$a$2586 [2] $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][2]$a$2586 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][2]$a$2586 [3] $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][2]$a$2586 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][2]$a$2586 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][3][5]$2606:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][2]$b$2587
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][2]$b$2587 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][2]$b$2587 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][2]$b$2587 [0] $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][2]$b$2587 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][3][6]$2609:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][3]$a$2589
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][3]$a$2589 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][3]$a$2589 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][3]$a$2589 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][3][7]$2612:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][3]$b$2590
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][3]$b$2590 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][3]$b$2590 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][3][0]$2668:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$a$2657
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$a$2657 [3] $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$a$2657 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$a$2657 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][3][1]$2671:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$b$2658
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$b$2658 [2] $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$b$2658 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$b$2658 [3] $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$b$2658 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$b$2658 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][3][2]$2674:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][1]$a$2660
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][1]$a$2660 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][1]$a$2660 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][1]$a$2660 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][3][3]$2677:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][1]$b$2661
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][1]$b$2661 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][1]$b$2661 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][1]$b$2661 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][3][4]$2680:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][2]$a$2663
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][2]$a$2663 [2] $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][2]$a$2663 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][2]$a$2663 [3] $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][2]$a$2663 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][2]$a$2663 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][3][5]$2683:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][2]$b$2664
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][2]$b$2664 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][2]$b$2664 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][2]$b$2664 [0] $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][2]$b$2664 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][3][6]$2686:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][3]$a$2666
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][3]$a$2666 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][3]$a$2666 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][3]$a$2666 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][3][7]$2689:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][3]$b$2667
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][3]$b$2667 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][3]$b$2667 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][3][0]$2745:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$a$2734
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$a$2734 [3] $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$a$2734 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$a$2734 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][3][1]$2748:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$b$2735
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$b$2735 [2] $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$b$2735 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$b$2735 [3] $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$b$2735 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$b$2735 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][3][2]$2751:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][1]$a$2737
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][1]$a$2737 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][1]$a$2737 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][1]$a$2737 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][3][3]$2754:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][1]$b$2738
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][1]$b$2738 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][1]$b$2738 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][1]$b$2738 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][3][4]$2757:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][2]$a$2740
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][2]$a$2740 [2] $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][2]$a$2740 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][2]$a$2740 [3] $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][2]$a$2740 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][2]$a$2740 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][3][5]$2760:
      Old ports: A=4'1111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][2]$b$2741
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][2]$b$2741 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][2]$b$2741 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][2]$b$2741 [0] $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][2]$b$2741 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][3][6]$2763:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][3]$a$2743
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][3]$a$2743 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][3]$a$2743 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][3]$a$2743 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][3][7]$2766:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][3]$b$2744
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][3]$b$2744 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][3]$b$2744 [3:2] = 2'00
  Optimizing cells in module \present_encryptor_top.
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][3]$1510:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][3]$a$1511, B=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][3]$b$1512, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][1][1]$b$1500
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][3]$a$1511 [0] $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][3]$a$1511 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][3]$b$1512 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][1][1]$b$1500 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][1][1]$b$1500 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][3]$1587:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][3]$a$1588, B=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][3]$b$1589, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][1][1]$b$1577
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][3]$a$1588 [0] $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][3]$a$1588 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][3]$b$1589 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][1][1]$b$1577 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][1][1]$b$1577 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][3]$1664:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][3]$a$1665, B=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][3]$b$1666, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][1][1]$b$1654
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][3]$a$1665 [0] $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][3]$a$1665 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][3]$b$1666 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][1][1]$b$1654 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][1][1]$b$1654 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][3]$1741:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][3]$a$1742, B=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][3]$b$1743, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][1][1]$b$1731
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][3]$a$1742 [0] $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][3]$a$1742 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][3]$b$1743 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][1][1]$b$1731 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][1][1]$b$1731 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][3]$1818:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][3]$a$1819, B=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][3]$b$1820, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][1][1]$b$1808
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][3]$a$1819 [0] $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][3]$a$1819 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][3]$b$1820 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][1][1]$b$1808 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][1][1]$b$1808 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][3]$1895:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][3]$a$1896, B=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][3]$b$1897, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][1][1]$b$1885
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][3]$a$1896 [0] $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][3]$a$1896 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][3]$b$1897 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][1][1]$b$1885 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][1][1]$b$1885 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][3]$1972:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][3]$a$1973, B=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][3]$b$1974, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][1][1]$b$1962
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][3]$a$1973 [0] $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][3]$a$1973 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][3]$b$1974 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][1][1]$b$1962 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][1][1]$b$1962 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][3]$2049:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][3]$a$2050, B=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][3]$b$2051, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][1][1]$b$2039
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][3]$a$2050 [0] $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][3]$a$2050 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][3]$b$2051 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][1][1]$b$2039 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][1][1]$b$2039 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][3]$2126:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][3]$a$2127, B=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][3]$b$2128, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][1][1]$b$2116
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][3]$a$2127 [0] $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][3]$a$2127 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][3]$b$2128 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][1][1]$b$2116 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][1][1]$b$2116 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][3]$2203:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][3]$a$2204, B=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][3]$b$2205, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][1][1]$b$2193
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][3]$a$2204 [0] $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][3]$a$2204 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][3]$b$2205 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][1][1]$b$2193 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][1][1]$b$2193 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][3]$2280:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][3]$a$2281, B=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][3]$b$2282, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][1][1]$b$2270
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][3]$a$2281 [0] $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][3]$a$2281 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][3]$b$2282 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][1][1]$b$2270 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][1][1]$b$2270 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][3]$2357:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][3]$a$2358, B=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][3]$b$2359, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][1][1]$b$2347
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][3]$a$2358 [0] $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][3]$a$2358 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][3]$b$2359 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][1][1]$b$2347 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][1][1]$b$2347 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][3]$2434:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][3]$a$2435, B=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][3]$b$2436, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][1][1]$b$2424
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][3]$a$2435 [0] $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][3]$a$2435 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][3]$b$2436 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][1][1]$b$2424 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][1][1]$b$2424 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][3]$2511:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][3]$a$2512, B=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][3]$b$2513, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][1][1]$b$2501
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][3]$a$2512 [0] $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][3]$a$2512 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][3]$b$2513 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][1][1]$b$2501 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][1][1]$b$2501 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][3]$2588:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][3]$a$2589, B=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][3]$b$2590, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][1][1]$b$2578
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][3]$a$2589 [0] $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][3]$a$2589 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][3]$b$2590 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][1][1]$b$2578 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][1][1]$b$2578 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][3]$2665:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][3]$a$2666, B=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][3]$b$2667, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][1][1]$b$2655
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][3]$a$2666 [0] $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][3]$a$2666 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][3]$b$2667 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][1][1]$b$2655 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][1][1]$b$2655 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][3]$2742:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][3]$a$2743, B=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][3]$b$2744, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][1][1]$b$2732
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][3]$a$2743 [0] $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][3]$a$2743 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][3]$b$2744 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][1][1]$b$2732 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][1][1]$b$2732 [3] = 1'0
  Optimizing cells in module \present_encryptor_top.
Performed a total of 153 changes.

yosys> opt_merge

3.30.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
<suppressed ~204 debug messages>
Removed a total of 68 cells.

yosys> opt_share

3.30.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 0 unused cells and 68 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.
<suppressed ~34 debug messages>

3.30.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~51 debug messages>

yosys> opt_reduce -full

3.30.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$1501:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$a$1502 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$a$1502 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$a$1502 [0] $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$a$1502 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$a$1502 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][1][0]$a$1496
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$a$1502 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$a$1502 [0] $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$a$1502 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][1][0]$a$1496 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][1][0]$a$1496 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$763$rdmux[0][2][0]$a$1502 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$1578:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$a$1579 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$a$1579 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$a$1579 [0] $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$a$1579 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$a$1579 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][1][0]$a$1573
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$a$1579 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$a$1579 [0] $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$a$1579 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][1][0]$a$1573 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][1][0]$a$1573 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$766$rdmux[0][2][0]$a$1579 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$1655:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$a$1656 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$a$1656 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$a$1656 [0] $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$a$1656 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$a$1656 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][1][0]$a$1650
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$a$1656 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$a$1656 [0] $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$a$1656 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][1][0]$a$1650 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][1][0]$a$1650 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$769$rdmux[0][2][0]$a$1656 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$1732:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$a$1733 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$a$1733 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$a$1733 [0] $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$a$1733 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$a$1733 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][1][0]$a$1727
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$a$1733 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$a$1733 [0] $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$a$1733 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][1][0]$a$1727 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][1][0]$a$1727 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$772$rdmux[0][2][0]$a$1733 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$1809:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$a$1810 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$a$1810 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$a$1810 [0] $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$a$1810 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$a$1810 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][1][0]$a$1804
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$a$1810 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$a$1810 [0] $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$a$1810 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][1][0]$a$1804 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][1][0]$a$1804 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$775$rdmux[0][2][0]$a$1810 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$1886:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$a$1887 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$a$1887 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$a$1887 [0] $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$a$1887 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$a$1887 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][1][0]$a$1881
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$a$1887 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$a$1887 [0] $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$a$1887 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][1][0]$a$1881 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][1][0]$a$1881 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$778$rdmux[0][2][0]$a$1887 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$1963:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$a$1964 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$a$1964 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$a$1964 [0] $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$a$1964 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$a$1964 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][1][0]$a$1958
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$a$1964 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$a$1964 [0] $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$a$1964 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][1][0]$a$1958 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][1][0]$a$1958 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$781$rdmux[0][2][0]$a$1964 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$2040:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$a$2041 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$a$2041 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$a$2041 [0] $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$a$2041 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$a$2041 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][1][0]$a$2035
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$a$2041 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$a$2041 [0] $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$a$2041 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][1][0]$a$2035 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][1][0]$a$2035 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$784$rdmux[0][2][0]$a$2041 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$2117:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$a$2118 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$a$2118 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$a$2118 [0] $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$a$2118 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$a$2118 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][1][0]$a$2112
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$a$2118 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$a$2118 [0] $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$a$2118 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][1][0]$a$2112 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][1][0]$a$2112 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$787$rdmux[0][2][0]$a$2118 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$2194:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$a$2195 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$a$2195 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$a$2195 [0] $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$a$2195 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$a$2195 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][1][0]$a$2189
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$a$2195 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$a$2195 [0] $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$a$2195 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][1][0]$a$2189 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][1][0]$a$2189 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$790$rdmux[0][2][0]$a$2195 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$2271:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$a$2272 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$a$2272 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$a$2272 [0] $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$a$2272 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$a$2272 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][1][0]$a$2266
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$a$2272 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$a$2272 [0] $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$a$2272 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][1][0]$a$2266 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][1][0]$a$2266 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$793$rdmux[0][2][0]$a$2272 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$2348:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$a$2349 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$a$2349 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$a$2349 [0] $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$a$2349 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$a$2349 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][1][0]$a$2343
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$a$2349 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$a$2349 [0] $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$a$2349 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][1][0]$a$2343 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][1][0]$a$2343 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$796$rdmux[0][2][0]$a$2349 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$2425:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$a$2426 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$a$2426 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$a$2426 [0] $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$a$2426 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$a$2426 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][1][0]$a$2420
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$a$2426 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$a$2426 [0] $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$a$2426 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][1][0]$a$2420 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][1][0]$a$2420 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$799$rdmux[0][2][0]$a$2426 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$2502:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$a$2503 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$a$2503 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$a$2503 [0] $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$a$2503 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$a$2503 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][1][0]$a$2497
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$a$2503 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$a$2503 [0] $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$a$2503 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][1][0]$a$2497 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][1][0]$a$2497 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$802$rdmux[0][2][0]$a$2503 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$2579:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$a$2580 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$a$2580 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$a$2580 [0] $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$a$2580 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$a$2580 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][1][0]$a$2574
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$a$2580 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$a$2580 [0] $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$a$2580 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][1][0]$a$2574 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][1][0]$a$2574 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$805$rdmux[0][2][0]$a$2580 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$2656:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$a$2657 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$a$2657 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$a$2657 [0] $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$a$2657 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$a$2657 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][1][0]$a$2651
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$a$2657 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$a$2657 [0] $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$a$2657 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][1][0]$a$2651 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][1][0]$a$2651 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$808$rdmux[0][2][0]$a$2657 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$2733:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$a$2734 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$a$2734 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$a$2734 [0] $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$a$2734 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$a$2734 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][1][0]$a$2728
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$a$2734 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$a$2734 [0] $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$a$2734 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][1][0]$a$2728 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][1][0]$a$2728 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$811$rdmux[0][2][0]$a$2734 [0]
  Optimizing cells in module \present_encryptor_top.
Performed a total of 17 changes.

yosys> opt_merge

3.30.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_share

3.30.22. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 0 unused cells and 17 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.30.26. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~51 debug messages>

yosys> opt_reduce -full

3.30.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.30.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_share

3.30.30. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> opt_expr -full

3.30.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.30.34. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $dff.
No more expansions possible.
<suppressed ~242 debug messages>

yosys> opt -sat

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.
<suppressed ~68 debug messages>

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
<suppressed ~255 debug messages>
Removed a total of 85 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 0 unused cells and 34 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.
<suppressed ~17 debug messages>

3.32.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.32.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.32.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 0 unused cells and 17 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.32.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.32.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.32.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.32.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> opt_expr

3.32.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.32.23. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  528 cells in clk=\clk_i, en=!\key_load, arst={ }, srst={ }
  29 cells in clk=\clk_i, en={ }, arst={ }, srst={ }
  19 cells in clk=\clk_i, en=!\key_load, arst={ }, srst=\data_load
  162 cells in clk=\clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$758, arst={ }, srst={ }

3.33.2. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, enabled by !\key_load
Extracted 528 gates and 659 wires to a netlist network with 129 inputs and 64 outputs.

3.33.2.1. Executing ABC.

3.33.3. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i
Extracted 29 gates and 40 wires to a netlist network with 9 inputs and 4 outputs.

3.33.3.1. Executing ABC.

3.33.4. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, enabled by !\key_load, synchronously reset by \data_load
Extracted 19 gates and 24 wires to a netlist network with 5 inputs and 5 outputs.

3.33.4.1. Executing ABC.

3.33.5. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$758
Extracted 162 gates and 249 wires to a netlist network with 87 inputs and 69 outputs.

3.33.5.1. Executing ABC.

yosys> abc -dff

3.34. Executing ABC pass (technology mapping using ABC).

3.34.1. Summary of detected clock domains:
  29 cells in clk=\clk_i, en={ }, arst={ }, srst={ }
  18 cells in clk=\clk_i, en=!\key_load, arst={ }, srst=\data_load
  560 cells in clk=\clk_i, en=!\key_load, arst={ }, srst={ }
  161 cells in clk=\clk_i, en=$abc$3987$auto$opt_dff.cc:194:make_patterns_logic$758, arst={ }, srst={ }

3.34.2. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i
Extracted 29 gates and 38 wires to a netlist network with 9 inputs and 4 outputs.

3.34.2.1. Executing ABC.

3.34.3. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, enabled by !\key_load, synchronously reset by \data_load
Extracted 18 gates and 23 wires to a netlist network with 5 inputs and 5 outputs.

3.34.3.1. Executing ABC.

3.34.4. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, enabled by !\key_load
Extracted 560 gates and 689 wires to a netlist network with 129 inputs and 64 outputs.

3.34.4.1. Executing ABC.

3.34.5. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, enabled by $abc$3987$auto$opt_dff.cc:194:make_patterns_logic$758
Extracted 161 gates and 248 wires to a netlist network with 87 inputs and 69 outputs.

3.34.5.1. Executing ABC.

yosys> abc -dff

3.35. Executing ABC pass (technology mapping using ABC).

3.35.1. Summary of detected clock domains:
  544 cells in clk=\clk_i, en=!\key_load, arst={ }, srst={ }
  28 cells in clk=\clk_i, en={ }, arst={ }, srst={ }
  18 cells in clk=\clk_i, en=!\key_load, arst={ }, srst=\data_load
  161 cells in clk=\clk_i, en=$abc$4810$abc$3987$auto$opt_dff.cc:194:make_patterns_logic$758, arst={ }, srst={ }

3.35.2. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, enabled by !\key_load
Extracted 544 gates and 673 wires to a netlist network with 129 inputs and 64 outputs.

3.35.2.1. Executing ABC.

3.35.3. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i
Extracted 28 gates and 37 wires to a netlist network with 9 inputs and 4 outputs.

3.35.3.1. Executing ABC.

3.35.4. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, enabled by !\key_load, synchronously reset by \data_load
Extracted 18 gates and 23 wires to a netlist network with 5 inputs and 5 outputs.

3.35.4.1. Executing ABC.

3.35.5. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, enabled by $abc$4810$abc$3987$auto$opt_dff.cc:194:make_patterns_logic$758
Extracted 161 gates and 248 wires to a netlist network with 87 inputs and 69 outputs.

3.35.5.1. Executing ABC.

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  18 cells in clk=\clk_i, en=!\key_load, arst={ }, srst=\data_load
  552 cells in clk=\clk_i, en=!\key_load, arst={ }, srst={ }
  28 cells in clk=\clk_i, en={ }, arst={ }, srst={ }
  161 cells in clk=\clk_i, en=$abc$5641$abc$4810$abc$3987$auto$opt_dff.cc:194:make_patterns_logic$758, arst={ }, srst={ }

3.36.2. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, enabled by !\key_load, synchronously reset by \data_load
Extracted 18 gates and 23 wires to a netlist network with 5 inputs and 5 outputs.

3.36.2.1. Executing ABC.

3.36.3. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, enabled by !\key_load
Extracted 552 gates and 681 wires to a netlist network with 129 inputs and 64 outputs.

3.36.3.1. Executing ABC.

3.36.4. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i
Extracted 28 gates and 37 wires to a netlist network with 9 inputs and 4 outputs.

3.36.4.1. Executing ABC.

3.36.5. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, enabled by $abc$5641$abc$4810$abc$3987$auto$opt_dff.cc:194:make_patterns_logic$758
Extracted 161 gates and 248 wires to a netlist network with 87 inputs and 69 outputs.

3.36.5.1. Executing ABC.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.
<suppressed ~14 debug messages>

yosys> opt_merge -nomux

3.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 0 unused cells and 3740 unused wires.
<suppressed ~26 debug messages>

yosys> opt_expr

3.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> opt_expr

3.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.38.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_z5EdfT/abc_tmp_1.scr

3.39. Executing ABC pass (technology mapping using ABC).

3.39.1. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Extracted 608 gates and 843 wires to a netlist network with 235 inputs and 218 outputs.

3.39.1.1. Executing ABC.
DE:   #PIs = 235  #Luts =   222  Max Lvl =   3  Avg Lvl =   1.33  [   0.06 sec. at Pass 0]
DE:   #PIs = 235  #Luts =   222  Max Lvl =   2  Avg Lvl =   1.31  [   1.06 sec. at Pass 1]
DE:   #PIs = 235  #Luts =   222  Max Lvl =   2  Avg Lvl =   1.31  [   0.22 sec. at Pass 2]
DE:   #PIs = 235  #Luts =   222  Max Lvl =   2  Avg Lvl =   1.31  [   0.33 sec. at Pass 3]
DE:   #PIs = 235  #Luts =   222  Max Lvl =   2  Avg Lvl =   1.31  [   0.39 sec. at Pass 4]
DE:   #PIs = 235  #Luts =   222  Max Lvl =   2  Avg Lvl =   1.31  [   0.44 sec. at Pass 5]
DE:   #PIs = 235  #Luts =   222  Max Lvl =   2  Avg Lvl =   1.31  [   0.43 sec. at Pass 6]
DE:   #PIs = 235  #Luts =   222  Max Lvl =   2  Avg Lvl =   1.31  [   0.21 sec. at Pass 7]

yosys> opt

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 0 unused cells and 838 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.42. Printing statistics.

=== present_encryptor_top ===

   Number of wires:                281
   Number of wire bits:           1282
   Number of public wires:          34
   Number of public wire bits:    1035
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                375
     $_DFFE_PN_                     64
     $_DFFE_PP_                     80
     $_DFF_P_                        4
     $_SDFFE_PP0N_                   5
     $lut                          222


yosys> shregmap -minlen 8 -maxlen 20

3.43. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.45. Printing statistics.

=== present_encryptor_top ===

   Number of wires:                291
   Number of wire bits:           1292
   Number of public wires:          34
   Number of public wire bits:    1035
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                385
     $_DFFE_PP0N_                   64
     $_DFFE_PP0P_                   80
     $_DFF_P_                        9
     $_MUX_                         10
     $lut                          222


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.46. Executing TECHMAP pass (map to technology primitives).

3.46.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.46.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.46.3. Continuing TECHMAP pass.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using template \$_DFFE_PP0N_ for cells of type $_DFFE_PP0N_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~719 debug messages>

yosys> opt_expr -mux_undef

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.
<suppressed ~4341 debug messages>

yosys> simplemap

3.48. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

yosys> opt_merge

3.50. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
<suppressed ~888 debug messages>
Removed a total of 296 cells.

yosys> opt_dff -nodffe -nosdff

3.51. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 0 unused cells and 1443 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.53. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.53.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.
<suppressed ~35 debug messages>

yosys> opt_merge -nomux

3.53.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.53.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.53.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.53.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.53.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.53.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.53.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> opt_expr

3.53.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.53.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_z5EdfT/abc_tmp_2.scr

3.54. Executing ABC pass (technology mapping using ABC).

3.54.1. Extracting gate netlist of module `\present_encryptor_top' to `<abc-temp-dir>/input.blif'..
Extracted 742 gates and 979 wires to a netlist network with 235 inputs and 219 outputs.

3.54.1.1. Executing ABC.
DE:   #PIs = 235  #Luts =   224  Max Lvl =   2  Avg Lvl =   1.31  [   0.11 sec. at Pass 0]
DE:   #PIs = 235  #Luts =   224  Max Lvl =   2  Avg Lvl =   1.31  [   1.19 sec. at Pass 1]
DE:   #PIs = 235  #Luts =   224  Max Lvl =   2  Avg Lvl =   1.31  [   0.34 sec. at Pass 2]
DE:   #PIs = 235  #Luts =   224  Max Lvl =   2  Avg Lvl =   1.31  [   0.43 sec. at Pass 3]
DE:   #PIs = 235  #Luts =   224  Max Lvl =   2  Avg Lvl =   1.31  [   0.64 sec. at Pass 4]
DE:   #PIs = 235  #Luts =   224  Max Lvl =   2  Avg Lvl =   1.31  [   1.11 sec. at Pass 5]
DE:   #PIs = 235  #Luts =   224  Max Lvl =   2  Avg Lvl =   1.31  [   1.00 sec. at Pass 6]
DE:   #PIs = 235  #Luts =   224  Max Lvl =   2  Avg Lvl =   1.31  [   0.17 sec. at Pass 7]

yosys> opt

3.55. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.55.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

yosys> opt_merge -nomux

3.55.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.55.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.55.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 0 unused cells and 792 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.55.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.55.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.55.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \present_encryptor_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \present_encryptor_top.
Performed a total of 0 changes.

yosys> opt_merge

3.55.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\present_encryptor_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..

yosys> opt_expr

3.55.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module present_encryptor_top.

3.55.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.56. Executing HIERARCHY pass (managing design hierarchy).

3.56.1. Analyzing design hierarchy..
Top module:  \present_encryptor_top

3.56.2. Analyzing design hierarchy..
Top module:  \present_encryptor_top
Removed 0 unused modules.

yosys> stat

3.57. Printing statistics.

=== present_encryptor_top ===

   Number of wires:                283
   Number of wire bits:           1284
   Number of public wires:          34
   Number of public wire bits:    1035
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                377
     $lut                          224
     dffsre                        153


yosys> opt_clean -purge

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \present_encryptor_top..
Removed 0 unused cells and 28 unused wires.
<suppressed ~28 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.59. Executing Verilog backend.
Dumping module `\present_encryptor_top'.

End of script. Logfile hash: 783e48ac9e, CPU: user 3.29s system 0.20s, MEM: 33.13 MB peak
Yosys 0.18+10 (git sha1 8217e4c48, gcc 9.1.0 -fPIC -Os)
Time spent: 93% 6x abc (44 sec), 2% 39x opt_expr (0 sec), ...
real 19.42
user 38.84
sys 8.87
