
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.140
 Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.

yosys> verilog_defaults -add -I.

yosys> read -sv prim_alert_pkg.sv prim_mubi_pkg.sv prim_pad_wrapper_pkg.sv prim_pkg.sv prim_secded_pkg.sv prim_subreg_pkg.sv prim_util_pkg.sv top_pkg.sv tlul_pkg.sv

yosys> verific -sv prim_alert_pkg.sv prim_mubi_pkg.sv prim_pad_wrapper_pkg.sv prim_pkg.sv prim_secded_pkg.sv prim_subreg_pkg.sv prim_util_pkg.sv top_pkg.sv tlul_pkg.sv

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_alert_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_alert_pkg.sv:19: parameter 'ALERT_TX_DEFAULT' declared inside package 'prim_alert_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_alert_pkg.sv:22: parameter 'ALERT_RX_DEFAULT' declared inside package 'prim_alert_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_mubi_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:19: parameter 'MuBi4Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:148: parameter 'MuBi8Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:277: parameter 'MuBi12Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:406: parameter 'MuBi16Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_pad_wrapper_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:24: parameter 'DriveStrDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:25: parameter 'SlewRateDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:39: parameter 'AttrDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:42: parameter 'PokDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_secded_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:81: parameter 'Secded2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:82: parameter 'Secded2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:90: parameter 'Secded2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:91: parameter 'Secded2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:99: parameter 'Secded3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:100: parameter 'Secded3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:108: parameter 'Secded6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:109: parameter 'Secded6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:117: parameter 'Secded7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:118: parameter 'Secded7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:126: parameter 'SecdedHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:127: parameter 'SecdedHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:135: parameter 'SecdedHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:136: parameter 'SecdedHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:144: parameter 'SecdedHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:145: parameter 'SecdedHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:153: parameter 'SecdedHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:154: parameter 'SecdedHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:162: parameter 'SecdedInv2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:163: parameter 'SecdedInv2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:171: parameter 'SecdedInv2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:172: parameter 'SecdedInv2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:180: parameter 'SecdedInv3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:181: parameter 'SecdedInv3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:189: parameter 'SecdedInv6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:190: parameter 'SecdedInv6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:198: parameter 'SecdedInv7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:199: parameter 'SecdedInv7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:207: parameter 'SecdedInvHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:208: parameter 'SecdedInvHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:216: parameter 'SecdedInvHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:217: parameter 'SecdedInvHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:225: parameter 'SecdedInvHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:226: parameter 'SecdedInvHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:234: parameter 'SecdedInvHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:235: parameter 'SecdedInvHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_subreg_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_util_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'top_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_pkg.sv'
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:14: parameter 'ArbiterImpl' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:27: parameter 'H2DCmdMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:28: parameter 'H2DCmdIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:29: parameter 'H2DCmdFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:30: parameter 'D2HRspMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:31: parameter 'D2HRspIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:32: parameter 'D2HRspFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:33: parameter 'DataMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:34: parameter 'DataIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:35: parameter 'DataFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:44: parameter 'TL_A_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:84: parameter 'TL_D_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam

yosys> read -vlog2k IOBUF.v

yosys> verific -vlog2k IOBUF.v

3. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IOBUF.v'

yosys> read -sv prim_xilinx_pad_wrapper.sv

yosys> verific -sv prim_xilinx_pad_wrapper.sv

4. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_xilinx_pad_wrapper.sv'

yosys> synth_rs -top prim_xilinx_pad_wrapper -tech genesis2 -goal area -de -verilog synthesized.v

5. Executing synth_rs pass: v0.4.116

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis2/cells_sim.v +/rapidsilicon/genesis2/dsp_sim.v +/rapidsilicon/genesis2/brams_sim.v

5.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

5.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dff'.
Generating RTLIL representation for module `\dffn'.
Generating RTLIL representation for module `\sdff'.
Generating RTLIL representation for module `\sdffn'.
Generating RTLIL representation for module `\dffr'.
Generating RTLIL representation for module `\dffnr'.
Generating RTLIL representation for module `\dffe'.
Generating RTLIL representation for module `\dffne'.
Generating RTLIL representation for module `\sdffre'.
Generating RTLIL representation for module `\sdffnre'.
Generating RTLIL representation for module `\dffre'.
Generating RTLIL representation for module `\dffnre'.
Generating RTLIL representation for module `\latch'.
Generating RTLIL representation for module `\latchn'.
Generating RTLIL representation for module `\latchr'.
Generating RTLIL representation for module `\latchnr'.
Generating RTLIL representation for module `\fa_1bit'.
Successfully finished Verilog frontend.

5.3. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP'.
Generating RTLIL representation for module `\RS_DSP_MULT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Successfully finished Verilog frontend.

5.4. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v' to AST representation.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\RS_TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top prim_xilinx_pad_wrapper

5.5. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] prim_xilinx_pad_wrapper.sv:9: compiling module 'prim_xilinx_pad_wrapper'
VERIFIC-INFO [VERI-1018] IOBUF.v:42: compiling module 'IOBUF'
VERIFIC-WARNING [VERI-1166] IOBUF.v:72: case condition never applies
Importing module prim_xilinx_pad_wrapper.
Importing module IOBUF.

5.5.1. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper
Used module:     \IOBUF

5.5.2. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper
Used module:     \IOBUF
Removed 0 unused modules.

yosys> proc

5.6. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

5.6.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

5.6.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

5.6.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

5.6.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

5.6.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

5.6.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

5.6.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

5.6.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

5.6.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

5.6.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

5.6.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

5.6.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module IOBUF.
<suppressed ~1 debug messages>
Optimizing module prim_xilinx_pad_wrapper.

yosys> demuxmap

5.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

5.8. Executing FLATTEN pass (flatten design).
Deleting now unused module IOBUF.
<suppressed ~1 debug messages>

yosys> demuxmap

5.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

5.10. Executing TRIBUF pass.

yosys> deminout

5.11. Executing DEMINOUT pass (demote inout ports to input or output).
Demoting inout port prim_xilinx_pad_wrapper.inout_io to output.

yosys> opt_expr

5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_clean

5.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 7 unused cells and 16 unused wires.
<suppressed ~17 debug messages>

yosys> check

5.14. Executing CHECK pass (checking for obvious problems).
Checking module prim_xilinx_pad_wrapper...
Found and reported 0 problems.

yosys> opt_expr

5.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.16. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.20. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

5.21. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.22. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

5.24. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

5.24.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

5.24.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

5.24.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

5.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> fsm_opt

5.24.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

5.24.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

5.24.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

5.24.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

5.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.30. Executing OPT_SHARE pass.

yosys> opt_dff -sat

5.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

5.34. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

5.35. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

5.36. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> demuxmap

5.37. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> stat

5.38. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  2
     $xor                            2


yosys> wreduce t:$mul

5.39. Executing WREDUCE pass (reducing word size of cells).

yosys> rs_dsp_macc -genesis2 -max_dsp 154

5.40. Executing RS_DSP_MACC pass.

yosys> techmap -map +/mul2dsp_check_maxwidth.v -D DSP_A_MAXWIDTH=20 -D DSP_B_MAXWIDTH=18 -D DSP_A_MINWIDTH=11 -D DSP_B_MINWIDTH=10 -D DSP_NAME=$__RS_MUL20X18 a:valid_map

5.41. Executing TECHMAP pass (map to technology primitives).

5.41.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

5.41.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> stat

5.42. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  2
     $xor                            2


yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/rapidsilicon/genesis2/dsp_map.v -D USE_DSP_CFG_PARAMS=0

5.43. Executing TECHMAP pass (map to technology primitives).

5.43.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_MUL20X18'.
Successfully finished Verilog frontend.

5.43.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/dsp_final_map.v

5.44. Executing TECHMAP pass (map to technology primitives).

5.44.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v' to AST representation.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Successfully finished Verilog frontend.

5.44.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> rs-pack-dsp-regs

5.45. Executing rs_pack_dsp_regs pass.

yosys> rs_dsp_io_regs

5.46. Executing RS_DSP_IO_REGS pass.

yosys> alumacc

5.47. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module prim_xilinx_pad_wrapper:
  created 0 $alu and 0 $macc cells.

yosys> opt_expr

5.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.49. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.50. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.51. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.52. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.53. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

5.54. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.55. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.56. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> stat

5.57. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  2
     $xor                            2


yosys> memory -nomap

5.58. Executing MEMORY pass.

yosys> opt_mem

5.58.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

5.58.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

5.58.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

5.58.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

5.58.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

5.58.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> memory_share

5.58.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

5.58.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

5.58.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> memory_collect

5.58.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

5.59. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  2
     $xor                            2


yosys> muxpack

5.60. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> opt_clean

5.61. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new_swap.txt -limit 150 a:read_swapped

5.62. Executing MEMORY_LIBMAP pass (mapping memories to cells).

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new.txt -limit 150

5.63. Executing MEMORY_LIBMAP pass (mapping memories to cells).

yosys> rs_bram_split -new_mapping

5.64. Executing Rs_BRAM_Split pass.

yosys> techmap -autoproc -map +/rapidsilicon/genesis2/brams_map_new.v

5.65. Executing TECHMAP pass (map to technology primitives).

5.65.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v' to AST representation.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_SDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_SDP'.
Successfully finished Verilog frontend.

5.65.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~6 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/brams_final_map_new.v

5.66. Executing TECHMAP pass (map to technology primitives).

5.66.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v' to AST representation.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Successfully finished Verilog frontend.

5.66.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> pmuxtree

5.67. Executing PMUXTREE pass.

yosys> muxpack

5.68. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> memory_map

5.69. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

5.70. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  2
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/arith_map.v

5.71. Executing TECHMAP pass (map to technology primitives).

5.71.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

5.71.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

5.71.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $xor.
No more expansions possible.
<suppressed ~73 debug messages>

yosys> stat

5.72. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  2
     $_XOR_                          2


yosys> opt_expr

5.73. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.74. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.75. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.76. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.77. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.78. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

5.79. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.80. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.81. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> opt_expr -full

5.82. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
<suppressed ~1 debug messages>

yosys> techmap -map +/techmap.v

5.83. Executing TECHMAP pass (map to technology primitives).

5.83.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

5.83.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> stat

5.84. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  2
     $_XOR_                          2


yosys> dfflegalize -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 t:$_SDFFCE_*

5.85. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

5.86. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  2
     $_XOR_                          2


yosys> opt_expr

5.87. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.88. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.89. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.90. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.91. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -sat

5.92. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.93. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.94. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> abc -dff -keepff

5.95. Executing ABC pass (technology mapping using ABC).

5.95.1. Summary of detected clock domains:
  2 cells in clk={ }, en={ }, arst={ }, srst={ }

5.95.2. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 2 gates and 4 wires to a netlist network with 2 inputs and 2 outputs.

5.95.2.1. Executing ABC.

yosys> abc -dff -keepff

5.96. Executing ABC pass (technology mapping using ABC).

5.96.1. Summary of detected clock domains:
  1 cells in clk={ }, en={ }, arst={ }, srst={ }

5.96.2. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 1 gates and 3 wires to a netlist network with 2 inputs and 1 outputs.

5.96.2.1. Executing ABC.

yosys> abc -dff -keepff

5.97. Executing ABC pass (technology mapping using ABC).

5.97.1. Summary of detected clock domains:
  1 cells in clk={ }, en={ }, arst={ }, srst={ }

5.97.2. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 1 gates and 3 wires to a netlist network with 2 inputs and 1 outputs.

5.97.2.1. Executing ABC.

yosys> abc -dff -keepff

5.98. Executing ABC pass (technology mapping using ABC).

5.98.1. Summary of detected clock domains:
  1 cells in clk={ }, en={ }, arst={ }, srst={ }

5.98.2. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 1 gates and 3 wires to a netlist network with 2 inputs and 1 outputs.

5.98.2.1. Executing ABC.

yosys> opt_ffinv

5.99. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

5.100. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.101. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.102. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.103. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.104. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.105. Executing OPT_SHARE pass.

yosys> opt_dff -sat

5.106. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.107. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 13 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

5.108. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> bmuxmap

5.109. Executing BMUXMAP pass.

yosys> demuxmap

5.110. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_1AH4Oq/abc_tmp_1.scr

5.111. Executing ABC pass (technology mapping using ABC).

5.111.1. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
Extracted 1 gates and 3 wires to a netlist network with 2 inputs and 1 outputs.

5.111.1.1. Executing ABC.
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.06 sec. at Pass 0]{firstMap}[1]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.15 sec. at Pass 1]{initMapFlow}[3]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.13 sec. at Pass 2]{map}[2]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.31 sec. at Pass 3]{postMap}[6]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.36 sec. at Pass 4]{map}[12]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.49 sec. at Pass 5]{postMap}[36]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   1.61 sec. at Pass 6]{pushMap}[100]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   1.47 sec. at Pass 7]{finalMap}[100]

yosys> opt_expr

5.112. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.113. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.114. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.115. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.116. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.117. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

5.118. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.119. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

5.120. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> opt_ffinv

5.121. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

5.122. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  1
     $lut                            1


yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFFE_??_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 -cell $_DLATCH_?_ 0 -cell $_DLATCH_???_ 0

5.123. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

5.124. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  1
     $lut                            1


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/ffs_map.v

5.125. Executing TECHMAP pass (map to technology primitives).

5.125.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

5.125.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Generating RTLIL representation for module `\$_SDFFE_PP0P_'.
Generating RTLIL representation for module `\$_SDFFE_PP0N_'.
Generating RTLIL representation for module `\$_SDFFE_PN0P_'.
Generating RTLIL representation for module `\$_SDFFE_PN0N_'.
Generating RTLIL representation for module `\$_SDFFE_PP1P_'.
Generating RTLIL representation for module `\$_SDFFE_PP1N_'.
Generating RTLIL representation for module `\$_SDFFE_PN1P_'.
Generating RTLIL representation for module `\$_SDFFE_PN1N_'.
Generating RTLIL representation for module `\$_SDFFE_NP0P_'.
Generating RTLIL representation for module `\$_SDFFE_NP0N_'.
Generating RTLIL representation for module `\$_SDFFE_NN0P_'.
Generating RTLIL representation for module `\$_SDFFE_NN0N_'.
Generating RTLIL representation for module `\$_SDFFE_NP1P_'.
Generating RTLIL representation for module `\$_SDFFE_NP1N_'.
Generating RTLIL representation for module `\$_SDFFE_NN1P_'.
Generating RTLIL representation for module `\$_SDFFE_NN1N_'.
Generating RTLIL representation for module `\$_DLATCH_P_'.
Generating RTLIL representation for module `\$_DLATCH_N_'.
Generating RTLIL representation for module `\$_DLATCH_PP0_'.
Generating RTLIL representation for module `\$_DLATCH_NP0_'.
Generating RTLIL representation for module `\$_DLATCH_PN0_'.
Generating RTLIL representation for module `\$_DLATCH_NN0_'.
Generating RTLIL representation for module `\$_DLATCH_PP1_'.
Generating RTLIL representation for module `\$_DLATCH_NP1_'.
Generating RTLIL representation for module `\$_DLATCH_PN1_'.
Generating RTLIL representation for module `\$_DLATCH_NN1_'.
Successfully finished Verilog frontend.

5.125.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~136 debug messages>

yosys> opt_expr -mux_undef

5.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
<suppressed ~1 debug messages>

yosys> simplemap

5.127. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

5.128. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge

5.129. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

5.130. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.131. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

5.132. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.133. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.134. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.135. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.136. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.137. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

5.138. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.139. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.140. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_1AH4Oq/abc_tmp_2.scr

5.141. Executing ABC pass (technology mapping using ABC).

5.141.1. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
Extracted 2 gates and 4 wires to a netlist network with 2 inputs and 1 outputs.

5.141.1.1. Executing ABC.
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.30 sec. at Pass 0]{firstMap}[1]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.27 sec. at Pass 1]{initMapFlow}[3]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.23 sec. at Pass 2]{map}[2]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.17 sec. at Pass 3]{postMap}[6]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.52 sec. at Pass 4]{map}[12]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.73 sec. at Pass 5]{postMap}[36]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   1.73 sec. at Pass 6]{pushMap}[100]
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   1.31 sec. at Pass 7]{finalMap}[100]

yosys> opt_expr

5.142. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.144. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.145. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.146. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.147. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

5.148. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.149. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

5.150. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> hierarchy -check

5.151. Executing HIERARCHY pass (managing design hierarchy).

5.151.1. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper

5.151.2. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper
Removed 0 unused modules.

yosys> stat

5.152. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  1
     $lut                            1


yosys> opt_clean -purge

5.153. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 8 unused wires.
<suppressed ~8 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

5.154. Executing Verilog backend.
Dumping module `\prim_xilinx_pad_wrapper'.

Warnings: 59 unique messages, 59 total
End of script. Logfile hash: d017597802, CPU: user 0.36s system 0.04s, MEM: 26.45 MB peak
Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)
Time spent: 99% 6x abc (74 sec), 0% 15x read_verilog (0 sec), ...
real 18.16
user 24.39
sys 50.61
