
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.14+36 (git sha1 4cd3e3b51, gcc 7.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k control.v conv2d.v ksa.v ksa1.v tfl.v

yosys> verific -vlog2k control.v conv2d.v ksa.v ksa1.v tfl.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'control.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'conv2d.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'ksa.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'ksa1.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tfl.v'
VERIFIC-WARNING [VERI-1407] tfl.v:385: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:260: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:254: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:248: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:241: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:237: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:236: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:225: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:221: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:219: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:218: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:217: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:216: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:215: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:214: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:213: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:212: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:211: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:210: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:209: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:206: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:160: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:158: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:156: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:149: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:144: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:129: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:128: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:5: attribute target identifier 'pad' not found in this scope

yosys> synth_rs -top top -tech genesis -goal area -no_dsp -no_bram -verilog top.verilog

3. Executing synth_rs pass.

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dff'.
Generating RTLIL representation for module `\dffn'.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top top

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] tfl.v:2: compiling module 'top'
VERIFIC-INFO [VERI-1018] control.v:1: compiling module 'CONTROL'
VERIFIC-WARNING [VERI-1209] control.v:155: expression size 32 truncated to fit in target size 16
VERIFIC-WARNING [VERI-1209] control.v:161: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] control.v:166: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] control.v:171: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] control.v:205: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] control.v:209: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] control.v:213: expression size 21 truncated to fit in target size 20
VERIFIC-INFO [VERI-1018] conv2d.v:2: compiling module 'conv2d'
VERIFIC-INFO [VERI-1018] ksa.v:1: compiling module 'ksa(WIDTH=20)'
VERIFIC-WARNING [VERI-1209] conv2d.v:418: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:435: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:442: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:449: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:456: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:463: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:470: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:477: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:540: expression size 14 truncated to fit in target size 13
VERIFIC-WARNING [VERI-1209] conv2d.v:606: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:630: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] conv2d.v:638: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:669: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:672: expression size 32 truncated to fit in target size 14
VERIFIC-WARNING [VERI-1209] conv2d.v:673: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:681: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] conv2d.v:685: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:687: expression size 32 truncated to fit in target size 13
VERIFIC-WARNING [VERI-1209] conv2d.v:688: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:689: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:717: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:720: expression size 32 truncated to fit in target size 14
VERIFIC-WARNING [VERI-1209] conv2d.v:721: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:729: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] conv2d.v:733: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:735: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:736: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:842: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:867: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] conv2d.v:869: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:874: expression size 17 truncated to fit in target size 16
VERIFIC-INFO [VERI-1018] ksa.v:1: compiling module 'ksa(WIDTH=24)'
VERIFIC-INFO [VERI-1018] ksa.v:1: compiling module 'ksa(WIDTH=16)'
VERIFIC-INFO [VERI-1018] ksa.v:1: compiling module 'ksa(WIDTH=12)'
VERIFIC-INFO [VERI-1018] ksa1.v:1: compiling module 'ksa1(WIDTH=12)'
VERIFIC-WARNING [VERI-1209] conv2d.v:1119: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:1138: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:1153: expression size 3 truncated to fit in target size 2
VERIFIC-WARNING [VERI-1209] conv2d.v:1156: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:1169: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:1173: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:1181: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:1199: expression size 17 truncated to fit in target size 16
Importing module top.
Importing module CONTROL.
Importing module conv2d.
Importing module ksa(WIDTH=20).
Importing module ksa(WIDTH=24).
Importing module ksa(WIDTH=16).
Importing module ksa(WIDTH=12).
Importing module ksa1(WIDTH=12).

3.3.1. Analyzing design hierarchy..
Top module:  \top
Used module:     \conv2d
Used module:         \ksa1(WIDTH=12)
Used module:         \ksa(WIDTH=12)
Used module:         \ksa(WIDTH=16)
Used module:         \ksa(WIDTH=24)
Used module:         \ksa(WIDTH=20)
Used module:     \CONTROL

3.3.2. Analyzing design hierarchy..
Top module:  \top
Used module:     \conv2d
Used module:         \ksa1(WIDTH=12)
Used module:         \ksa(WIDTH=12)
Used module:         \ksa(WIDTH=16)
Used module:         \ksa(WIDTH=24)
Used module:         \ksa(WIDTH=20)
Used module:     \CONTROL
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module ksa1(WIDTH=12).
Optimizing module ksa(WIDTH=12).
Optimizing module ksa(WIDTH=16).
Optimizing module ksa(WIDTH=24).
Optimizing module ksa(WIDTH=20).
Optimizing module conv2d.
<suppressed ~168 debug messages>
Optimizing module CONTROL.
<suppressed ~41 debug messages>
Optimizing module top.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module ksa1(WIDTH=12).
Deleting now unused module ksa(WIDTH=12).
Deleting now unused module ksa(WIDTH=16).
Deleting now unused module ksa(WIDTH=24).
Deleting now unused module ksa(WIDTH=20).
Deleting now unused module conv2d.
Deleting now unused module CONTROL.
<suppressed ~23 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~3 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 108 unused cells and 4457 unused wires.
<suppressed ~539 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module top...
Warning: found logic loop in module top:
    cell $flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and)
    cell $flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or)
    wire $flatten\u_conv2d.\pk2.$verific$n206$5291 [0]
    wire \u_conv2d.pk2.c_gen [10]
Warning: found logic loop in module top:
    cell $flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and)
    cell $flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or)
    wire $flatten\u_conv2d.\pk2.$verific$n206$5291 [10]
    wire \u_conv2d.pk2.c_gen [10]
Warning: found logic loop in module top:
    cell $flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and)
    cell $flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or)
    wire $flatten\u_conv2d.\pk2.$verific$n206$5291 [1]
    wire \u_conv2d.pk2.c_gen [10]
Warning: found logic loop in module top:
    cell $flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and)
    cell $flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or)
    wire $flatten\u_conv2d.\pk2.$verific$n206$5291 [2]
    wire \u_conv2d.pk2.c_gen [10]
Warning: found logic loop in module top:
    cell $flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and)
    cell $flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or)
    wire $flatten\u_conv2d.\pk2.$verific$n206$5291 [3]
    wire \u_conv2d.pk2.c_gen [10]
Warning: found logic loop in module top:
    cell $flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and)
    cell $flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or)
    wire $flatten\u_conv2d.\pk2.$verific$n206$5291 [4]
    wire \u_conv2d.pk2.c_gen [10]
Warning: found logic loop in module top:
    cell $flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and)
    cell $flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or)
    wire $flatten\u_conv2d.\pk2.$verific$n206$5291 [5]
    wire \u_conv2d.pk2.c_gen [10]
Warning: found logic loop in module top:
    cell $flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and)
    cell $flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or)
    wire $flatten\u_conv2d.\pk2.$verific$n206$5291 [6]
    wire \u_conv2d.pk2.c_gen [10]
Warning: found logic loop in module top:
    cell $flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and)
    cell $flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or)
    wire $flatten\u_conv2d.\pk2.$verific$n206$5291 [7]
    wire \u_conv2d.pk2.c_gen [10]
Warning: found logic loop in module top:
    cell $flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and)
    cell $flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or)
    wire $flatten\u_conv2d.\pk2.$verific$n206$5291 [8]
    wire \u_conv2d.pk2.c_gen [10]
Warning: found logic loop in module top:
    cell $flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and)
    cell $flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or)
    wire $flatten\u_conv2d.\pk2.$verific$n206$5291 [9]
    wire \u_conv2d.pk2.c_gen [10]
Found and reported 11 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~9 debug messages>
Removed a total of 3 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
      Replacing known input bits on port A of cell $flatten\u_conv2d.$verific$i1027$conv2d.v:1124$4260: \u_conv2d.filter_reload -> 1'0
      Replacing known input bits on port A of cell $flatten\u_conv2d.$verific$i1014$conv2d.v:1113$4251: \u_conv2d.filter_reload -> 1'1
      Replacing known input bits on port A of cell $flatten\u_conv2d.$verific$i357$conv2d.v:607$2825: \u_conv2d.i_bias_wen -> 1'0
      Replacing known input bits on port A of cell $flatten\u_conv2d.$verific$i727$conv2d.v:843$3047: \u_conv2d.i_pixel_wen -> 1'0
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~154 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_1181$conv2d.v:1245$4344: { $flatten\u_conv2d.$verific$n11580$1926 $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11249$1917 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_1184$conv2d.v:1245$4347: { $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11249$1917 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_1194$conv2d.v:1245$4356: { $flatten\u_conv2d.$verific$n11615$1934 $flatten\u_conv2d.$verific$n11256$1924 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_1197$conv2d.v:1245$4359: { $flatten\u_conv2d.$verific$n11617$1936 $flatten\u_conv2d.$verific$n11618$1937 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_1203$conv2d.v:1245$4363: { $flatten\u_conv2d.$verific$n11636$1940 $flatten\u_conv2d.$verific$n11249$1917 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_632$conv2d.v:784$2969: { $flatten\u_conv2d.$verific$n6557$1815 $auto$opt_reduce.cc:134:opt_pmux$5324 $flatten\u_conv2d.$verific$n6560$1818 $flatten\u_conv2d.$verific$n6561$1819 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_633$conv2d.v:784$2970: { $flatten\u_conv2d.$verific$n6557$1815 $auto$opt_reduce.cc:134:opt_pmux$5326 $flatten\u_conv2d.$verific$n6560$1818 $flatten\u_conv2d.$verific$n6561$1819 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_638$conv2d.v:784$2975: $auto$opt_reduce.cc:134:opt_pmux$5328
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_640$conv2d.v:784$2976: $auto$opt_reduce.cc:134:opt_pmux$5330
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_643$conv2d.v:784$2979: { $flatten\u_conv2d.$verific$n6698$1825 $auto$opt_reduce.cc:134:opt_pmux$5332 $flatten\u_conv2d.$verific$n6560$1818 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_826$conv2d.v:912$3107: { $flatten\u_conv2d.$verific$n8234$1854 $flatten\u_conv2d.$verific$n8268$1858 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_828$conv2d.v:912$3108: { $flatten\u_conv2d.$verific$n8234$1854 $flatten\u_conv2d.$verific$n8268$1858 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_106$conv2d.v:223$2508: { $flatten\u_conv2d.$verific$n851$1736 $flatten\u_conv2d.$verific$n852$1737 $flatten\u_conv2d.$verific$n853$1738 $flatten\u_conv2d.$verific$n854$1739 $flatten\u_conv2d.$verific$n856$1741 $flatten\u_conv2d.$verific$n858$1743 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1164$conv2d.v:1245$4327: { $flatten\u_conv2d.$verific$n11242$1910 $flatten\u_conv2d.$verific$n11251$1919 $flatten\u_conv2d.$verific$n11256$1924 $auto$opt_reduce.cc:134:opt_pmux$5334 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1165$conv2d.v:1245$4328: { $auto$opt_reduce.cc:134:opt_pmux$5338 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$5336 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1166$conv2d.v:1245$4329: { $auto$opt_reduce.cc:134:opt_pmux$5342 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$5340 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1167$conv2d.v:1245$4330: { $auto$opt_reduce.cc:134:opt_pmux$5346 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$5344 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1168$conv2d.v:1245$4331: { $auto$opt_reduce.cc:134:opt_pmux$5350 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$5348 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1169$conv2d.v:1245$4332: { $auto$opt_reduce.cc:134:opt_pmux$5354 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$5352 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1170$conv2d.v:1245$4333: { $auto$opt_reduce.cc:134:opt_pmux$5358 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$5356 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1171$conv2d.v:1245$4334: { $auto$opt_reduce.cc:134:opt_pmux$5362 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$5360 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1172$conv2d.v:1245$4335: { $auto$opt_reduce.cc:134:opt_pmux$5366 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$5364 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1173$conv2d.v:1245$4336: { $flatten\u_conv2d.$verific$n11242$1910 $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11244$1912 $flatten\u_conv2d.$verific$n11245$1913 $auto$opt_reduce.cc:134:opt_pmux$5368 $flatten\u_conv2d.$verific$n11248$1916 $flatten\u_conv2d.$verific$n11249$1917 $flatten\u_conv2d.$verific$n11250$1918 $flatten\u_conv2d.$verific$n11251$1919 $flatten\u_conv2d.$verific$n11252$1920 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $flatten\u_conv2d.$verific$n11255$1923 $flatten\u_conv2d.$verific$n11256$1924 $flatten\u_conv2d.$verific$n11257$1925 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1174$conv2d.v:1245$4337: { $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11249$1917 $flatten\u_conv2d.$verific$n11251$1919 $flatten\u_conv2d.$verific$n11252$1920 $auto$opt_reduce.cc:134:opt_pmux$5370 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1175$conv2d.v:1245$4338: { $auto$opt_reduce.cc:134:opt_pmux$5374 $auto$opt_reduce.cc:134:opt_pmux$5372 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1176$conv2d.v:1245$4339: { $auto$opt_reduce.cc:134:opt_pmux$5378 $auto$opt_reduce.cc:134:opt_pmux$5376 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1177$conv2d.v:1245$4340: { $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11251$1919 $auto$opt_reduce.cc:134:opt_pmux$5380 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1178$conv2d.v:1245$4341: { $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11253$1921 $auto$opt_reduce.cc:134:opt_pmux$5382 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1179$conv2d.v:1245$4342: { $flatten\u_conv2d.$verific$n11243$1911 $auto$opt_reduce.cc:134:opt_pmux$5384 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1182$conv2d.v:1245$4345: { $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11249$1917 $flatten\u_conv2d.$verific$n11252$1920 $auto$opt_reduce.cc:134:opt_pmux$5386 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1189$conv2d.v:1245$4352: { $flatten\u_conv2d.$verific$n11251$1919 $auto$opt_reduce.cc:134:opt_pmux$5388 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1190$conv2d.v:1245$4353: { $flatten\u_conv2d.$verific$n11248$1916 $flatten\u_conv2d.$verific$n11249$1917 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$5392 $auto$opt_reduce.cc:134:opt_pmux$5390 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1191$conv2d.v:1245$4354: { $flatten\u_conv2d.$verific$n11248$1916 $flatten\u_conv2d.$verific$n11251$1919 $auto$opt_reduce.cc:134:opt_pmux$5394 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1201$conv2d.v:1245$4361: { $flatten\u_conv2d.$verific$n11249$1917 $flatten\u_conv2d.$verific$n11250$1918 $flatten\u_conv2d.$verific$n11251$1919 $flatten\u_conv2d.$verific$n11252$1920 $auto$opt_reduce.cc:134:opt_pmux$5396 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_409$conv2d.v:648$2862: { $flatten\u_conv2d.$verific$n5060$1775 $auto$opt_reduce.cc:134:opt_pmux$5398 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_410$conv2d.v:648$2863: $auto$opt_reduce.cc:134:opt_pmux$5400
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_411$conv2d.v:648$2864: { $flatten\u_conv2d.$verific$n5060$1775 $flatten\u_conv2d.$verific$n5061$1776 $auto$opt_reduce.cc:134:opt_pmux$5402 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_418$conv2d.v:648$2870: { $flatten\u_conv2d.$verific$n5061$1776 $auto$opt_reduce.cc:134:opt_pmux$5404 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_627$conv2d.v:784$2964: { $flatten\u_conv2d.$verific$n6558$1816 $flatten\u_conv2d.$verific$n6559$1817 $flatten\u_conv2d.$verific$n6560$1818 $flatten\u_conv2d.$verific$n6561$1819 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_629$conv2d.v:784$2966: { $flatten\u_conv2d.$verific$n6557$1815 $flatten\u_conv2d.$verific$n6558$1816 $auto$opt_reduce.cc:134:opt_pmux$5406 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_630$conv2d.v:784$2967: { $flatten\u_conv2d.$verific$n6558$1816 $flatten\u_conv2d.$verific$n6559$1817 $flatten\u_conv2d.$verific$n6560$1818 $flatten\u_conv2d.$verific$n6561$1819 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_631$conv2d.v:784$2968: { $flatten\u_conv2d.$verific$n6557$1815 $flatten\u_conv2d.$verific$n6558$1816 $flatten\u_conv2d.$verific$n6559$1817 $auto$opt_reduce.cc:134:opt_pmux$5408 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_636$conv2d.v:784$2973: { $flatten\u_conv2d.$verific$n6558$1816 $flatten\u_conv2d.$verific$n6559$1817 $auto$opt_reduce.cc:134:opt_pmux$5410 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_641$conv2d.v:784$2977: { $flatten\u_conv2d.$verific$n6558$1816 $flatten\u_conv2d.$verific$n6559$1817 $flatten\u_conv2d.$verific$n6560$1818 $auto$opt_reduce.cc:134:opt_pmux$5412 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_75$conv2d.v:164$2504: { $flatten\u_conv2d.$verific$n851$1736 $flatten\u_conv2d.$verific$n852$1737 $flatten\u_conv2d.$verific$n853$1738 $flatten\u_conv2d.$verific$n854$1739 $flatten\u_conv2d.$verific$n856$1741 $flatten\u_conv2d.$verific$n858$1743 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_823$conv2d.v:912$3104: { $flatten\u_conv2d.$verific$n8234$1854 $auto$opt_reduce.cc:134:opt_pmux$5414 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_824$conv2d.v:912$3105: { $flatten\u_conv2d.$verific$n8236$1856 $auto$opt_reduce.cc:134:opt_pmux$5416 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_829$conv2d.v:912$3109: { $flatten\u_conv2d.$verific$n8233$1853 $flatten\u_conv2d.$verific$n8234$1854 $auto$opt_reduce.cc:134:opt_pmux$5418 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_830$conv2d.v:912$3110: { $flatten\u_conv2d.$verific$n8234$1854 $flatten\u_conv2d.$verific$n8236$1856 $auto$opt_reduce.cc:134:opt_pmux$5420 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_836$conv2d.v:912$3115: { $flatten\u_conv2d.$verific$n8234$1854 $auto$opt_reduce.cc:134:opt_pmux$5422 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_838$conv2d.v:912$3117: { $flatten\u_conv2d.$verific$n8234$1854 $auto$opt_reduce.cc:134:opt_pmux$5424 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$Select_225$control.v:223$1677: { $flatten\u_ctl.$verific$n2482$1443 $flatten\u_ctl.$verific$n2485$1446 $flatten\u_ctl.$verific$n2486$1447 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_144$control.v:185$1637: { $flatten\u_ctl.$verific$n1301$1414 $auto$opt_reduce.cc:134:opt_pmux$5426 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_145$control.v:185$1638: { $flatten\u_ctl.$verific$n1302$1415 $auto$opt_reduce.cc:134:opt_pmux$5428 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_146$control.v:185$1639: { $flatten\u_ctl.$verific$n1303$1416 $auto$opt_reduce.cc:134:opt_pmux$5430 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_147$control.v:185$1640: { $flatten\u_ctl.$verific$n1304$1417 $auto$opt_reduce.cc:134:opt_pmux$5432 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_148$control.v:185$1641: { $flatten\u_ctl.$verific$n1305$1418 $auto$opt_reduce.cc:134:opt_pmux$5434 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_149$control.v:185$1642: { $flatten\u_ctl.$verific$n1306$1419 $auto$opt_reduce.cc:134:opt_pmux$5436 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_150$control.v:185$1643: { $flatten\u_ctl.$verific$n1307$1420 $auto$opt_reduce.cc:134:opt_pmux$5438 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_151$control.v:185$1644: { $flatten\u_ctl.$verific$n1308$1421 $auto$opt_reduce.cc:134:opt_pmux$5440 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_152$control.v:185$1645: { $flatten\u_ctl.$verific$n1309$1422 $auto$opt_reduce.cc:134:opt_pmux$5442 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_153$control.v:185$1646: { $flatten\u_ctl.$verific$n1310$1423 $auto$opt_reduce.cc:134:opt_pmux$5444 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_156$control.v:185$1649: { $flatten\u_ctl.$verific$n1313$1426 $auto$opt_reduce.cc:134:opt_pmux$5448 $auto$opt_reduce.cc:134:opt_pmux$5446 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_161$control.v:185$1654: { $flatten\u_ctl.$verific$n1317$1430 $auto$opt_reduce.cc:134:opt_pmux$5450 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_162$control.v:185$1655: { $flatten\u_ctl.$verific$n1318$1431 $auto$opt_reduce.cc:134:opt_pmux$5452 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_163$control.v:185$1656: { $flatten\u_ctl.$verific$n1318$1431 $auto$opt_reduce.cc:134:opt_pmux$5454 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_216$control.v:220$1667: { $auto$opt_reduce.cc:134:opt_pmux$5458 $auto$opt_reduce.cc:134:opt_pmux$5456 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_223$control.v:223$1675: { $flatten\u_ctl.$verific$n2482$1443 $flatten\u_ctl.$verific$n2485$1446 $flatten\u_ctl.$verific$n2486$1447 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_226$control.v:223$1678: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$5460 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_227$control.v:223$1679: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$5462 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_228$control.v:223$1680: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$5464 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_229$control.v:223$1681: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$5466 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_230$control.v:223$1682: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$5468 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_231$control.v:223$1683: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$5470 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_232$control.v:223$1684: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$5472 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_233$control.v:223$1685: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$5474 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_234$control.v:223$1686: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$5476 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_235$control.v:223$1687: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$5478 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_238$control.v:223$1690: { $flatten\u_ctl.$verific$n2484$1445 $flatten\u_ctl.$verific$n2485$1446 $auto$opt_reduce.cc:134:opt_pmux$5480 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_243$control.v:223$1695: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$5482 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_244$control.v:223$1696: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$5484 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_245$control.v:223$1697: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$5486 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_248$control.v:223$1700: { $flatten\u_ctl.$verific$n2485$1446 $auto$opt_reduce.cc:134:opt_pmux$5488 }
  Optimizing cells in module \top.
Performed a total of 85 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~120 debug messages>
Removed a total of 40 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_width_reg$control.v:224$1703 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_total_reg$control.v:224$1712 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_shift_reg$control.v:224$1725 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_sda_reg$control.v:224$1726 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_scl_reg$control.v:224$1727 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_result_base_reg$control.v:224$1711 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_ready_reg$control.v:224$1701 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_quant_reg$control.v:224$1724 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_pixel_base_reg$control.v:224$1709 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_intr_sts_reg$control.v:224$1723 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_intr_en_reg$control.v:224$1722 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_height_reg$control.v:224$1704 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_filters_reg$control.v:224$1706 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_filter_base_reg$control.v:224$1708 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_debug_mux_reg$control.v:224$1715 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_dataout_reg$control.v:224$1707 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_ctl_pwen_reg$control.v:224$1720 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_ctl_pfwaddr_reg$control.v:224$1718 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_ctl_fwen_reg$control.v:224$1719 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_ctl_bwen_reg$control.v:224$1721 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_channels_reg$control.v:224$1705 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_bias_base_reg$control.v:224$1710 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_addr_reg$control.v:224$1717 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$fsm_ctl_reg$control.v:224$1728 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$ctl_reg$control.v:224$1702 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$counter_reg$control.v:224$1713 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$write2_reg$conv2d.v:1246$4402 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$wdata2_reg$conv2d.v:785$3001 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$total_pixels_done_reg$conv2d.v:1246$4388 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$total_filters_done_reg$conv2d.v:1246$4382 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$sat37_reg$conv2d.v:92$2470 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$sat26_reg$conv2d.v:92$2469 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$sat15_reg$conv2d.v:92$2468 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$sat04_reg$conv2d.v:92$2467 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$running_reg$conv2d.v:1246$4384 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$result_base_reg$conv2d.v:785$2999 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$reset_bias_address_reg$conv2d.v:785$3024 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$pixels_read_reg$conv2d.v:913$3120 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$pixel_start_reg$conv2d.v:913$3127 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$pixel_select_reg$conv2d.v:1246$4400 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$p2_raddr_reg$conv2d.v:1246$4370 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$p1_raddr_reg$conv2d.v:1246$4369 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$next_buffer_reg$conv2d.v:1246$4399 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$load_more_pixels_reg$conv2d.v:1246$4387 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$load_more_filters_reg$conv2d.v:1246$4386 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$load_ext_acc_reg$conv2d.v:1246$4389 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$load_buffer_reg$conv2d.v:913$3129 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$last_start2d_reg$conv2d.v:785$3023 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm3_wen_reg$conv2d.v:785$3010 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm3_req_reg$conv2d.v:785$3009 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm3_rdata_reg$conv2d.v:785$3026 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm2_wreq_reg$conv2d.v:785$3008 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm2_wen_reg$conv2d.v:785$3018 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm2_wdata_reg$conv2d.v:785$3000 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm2_rreq_reg$conv2d.v:785$3007 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm2_rdata_reg$conv2d.v:785$3025 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm1_wen_reg$conv2d.v:913$3122 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm1_req_reg$conv2d.v:913$3123 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm1_rdata_reg$conv2d.v:913$3130 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_sat_reg$conv2d.v:1246$4373 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_pixel_wen_reg$conv2d.v:913$3124 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_pixel_wdata_reg$conv2d.v:913$3126 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_pixel_waddr_reg$conv2d.v:913$3125 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_pixel_raddr_reg$conv2d.v:1246$4378 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_outsel_reg$conv2d.v:1246$4377 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_mult2_coef_reg$conv2d.v:1246$4404 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_mult1_coef_reg$conv2d.v:1246$4403 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_math_mode_reg$conv2d.v:1246$4374 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_mac_clr_reg$conv2d.v:1246$4375 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_mac_clken_reg$conv2d.v:1246$4376 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_filter_wdata_reg$conv2d.v:785$3014 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_filter_waddr_reg$conv2d.v:785$3013 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_filter_raddr_reg$conv2d.v:1246$4379 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_filter2_wen_reg$conv2d.v:785$3016 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_filter1_wen_reg$conv2d.v:785$3015 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_done2d_reg$conv2d.v:1246$4383 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_csel_reg$conv2d.v:1246$4372 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_bias_wen_reg$conv2d.v:785$3011 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_bias_wdata_reg$conv2d.v:785$3012 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_bias_waddr_reg$conv2d.v:785$3004 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_bias_raddr_reg$conv2d.v:785$3003 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i3_t2_waddr_reg$conv2d.v:785$2982 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i2_t2_waddr_reg$conv2d.v:785$2981 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i1_t2_waddr_reg$conv2d.v:785$2980 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fsm_writechannels_reg$conv2d.v:785$3022 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fsm_loadacc_reg$conv2d.v:785$2988 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fsm_getpixels_reg$conv2d.v:913$3118 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fsm_getfilters_reg$conv2d.v:785$2986 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fsm_getbias_reg$conv2d.v:785$2987 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fsm_conv2d_reg$conv2d.v:1246$4371 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fract_select_reg$conv2d.v:1246$4401 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filters_loaded_reg$conv2d.v:785$2983 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filters_done_reg$conv2d.v:1246$4381 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filters_complete_reg$conv2d.v:785$3021 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filter_stride_reg$conv2d.v:785$2984 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filter_start_reg$conv2d.v:785$3019 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filter_space_left_reg$conv2d.v:785$3020 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filter_reload_reg$conv2d.v:1246$4385 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filter_channels_reg$conv2d.v:785$3017 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$copy_acc_reg$conv2d.v:1246$4390 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$channels_loaded_reg$conv2d.v:913$3119 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$channels_done_reg$conv2d.v:1246$4380 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$buffers_used_reg$conv2d.v:913$3128 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias_loaded_reg$conv2d.v:785$3006 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias_base_addr_reg$conv2d.v:785$3005 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias7_reg$conv2d.v:785$2996 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias6_reg$conv2d.v:785$2995 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias5_reg$conv2d.v:785$2994 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias4_reg$conv2d.v:785$2993 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias3_reg$conv2d.v:785$2992 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias2_reg$conv2d.v:785$2991 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias1_reg$conv2d.v:785$2990 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias0_reg$conv2d.v:785$2989 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$add_stride_reg$conv2d.v:785$2985 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc7_reg$conv2d.v:1246$4398 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc6_reg$conv2d.v:1246$4397 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc5_reg$conv2d.v:1246$4396 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc4_reg$conv2d.v:1246$4395 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc3_reg$conv2d.v:1246$4394 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc2_reg$conv2d.v:1246$4393 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc1_reg$conv2d.v:1246$4392 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc0_reg$conv2d.v:1246$4391 ($aldff) from module top.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 4 unused cells and 48 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~152 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).
Not marking top.u_conv2d.fract_select as FSM state register:
    Users of register don't seem to benefit from recoding.
Found FSM state register top.u_conv2d.fsm_conv2d.
Found FSM state register top.u_conv2d.fsm_getbias.
Found FSM state register top.u_conv2d.fsm_getpixels.
Not marking top.u_conv2d.i_outsel as FSM state register:
    Register is connected to module port.
    Users of register don't seem to benefit from recoding.
Found FSM state register top.u_ctl.fsm_ctl.

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).
Extracting FSM `\u_conv2d.fsm_conv2d' from module `\top'.
  found $adff cell for state register: $flatten\u_conv2d.$verific$fsm_conv2d_reg$conv2d.v:1246$4371
  root of input selection tree: $flatten\u_conv2d.$verific$n11461$2435
  found reset state: 5'00000 (from async reset)
  found ctrl input: $flatten\u_conv2d.$verific$n11257$1925
  found ctrl input: $flatten\u_conv2d.$verific$n11256$1924
  found ctrl input: $flatten\u_conv2d.$verific$n11255$1923
  found ctrl input: $flatten\u_conv2d.$verific$n11254$1922
  found ctrl input: $flatten\u_conv2d.$verific$n11253$1921
  found ctrl input: $flatten\u_conv2d.$verific$n11252$1920
  found ctrl input: $flatten\u_conv2d.$verific$n11251$1919
  found ctrl input: $flatten\u_conv2d.$verific$n11250$1918
  found ctrl input: $flatten\u_conv2d.$verific$n11249$1917
  found ctrl input: $flatten\u_conv2d.$verific$n11248$1916
  found ctrl input: $auto$opt_reduce.cc:134:opt_pmux$5368
  found ctrl input: $flatten\u_conv2d.$verific$n11245$1913
  found ctrl input: $flatten\u_conv2d.$verific$n11244$1912
  found ctrl input: $flatten\u_conv2d.$verific$n11243$1911
  found ctrl input: $flatten\u_conv2d.$verific$n11242$1910
  found ctrl input: \u_ctl.ctl [0]
  found state code: 5'01100
  found ctrl input: $flatten\u_conv2d.$verific$n11095$1905
  found state code: 5'01001
  found state code: 5'01000
  found state code: 5'00100
  found state code: 5'00011
  found ctrl input: $flatten\u_conv2d.$verific$n10441$1895
  found ctrl input: $flatten\u_conv2d.$verific$n10472$1899
  found state code: 5'00010
  found state code: 5'00001
  found ctrl input: \u_conv2d.filter_reload
  found ctrl input: $flatten\u_conv2d.$verific$n10079$1885
  found ctrl input: $flatten\u_conv2d.$verific$n10042$1881
  found state code: 5'00110
  found state code: 5'00111
  found state code: 5'01111
  found ctrl input: $flatten\u_conv2d.$verific$n9562$1865
  found ctrl input: $flatten\u_conv2d.$verific$n9563$1866
  found ctrl input: $flatten\u_conv2d.$verific$n9583$1867
  found ctrl input: $flatten\u_conv2d.$verific$n9612$1868
  found state code: 5'00101
  found state code: 5'01010
  found ctrl output: $flatten\u_conv2d.$verific$n11256$1924
  found ctrl output: $flatten\u_conv2d.$verific$n11255$1923
  found ctrl output: $flatten\u_conv2d.$verific$n11254$1922
  found ctrl output: $flatten\u_conv2d.$verific$n11253$1921
  found ctrl output: $flatten\u_conv2d.$verific$n11252$1920
  found ctrl output: $flatten\u_conv2d.$verific$n11251$1919
  found ctrl output: $flatten\u_conv2d.$verific$n11250$1918
  found ctrl output: $flatten\u_conv2d.$verific$n11249$1917
  found ctrl output: $flatten\u_conv2d.$verific$n11248$1916
  found ctrl output: $flatten\u_conv2d.$verific$n11247$1915
  found ctrl output: $flatten\u_conv2d.$verific$n11246$1914
  found ctrl output: $flatten\u_conv2d.$verific$n11245$1913
  found ctrl output: $flatten\u_conv2d.$verific$n11244$1912
  found ctrl output: $flatten\u_conv2d.$verific$n11243$1911
  found ctrl output: $flatten\u_conv2d.$verific$n11242$1910
  ctrl inputs: { \u_conv2d.filter_reload $flatten\u_conv2d.$verific$n9562$1865 $flatten\u_conv2d.$verific$n9563$1866 $flatten\u_conv2d.$verific$n9583$1867 $flatten\u_conv2d.$verific$n9612$1868 $flatten\u_conv2d.$verific$n10042$1881 $flatten\u_conv2d.$verific$n10079$1885 $flatten\u_conv2d.$verific$n10441$1895 $flatten\u_conv2d.$verific$n10472$1899 $flatten\u_conv2d.$verific$n11095$1905 $flatten\u_conv2d.$verific$n11257$1925 $auto$opt_reduce.cc:134:opt_pmux$5368 \u_ctl.ctl [0] }
  ctrl outputs: { $flatten\u_conv2d.$verific$n11242$1910 $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11244$1912 $flatten\u_conv2d.$verific$n11245$1913 $flatten\u_conv2d.$verific$n11246$1914 $flatten\u_conv2d.$verific$n11247$1915 $flatten\u_conv2d.$verific$n11248$1916 $flatten\u_conv2d.$verific$n11249$1917 $flatten\u_conv2d.$verific$n11250$1918 $flatten\u_conv2d.$verific$n11251$1919 $flatten\u_conv2d.$verific$n11252$1920 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $flatten\u_conv2d.$verific$n11255$1923 $flatten\u_conv2d.$verific$n11256$1924 $flatten\u_conv2d.$verific$n11461$2435 }
  transition:    5'00000 13'-----0------- ->    5'00000 20'00000010000000000000
  transition:    5'00000 13'-----1------- ->    5'00110 20'00000010000000000110
  transition:    5'01000 13'------------- ->    5'00001 20'00000000100000000001
  transition:    5'00100 13'---------0--- ->    5'01001 20'00000000000010001001
  transition:    5'00100 13'---------1--- ->    5'01000 20'00000000000010001000
  transition:    5'01100 13'------------0 ->    5'00000 20'00000000000000100000
  transition:    5'01100 13'------------1 ->    5'01100 20'00000000000000101100
  transition:    5'00010 13'------------- ->    5'00011 20'00000000001000000011
  transition:    5'01010 13'-0----------- ->    5'01010 20'01000000000000001010
  transition:    5'01010 13'-100--------- ->    5'00111 20'01000000000000000111
  transition:    5'01010 13'-1010-------- ->    5'00111 20'01000000000000000111
  transition:    5'01010 13'-1011-------- ->    5'00101 20'01000000000000000101
  transition:    5'01010 13'-11---------- ->    5'00111 20'01000000000000000111
  transition:    5'00110 13'0------------ ->    5'00001 20'00000001000000000001
  transition:    5'00110 13'1-----0------ ->    5'00110 20'00000001000000000110
  transition:    5'00110 13'1-----1------ ->    5'00000 20'00000001000000000000
  transition:    5'00001 13'-------0----- ->    5'00001 20'00000000010000000001
  transition:    5'00001 13'-------10---- ->    5'00001 20'00000000010000000001
  transition:    5'00001 13'-------11---- ->    5'00010 20'00000000010000000010
  transition:    5'01001 13'------------- ->    5'01010 20'10000000000000001010
  transition:    5'00101 13'------------- ->    5'01100 20'00000000000001001100
  transition:    5'00011 13'------------- ->    5'00100 20'00000000000100000100
  transition:    5'00111 13'------------- ->    5'00110 20'00001000000000000110
  transition:    5'01111 13'------------- ->    5'00111 20'00010000000000000111
Extracting FSM `\u_conv2d.fsm_getbias' from module `\top'.
  found $adff cell for state register: $flatten\u_conv2d.$verific$fsm_getbias_reg$conv2d.v:785$2987
  root of input selection tree: $flatten\u_conv2d.$verific$n5122$2153
  found reset state: 3'000 (from async reset)
  found ctrl input: $flatten\u_conv2d.$verific$n5063$1778
  found ctrl input: $flatten\u_conv2d.$verific$n5062$1777
  found ctrl input: $flatten\u_conv2d.$verific$n5061$1776
  found ctrl input: $flatten\u_conv2d.$verific$n5060$1775
  found ctrl input: \u_conv2d.i_done2d
  found ctrl input: \tcdm_valid_p3
  found ctrl input: $flatten\u_conv2d.$verific$n4916$1769
  found state code: 3'010
  found ctrl input: \u_ctl.ctl [0]
  found state code: 3'001
  found ctrl output: $flatten\u_conv2d.$verific$n5062$1777
  found ctrl output: $flatten\u_conv2d.$verific$n5061$1776
  found ctrl output: $flatten\u_conv2d.$verific$n5060$1775
  ctrl inputs: { \u_conv2d.i_done2d $flatten\u_conv2d.$verific$n4916$1769 $flatten\u_conv2d.$verific$n5063$1778 \u_ctl.ctl [0] \tcdm_valid_p3 }
  ctrl outputs: { $flatten\u_conv2d.$verific$n5060$1775 $flatten\u_conv2d.$verific$n5061$1776 $flatten\u_conv2d.$verific$n5062$1777 $flatten\u_conv2d.$verific$n5122$2153 }
  transition:      3'000 5'---0- ->      3'000 6'100000
  transition:      3'000 5'---1- ->      3'001 6'100001
  transition:      3'010 5'0---- ->      3'010 6'001010
  transition:      3'010 5'1---- ->      3'000 6'001000
  transition:      3'001 5'----0 ->      3'001 6'010001
  transition:      3'001 5'-0--1 ->      3'001 6'010001
  transition:      3'001 5'-1--1 ->      3'010 6'010010
Extracting FSM `\u_conv2d.fsm_getpixels' from module `\top'.
  found $adff cell for state register: $flatten\u_conv2d.$verific$fsm_getpixels_reg$conv2d.v:913$3118
  root of input selection tree: $flatten\u_conv2d.$verific$n8296$2272
  found reset state: 3'000 (from async reset)
  found ctrl input: $flatten\u_conv2d.$verific$n8237$1857
  found ctrl input: $flatten\u_conv2d.$verific$n8236$1856
  found ctrl input: $flatten\u_conv2d.$verific$n8235$1855
  found ctrl input: $flatten\u_conv2d.$verific$n8234$1854
  found ctrl input: $flatten\u_conv2d.$verific$n8233$1853
  found ctrl input: $flatten\u_conv2d.$verific$n8211$1849
  found state code: 3'001
  found ctrl input: \u_conv2d.i_done2d
  found ctrl input: \u_conv2d.load_more_filters
  found ctrl input: \tcdm_valid_p1
  found ctrl input: $flatten\u_conv2d.$verific$n7947$1834
  found ctrl input: $flatten\u_conv2d.$verific$n8018$1838
  found state code: 3'011
  found state code: 3'010
  found ctrl input: \u_ctl.ctl [0]
  found ctrl output: $flatten\u_conv2d.$verific$n8236$1856
  found ctrl output: $flatten\u_conv2d.$verific$n8235$1855
  found ctrl output: $flatten\u_conv2d.$verific$n8234$1854
  found ctrl output: $flatten\u_conv2d.$verific$n8233$1853
  ctrl inputs: { \u_conv2d.i_done2d \u_conv2d.load_more_filters $flatten\u_conv2d.$verific$n7947$1834 $flatten\u_conv2d.$verific$n8018$1838 $flatten\u_conv2d.$verific$n8211$1849 $flatten\u_conv2d.$verific$n8237$1857 \u_ctl.ctl [0] \tcdm_valid_p1 }
  ctrl outputs: { $flatten\u_conv2d.$verific$n8233$1853 $flatten\u_conv2d.$verific$n8234$1854 $flatten\u_conv2d.$verific$n8235$1855 $flatten\u_conv2d.$verific$n8236$1856 $flatten\u_conv2d.$verific$n8296$2272 }
  transition:      3'000 8'------0- ->      3'000 7'1000000
  transition:      3'000 8'------1- ->      3'001 7'1000001
  transition:      3'010 8'00------ ->      3'010 7'0010010
  transition:      3'010 8'01------ ->      3'000 7'0010000
  transition:      3'010 8'1------- ->      3'000 7'0010000
  transition:      3'001 8'-------0 ->      3'001 7'0100001
  transition:      3'001 8'--0----1 ->      3'001 7'0100001
  transition:      3'001 8'--10---1 ->      3'011 7'0100011
  transition:      3'001 8'--11---1 ->      3'010 7'0100010
  transition:      3'011 8'----0--- ->      3'001 7'0001001
  transition:      3'011 8'----1--- ->      3'011 7'0001011
Extracting FSM `\u_ctl.fsm_ctl' from module `\top'.
  found $adff cell for state register: $flatten\u_ctl.$verific$fsm_ctl_reg$control.v:224$1728
  root of input selection tree: $flatten\u_ctl.$verific$n2487$1532
  found reset state: 3'000 (from async reset)
  found ctrl input: $flatten\u_ctl.$verific$n2486$1447
  found ctrl input: $flatten\u_ctl.$verific$n2485$1446
  found ctrl input: $flatten\u_ctl.$verific$n2482$1443
  found state code: 3'011
  found ctrl input: $flatten\u_ctl.$verific$n828$1411
  found ctrl input: $flatten\u_ctl.$verific$n815$1408
  found state code: 3'001
  found state code: 3'010
  found ctrl output: $flatten\u_ctl.$verific$n2485$1446
  found ctrl output: $flatten\u_ctl.$verific$n2484$1445
  found ctrl output: $flatten\u_ctl.$verific$n2483$1444
  found ctrl output: $flatten\u_ctl.$verific$n2482$1443
  ctrl inputs: { $flatten\u_ctl.$verific$n815$1408 $flatten\u_ctl.$verific$n828$1411 $flatten\u_ctl.$verific$n2486$1447 }
  ctrl outputs: { $flatten\u_ctl.$verific$n2482$1443 $flatten\u_ctl.$verific$n2483$1444 $flatten\u_ctl.$verific$n2484$1445 $flatten\u_ctl.$verific$n2485$1446 $flatten\u_ctl.$verific$n2487$1532 }
  transition:      3'000 3'00- ->      3'000 7'1000000
  transition:      3'000 3'10- ->      3'001 7'1000001
  transition:      3'000 3'-1- ->      3'010 7'1000010
  transition:      3'010 3'--- ->      3'011 7'0001011
  transition:      3'001 3'--- ->      3'000 7'0010000
  transition:      3'011 3'--- ->      3'000 7'0100000

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\u_ctl.fsm_ctl$5517' from module `\top'.
  Removing unused input signal $flatten\u_ctl.$verific$n2486$1447.
Optimizing FSM `$fsm$\u_conv2d.fsm_getpixels$5511' from module `\top'.
  Removing unused input signal $flatten\u_conv2d.$verific$n8237$1857.
Optimizing FSM `$fsm$\u_conv2d.fsm_getbias$5506' from module `\top'.
  Removing unused input signal $flatten\u_conv2d.$verific$n5063$1778.
Optimizing FSM `$fsm$\u_conv2d.fsm_conv2d$5489' from module `\top'.
  Removing unreachable state 5'01111.
  Removing unused input signal $flatten\u_conv2d.$verific$n11257$1925.
  Removing unused input signal $auto$opt_reduce.cc:134:opt_pmux$5368.

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 59 unused cells and 59 unused wires.
<suppressed ~60 debug messages>

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\u_conv2d.fsm_conv2d$5489' from module `\top'.
  Removing unused output signal $flatten\u_conv2d.$verific$n11461$2435 [0].
  Removing unused output signal $flatten\u_conv2d.$verific$n11461$2435 [1].
  Removing unused output signal $flatten\u_conv2d.$verific$n11461$2435 [2].
  Removing unused output signal $flatten\u_conv2d.$verific$n11461$2435 [3].
  Removing unused output signal $flatten\u_conv2d.$verific$n11461$2435 [4].
Optimizing FSM `$fsm$\u_conv2d.fsm_getbias$5506' from module `\top'.
  Removing unused output signal $flatten\u_conv2d.$verific$n5122$2153 [0].
  Removing unused output signal $flatten\u_conv2d.$verific$n5122$2153 [1].
  Removing unused output signal $flatten\u_conv2d.$verific$n5122$2153 [2].
Optimizing FSM `$fsm$\u_conv2d.fsm_getpixels$5511' from module `\top'.
  Removing unused output signal $flatten\u_conv2d.$verific$n8296$2272 [0].
  Removing unused output signal $flatten\u_conv2d.$verific$n8296$2272 [1].
  Removing unused output signal $flatten\u_conv2d.$verific$n8296$2272 [2].
Optimizing FSM `$fsm$\u_ctl.fsm_ctl$5517' from module `\top'.
  Removing unused output signal $flatten\u_ctl.$verific$n2487$1532 [0].
  Removing unused output signal $flatten\u_ctl.$verific$n2487$1532 [1].
  Removing unused output signal $flatten\u_ctl.$verific$n2487$1532 [2].

yosys> fsm_recode

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).
Recoding FSM `$fsm$\u_conv2d.fsm_conv2d$5489' from module `\top' using `auto' encoding:
  mapping auto encoding to `one-hot` for this FSM.
  00000 -> -----------1
  01000 -> ----------1-
  00100 -> ---------1--
  01100 -> --------1---
  00010 -> -------1----
  01010 -> ------1-----
  00110 -> -----1------
  00001 -> ----1-------
  01001 -> ---1--------
  00101 -> --1---------
  00011 -> -1----------
  00111 -> 1-----------
Recoding FSM `$fsm$\u_conv2d.fsm_getbias$5506' from module `\top' using `auto' encoding:
  mapping auto encoding to `one-hot` for this FSM.
  000 -> --1
  010 -> -1-
  001 -> 1--
Recoding FSM `$fsm$\u_conv2d.fsm_getpixels$5511' from module `\top' using `auto' encoding:
  mapping auto encoding to `one-hot` for this FSM.
  000 -> ---1
  010 -> --1-
  001 -> -1--
  011 -> 1---
Recoding FSM `$fsm$\u_ctl.fsm_ctl$5517' from module `\top' using `auto' encoding:
  mapping auto encoding to `one-hot` for this FSM.
  000 -> ---1
  010 -> --1-
  001 -> -1--
  011 -> 1---

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

FSM `$fsm$\u_conv2d.fsm_conv2d$5489' from module `top':
-------------------------------------

  Information on FSM $fsm$\u_conv2d.fsm_conv2d$5489 (\u_conv2d.fsm_conv2d):

  Number of input signals:   11
  Number of output signals:  15
  Number of state bits:      12

  Input signals:
    0: \u_ctl.ctl [0]
    1: $flatten\u_conv2d.$verific$n11095$1905
    2: $flatten\u_conv2d.$verific$n10472$1899
    3: $flatten\u_conv2d.$verific$n10441$1895
    4: $flatten\u_conv2d.$verific$n10079$1885
    5: $flatten\u_conv2d.$verific$n10042$1881
    6: $flatten\u_conv2d.$verific$n9612$1868
    7: $flatten\u_conv2d.$verific$n9583$1867
    8: $flatten\u_conv2d.$verific$n9563$1866
    9: $flatten\u_conv2d.$verific$n9562$1865
   10: \u_conv2d.filter_reload

  Output signals:
    0: $flatten\u_conv2d.$verific$n11256$1924
    1: $flatten\u_conv2d.$verific$n11255$1923
    2: $flatten\u_conv2d.$verific$n11254$1922
    3: $flatten\u_conv2d.$verific$n11253$1921
    4: $flatten\u_conv2d.$verific$n11252$1920
    5: $flatten\u_conv2d.$verific$n11251$1919
    6: $flatten\u_conv2d.$verific$n11250$1918
    7: $flatten\u_conv2d.$verific$n11249$1917
    8: $flatten\u_conv2d.$verific$n11248$1916
    9: $flatten\u_conv2d.$verific$n11247$1915
   10: $flatten\u_conv2d.$verific$n11246$1914
   11: $flatten\u_conv2d.$verific$n11245$1913
   12: $flatten\u_conv2d.$verific$n11244$1912
   13: $flatten\u_conv2d.$verific$n11243$1911
   14: $flatten\u_conv2d.$verific$n11242$1910

  State encoding:
    0: 12'-----------1  <RESET STATE>
    1: 12'----------1-
    2: 12'---------1--
    3: 12'--------1---
    4: 12'-------1----
    5: 12'------1-----
    6: 12'-----1------
    7: 12'----1-------
    8: 12'---1--------
    9: 12'--1---------
   10: 12'-1----------
   11: 12'1-----------

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 11'-----0-----   ->     0 15'000000100000000
      1:     0 11'-----1-----   ->     6 15'000000100000000
      2:     1 11'-----------   ->     7 15'000000001000000
      3:     2 11'---------1-   ->     1 15'000000000000100
      4:     2 11'---------0-   ->     8 15'000000000000100
      5:     3 11'----------0   ->     0 15'000000000000001
      6:     3 11'----------1   ->     3 15'000000000000001
      7:     4 11'-----------   ->    10 15'000000000010000
      8:     5 11'-0---------   ->     5 15'010000000000000
      9:     5 11'-1011------   ->     9 15'010000000000000
     10:     5 11'-1010------   ->    11 15'010000000000000
     11:     5 11'-100-------   ->    11 15'010000000000000
     12:     5 11'-11--------   ->    11 15'010000000000000
     13:     6 11'1-----1----   ->     0 15'000000010000000
     14:     6 11'1-----0----   ->     6 15'000000010000000
     15:     6 11'0----------   ->     7 15'000000010000000
     16:     7 11'-------11--   ->     4 15'000000000100000
     17:     7 11'-------10--   ->     7 15'000000000100000
     18:     7 11'-------0---   ->     7 15'000000000100000
     19:     8 11'-----------   ->     5 15'100000000000000
     20:     9 11'-----------   ->     3 15'000000000000010
     21:    10 11'-----------   ->     2 15'000000000001000
     22:    11 11'-----------   ->     6 15'000010000000000

-------------------------------------

FSM `$fsm$\u_conv2d.fsm_getbias$5506' from module `top':
-------------------------------------

  Information on FSM $fsm$\u_conv2d.fsm_getbias$5506 (\u_conv2d.fsm_getbias):

  Number of input signals:    4
  Number of output signals:   3
  Number of state bits:       3

  Input signals:
    0: \tcdm_valid_p3
    1: \u_ctl.ctl [0]
    2: $flatten\u_conv2d.$verific$n4916$1769
    3: \u_conv2d.i_done2d

  Output signals:
    0: $flatten\u_conv2d.$verific$n5062$1777
    1: $flatten\u_conv2d.$verific$n5061$1776
    2: $flatten\u_conv2d.$verific$n5060$1775

  State encoding:
    0:      3'--1  <RESET STATE>
    1:      3'-1-
    2:      3'1--

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 4'--0-   ->     0 3'100
      1:     0 4'--1-   ->     2 3'100
      2:     1 4'1---   ->     0 3'001
      3:     1 4'0---   ->     1 3'001
      4:     2 4'-1-1   ->     1 3'010
      5:     2 4'---0   ->     2 3'010
      6:     2 4'-0-1   ->     2 3'010

-------------------------------------

FSM `$fsm$\u_conv2d.fsm_getpixels$5511' from module `top':
-------------------------------------

  Information on FSM $fsm$\u_conv2d.fsm_getpixels$5511 (\u_conv2d.fsm_getpixels):

  Number of input signals:    7
  Number of output signals:   4
  Number of state bits:       4

  Input signals:
    0: \tcdm_valid_p1
    1: \u_ctl.ctl [0]
    2: $flatten\u_conv2d.$verific$n8211$1849
    3: $flatten\u_conv2d.$verific$n8018$1838
    4: $flatten\u_conv2d.$verific$n7947$1834
    5: \u_conv2d.load_more_filters
    6: \u_conv2d.i_done2d

  Output signals:
    0: $flatten\u_conv2d.$verific$n8236$1856
    1: $flatten\u_conv2d.$verific$n8235$1855
    2: $flatten\u_conv2d.$verific$n8234$1854
    3: $flatten\u_conv2d.$verific$n8233$1853

  State encoding:
    0:     4'---1  <RESET STATE>
    1:     4'--1-
    2:     4'-1--
    3:     4'1---

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 7'-----0-   ->     0 4'1000
      1:     0 7'-----1-   ->     2 4'1000
      2:     1 7'01-----   ->     0 4'0010
      3:     1 7'1------   ->     0 4'0010
      4:     1 7'00-----   ->     1 4'0010
      5:     2 7'--11--1   ->     1 4'0100
      6:     2 7'------0   ->     2 4'0100
      7:     2 7'--0---1   ->     2 4'0100
      8:     2 7'--10--1   ->     3 4'0100
      9:     3 7'----0--   ->     2 4'0001
     10:     3 7'----1--   ->     3 4'0001

-------------------------------------

FSM `$fsm$\u_ctl.fsm_ctl$5517' from module `top':
-------------------------------------

  Information on FSM $fsm$\u_ctl.fsm_ctl$5517 (\u_ctl.fsm_ctl):

  Number of input signals:    2
  Number of output signals:   4
  Number of state bits:       4

  Input signals:
    0: $flatten\u_ctl.$verific$n828$1411
    1: $flatten\u_ctl.$verific$n815$1408

  Output signals:
    0: $flatten\u_ctl.$verific$n2485$1446
    1: $flatten\u_ctl.$verific$n2484$1445
    2: $flatten\u_ctl.$verific$n2483$1444
    3: $flatten\u_ctl.$verific$n2482$1443

  State encoding:
    0:     4'---1  <RESET STATE>
    1:     4'--1-
    2:     4'-1--
    3:     4'1---

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 2'00   ->     0 4'1000
      1:     0 2'-1   ->     1 4'1000
      2:     0 2'10   ->     2 4'1000
      3:     1 2'--   ->     3 4'0001
      4:     2 2'--   ->     0 4'0010
      5:     3 2'--   ->     0 4'0100

-------------------------------------

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).
Mapping FSM `$fsm$\u_conv2d.fsm_conv2d$5489' from module `\top'.
Mapping FSM `$fsm$\u_conv2d.fsm_getbias$5506' from module `\top'.
Mapping FSM `$fsm$\u_conv2d.fsm_getpixels$5511' from module `\top'.
Mapping FSM `$fsm$\u_ctl.fsm_ctl$5517' from module `\top'.

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~23 debug messages>

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~148 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_or_1206$conv2d.v:1245$4365: { \u_conv2d.fsm_conv2d [11:7] \u_conv2d.fsm_conv2d [5:4] \u_conv2d.fsm_conv2d [1:0] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_or_1202$conv2d.v:1245$4362: { \u_conv2d.fsm_conv2d [11:7] \u_conv2d.fsm_conv2d [5:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_or_1195$conv2d.v:1245$4357: { \u_conv2d.fsm_conv2d [11:8] \u_conv2d.fsm_conv2d [6:3] \u_conv2d.fsm_conv2d [1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_or_1193$conv2d.v:1245$4355: { \u_conv2d.fsm_conv2d [11:4] \u_conv2d.fsm_conv2d [2:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_or_1185$conv2d.v:1245$4348: { \u_conv2d.fsm_conv2d [11:6] \u_conv2d.fsm_conv2d [4:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_or_1180$conv2d.v:1245$4343: { \u_conv2d.fsm_conv2d [11:7] \u_conv2d.fsm_conv2d [4:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_nor_1163$conv2d.v:1245$4325: \u_conv2d.fsm_conv2d
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$5395: { \u_conv2d.fsm_conv2d [11:8] \u_conv2d.fsm_conv2d [5] \u_conv2d.fsm_conv2d [3:2] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$5393: { \u_conv2d.fsm_conv2d [10:8] \u_conv2d.fsm_conv2d [6:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$5389: { \u_conv2d.fsm_conv2d [10] \u_conv2d.fsm_conv2d [8:7] \u_conv2d.fsm_conv2d [5:3] \u_conv2d.fsm_conv2d [1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$5385: { \u_conv2d.fsm_conv2d [11:10] \u_conv2d.fsm_conv2d [8:7] \u_conv2d.fsm_conv2d [3:0] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$5383: { \u_conv2d.fsm_conv2d [11:10] \u_conv2d.fsm_conv2d [8:6] \u_conv2d.fsm_conv2d [4:0] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$5381: { \u_conv2d.fsm_conv2d [11] \u_conv2d.fsm_conv2d [9:6] \u_conv2d.fsm_conv2d [4:0] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$5379: { \u_conv2d.fsm_conv2d [11:8] \u_conv2d.fsm_conv2d [6] \u_conv2d.fsm_conv2d [4:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$5375: { \u_conv2d.fsm_conv2d [10] \u_conv2d.fsm_conv2d [8:6] \u_conv2d.fsm_conv2d [4:0] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$5369: { \u_conv2d.fsm_conv2d [11] \u_conv2d.fsm_conv2d [9:8] \u_conv2d.fsm_conv2d [3:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$5363: { \u_conv2d.fsm_conv2d [11] \u_conv2d.fsm_conv2d [9] \u_conv2d.fsm_conv2d [7:3] \u_conv2d.fsm_conv2d [0] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$5333: { \u_conv2d.fsm_conv2d [11:9] \u_conv2d.fsm_conv2d [6:4] \u_conv2d.fsm_conv2d [2:0] $flatten\u_conv2d.$verific$n11257$1925 }
  Optimizing cells in module \top.
Performed a total of 18 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\u_ctl.$verific$i_width_reg$control.v:224$1703 ($adff) from module top (D = $flatten\u_ctl.$verific$n2526$1534, Q = \u_ctl.i_width).
Adding EN signal on $flatten\u_ctl.$verific$i_total_reg$control.v:224$1712 ($adff) from module top (D = $flatten\u_ctl.$verific$n2650$1542, Q = \u_ctl.i_total).
Adding EN signal on $flatten\u_ctl.$verific$i_shift_reg$control.v:224$1725 ($adff) from module top (D = $flatten\u_ctl.$verific$n2752$1547, Q = \u_ctl.i_shift).
Adding EN signal on $flatten\u_ctl.$verific$i_sda_reg$control.v:224$1726 ($adff) from module top (D = \PWDATA [0], Q = \u_ctl.i_sda).
Adding EN signal on $flatten\u_ctl.$verific$i_scl_reg$control.v:224$1727 ($adff) from module top (D = \PWDATA [1], Q = \u_ctl.i_scl).
Adding EN signal on $flatten\u_ctl.$verific$i_result_base_reg$control.v:224$1711 ($adff) from module top (D = $flatten\u_ctl.$verific$n2629$1541, Q = \u_ctl.i_result_base).
Adding EN signal on $flatten\u_ctl.$verific$i_ready_reg$control.v:224$1701 ($adff) from module top (D = $flatten\u_ctl.$verific$n2492$1449, Q = \u_ctl.i_ready).
Adding EN signal on $flatten\u_ctl.$verific$i_quant_reg$control.v:224$1724 ($adff) from module top (D = $flatten\u_ctl.$verific$n2735$1546, Q = \u_ctl.i_quant).
Adding EN signal on $flatten\u_ctl.$verific$i_pixel_base_reg$control.v:224$1709 ($adff) from module top (D = $flatten\u_ctl.$verific$n2587$1539, Q = \u_ctl.i_pixel_base).
Adding EN signal on $flatten\u_ctl.$verific$i_intr_en_reg$control.v:224$1722 ($adff) from module top (D = \PWDATA [0], Q = \u_ctl.i_intr_en).
Adding EN signal on $flatten\u_ctl.$verific$i_height_reg$control.v:224$1704 ($adff) from module top (D = $flatten\u_ctl.$verific$n2536$1535, Q = \u_ctl.i_height).
Adding EN signal on $flatten\u_ctl.$verific$i_filters_reg$control.v:224$1706 ($adff) from module top (D = $flatten\u_ctl.$verific$n2556$1537, Q = \u_ctl.i_filters).
Adding EN signal on $flatten\u_ctl.$verific$i_filter_base_reg$control.v:224$1708 ($adff) from module top (D = $flatten\u_ctl.$verific$n2566$1538, Q = \u_ctl.i_filter_base).
Adding EN signal on $flatten\u_ctl.$verific$i_debug_mux_reg$control.v:224$1715 ($adff) from module top (D = $flatten\u_ctl.$verific$n2726$1545, Q = \u_ctl.i_debug_mux).
Adding EN signal on $flatten\u_ctl.$verific$i_dataout_reg$control.v:224$1707 ($adff) from module top (D = $flatten\u_ctl.$verific$n2758$1548, Q = \u_ctl.i_dataout).
Adding EN signal on $flatten\u_ctl.$verific$i_channels_reg$control.v:224$1705 ($adff) from module top (D = $flatten\u_ctl.$verific$n2546$1536, Q = \u_ctl.i_channels).
Adding EN signal on $flatten\u_ctl.$verific$i_bias_base_reg$control.v:224$1710 ($adff) from module top (D = $flatten\u_ctl.$verific$n2608$1540, Q = \u_ctl.i_bias_base).
Adding EN signal on $flatten\u_ctl.$verific$i_addr_reg$control.v:224$1717 ($adff) from module top (D = $flatten\u_ctl.$verific$n2669$1543 [1:0], Q = \u_ctl.i_addr [1:0]).
Adding EN signal on $flatten\u_ctl.$verific$i_addr_reg$control.v:224$1717 ($adff) from module top (D = $flatten\u_ctl.$verific$n2669$1543 [19:2], Q = \u_ctl.i_addr [19:2]).
Adding EN signal on $flatten\u_ctl.$verific$ctl_reg$control.v:224$1702 ($adff) from module top (D = $flatten\u_ctl.$verific$n2493$1533 [31:1], Q = \u_ctl.ctl [31:1]).
Adding EN signal on $flatten\u_conv2d.$verific$total_filters_done_reg$conv2d.v:1246$4382 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11570$2441, Q = \u_conv2d.total_filters_done).
Adding EN signal on $flatten\u_conv2d.$verific$running_reg$conv2d.v:1246$4384 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11639$1942, Q = \u_conv2d.running).
Adding EN signal on $flatten\u_conv2d.$verific$pixels_read_reg$conv2d.v:913$3120 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8238$2268, Q = \u_conv2d.pixels_read).
Adding EN signal on $flatten\u_conv2d.$verific$pixel_start_reg$conv2d.v:913$3127 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8271$1860, Q = \u_conv2d.pixel_start).
Adding EN signal on $flatten\u_conv2d.$verific$pixel_select_reg$conv2d.v:1246$4400 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11598$2443, Q = \u_conv2d.pixel_select).
Adding EN signal on $flatten\u_conv2d.$verific$next_buffer_reg$conv2d.v:1246$4399 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11595$1931, Q = \u_conv2d.next_buffer).
Adding EN signal on $flatten\u_conv2d.$verific$load_more_filters_reg$conv2d.v:1246$4386 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11637$1941, Q = \u_conv2d.load_more_filters).
Adding EN signal on $flatten\u_conv2d.$verific$load_buffer_reg$conv2d.v:913$3129 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8269$1859, Q = \u_conv2d.load_buffer).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm3_wen_reg$conv2d.v:785$3010 ($adff) from module top (D = $flatten\u_conv2d.$verific$n5111$1781, Q = \u_conv2d.i_tcdm3_wen).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm3_req_reg$conv2d.v:785$3009 ($adff) from module top (D = $flatten\u_conv2d.$verific$n5109$1780, Q = \u_conv2d.i_tcdm3_req).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm3_raddr_reg$conv2d.v:785$3002 ($aldff) from module top (D = $flatten\u_conv2d.$verific$n5087$2151 [1:0], Q = \u_conv2d.i_tcdm3_raddr [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm3_raddr_reg$conv2d.v:785$3002 ($aldff) from module top (D = $flatten\u_conv2d.$verific$n5087$2151 [19:2], Q = \u_conv2d.i_tcdm3_raddr [19:2]).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm2_wen_reg$conv2d.v:785$3018 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6636$1821, Q = \u_conv2d.i_tcdm2_wen).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm2_rreq_reg$conv2d.v:785$3007 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6635$1820, Q = \u_conv2d.i_tcdm2_rreq).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm2_raddr_reg$conv2d.v:785$2997 ($aldff) from module top (D = $flatten\u_conv2d.$verific$n6614$2225 [1:0], Q = \u_conv2d.i_tcdm2_raddr [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm2_raddr_reg$conv2d.v:785$2997 ($aldff) from module top (D = $flatten\u_conv2d.$verific$n6614$2225 [19:2], Q = \u_conv2d.i_tcdm2_raddr [19:2]).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm1_wen_reg$conv2d.v:913$3122 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8303$1863, Q = \u_conv2d.i_tcdm1_wen).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm1_req_reg$conv2d.v:913$3123 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8301$1862, Q = \u_conv2d.i_tcdm1_req).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm1_addr_reg$conv2d.v:913$3121 ($aldff) from module top (D = $flatten\u_conv2d.$verific$n8272$2270 [1:0], Q = \u_conv2d.i_tcdm1_addr [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm1_addr_reg$conv2d.v:913$3121 ($aldff) from module top (D = $flatten\u_conv2d.$verific$n8272$2270 [19:2], Q = \u_conv2d.i_tcdm1_addr [19:2]).
Adding EN signal on $flatten\u_conv2d.$verific$i_pixel_wdata_reg$conv2d.v:913$3126 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8304$2273, Q = \u_conv2d.i_pixel_wdata).
Adding EN signal on $flatten\u_conv2d.$verific$i_pixel_raddr_reg$conv2d.v:1246$4378 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11540$2439, Q = \u_conv2d.i_pixel_raddr).
Adding EN signal on $flatten\u_conv2d.$verific$i_outsel_reg$conv2d.v:1246$4377 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11467$2436, Q = \u_conv2d.i_outsel).
Adding EN signal on $flatten\u_conv2d.$verific$i_mult2_coef_reg$conv2d.v:1246$4404 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11507$2438, Q = \u_conv2d.i_mult2_coef).
Adding EN signal on $flatten\u_conv2d.$verific$i_mult1_coef_reg$conv2d.v:1246$4403 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11474$2437, Q = \u_conv2d.i_mult1_coef).
Adding EN signal on $flatten\u_conv2d.$verific$i_math_mode_reg$conv2d.v:1246$4374 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11258$2426, Q = \u_conv2d.i_math_mode).
Adding EN signal on $flatten\u_conv2d.$verific$i_mac_clr_reg$conv2d.v:1246$4375 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11619$1938, Q = \u_conv2d.i_mac_clr).
Adding EN signal on $flatten\u_conv2d.$verific$i_mac_clken_reg$conv2d.v:1246$4376 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11622$1939, Q = \u_conv2d.i_mac_clken).
Adding EN signal on $flatten\u_conv2d.$verific$i_filter_wdata_reg$conv2d.v:785$3014 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6651$2228, Q = \u_conv2d.i_filter_wdata).
Adding EN signal on $flatten\u_conv2d.$verific$i_filter_waddr_reg$conv2d.v:785$3013 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6562$2221 [0], Q = \u_conv2d.i_filter_waddr [0]).
Adding EN signal on $flatten\u_conv2d.$verific$i_filter_waddr_reg$conv2d.v:785$3013 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6562$2221 [11:1], Q = \u_conv2d.i_filter_waddr [11:1]).
Adding EN signal on $flatten\u_conv2d.$verific$i_filter_raddr_reg$conv2d.v:1246$4379 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11623$2446 [1:0], Q = \u_conv2d.i_filter_raddr [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$i_filter_raddr_reg$conv2d.v:1246$4379 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11623$2446 [11:2], Q = \u_conv2d.i_filter_raddr [11:2]).
Adding EN signal on $flatten\u_conv2d.$verific$i_done2d_reg$conv2d.v:1246$4383 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11616$1935, Q = \u_conv2d.i_done2d).
Adding EN signal on $flatten\u_conv2d.$verific$i_csel_reg$conv2d.v:1246$4372 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11641$1944, Q = \u_conv2d.i_csel).
Adding EN signal on $flatten\u_conv2d.$verific$i_bias_wdata_reg$conv2d.v:785$3012 ($adff) from module top (D = $flatten\u_conv2d.$verific$n5126$2154, Q = \u_conv2d.i_bias_wdata).
Adding EN signal on $flatten\u_conv2d.$verific$i_bias_waddr_reg$conv2d.v:785$3004 ($adff) from module top (D = $flatten\u_conv2d.$verific$n5064$2149 [11:2], Q = \u_conv2d.i_bias_waddr [11:2]).
Adding EN signal on $flatten\u_conv2d.$verific$i_bias_waddr_reg$conv2d.v:785$3004 ($adff) from module top (D = $flatten\u_conv2d.$verific$n5064$2149 [1:0], Q = \u_conv2d.i_bias_waddr [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$fsm_getfilters_reg$conv2d.v:785$2986 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6647$2227, Q = \u_conv2d.fsm_getfilters).
Adding EN signal on $flatten\u_conv2d.$verific$fract_select_reg$conv2d.v:1246$4401 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11601$2444, Q = \u_conv2d.fract_select).
Adding EN signal on $flatten\u_conv2d.$verific$filters_loaded_reg$conv2d.v:785$2983 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6604$2224, Q = \u_conv2d.filters_loaded).
Adding EN signal on $flatten\u_conv2d.$verific$filters_done_reg$conv2d.v:1246$4381 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11582$2442 [2:0], Q = \u_conv2d.filters_done [2:0]).
Adding EN signal on $flatten\u_conv2d.$verific$filters_done_reg$conv2d.v:1246$4381 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11582$2442 [8:3], Q = \u_conv2d.filters_done [8:3]).
Adding EN signal on $flatten\u_conv2d.$verific$filter_stride_reg$conv2d.v:785$2984 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6590$2223, Q = \u_conv2d.filter_stride).
Adding EN signal on $flatten\u_conv2d.$verific$filter_start_reg$conv2d.v:785$3019 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6699$1826, Q = \u_conv2d.filter_start).
Adding EN signal on $flatten\u_conv2d.$verific$filter_space_left_reg$conv2d.v:785$3020 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6575$2222, Q = \u_conv2d.filter_space_left).
Adding EN signal on $flatten\u_conv2d.$verific$filter_reload_reg$conv2d.v:1246$4385 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11581$1927, Q = \u_conv2d.filter_reload).
Adding EN signal on $flatten\u_conv2d.$verific$filter_channels_reg$conv2d.v:785$3017 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6637$2226, Q = \u_conv2d.filter_channels).
Adding EN signal on $flatten\u_conv2d.$verific$channels_loaded_reg$conv2d.v:913$3119 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8338$2274 [1:0], Q = \u_conv2d.channels_loaded [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$channels_loaded_reg$conv2d.v:913$3119 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8338$2274 [8:2], Q = \u_conv2d.channels_loaded [8:2]).
Adding EN signal on $flatten\u_conv2d.$verific$channels_done_reg$conv2d.v:1246$4380 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11604$2445 [1:0], Q = \u_conv2d.channels_done [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$channels_done_reg$conv2d.v:1246$4380 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11604$2445 [8:2], Q = \u_conv2d.channels_done [8:2]).
Adding EN signal on $flatten\u_conv2d.$verific$buffers_used_reg$conv2d.v:913$3128 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8293$2271 [1], Q = \u_conv2d.buffers_used [1]).
Adding EN signal on $flatten\u_conv2d.$verific$buffers_used_reg$conv2d.v:913$3128 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8293$2271 [0], Q = \u_conv2d.buffers_used [0]).
Adding EN signal on $flatten\u_conv2d.$verific$bias_loaded_reg$conv2d.v:785$3006 ($adff) from module top (D = $flatten\u_conv2d.$verific$n5112$2152, Q = \u_conv2d.bias_loaded).
Adding EN signal on $flatten\u_conv2d.$verific$acc7_reg$conv2d.v:1246$4398 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11436$2434 [7:0], Q = \u_conv2d.acc7 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc7_reg$conv2d.v:1246$4398 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11436$2434 [15:8], Q = \u_conv2d.acc7 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc7_reg$conv2d.v:1246$4398 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11436$2434 [23:16], Q = \u_conv2d.acc7 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc6_reg$conv2d.v:1246$4397 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11411$2433 [7:0], Q = \u_conv2d.acc6 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc6_reg$conv2d.v:1246$4397 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11411$2433 [15:8], Q = \u_conv2d.acc6 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc6_reg$conv2d.v:1246$4397 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11411$2433 [23:16], Q = \u_conv2d.acc6 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc5_reg$conv2d.v:1246$4396 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11386$2432 [7:0], Q = \u_conv2d.acc5 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc5_reg$conv2d.v:1246$4396 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11386$2432 [15:8], Q = \u_conv2d.acc5 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc5_reg$conv2d.v:1246$4396 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11386$2432 [23:16], Q = \u_conv2d.acc5 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc4_reg$conv2d.v:1246$4395 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11361$2431 [7:0], Q = \u_conv2d.acc4 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc4_reg$conv2d.v:1246$4395 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11361$2431 [15:8], Q = \u_conv2d.acc4 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc4_reg$conv2d.v:1246$4395 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11361$2431 [23:16], Q = \u_conv2d.acc4 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc3_reg$conv2d.v:1246$4394 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11336$2430 [7:0], Q = \u_conv2d.acc3 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc3_reg$conv2d.v:1246$4394 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11336$2430 [15:8], Q = \u_conv2d.acc3 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc3_reg$conv2d.v:1246$4394 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11336$2430 [23:16], Q = \u_conv2d.acc3 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc2_reg$conv2d.v:1246$4393 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11311$2429 [7:0], Q = \u_conv2d.acc2 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc2_reg$conv2d.v:1246$4393 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11311$2429 [15:8], Q = \u_conv2d.acc2 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc2_reg$conv2d.v:1246$4393 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11311$2429 [23:16], Q = \u_conv2d.acc2 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc1_reg$conv2d.v:1246$4392 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11286$2428 [7:0], Q = \u_conv2d.acc1 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc1_reg$conv2d.v:1246$4392 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11286$2428 [15:8], Q = \u_conv2d.acc1 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc1_reg$conv2d.v:1246$4392 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11286$2428 [23:16], Q = \u_conv2d.acc1 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc0_reg$conv2d.v:1246$4391 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11261$2427 [7:0], Q = \u_conv2d.acc0 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc0_reg$conv2d.v:1246$4391 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11261$2427 [15:8], Q = \u_conv2d.acc0 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc0_reg$conv2d.v:1246$4391 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11261$2427 [23:16], Q = \u_conv2d.acc0 [23:16]).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$6336 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$6336 ($adffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$6320 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$6320 ($adffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$6221 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$6221 ($adffe) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$6221 ($adffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$6123 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$6123 ($adffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$6093 ($adffe) from module top.
Setting constant 0-bit at position 0 on $flatten\u_conv2d.$verific$bias_base_addr_reg$conv2d.v:785$3005 ($adff) from module top.
Setting constant 0-bit at position 1 on $flatten\u_conv2d.$verific$bias_base_addr_reg$conv2d.v:785$3005 ($adff) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$6283 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$6283 ($adffe) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$6283 ($adffe) from module top.
Setting constant 0-bit at position 0 on $flatten\u_conv2d.$verific$filters_complete_reg$conv2d.v:785$3021 ($adff) from module top.
Setting constant 0-bit at position 1 on $flatten\u_conv2d.$verific$filters_complete_reg$conv2d.v:785$3021 ($adff) from module top.
Setting constant 0-bit at position 2 on $flatten\u_conv2d.$verific$filters_complete_reg$conv2d.v:785$3021 ($adff) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$6210 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$6210 ($adffe) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$6210 ($adffe) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$6188 ($adffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$6181 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$6181 ($adffe) from module top.
Setting constant 0-bit at position 0 on $flatten\u_conv2d.$verific$i_pixel_waddr_reg$conv2d.v:913$3125 ($adff) from module top.
Setting constant 0-bit at position 1 on $flatten\u_conv2d.$verific$i_pixel_waddr_reg$conv2d.v:913$3125 ($adff) from module top.

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 46 unused cells and 95 unused wires.
<suppressed ~47 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~135 debug messages>

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~145 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~519 debug messages>
Removed a total of 173 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$5842 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$5842 ($adffe) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$5842 ($adffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$6551 ($adff) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$6551 ($adff) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$6551 ($adff) from module top.
Setting constant 0-bit at position 0 on $flatten\u_conv2d.$verific$i_bias_raddr_reg$conv2d.v:785$3003 ($adff) from module top.
Setting constant 0-bit at position 1 on $flatten\u_conv2d.$verific$i_bias_raddr_reg$conv2d.v:785$3003 ($adff) from module top.

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 1 unused cells and 182 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~149 debug messages>

yosys> opt_reduce

3.13.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.13.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 7 bits (of 20) from FF cell top.$flatten\u_ctl.$verific$i_ctl_pfwaddr_reg$control.v:224$1718 ($adff).
Removed top 2 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_211$control.v:216$1662 ($eq).
Removed top 2 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_142$control.v:181$1633 ($eq).
Removed top 2 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_141$control.v:177$1632 ($eq).
Removed top 2 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_140$control.v:174$1631 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_139$control.v:169$1630 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_138$control.v:164$1629 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_137$control.v:159$1628 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_136$control.v:158$1627 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_135$control.v:157$1626 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_134$control.v:156$1625 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_133$control.v:155$1624 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_132$control.v:154$1623 ($eq).
Removed top 4 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_131$control.v:153$1622 ($eq).
Removed top 4 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_130$control.v:152$1621 ($eq).
Removed top 4 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_129$control.v:151$1620 ($eq).
Removed top 4 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_128$control.v:150$1619 ($eq).
Removed top 5 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_127$control.v:149$1618 ($eq).
Removed top 5 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_126$control.v:148$1617 ($eq).
Removed top 6 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_125$control.v:147$1616 ($eq).
Removed top 17 bits (of 18) from port B of cell top.$flatten\u_ctl.$verific$add_108$control.v:161$1611 ($add).
Removed top 23 bits (of 24) from port B of cell top.$flatten\u_ctl.$verific$add_69$control.v:118$1593 ($add).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$6394 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$6368 ($ne).
Removed top 1 bits (of 4) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$6362 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$6291 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$6289 ($ne).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$6276 ($ne).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$6263 ($ne).
Removed top 2 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$6198 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$6180 ($ne).
Removed top 2 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$6120 ($ne).
Removed top 2 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$6118 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$6116 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5954 ($ne).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5948 ($ne).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5916 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5902 ($ne).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5868 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$5645 ($eq).
Removed top 1 bits (of 2) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$5667 ($eq).
Removed top 1 bits (of 11) from port Y of cell top.$flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or).
Removed top 1 bits (of 11) from port A of cell top.$flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or).
Removed top 1 bits (of 11) from port B of cell top.$flatten\u_conv2d.\pk2.$verific$or_132$ksa1.v:31$5316 ($or).
Removed top 9 bits (of 12) from port B of cell top.$flatten\u_conv2d.\pk1.$verific$xor_4$ksa.v:12$5198 ($xor).
Removed top 9 bits (of 12) from port B of cell top.$flatten\u_conv2d.\pk1.$verific$and_6$ksa.v:13$5200 ($and).
Removed top 1 bits (of 12) from port Y of cell top.$flatten\u_conv2d.\pk1.$verific$and_6$ksa.v:13$5200 ($and).
Removed top 1 bits (of 12) from port A of cell top.$flatten\u_conv2d.\pk1.$verific$and_6$ksa.v:13$5200 ($and).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_7.$verific$xor_4$ksa.v:12$5029 ($xor).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_7.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port Y of cell top.$flatten\u_conv2d.\k16_7.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port A of cell top.$flatten\u_conv2d.\k16_7.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_6.$verific$xor_4$ksa.v:12$5029 ($xor).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_6.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port Y of cell top.$flatten\u_conv2d.\k16_6.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port A of cell top.$flatten\u_conv2d.\k16_6.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_5.$verific$xor_4$ksa.v:12$5029 ($xor).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_5.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port Y of cell top.$flatten\u_conv2d.\k16_5.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port A of cell top.$flatten\u_conv2d.\k16_5.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_4.$verific$xor_4$ksa.v:12$5029 ($xor).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_4.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port Y of cell top.$flatten\u_conv2d.\k16_4.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port A of cell top.$flatten\u_conv2d.\k16_4.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_3.$verific$xor_4$ksa.v:12$5029 ($xor).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_3.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port Y of cell top.$flatten\u_conv2d.\k16_3.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port A of cell top.$flatten\u_conv2d.\k16_3.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_2.$verific$xor_4$ksa.v:12$5029 ($xor).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_2.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port Y of cell top.$flatten\u_conv2d.\k16_2.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port A of cell top.$flatten\u_conv2d.\k16_2.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_1.$verific$xor_4$ksa.v:12$5029 ($xor).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_1.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port Y of cell top.$flatten\u_conv2d.\k16_1.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port A of cell top.$flatten\u_conv2d.\k16_1.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_0.$verific$xor_4$ksa.v:12$5029 ($xor).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_0.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port Y of cell top.$flatten\u_conv2d.\k16_0.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 1 bits (of 16) from port A of cell top.$flatten\u_conv2d.\k16_0.$verific$and_6$ksa.v:13$5031 ($and).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k7.$verific$xor_4$ksa.v:12$4788 ($xor).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k7.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port Y of cell top.$flatten\u_conv2d.\k7.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port A of cell top.$flatten\u_conv2d.\k7.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k6.$verific$xor_4$ksa.v:12$4788 ($xor).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k6.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port Y of cell top.$flatten\u_conv2d.\k6.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port A of cell top.$flatten\u_conv2d.\k6.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k5.$verific$xor_4$ksa.v:12$4788 ($xor).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k5.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port Y of cell top.$flatten\u_conv2d.\k5.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port A of cell top.$flatten\u_conv2d.\k5.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k4.$verific$xor_4$ksa.v:12$4788 ($xor).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k4.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port Y of cell top.$flatten\u_conv2d.\k4.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port A of cell top.$flatten\u_conv2d.\k4.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k3.$verific$xor_4$ksa.v:12$4788 ($xor).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k3.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port Y of cell top.$flatten\u_conv2d.\k3.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port A of cell top.$flatten\u_conv2d.\k3.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k2.$verific$xor_4$ksa.v:12$4788 ($xor).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k2.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port Y of cell top.$flatten\u_conv2d.\k2.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port A of cell top.$flatten\u_conv2d.\k2.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k1.$verific$xor_4$ksa.v:12$4788 ($xor).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k1.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port Y of cell top.$flatten\u_conv2d.\k1.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port A of cell top.$flatten\u_conv2d.\k1.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k0.$verific$xor_4$ksa.v:12$4788 ($xor).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k0.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port Y of cell top.$flatten\u_conv2d.\k0.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 1 bits (of 24) from port A of cell top.$flatten\u_conv2d.\k0.$verific$and_6$ksa.v:13$4790 ($and).
Removed top 7 bits (of 20) from port B of cell top.$flatten\u_conv2d.\t2_3.$verific$xor_4$ksa.v:12$4523 ($xor).
Removed top 7 bits (of 20) from port B of cell top.$flatten\u_conv2d.\t2_3.$verific$and_6$ksa.v:13$4525 ($and).
Removed top 1 bits (of 20) from port Y of cell top.$flatten\u_conv2d.\t2_3.$verific$and_6$ksa.v:13$4525 ($and).
Removed top 1 bits (of 20) from port A of cell top.$flatten\u_conv2d.\t2_3.$verific$and_6$ksa.v:13$4525 ($and).
Removed top 17 bits (of 20) from port B of cell top.$flatten\u_conv2d.\t2_2.$verific$xor_4$ksa.v:12$4523 ($xor).
Removed top 17 bits (of 20) from port B of cell top.$flatten\u_conv2d.\t2_2.$verific$and_6$ksa.v:13$4525 ($and).
Removed top 1 bits (of 20) from port Y of cell top.$flatten\u_conv2d.\t2_2.$verific$and_6$ksa.v:13$4525 ($and).
Removed top 1 bits (of 20) from port A of cell top.$flatten\u_conv2d.\t2_2.$verific$and_6$ksa.v:13$4525 ($and).
Removed top 11 bits (of 20) from port B of cell top.$flatten\u_conv2d.\t2_1.$verific$xor_4$ksa.v:12$4523 ($xor).
Removed top 11 bits (of 20) from port B of cell top.$flatten\u_conv2d.\t2_1.$verific$and_6$ksa.v:13$4525 ($and).
Removed top 1 bits (of 20) from port Y of cell top.$flatten\u_conv2d.\t2_1.$verific$and_6$ksa.v:13$4525 ($and).
Removed top 1 bits (of 20) from port A of cell top.$flatten\u_conv2d.\t2_1.$verific$and_6$ksa.v:13$4525 ($and).
Removed top 1 bits (of 2) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$5628 ($eq).
Removed top 15 bits (of 16) from port B of cell top.$flatten\u_conv2d.$verific$add_1110$conv2d.v:1199$4296 ($add).
Removed top 1 bits (of 7) from port B of cell top.$flatten\u_conv2d.$verific$equal_1094$conv2d.v:1182$4292 ($eq).
Removed top 5 bits (of 6) from port B of cell top.$flatten\u_conv2d.$verific$add_1091$conv2d.v:1181$4290 ($add).
Removed top 1 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$equal_1069$conv2d.v:1157$4276 ($eq).
Removed top 6 bits (of 7) from port B of cell top.$flatten\u_conv2d.$verific$add_1066$conv2d.v:1156$4274 ($add).
Removed top 1 bits (of 2) from port B of cell top.$flatten\u_conv2d.$verific$add_1063$conv2d.v:1153$4272 ($add).
Removed top 9 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$add_1018$conv2d.v:1119$4253 ($add).
Removed top 1 bits (of 17) from port B of cell top.$flatten\u_conv2d.$verific$equal_768$conv2d.v:876$3066 ($eq).
Removed top 15 bits (of 16) from port B of cell top.$flatten\u_conv2d.$verific$add_764$conv2d.v:874$3064 ($add).
Removed top 1 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$equal_756$conv2d.v:870$3060 ($eq).
Removed top 6 bits (of 7) from port B of cell top.$flatten\u_conv2d.$verific$add_753$conv2d.v:869$3058 ($add).
Removed top 17 bits (of 18) from port B of cell top.$flatten\u_conv2d.$verific$add_750$conv2d.v:867$3056 ($add).
Removed top 9 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$add_724$conv2d.v:842$3045 ($add).
Removed top 1 bits (of 3) from mux cell top.$flatten\u_conv2d.$verific$select_635$conv2d.v:784$2972 ($pmux).
Removed top 1 bits (of 2) from port B of cell top.$flatten\u_conv2d.$verific$equal_623$conv2d.v:667$2958 ($eq).
Removed top 1 bits (of 3) from mux cell top.$flatten\u_conv2d.$verific$mux_621$conv2d.v:782$2956 ($mux).
Removed top 1 bits (of 3) from mux cell top.$flatten\u_conv2d.$verific$mux_617$conv2d.v:779$2954 ($mux).
Removed top 1 bits (of 3) from mux cell top.$flatten\u_conv2d.$verific$mux_486$conv2d.v:702$2913 ($mux).
Removed top 2 bits (of 14) from port A of cell top.$flatten\u_conv2d.$verific$LessThan_472$conv2d.v:691$2908 ($le).
Removed top 1 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$LessThan_471$conv2d.v:690$2907 ($lt).
Removed top 5 bits (of 6) from port B of cell top.$flatten\u_conv2d.$verific$add_468$conv2d.v:689$2905 ($add).
Removed top 5 bits (of 6) from port B of cell top.$flatten\u_conv2d.$verific$add_466$conv2d.v:688$2903 ($add).
Removed top 1 bits (of 14) from port A of cell top.$flatten\u_conv2d.$verific$sub_464$conv2d.v:687$2900 ($sub).
Removed top 10 bits (of 14) from port B of cell top.$flatten\u_conv2d.$verific$sub_464$conv2d.v:687$2900 ($sub).
Removed top 1 bits (of 14) from port Y of cell top.$flatten\u_conv2d.$verific$sub_464$conv2d.v:687$2900 ($sub).
Removed top 1 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$equal_463$conv2d.v:686$2899 ($eq).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_conv2d.$verific$add_460$conv2d.v:685$2897 ($add).
Removed top 17 bits (of 18) from port B of cell top.$flatten\u_conv2d.$verific$add_454$conv2d.v:681$2891 ($add).
Removed top 1 bits (of 15) from port A of cell top.$flatten\u_conv2d.$verific$sub_439$conv2d.v:672$2881 ($sub).
Removed top 11 bits (of 15) from port B of cell top.$flatten\u_conv2d.$verific$sub_439$conv2d.v:672$2881 ($sub).
Removed top 1 bits (of 15) from port Y of cell top.$flatten\u_conv2d.$verific$sub_439$conv2d.v:672$2881 ($sub).
Removed top 10 bits (of 11) from port B of cell top.$flatten\u_conv2d.$verific$add_436$conv2d.v:669$2879 ($add).
Removed top 1 bits (of 3) from mux cell top.$flatten\u_conv2d.$verific$mux_435$conv2d.v:665$2878 ($mux).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_conv2d.$verific$add_387$conv2d.v:638$2841 ($add).
Removed top 17 bits (of 18) from port B of cell top.$flatten\u_conv2d.$verific$add_381$conv2d.v:630$2837 ($add).
Removed top 9 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$add_354$conv2d.v:606$2823 ($add).
Removed top 1 bits (of 4) from mux cell top.$flatten\u_conv2d.$verific$mux_324$conv2d.v:579$2806 ($mux).
Removed top 10 bits (of 11) from port B of cell top.$flatten\u_conv2d.$verific$add_291$conv2d.v:540$2788 ($add).
Removed top 9 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$add_202$conv2d.v:418$2738 ($add).
Removed top 1 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$add_190$conv2d.v:409$2729 ($add).
Removed top 2 bits (of 4) from port B of cell top.$flatten\u_conv2d.$verific$equal_69$conv2d.v:123$2492 ($eq).
Removed top 2 bits (of 4) from port B of cell top.$flatten\u_conv2d.$verific$equal_68$conv2d.v:122$2491 ($eq).
Removed top 3 bits (of 4) from port B of cell top.$flatten\u_conv2d.$verific$equal_67$conv2d.v:121$2490 ($eq).
Removed top 1 bits (of 11) from port Y of cell top.$flatten\u_conv2d.\pk2.$verific$or_129$ksa1.v:30$5313 ($or).
Removed top 1 bits (of 11) from port A of cell top.$flatten\u_conv2d.\pk2.$verific$or_129$ksa1.v:30$5313 ($or).
Removed top 1 bits (of 11) from port B of cell top.$flatten\u_conv2d.\pk2.$verific$or_129$ksa1.v:30$5313 ($or).
Removed top 1 bits (of 11) from port Y of cell top.$flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and).
Removed top 1 bits (of 11) from port A of cell top.$flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and).
Removed top 1 bits (of 11) from port B of cell top.$flatten\u_conv2d.\pk2.$verific$and_133$ksa1.v:31$5315 ($and).
Removed top 1 bits (of 6) from mux cell top.$flatten\u_conv2d.$verific$mux_1278$conv2d.v:713$4197 ($mux).
Removed top 1 bits (of 12) from port Y of cell top.$flatten\u_conv2d.\pk2.$verific$and_6$ksa1.v:18$5296 ($and).
Removed top 1 bits (of 12) from port A of cell top.$flatten\u_conv2d.\pk2.$verific$and_6$ksa1.v:18$5296 ($and).
Removed top 1 bits (of 12) from port B of cell top.$flatten\u_conv2d.\pk2.$verific$and_6$ksa1.v:18$5296 ($and).
Removed cell top.$flatten\u_conv2d.\pk2.$verific$i116$ksa1.v:29$5309 ($and).
Removed top 1 bits (of 11) from port Y of cell top.$flatten\u_conv2d.\pk2.$verific$and_130$ksa1.v:30$5312 ($and).
Removed top 1 bits (of 11) from port A of cell top.$flatten\u_conv2d.\pk2.$verific$and_130$ksa1.v:30$5312 ($and).
Removed top 1 bits (of 11) from port B of cell top.$flatten\u_conv2d.\pk2.$verific$and_130$ksa1.v:30$5312 ($and).
Removed top 1 bits (of 4) from wire top.$flatten\u_conv2d.$verific$n4415$2110.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n5316$2159.
Removed top 1 bits (of 15) from wire top.$flatten\u_conv2d.$verific$n5359$2163.
Removed top 4 bits (of 14) from wire top.$flatten\u_conv2d.$verific$n5416$2165.
Removed top 1 bits (of 14) from wire top.$flatten\u_conv2d.$verific$n5563$2172.
Removed top 3 bits (of 6) from wire top.$flatten\u_conv2d.$verific$n5593$2174.
Removed top 5 bits (of 6) from wire top.$flatten\u_conv2d.$verific$n5611$2176.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n5681$2178.
Removed top 1 bits (of 13) from wire top.$flatten\u_conv2d.$verific$n5687$2179.
Removed top 7 bits (of 9) from wire top.$flatten\u_conv2d.$verific$n5701$2180.
Removed top 1 bits (of 9) from wire top.$flatten\u_conv2d.$verific$n5711$2181.
Removed top 3 bits (of 9) from wire top.$flatten\u_conv2d.$verific$n5723$2182.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n5734$2183.
Removed top 2 bits (of 9) from wire top.$flatten\u_conv2d.$verific$n5740$2184.
Removed top 2 bits (of 13) from wire top.$flatten\u_conv2d.$verific$n5750$2185.
Removed top 1 bits (of 9) from wire top.$flatten\u_conv2d.$verific$n5764$2186.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n5894$2195.
Removed top 1 bits (of 12) from wire top.$flatten\u_conv2d.$verific$n5924$2197.
Removed top 1 bits (of 14) from wire top.$flatten\u_conv2d.$verific$n5994$2199.
Removed top 3 bits (of 12) from wire top.$flatten\u_conv2d.$verific$n6009$2200.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n6534$2218.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n6553$2220.
Removed top 1 bits (of 12) from wire top.$flatten\u_conv2d.$verific$n6562$2221.
Removed top 2 bits (of 14) from wire top.$flatten\u_conv2d.$verific$n6575$2222.
Removed top 3 bits (of 13) from wire top.$flatten\u_conv2d.$verific$n6590$2223.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n6647$2227.
Removed top 1 bits (of 11) from wire top.$flatten\u_conv2d.\pk2.$verific$n203$5289.
Removed top 1 bits (of 11) from wire top.$flatten\u_conv2d.\pk2.$verific$n206$5291.
Removed top 7 bits (of 20) from wire top.ctl_pfwaddr.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 180 unused cells and 301 unused wires.
<suppressed ~181 debug messages>

yosys> techmap

3.18. Executing TECHMAP pass (map to technology primitives).

3.18.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.18.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $logic_not.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=18:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=18:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=18:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=18:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=18:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=18:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=24:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=24:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=24:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=24:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=24:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=24:394426c56d1a028ba8fdd5469b163e04011def47.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $aldffe.
Using extmapper simplemap for cells of type $xor.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=16:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=16:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=16:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=16:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=16:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=16:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=6:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=7:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=6:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=7:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=6:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=7:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=7:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=7:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=7:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=2:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=2:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=2:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=2:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=2:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=2:394426c56d1a028ba8fdd5469b163e04011def47.
Using extmapper simplemap for cells of type $bmux.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=10:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=10:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=10:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=10:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=10:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=10:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=16:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=17:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=16:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=17:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=16:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=17:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=8:Y_WIDTH=8:394426c56d1a028ba8fdd5469b163e04011def47.
Using extmapper simplemap for cells of type $aldff.
Running "alumacc" on wrapper $extern:wrap:$le:A_SIGNED=0:A_WIDTH=12:B_SIGNED=0:B_WIDTH=14:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$le:A_SIGNED=0:A_WIDTH=12:B_SIGNED=0:B_WIDTH=14:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$le:A_SIGNED=0:A_WIDTH=12:B_SIGNED=0:B_WIDTH=14:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=10:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=10:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$lt:A_SIGNED=0:A_WIDTH=10:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=1:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=6:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=6:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=6:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=6:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=6:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=6:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=13:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=13:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=13:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=13:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=13:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=13:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=10:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=10:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=10:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=14:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=14:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=14:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=14:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=14:B_SIGNED=0:B_WIDTH=4:Y_WIDTH=14:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=11:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=11:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=11:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=11:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=11:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=11:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=10:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=10:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=10:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=10:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=10:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=10:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $paramod$a1bc51c02ce12ac21eb18988e83292af48ed7d72\_90_alu for cells of type $alu.
Using template $paramod$754650b284649a026620fc6856e5b6886cbfe794\_90_alu for cells of type $alu.
Using template $paramod$ea402187f386206c0840504755479bf827f47707\_90_alu for cells of type $alu.
Using template $paramod$0a77e3c00010cb33e399decd813a7380c6e25cba\_90_alu for cells of type $alu.
Using template $paramod$f30f8fc2e30bd83d28cb1ad43b9d9ec083109075\_90_alu for cells of type $alu.
Using template $paramod$d2fa05d38998afabc6d4f34471305d0af4b8b2df\_90_alu for cells of type $alu.
Using template $paramod$175e67c02b86e96b1288b9dc100122520d7240d8\_90_alu for cells of type $alu.
Using template $paramod$f28fc3f2e267d7716249e826e8c90c34ca9542c1\_90_alu for cells of type $alu.
Using template $paramod$2af30114e9bd4ccb04dad757b3f0a8f6bf0615b0\_90_alu for cells of type $alu.
Using template $paramod$2f5fb04daf2da94d981bf9455fa4454c6ec8b705\_90_alu for cells of type $alu.
Using template $paramod$53700bbee849b2010ad0b60a61ccd204a10e24ca\_90_alu for cells of type $alu.
Using template $paramod$403c17aef119cccdd585ba431bb1c77ec6e3c700\_90_alu for cells of type $alu.
Using template $paramod$b2626aff51a34e60b9c57dceb41667aaf5650a38\_90_alu for cells of type $alu.
Using template $paramod$c703ee6d780d90e162c7eed92bfd050bee00636f\_90_alu for cells of type $alu.
Using template $paramod$32efbfac1c4dc57230cf86180788fdfd12e3b511\_90_alu for cells of type $alu.
Using template $paramod$49641a5ace7a8dbedd31c417f5a1b54fcecf6c7d\_90_alu for cells of type $alu.
Using template $paramod$46d3f1a4a915912bab1067a0beb0fb376719baeb\_90_alu for cells of type $alu.
Using template $paramod$79aa992f2eb7f354d4aaf651790713cf239111fa\_90_alu for cells of type $alu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001000 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000111 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001011 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011000 for cells of type $lcu.
No more expansions possible.
<suppressed ~8199 debug messages>

yosys> alumacc

3.19. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module top:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.20. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.20.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~8297 debug messages>

yosys> opt_merge -nomux

3.20.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~4548 debug messages>
Removed a total of 1516 cells.

yosys> opt_muxtree

3.20.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.20.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.20.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.20.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$26235 ($_DFFE_PN0P_) from module top (D = $auto$rtlil.cc:2459:Mux$6824 [0], Q = \u_conv2d.i_math_mode [0]).
Adding EN signal on $auto$ff.cc:262:slice$26236 ($_DFFE_PN1P_) from module top (D = $auto$rtlil.cc:2459:Mux$6824 [1], Q = \u_conv2d.i_math_mode [1]).
Adding EN signal on $auto$ff.cc:262:slice$19858 ($_DFFE_PN0P_) from module top (D = $auto$rtlil.cc:2459:Mux$7142 [0], Q = \u_conv2d.filter_stride [0]).
Adding EN signal on $auto$ff.cc:262:slice$19859 ($_DFFE_PN0P_) from module top (D = $auto$rtlil.cc:2459:Mux$7142 [1], Q = \u_conv2d.filter_stride [1]).
Adding EN signal on $auto$ff.cc:262:slice$19860 ($_DFFE_PN0P_) from module top (D = $auto$rtlil.cc:2459:Mux$7142 [2], Q = \u_conv2d.filter_stride [2]).

yosys> opt_clean

3.20.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 1552 unused cells and 3239 unused wires.
<suppressed ~1553 debug messages>

yosys> opt_expr

3.20.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~36 debug messages>

3.20.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.20.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.20.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.20.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~81 debug messages>
Removed a total of 27 cells.

yosys> opt_dff

3.20.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$8149 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25636 [11], Q = \u_conv2d.bias_base_addr [11]).
Adding EN signal on $auto$ff.cc:262:slice$8148 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25636 [10], Q = \u_conv2d.bias_base_addr [10]).
Adding EN signal on $auto$ff.cc:262:slice$8147 ($_DFF_PN1_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25636 [9], Q = \u_conv2d.bias_base_addr [9]).
Adding EN signal on $auto$ff.cc:262:slice$8146 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25636 [8], Q = \u_conv2d.bias_base_addr [8]).
Adding EN signal on $auto$ff.cc:262:slice$8145 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25636 [7], Q = \u_conv2d.bias_base_addr [7]).
Adding EN signal on $auto$ff.cc:262:slice$8144 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25636 [6], Q = \u_conv2d.bias_base_addr [6]).
Adding EN signal on $auto$ff.cc:262:slice$8143 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25636 [5], Q = \u_conv2d.bias_base_addr [5]).
Adding EN signal on $auto$ff.cc:262:slice$19440 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21459 [12], Q = \u_conv2d.add_stride [12]).
Adding EN signal on $auto$ff.cc:262:slice$19439 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21459 [11], Q = \u_conv2d.add_stride [11]).
Adding EN signal on $auto$ff.cc:262:slice$19438 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21459 [10], Q = \u_conv2d.add_stride [10]).
Adding EN signal on $auto$ff.cc:262:slice$19437 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21459 [9], Q = \u_conv2d.add_stride [9]).
Adding EN signal on $auto$ff.cc:262:slice$19436 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21459 [8], Q = \u_conv2d.add_stride [8]).
Adding EN signal on $auto$ff.cc:262:slice$19435 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21459 [7], Q = \u_conv2d.add_stride [7]).
Adding EN signal on $auto$ff.cc:262:slice$19434 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21459 [6], Q = \u_conv2d.add_stride [6]).
Adding EN signal on $auto$ff.cc:262:slice$19433 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21459 [5], Q = \u_conv2d.add_stride [5]).
Adding EN signal on $auto$ff.cc:262:slice$19432 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21459 [4], Q = \u_conv2d.add_stride [4]).
Adding EN signal on $auto$ff.cc:262:slice$19431 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21459 [3], Q = \u_conv2d.add_stride [3]).
Adding EN signal on $auto$ff.cc:262:slice$19430 ($_DFF_PN1_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21459 [2], Q = \u_conv2d.add_stride [2]).
Adding EN signal on $auto$ff.cc:262:slice$19429 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21459 [1], Q = \u_conv2d.add_stride [1]).
Adding EN signal on $auto$ff.cc:262:slice$19428 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21459 [0], Q = \u_conv2d.add_stride [0]).
Adding EN signal on $auto$ff.cc:262:slice$19410 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25257 [3], Q = \u_conv2d.fsm_loadacc [3]).
Adding EN signal on $auto$ff.cc:262:slice$19409 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25257 [2], Q = \u_conv2d.fsm_loadacc [2]).
Adding EN signal on $auto$ff.cc:262:slice$19408 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25257 [1], Q = \u_conv2d.fsm_loadacc [1]).
Adding EN signal on $auto$ff.cc:262:slice$19407 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25257 [0], Q = \u_conv2d.fsm_loadacc [0]).
Adding EN signal on $auto$ff.cc:262:slice$19401 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [18], Q = \u_conv2d.bias0 [18]).
Adding EN signal on $auto$ff.cc:262:slice$19400 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [17], Q = \u_conv2d.bias0 [17]).
Adding EN signal on $auto$ff.cc:262:slice$19399 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [16], Q = \u_conv2d.bias0 [16]).
Adding EN signal on $auto$ff.cc:262:slice$19398 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [15], Q = \u_conv2d.bias0 [15]).
Adding EN signal on $auto$ff.cc:262:slice$19397 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [14], Q = \u_conv2d.bias0 [14]).
Adding EN signal on $auto$ff.cc:262:slice$19396 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [13], Q = \u_conv2d.bias0 [13]).
Adding EN signal on $auto$ff.cc:262:slice$19395 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [12], Q = \u_conv2d.bias0 [12]).
Adding EN signal on $auto$ff.cc:262:slice$19394 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [11], Q = \u_conv2d.bias0 [11]).
Adding EN signal on $auto$ff.cc:262:slice$19393 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [10], Q = \u_conv2d.bias0 [10]).
Adding EN signal on $auto$ff.cc:262:slice$19392 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [9], Q = \u_conv2d.bias0 [9]).
Adding EN signal on $auto$ff.cc:262:slice$19391 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [8], Q = \u_conv2d.bias0 [8]).
Adding EN signal on $auto$ff.cc:262:slice$19390 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [7], Q = \u_conv2d.bias0 [7]).
Adding EN signal on $auto$ff.cc:262:slice$19389 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [6], Q = \u_conv2d.bias0 [6]).
Adding EN signal on $auto$ff.cc:262:slice$19388 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [5], Q = \u_conv2d.bias0 [5]).
Adding EN signal on $auto$ff.cc:262:slice$19387 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [4], Q = \u_conv2d.bias0 [4]).
Adding EN signal on $auto$ff.cc:262:slice$19386 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [3], Q = \u_conv2d.bias0 [3]).
Adding EN signal on $auto$ff.cc:262:slice$19385 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [2], Q = \u_conv2d.bias0 [2]).
Adding EN signal on $auto$ff.cc:262:slice$19384 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [1], Q = \u_conv2d.bias0 [1]).
Adding EN signal on $auto$ff.cc:262:slice$19383 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25173 [0], Q = \u_conv2d.bias0 [0]).
Adding EN signal on $auto$ff.cc:262:slice$19377 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [18], Q = \u_conv2d.bias1 [18]).
Adding EN signal on $auto$ff.cc:262:slice$19376 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [17], Q = \u_conv2d.bias1 [17]).
Adding EN signal on $auto$ff.cc:262:slice$19375 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [16], Q = \u_conv2d.bias1 [16]).
Adding EN signal on $auto$ff.cc:262:slice$19374 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [15], Q = \u_conv2d.bias1 [15]).
Adding EN signal on $auto$ff.cc:262:slice$19373 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [14], Q = \u_conv2d.bias1 [14]).
Adding EN signal on $auto$ff.cc:262:slice$19372 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [13], Q = \u_conv2d.bias1 [13]).
Adding EN signal on $auto$ff.cc:262:slice$19371 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [12], Q = \u_conv2d.bias1 [12]).
Adding EN signal on $auto$ff.cc:262:slice$19370 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [11], Q = \u_conv2d.bias1 [11]).
Adding EN signal on $auto$ff.cc:262:slice$19369 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [10], Q = \u_conv2d.bias1 [10]).
Adding EN signal on $auto$ff.cc:262:slice$19368 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [9], Q = \u_conv2d.bias1 [9]).
Adding EN signal on $auto$ff.cc:262:slice$19367 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [8], Q = \u_conv2d.bias1 [8]).
Adding EN signal on $auto$ff.cc:262:slice$19366 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [7], Q = \u_conv2d.bias1 [7]).
Adding EN signal on $auto$ff.cc:262:slice$19365 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [6], Q = \u_conv2d.bias1 [6]).
Adding EN signal on $auto$ff.cc:262:slice$19364 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [5], Q = \u_conv2d.bias1 [5]).
Adding EN signal on $auto$ff.cc:262:slice$19363 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [4], Q = \u_conv2d.bias1 [4]).
Adding EN signal on $auto$ff.cc:262:slice$19362 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [3], Q = \u_conv2d.bias1 [3]).
Adding EN signal on $auto$ff.cc:262:slice$19361 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [2], Q = \u_conv2d.bias1 [2]).
Adding EN signal on $auto$ff.cc:262:slice$19360 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [1], Q = \u_conv2d.bias1 [1]).
Adding EN signal on $auto$ff.cc:262:slice$19359 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24809 [0], Q = \u_conv2d.bias1 [0]).
Adding EN signal on $auto$ff.cc:262:slice$19353 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [18], Q = \u_conv2d.bias2 [18]).
Adding EN signal on $auto$ff.cc:262:slice$19352 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [17], Q = \u_conv2d.bias2 [17]).
Adding EN signal on $auto$ff.cc:262:slice$19351 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [16], Q = \u_conv2d.bias2 [16]).
Adding EN signal on $auto$ff.cc:262:slice$19350 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [15], Q = \u_conv2d.bias2 [15]).
Adding EN signal on $auto$ff.cc:262:slice$19349 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [14], Q = \u_conv2d.bias2 [14]).
Adding EN signal on $auto$ff.cc:262:slice$19348 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [13], Q = \u_conv2d.bias2 [13]).
Adding EN signal on $auto$ff.cc:262:slice$19347 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [12], Q = \u_conv2d.bias2 [12]).
Adding EN signal on $auto$ff.cc:262:slice$19346 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [11], Q = \u_conv2d.bias2 [11]).
Adding EN signal on $auto$ff.cc:262:slice$19345 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [10], Q = \u_conv2d.bias2 [10]).
Adding EN signal on $auto$ff.cc:262:slice$19344 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [9], Q = \u_conv2d.bias2 [9]).
Adding EN signal on $auto$ff.cc:262:slice$19343 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [8], Q = \u_conv2d.bias2 [8]).
Adding EN signal on $auto$ff.cc:262:slice$19342 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [7], Q = \u_conv2d.bias2 [7]).
Adding EN signal on $auto$ff.cc:262:slice$19341 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [6], Q = \u_conv2d.bias2 [6]).
Adding EN signal on $auto$ff.cc:262:slice$19340 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [5], Q = \u_conv2d.bias2 [5]).
Adding EN signal on $auto$ff.cc:262:slice$19339 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [4], Q = \u_conv2d.bias2 [4]).
Adding EN signal on $auto$ff.cc:262:slice$19338 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [3], Q = \u_conv2d.bias2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$19337 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [2], Q = \u_conv2d.bias2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$19336 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [1], Q = \u_conv2d.bias2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$19335 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24445 [0], Q = \u_conv2d.bias2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$19329 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [18], Q = \u_conv2d.bias3 [18]).
Adding EN signal on $auto$ff.cc:262:slice$19328 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [17], Q = \u_conv2d.bias3 [17]).
Adding EN signal on $auto$ff.cc:262:slice$19327 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [16], Q = \u_conv2d.bias3 [16]).
Adding EN signal on $auto$ff.cc:262:slice$19326 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [15], Q = \u_conv2d.bias3 [15]).
Adding EN signal on $auto$ff.cc:262:slice$19325 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [14], Q = \u_conv2d.bias3 [14]).
Adding EN signal on $auto$ff.cc:262:slice$19324 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [13], Q = \u_conv2d.bias3 [13]).
Adding EN signal on $auto$ff.cc:262:slice$19323 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [12], Q = \u_conv2d.bias3 [12]).
Adding EN signal on $auto$ff.cc:262:slice$19322 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [11], Q = \u_conv2d.bias3 [11]).
Adding EN signal on $auto$ff.cc:262:slice$19321 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [10], Q = \u_conv2d.bias3 [10]).
Adding EN signal on $auto$ff.cc:262:slice$19320 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [9], Q = \u_conv2d.bias3 [9]).
Adding EN signal on $auto$ff.cc:262:slice$19319 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [8], Q = \u_conv2d.bias3 [8]).
Adding EN signal on $auto$ff.cc:262:slice$19318 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [7], Q = \u_conv2d.bias3 [7]).
Adding EN signal on $auto$ff.cc:262:slice$19317 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [6], Q = \u_conv2d.bias3 [6]).
Adding EN signal on $auto$ff.cc:262:slice$19316 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [5], Q = \u_conv2d.bias3 [5]).
Adding EN signal on $auto$ff.cc:262:slice$19315 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [4], Q = \u_conv2d.bias3 [4]).
Adding EN signal on $auto$ff.cc:262:slice$19314 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [3], Q = \u_conv2d.bias3 [3]).
Adding EN signal on $auto$ff.cc:262:slice$19313 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [2], Q = \u_conv2d.bias3 [2]).
Adding EN signal on $auto$ff.cc:262:slice$19312 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [1], Q = \u_conv2d.bias3 [1]).
Adding EN signal on $auto$ff.cc:262:slice$19311 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$24081 [0], Q = \u_conv2d.bias3 [0]).
Adding EN signal on $auto$ff.cc:262:slice$19305 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [18], Q = \u_conv2d.bias4 [18]).
Adding EN signal on $auto$ff.cc:262:slice$19304 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [17], Q = \u_conv2d.bias4 [17]).
Adding EN signal on $auto$ff.cc:262:slice$19303 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [16], Q = \u_conv2d.bias4 [16]).
Adding EN signal on $auto$ff.cc:262:slice$19302 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [15], Q = \u_conv2d.bias4 [15]).
Adding EN signal on $auto$ff.cc:262:slice$19301 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [14], Q = \u_conv2d.bias4 [14]).
Adding EN signal on $auto$ff.cc:262:slice$19300 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [13], Q = \u_conv2d.bias4 [13]).
Adding EN signal on $auto$ff.cc:262:slice$19299 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [12], Q = \u_conv2d.bias4 [12]).
Adding EN signal on $auto$ff.cc:262:slice$19298 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [11], Q = \u_conv2d.bias4 [11]).
Adding EN signal on $auto$ff.cc:262:slice$19297 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [10], Q = \u_conv2d.bias4 [10]).
Adding EN signal on $auto$ff.cc:262:slice$19296 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [9], Q = \u_conv2d.bias4 [9]).
Adding EN signal on $auto$ff.cc:262:slice$19295 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [8], Q = \u_conv2d.bias4 [8]).
Adding EN signal on $auto$ff.cc:262:slice$19294 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [7], Q = \u_conv2d.bias4 [7]).
Adding EN signal on $auto$ff.cc:262:slice$19293 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [6], Q = \u_conv2d.bias4 [6]).
Adding EN signal on $auto$ff.cc:262:slice$19292 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [5], Q = \u_conv2d.bias4 [5]).
Adding EN signal on $auto$ff.cc:262:slice$19291 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [4], Q = \u_conv2d.bias4 [4]).
Adding EN signal on $auto$ff.cc:262:slice$19290 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [3], Q = \u_conv2d.bias4 [3]).
Adding EN signal on $auto$ff.cc:262:slice$19289 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [2], Q = \u_conv2d.bias4 [2]).
Adding EN signal on $auto$ff.cc:262:slice$19288 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [1], Q = \u_conv2d.bias4 [1]).
Adding EN signal on $auto$ff.cc:262:slice$19287 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23717 [0], Q = \u_conv2d.bias4 [0]).
Adding EN signal on $auto$ff.cc:262:slice$19281 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [18], Q = \u_conv2d.bias5 [18]).
Adding EN signal on $auto$ff.cc:262:slice$19280 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [17], Q = \u_conv2d.bias5 [17]).
Adding EN signal on $auto$ff.cc:262:slice$19279 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [16], Q = \u_conv2d.bias5 [16]).
Adding EN signal on $auto$ff.cc:262:slice$19278 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [15], Q = \u_conv2d.bias5 [15]).
Adding EN signal on $auto$ff.cc:262:slice$19277 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [14], Q = \u_conv2d.bias5 [14]).
Adding EN signal on $auto$ff.cc:262:slice$19276 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [13], Q = \u_conv2d.bias5 [13]).
Adding EN signal on $auto$ff.cc:262:slice$19275 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [12], Q = \u_conv2d.bias5 [12]).
Adding EN signal on $auto$ff.cc:262:slice$19274 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [11], Q = \u_conv2d.bias5 [11]).
Adding EN signal on $auto$ff.cc:262:slice$19273 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [10], Q = \u_conv2d.bias5 [10]).
Adding EN signal on $auto$ff.cc:262:slice$19272 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [9], Q = \u_conv2d.bias5 [9]).
Adding EN signal on $auto$ff.cc:262:slice$19271 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [8], Q = \u_conv2d.bias5 [8]).
Adding EN signal on $auto$ff.cc:262:slice$19270 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [7], Q = \u_conv2d.bias5 [7]).
Adding EN signal on $auto$ff.cc:262:slice$19269 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [6], Q = \u_conv2d.bias5 [6]).
Adding EN signal on $auto$ff.cc:262:slice$19268 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [5], Q = \u_conv2d.bias5 [5]).
Adding EN signal on $auto$ff.cc:262:slice$19267 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [4], Q = \u_conv2d.bias5 [4]).
Adding EN signal on $auto$ff.cc:262:slice$19266 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [3], Q = \u_conv2d.bias5 [3]).
Adding EN signal on $auto$ff.cc:262:slice$19265 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [2], Q = \u_conv2d.bias5 [2]).
Adding EN signal on $auto$ff.cc:262:slice$19264 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [1], Q = \u_conv2d.bias5 [1]).
Adding EN signal on $auto$ff.cc:262:slice$19263 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$23353 [0], Q = \u_conv2d.bias5 [0]).
Adding EN signal on $auto$ff.cc:262:slice$19257 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [18], Q = \u_conv2d.bias6 [18]).
Adding EN signal on $auto$ff.cc:262:slice$19256 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [17], Q = \u_conv2d.bias6 [17]).
Adding EN signal on $auto$ff.cc:262:slice$19255 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [16], Q = \u_conv2d.bias6 [16]).
Adding EN signal on $auto$ff.cc:262:slice$19254 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [15], Q = \u_conv2d.bias6 [15]).
Adding EN signal on $auto$ff.cc:262:slice$19253 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [14], Q = \u_conv2d.bias6 [14]).
Adding EN signal on $auto$ff.cc:262:slice$19252 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [13], Q = \u_conv2d.bias6 [13]).
Adding EN signal on $auto$ff.cc:262:slice$19251 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [12], Q = \u_conv2d.bias6 [12]).
Adding EN signal on $auto$ff.cc:262:slice$19250 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [11], Q = \u_conv2d.bias6 [11]).
Adding EN signal on $auto$ff.cc:262:slice$19249 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [10], Q = \u_conv2d.bias6 [10]).
Adding EN signal on $auto$ff.cc:262:slice$19248 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [9], Q = \u_conv2d.bias6 [9]).
Adding EN signal on $auto$ff.cc:262:slice$19247 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [8], Q = \u_conv2d.bias6 [8]).
Adding EN signal on $auto$ff.cc:262:slice$19246 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [7], Q = \u_conv2d.bias6 [7]).
Adding EN signal on $auto$ff.cc:262:slice$19245 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [6], Q = \u_conv2d.bias6 [6]).
Adding EN signal on $auto$ff.cc:262:slice$19244 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [5], Q = \u_conv2d.bias6 [5]).
Adding EN signal on $auto$ff.cc:262:slice$19243 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [4], Q = \u_conv2d.bias6 [4]).
Adding EN signal on $auto$ff.cc:262:slice$19242 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [3], Q = \u_conv2d.bias6 [3]).
Adding EN signal on $auto$ff.cc:262:slice$19241 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [2], Q = \u_conv2d.bias6 [2]).
Adding EN signal on $auto$ff.cc:262:slice$19240 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [1], Q = \u_conv2d.bias6 [1]).
Adding EN signal on $auto$ff.cc:262:slice$19239 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22989 [0], Q = \u_conv2d.bias6 [0]).
Adding EN signal on $auto$ff.cc:262:slice$19233 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [42], Q = \u_conv2d.bias7 [18]).
Adding EN signal on $auto$ff.cc:262:slice$19232 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [41], Q = \u_conv2d.bias7 [17]).
Adding EN signal on $auto$ff.cc:262:slice$19231 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [40], Q = \u_conv2d.bias7 [16]).
Adding EN signal on $auto$ff.cc:262:slice$19230 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [39], Q = \u_conv2d.bias7 [15]).
Adding EN signal on $auto$ff.cc:262:slice$19229 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [38], Q = \u_conv2d.bias7 [14]).
Adding EN signal on $auto$ff.cc:262:slice$19228 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [37], Q = \u_conv2d.bias7 [13]).
Adding EN signal on $auto$ff.cc:262:slice$19227 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [36], Q = \u_conv2d.bias7 [12]).
Adding EN signal on $auto$ff.cc:262:slice$19226 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [35], Q = \u_conv2d.bias7 [11]).
Adding EN signal on $auto$ff.cc:262:slice$19225 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [34], Q = \u_conv2d.bias7 [10]).
Adding EN signal on $auto$ff.cc:262:slice$19224 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [33], Q = \u_conv2d.bias7 [9]).
Adding EN signal on $auto$ff.cc:262:slice$19223 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [32], Q = \u_conv2d.bias7 [8]).
Adding EN signal on $auto$ff.cc:262:slice$19222 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [31], Q = \u_conv2d.bias7 [7]).
Adding EN signal on $auto$ff.cc:262:slice$19221 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [30], Q = \u_conv2d.bias7 [6]).
Adding EN signal on $auto$ff.cc:262:slice$19220 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [29], Q = \u_conv2d.bias7 [5]).
Adding EN signal on $auto$ff.cc:262:slice$19219 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [28], Q = \u_conv2d.bias7 [4]).
Adding EN signal on $auto$ff.cc:262:slice$19218 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [27], Q = \u_conv2d.bias7 [3]).
Adding EN signal on $auto$ff.cc:262:slice$19217 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [26], Q = \u_conv2d.bias7 [2]).
Adding EN signal on $auto$ff.cc:262:slice$19216 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [25], Q = \u_conv2d.bias7 [1]).
Adding EN signal on $auto$ff.cc:262:slice$19215 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$22576 [24], Q = \u_conv2d.bias7 [0]).
Adding EN signal on $auto$ff.cc:262:slice$19193 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [19], Q = \u_conv2d.result_base [19]).
Adding EN signal on $auto$ff.cc:262:slice$19192 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [18], Q = \u_conv2d.result_base [18]).
Adding EN signal on $auto$ff.cc:262:slice$19191 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [17], Q = \u_conv2d.result_base [17]).
Adding EN signal on $auto$ff.cc:262:slice$19190 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [16], Q = \u_conv2d.result_base [16]).
Adding EN signal on $auto$ff.cc:262:slice$19189 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [15], Q = \u_conv2d.result_base [15]).
Adding EN signal on $auto$ff.cc:262:slice$19188 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [14], Q = \u_conv2d.result_base [14]).
Adding EN signal on $auto$ff.cc:262:slice$19187 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [13], Q = \u_conv2d.result_base [13]).
Adding EN signal on $auto$ff.cc:262:slice$19186 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [12], Q = \u_conv2d.result_base [12]).
Adding EN signal on $auto$ff.cc:262:slice$19185 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [11], Q = \u_conv2d.result_base [11]).
Adding EN signal on $auto$ff.cc:262:slice$19184 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [10], Q = \u_conv2d.result_base [10]).
Adding EN signal on $auto$ff.cc:262:slice$19183 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [9], Q = \u_conv2d.result_base [9]).
Adding EN signal on $auto$ff.cc:262:slice$19182 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [8], Q = \u_conv2d.result_base [8]).
Adding EN signal on $auto$ff.cc:262:slice$19181 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [7], Q = \u_conv2d.result_base [7]).
Adding EN signal on $auto$ff.cc:262:slice$19180 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [6], Q = \u_conv2d.result_base [6]).
Adding EN signal on $auto$ff.cc:262:slice$19179 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [5], Q = \u_conv2d.result_base [5]).
Adding EN signal on $auto$ff.cc:262:slice$19178 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [4], Q = \u_conv2d.result_base [4]).
Adding EN signal on $auto$ff.cc:262:slice$19177 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [3], Q = \u_conv2d.result_base [3]).
Adding EN signal on $auto$ff.cc:262:slice$19176 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [2], Q = \u_conv2d.result_base [2]).
Adding EN signal on $auto$ff.cc:262:slice$19175 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [1], Q = \u_conv2d.result_base [1]).
Adding EN signal on $auto$ff.cc:262:slice$19174 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21756 [0], Q = \u_conv2d.result_base [0]).
Adding EN signal on $auto$ff.cc:262:slice$19173 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [31], Q = \u_conv2d.i_tcdm2_wdata [31]).
Adding EN signal on $auto$ff.cc:262:slice$19172 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [30], Q = \u_conv2d.i_tcdm2_wdata [30]).
Adding EN signal on $auto$ff.cc:262:slice$19171 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [29], Q = \u_conv2d.i_tcdm2_wdata [29]).
Adding EN signal on $auto$ff.cc:262:slice$19170 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [28], Q = \u_conv2d.i_tcdm2_wdata [28]).
Adding EN signal on $auto$ff.cc:262:slice$19169 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [27], Q = \u_conv2d.i_tcdm2_wdata [27]).
Adding EN signal on $auto$ff.cc:262:slice$19168 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [26], Q = \u_conv2d.i_tcdm2_wdata [26]).
Adding EN signal on $auto$ff.cc:262:slice$19167 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [25], Q = \u_conv2d.i_tcdm2_wdata [25]).
Adding EN signal on $auto$ff.cc:262:slice$19166 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [24], Q = \u_conv2d.i_tcdm2_wdata [24]).
Adding EN signal on $auto$ff.cc:262:slice$19165 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [23], Q = \u_conv2d.i_tcdm2_wdata [23]).
Adding EN signal on $auto$ff.cc:262:slice$19164 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [22], Q = \u_conv2d.i_tcdm2_wdata [22]).
Adding EN signal on $auto$ff.cc:262:slice$19163 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [21], Q = \u_conv2d.i_tcdm2_wdata [21]).
Adding EN signal on $auto$ff.cc:262:slice$19162 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [20], Q = \u_conv2d.i_tcdm2_wdata [20]).
Adding EN signal on $auto$ff.cc:262:slice$19161 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [19], Q = \u_conv2d.i_tcdm2_wdata [19]).
Adding EN signal on $auto$ff.cc:262:slice$19160 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [18], Q = \u_conv2d.i_tcdm2_wdata [18]).
Adding EN signal on $auto$ff.cc:262:slice$19159 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [17], Q = \u_conv2d.i_tcdm2_wdata [17]).
Adding EN signal on $auto$ff.cc:262:slice$19158 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [16], Q = \u_conv2d.i_tcdm2_wdata [16]).
Adding EN signal on $auto$ff.cc:262:slice$19157 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [15], Q = \u_conv2d.i_tcdm2_wdata [15]).
Adding EN signal on $auto$ff.cc:262:slice$19156 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [14], Q = \u_conv2d.i_tcdm2_wdata [14]).
Adding EN signal on $auto$ff.cc:262:slice$19155 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [13], Q = \u_conv2d.i_tcdm2_wdata [13]).
Adding EN signal on $auto$ff.cc:262:slice$19154 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [12], Q = \u_conv2d.i_tcdm2_wdata [12]).
Adding EN signal on $auto$ff.cc:262:slice$19153 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [11], Q = \u_conv2d.i_tcdm2_wdata [11]).
Adding EN signal on $auto$ff.cc:262:slice$19152 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [10], Q = \u_conv2d.i_tcdm2_wdata [10]).
Adding EN signal on $auto$ff.cc:262:slice$19151 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [9], Q = \u_conv2d.i_tcdm2_wdata [9]).
Adding EN signal on $auto$ff.cc:262:slice$19150 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [8], Q = \u_conv2d.i_tcdm2_wdata [8]).
Adding EN signal on $auto$ff.cc:262:slice$19149 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [7], Q = \u_conv2d.i_tcdm2_wdata [7]).
Adding EN signal on $auto$ff.cc:262:slice$19148 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [6], Q = \u_conv2d.i_tcdm2_wdata [6]).
Adding EN signal on $auto$ff.cc:262:slice$19147 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [5], Q = \u_conv2d.i_tcdm2_wdata [5]).
Adding EN signal on $auto$ff.cc:262:slice$19146 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [4], Q = \u_conv2d.i_tcdm2_wdata [4]).
Adding EN signal on $auto$ff.cc:262:slice$19145 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [3], Q = \u_conv2d.i_tcdm2_wdata [3]).
Adding EN signal on $auto$ff.cc:262:slice$19144 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [2], Q = \u_conv2d.i_tcdm2_wdata [2]).
Adding EN signal on $auto$ff.cc:262:slice$19143 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [1], Q = \u_conv2d.i_tcdm2_wdata [1]).
Adding EN signal on $auto$ff.cc:262:slice$19142 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20609 [0], Q = \u_conv2d.i_tcdm2_wdata [0]).
Adding EN signal on $auto$ff.cc:262:slice$19141 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [7], Q = \u_conv2d.wdata2 [31]).
Adding EN signal on $auto$ff.cc:262:slice$19140 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [6], Q = \u_conv2d.wdata2 [30]).
Adding EN signal on $auto$ff.cc:262:slice$19139 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [5], Q = \u_conv2d.wdata2 [29]).
Adding EN signal on $auto$ff.cc:262:slice$19138 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [4], Q = \u_conv2d.wdata2 [28]).
Adding EN signal on $auto$ff.cc:262:slice$19137 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [3], Q = \u_conv2d.wdata2 [27]).
Adding EN signal on $auto$ff.cc:262:slice$19136 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [2], Q = \u_conv2d.wdata2 [26]).
Adding EN signal on $auto$ff.cc:262:slice$19135 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [1], Q = \u_conv2d.wdata2 [25]).
Adding EN signal on $auto$ff.cc:262:slice$19134 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [0], Q = \u_conv2d.wdata2 [24]).
Adding EN signal on $auto$ff.cc:262:slice$19133 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [7], Q = \u_conv2d.wdata2 [23]).
Adding EN signal on $auto$ff.cc:262:slice$19132 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [6], Q = \u_conv2d.wdata2 [22]).
Adding EN signal on $auto$ff.cc:262:slice$19131 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [5], Q = \u_conv2d.wdata2 [21]).
Adding EN signal on $auto$ff.cc:262:slice$19130 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [4], Q = \u_conv2d.wdata2 [20]).
Adding EN signal on $auto$ff.cc:262:slice$19129 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [3], Q = \u_conv2d.wdata2 [19]).
Adding EN signal on $auto$ff.cc:262:slice$19128 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [2], Q = \u_conv2d.wdata2 [18]).
Adding EN signal on $auto$ff.cc:262:slice$19127 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [1], Q = \u_conv2d.wdata2 [17]).
Adding EN signal on $auto$ff.cc:262:slice$19126 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [0], Q = \u_conv2d.wdata2 [16]).
Adding EN signal on $auto$ff.cc:262:slice$19125 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [7], Q = \u_conv2d.wdata2 [15]).
Adding EN signal on $auto$ff.cc:262:slice$19124 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [6], Q = \u_conv2d.wdata2 [14]).
Adding EN signal on $auto$ff.cc:262:slice$19123 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [5], Q = \u_conv2d.wdata2 [13]).
Adding EN signal on $auto$ff.cc:262:slice$19122 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [4], Q = \u_conv2d.wdata2 [12]).
Adding EN signal on $auto$ff.cc:262:slice$19121 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [3], Q = \u_conv2d.wdata2 [11]).
Adding EN signal on $auto$ff.cc:262:slice$19120 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [2], Q = \u_conv2d.wdata2 [10]).
Adding EN signal on $auto$ff.cc:262:slice$19119 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [1], Q = \u_conv2d.wdata2 [9]).
Adding EN signal on $auto$ff.cc:262:slice$19118 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [0], Q = \u_conv2d.wdata2 [8]).
Adding EN signal on $auto$ff.cc:262:slice$19117 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [7], Q = \u_conv2d.wdata2 [7]).
Adding EN signal on $auto$ff.cc:262:slice$19116 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [6], Q = \u_conv2d.wdata2 [6]).
Adding EN signal on $auto$ff.cc:262:slice$19115 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [5], Q = \u_conv2d.wdata2 [5]).
Adding EN signal on $auto$ff.cc:262:slice$19114 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [4], Q = \u_conv2d.wdata2 [4]).
Adding EN signal on $auto$ff.cc:262:slice$19113 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [3], Q = \u_conv2d.wdata2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$19112 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [2], Q = \u_conv2d.wdata2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$19111 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [1], Q = \u_conv2d.wdata2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$19110 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [0], Q = \u_conv2d.wdata2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$19086 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20721 [0], Q = \u_conv2d.i_tcdm2_wreq).
Adding EN signal on $auto$ff.cc:262:slice$19070 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25452 [11], Q = \u_conv2d.i_bias_raddr [11]).
Adding EN signal on $auto$ff.cc:262:slice$19069 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25452 [10], Q = \u_conv2d.i_bias_raddr [10]).
Adding EN signal on $auto$ff.cc:262:slice$19068 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25452 [9], Q = \u_conv2d.i_bias_raddr [9]).
Adding EN signal on $auto$ff.cc:262:slice$19067 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25452 [8], Q = \u_conv2d.i_bias_raddr [8]).
Adding EN signal on $auto$ff.cc:262:slice$19066 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25452 [7], Q = \u_conv2d.i_bias_raddr [7]).
Adding EN signal on $auto$ff.cc:262:slice$19065 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25452 [6], Q = \u_conv2d.i_bias_raddr [6]).
Adding EN signal on $auto$ff.cc:262:slice$19064 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25452 [5], Q = \u_conv2d.i_bias_raddr [5]).
Adding EN signal on $auto$ff.cc:262:slice$19063 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25452 [4], Q = \u_conv2d.i_bias_raddr [4]).
Adding EN signal on $auto$ff.cc:262:slice$19062 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25452 [3], Q = \u_conv2d.i_bias_raddr [3]).
Adding EN signal on $auto$ff.cc:262:slice$19061 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$25452 [2], Q = \u_conv2d.i_bias_raddr [2]).
Adding EN signal on $auto$ff.cc:262:slice$19032 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21269 [3], Q = \u_conv2d.fsm_writechannels [3]).
Adding EN signal on $auto$ff.cc:262:slice$19031 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21269 [2], Q = \u_conv2d.fsm_writechannels [2]).
Adding EN signal on $auto$ff.cc:262:slice$19030 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21269 [1], Q = \u_conv2d.fsm_writechannels [1]).
Adding EN signal on $auto$ff.cc:262:slice$19029 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21269 [0], Q = \u_conv2d.fsm_writechannels [0]).

yosys> opt_clean

3.20.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 180 unused cells and 2059 unused wires.
<suppressed ~181 debug messages>

yosys> opt_expr

3.20.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~6158 debug messages>

3.20.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.20.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.20.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.20.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~28386 debug messages>
Removed a total of 9462 cells.

yosys> opt_dff

3.20.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.20.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 9124 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.20.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.20.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.20.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.20.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.20.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.20.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.20.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.20.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.20.30. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.21.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_share

3.21.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_collect

3.21.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.22. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> stat

3.23. Printing statistics.

=== top ===

   Number of wires:               2779
   Number of wire bits:          22652
   Number of public wires:         631
   Number of public wire bits:    8682
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              11844
     $_ALDFFE_PNP_                  60
     $_ALDFF_PN_                    20
     $_AND_                       1645
     $_DFFE_PN0N_                   43
     $_DFFE_PN0P_                  879
     $_DFFE_PN1N_                    1
     $_DFFE_PN1P_                   26
     $_DFF_PN0_                    315
     $_DFF_PN1_                      5
     $_MUX_                       6622
     $_NOT_                        288
     $_OR_                        1052
     $_XOR_                        888


yosys> shregmap -minlen 8 -maxlen 20

3.24. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.25. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.26. Printing statistics.

=== top ===

   Number of wires:               2939
   Number of wire bits:          22812
   Number of public wires:         631
   Number of public wire bits:    8682
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              12004
     $_AND_                       1645
     $_DFFE_PN0N_                   43
     $_DFFE_PN0P_                  879
     $_DFFE_PN1N_                    1
     $_DFFE_PN1P_                   26
     $_DFFSRE_PNNP_                 60
     $_DFFSR_PNN_                   20
     $_DFF_PN0_                    315
     $_DFF_PN1_                      5
     $_MUX_                       6622
     $_NOT_                        288
     $_ORNOT_                       80
     $_OR_                        1132
     $_XOR_                        888


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.27. Executing TECHMAP pass (map to technology primitives).

3.27.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.27.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Successfully finished Verilog frontend.

3.27.3. Continuing TECHMAP pass.
Using template \$_DFFE_PN0N_ for cells of type $_DFFE_PN0N_.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_DFFSR_PNN_ for cells of type $_DFFSR_PNN_.
Using template \$_DFFE_PN1P_ for cells of type $_DFFE_PN1P_.
Using template \$_DFFSRE_PNNP_ for cells of type $_DFFSRE_PNNP_.
Using template \$_DFF_PN1_ for cells of type $_DFF_PN1_.
Using template \$_DFFE_PN1N_ for cells of type $_DFFE_PN1N_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~1521 debug messages>

yosys> opt_expr -mux_undef

3.28. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~2889 debug messages>

yosys> simplemap

3.29. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.30. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.31. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~156 debug messages>
Removed a total of 52 cells.

yosys> opt_dff -nodffe -nosdff

3.32. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.33. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 6780 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.34. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.34.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~3 debug messages>

yosys> opt_merge -nomux

3.34.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.34.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.34.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.34.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.34.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.34.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.34.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.34.9. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.35. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.35.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~1428 debug messages>

yosys> opt_merge

3.35.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_dff

3.35.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.35.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

3.35.5. Finished fast OPT passes.

yosys> memory_map

3.36. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.37. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.37.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.37.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.37.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.37.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.37.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.37.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.37.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.37.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr -full

3.37.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.37.10. Finished OPT passes. (There is nothing left to do.)

yosys> techmap

3.38. Executing TECHMAP pass (map to technology primitives).

3.38.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.38.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt

3.39. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.39.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.39.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.39.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.39.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.39.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.39.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.39.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.39.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.40. Executing ABC pass (technology mapping using ABC).

3.40.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 7753 gates and 9275 wires to a netlist network with 1520 inputs and 1703 outputs.

3.40.1.1. Executing ABC.
Running ABC command: /home/users/meri/Documents/workspace/clean/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/meri/Documents/workspace/clean/yosys_verific_rs/result_18-03-2022T17-26-14/All_lut_synth_rs_area.json/conv2d/abc_tmp.scr 
ABC: netlist  : i/o =   1520/   1703  and =   12393  lev =   33 (7.04)  mem = 0.23 MB
ABC: Mapping (K=6)  :  lut =   2590  edge =   10038  lev =   16 (3.03)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   12807  lev =   33 (7.05)  mem = 0.23 MB
ABC: Mapping (K=6)  :  lut =   2525  edge =   10081  lev =   11 (2.72)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   12896  lev =   33 (7.13)  mem = 0.23 MB
ABC: Mapping (K=6)  :  lut =   2517  edge =   10124  lev =   11 (2.68)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   13167  lev =   32 (6.45)  mem = 0.24 MB
ABC: Mapping (K=6)  :  lut =   2512  edge =   10103  lev =   11 (2.71)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   12717  lev =   33 (7.12)  mem = 0.23 MB
ABC: Mapping (K=6)  :  lut =   2546  edge =   10085  lev =   11 (2.74)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   12883  lev =   33 (7.09)  mem = 0.30 MB
ABC: Mapping (K=6)  :  lut =   2489  edge =   10083  lev =   10 (2.66)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   12943  lev =   33 (7.06)  mem = 0.30 MB
ABC: Mapping (K=6)  :  lut =   2495  edge =   10132  lev =   10 (2.65)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   12901  lev =   33 (7.06)  mem = 0.30 MB
ABC: Mapping (K=6)  :  lut =   2492  edge =   10114  lev =   10 (2.68)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   13019  lev =   33 (6.46)  mem = 0.30 MB
ABC: Mapping (K=6)  :  lut =   2517  edge =   10031  lev =   11 (2.79)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   12982  lev =   33 (6.99)  mem = 0.30 MB
ABC: Mapping (K=6)  :  lut =   2526  edge =    9987  lev =   10 (2.71)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   12994  lev =   33 (7.04)  mem = 0.30 MB
ABC: Mapping (K=6)  :  lut =   2524  edge =    9976  lev =   10 (2.71)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   12856  lev =   33 (7.01)  mem = 0.30 MB
ABC: Mapping (K=6)  :  lut =   2470  edge =   10018  lev =   10 (2.67)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   13113  lev =   33 (6.97)  mem = 0.30 MB
ABC: Mapping (K=6)  :  lut =   2505  edge =   10050  lev =   10 (2.66)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   12856  lev =   33 (7.01)  mem = 0.23 MB
ABC: Mapping (K=6)  :  lut =   2470  edge =   10018  lev =   10 (2.67)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   12856  lev =   33 (7.01)  mem = 0.30 MB
ABC: Mapping (K=6)  :  lut =   2469  edge =   10017  lev =   10 (2.67)  mem = 0.12 MB
ABC: netlist  : i/o =   1520/   1703  and =   12880  lev =   33 (7.00)  mem = 0.23 MB
ABC: Mapping (K=6)  :  lut =   2469  edge =   10017  lev =   10 (2.67)  mem = 0.12 MB
ABC: + write_blif <abc-temp-dir>/output.blif 

3.40.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     2520
ABC RESULTS:        internal signals:     6052
ABC RESULTS:           input signals:     1520
ABC RESULTS:          output signals:     1703
Removing temp directory.

yosys> opt

3.41. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.41.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.41.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.41.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.41.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.41.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.41.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.41.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 3959 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.41.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.41.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.41.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.41.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.41.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.41.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.41.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.41.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.41.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.42. Executing HIERARCHY pass (managing design hierarchy).

3.42.1. Analyzing design hierarchy..
Top module:  \top

3.42.2. Analyzing design hierarchy..
Top module:  \top
Removed 0 unused modules.

yosys> stat

3.43. Printing statistics.

=== top ===

   Number of wires:               2769
   Number of wire bits:          10820
   Number of public wires:         631
   Number of public wire bits:    8682
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3823
     $lut                         2474
     dffsre                       1349


yosys> opt_clean -purge

3.44. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 423 unused wires.
<suppressed ~423 debug messages>

yosys> write_verilog -noattr -nohex top.verilog

3.45. Executing Verilog backend.

yosys> bmuxmap

3.45.1. Executing BMUXMAP pass.

yosys> demuxmap

3.45.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\top'.

Warnings: 86 unique messages, 86 total
End of script. Logfile hash: 66d5998fab, CPU: user 36.49s system 0.13s, MEM: 87.51 MB peak
Yosys 0.14+36 (git sha1 4cd3e3b51, gcc 7.1.0 -fPIC -Os)
Time spent: 40% 1x abc (24 sec), 21% 29x opt_dff (13 sec), ...
real 60.72
user 58.89
sys 1.83
