
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.45
 Yosys 0.17+103 (git sha1 a1babadd5, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k crp.v des_top.v key_sel.v sbox1.v sbox2.v sbox3.v sbox4.v sbox5.v sbox6.v sbox7.v sbox8.v

yosys> verific -vlog2k crp.v des_top.v key_sel.v sbox1.v sbox2.v sbox3.v sbox4.v sbox5.v sbox6.v sbox7.v sbox8.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'crp.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'des_top.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'key_sel.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox1.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox2.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox4.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox5.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox6.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox7.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox8.v'

yosys> synth_rs -top des_top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.56

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top des_top

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] des_top.v:35: compiling module 'des_top'
VERIFIC-INFO [VERI-1018] crp.v:35: compiling module 'crp'
VERIFIC-INFO [VERI-1018] sbox1.v:35: compiling module 'sbox1'
VERIFIC-INFO [VERI-1018] sbox2.v:35: compiling module 'sbox2'
VERIFIC-INFO [VERI-1018] sbox3.v:35: compiling module 'sbox3'
VERIFIC-INFO [VERI-1018] sbox4.v:35: compiling module 'sbox4'
VERIFIC-INFO [VERI-1018] sbox5.v:35: compiling module 'sbox5'
VERIFIC-INFO [VERI-1018] sbox6.v:35: compiling module 'sbox6'
VERIFIC-INFO [VERI-1018] sbox7.v:35: compiling module 'sbox7'
VERIFIC-INFO [VERI-1018] sbox8.v:35: compiling module 'sbox8'
VERIFIC-WARNING [VERI-2371] des_top.v:58: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des_top.v:61: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] key_sel.v:43: compiling module 'key_selh'
Importing module des_top.
Importing module crp.
Importing module key_selh.
Importing module sbox1.
Importing module sbox2.
Importing module sbox3.
Importing module sbox4.
Importing module sbox5.
Importing module sbox6.
Importing module sbox7.
Importing module sbox8.

3.3.1. Analyzing design hierarchy..
Top module:  \des_top
Used module:     \key_selh
Used module:     \crp
Used module:         \sbox8
Used module:         \sbox7
Used module:         \sbox6
Used module:         \sbox5
Used module:         \sbox4
Used module:         \sbox3
Used module:         \sbox2
Used module:         \sbox1

3.3.2. Analyzing design hierarchy..
Top module:  \des_top
Used module:     \key_selh
Used module:     \crp
Used module:         \sbox8
Used module:         \sbox7
Used module:         \sbox6
Used module:         \sbox5
Used module:         \sbox4
Used module:         \sbox3
Used module:         \sbox2
Used module:         \sbox1
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module sbox8.
Optimizing module sbox7.
Optimizing module sbox6.
Optimizing module sbox5.
Optimizing module sbox4.
Optimizing module sbox3.
Optimizing module sbox2.
Optimizing module sbox1.
Optimizing module key_selh.
Optimizing module crp.
Optimizing module des_top.
<suppressed ~1 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module sbox8.
Deleting now unused module sbox7.
Deleting now unused module sbox6.
Deleting now unused module sbox5.
Deleting now unused module sbox4.
Deleting now unused module sbox3.
Deleting now unused module sbox2.
Deleting now unused module sbox1.
Deleting now unused module key_selh.
Deleting now unused module crp.
<suppressed ~10 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 123 unused wires.
<suppressed ~23 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module des_top...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~11 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$R_reg$des_top.v:61$25 ($aldff) from module des_top.
Removing never-active async load on $verific$L_reg$des_top.v:58$23 ($aldff) from module des_top.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~11 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~11 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.13.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module des_top:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~11 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== des_top ===

   Number of wires:                 53
   Number of wire bits:           1379
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 27
     $bmux                           9
     $dff                            2
     $logic_not                      1
     $mux                           11
     $not                            1
     $xor                            3


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.21.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.21.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `$auto$memory_bmux2rom.cc:63:execute$214'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$211'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$208'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$205'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$202'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$199'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$196'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$193'[0] in module `\des_top': no output FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$214'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$211'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$208'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$205'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$202'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$199'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$196'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$193'[0] in module `\des_top': no address FF found.

yosys> opt_clean

3.21.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> memory_share

3.21.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> memory_collect

3.21.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== des_top ===

   Number of wires:                 53
   Number of wire bits:           1379
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 27
     $bmux                           1
     $dff                            2
     $logic_not                      1
     $mem_v2                         8
     $mux                           11
     $not                            1
     $xor                            3


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> stat

3.24. Printing statistics.

=== des_top ===

   Number of wires:                 53
   Number of wire bits:           1379
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 27
     $bmux                           1
     $dff                            2
     $logic_not                      1
     $mem_v2                         8
     $mux                           11
     $not                            1
     $xor                            3


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $not.
No more expansions possible.
<suppressed ~90 debug messages>

yosys> stat

3.26. Printing statistics.

=== des_top ===

   Number of wires:                 58
   Number of wire bits:           1718
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                947
     $_DFF_P_                       64
     $_MUX_                        787
     $_NOT_                          4
     $_OR_                           3
     $_XOR_                         81
     $mem_v2                         8


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~64 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 1 unused cells and 2 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.27.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory $auto$memory_bmux2rom.cc:63:execute$193 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$196 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$199 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$202 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$205 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$208 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$211 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$214 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[0]$1261 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[1]$1263 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[2]$1265 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[3]$1267 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[4]$1269 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[5]$1271 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[6]$1273 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[7]$1275 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[8]$1277 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[9]$1279 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[10]$1281 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[11]$1283 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[12]$1285 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[13]$1287 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[14]$1289 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[15]$1291 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[16]$1293 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[17]$1295 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[18]$1297 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[19]$1299 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[20]$1301 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[21]$1303 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[22]$1305 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[23]$1307 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[24]$1309 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[25]$1311 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[26]$1313 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[27]$1315 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[28]$1317 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[29]$1319 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[30]$1321 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[31]$1323 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[32]$1325 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[33]$1327 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[34]$1329 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[35]$1331 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[36]$1333 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[37]$1335 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[38]$1337 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[39]$1339 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[40]$1341 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[41]$1343 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[42]$1345 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[43]$1347 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[44]$1349 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[45]$1351 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[46]$1353 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[47]$1355 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[48]$1357 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[49]$1359 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[50]$1361 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[51]$1363 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[52]$1365 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[53]$1367 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[54]$1369 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[55]$1371 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[56]$1373 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[57]$1375 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[58]$1377 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[59]$1379 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[60]$1381 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[61]$1383 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[62]$1385 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$193[63]$1387 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[0]$1578 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[1]$1580 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[2]$1582 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[3]$1584 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[4]$1586 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[5]$1588 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[6]$1590 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[7]$1592 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[8]$1594 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[9]$1596 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[10]$1598 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[11]$1600 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[12]$1602 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[13]$1604 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[14]$1606 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[15]$1608 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[16]$1610 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[17]$1612 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[18]$1614 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[19]$1616 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[20]$1618 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[21]$1620 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[22]$1622 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[23]$1624 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[24]$1626 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[25]$1628 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[26]$1630 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[27]$1632 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[28]$1634 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[29]$1636 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[30]$1638 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[31]$1640 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[32]$1642 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[33]$1644 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[34]$1646 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[35]$1648 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[36]$1650 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[37]$1652 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[38]$1654 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[39]$1656 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[40]$1658 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[41]$1660 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[42]$1662 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[43]$1664 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[44]$1666 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[45]$1668 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[46]$1670 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[47]$1672 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[48]$1674 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[49]$1676 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[50]$1678 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[51]$1680 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[52]$1682 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[53]$1684 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[54]$1686 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[55]$1688 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[56]$1690 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[57]$1692 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[58]$1694 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[59]$1696 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[60]$1698 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[61]$1700 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[62]$1702 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$196[63]$1704 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[0]$1895 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[1]$1897 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[2]$1899 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[3]$1901 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[4]$1903 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[5]$1905 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[6]$1907 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[7]$1909 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[8]$1911 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[9]$1913 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[10]$1915 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[11]$1917 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[12]$1919 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[13]$1921 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[14]$1923 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[15]$1925 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[16]$1927 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[17]$1929 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[18]$1931 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[19]$1933 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[20]$1935 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[21]$1937 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[22]$1939 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[23]$1941 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[24]$1943 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[25]$1945 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[26]$1947 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[27]$1949 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[28]$1951 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[29]$1953 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[30]$1955 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[31]$1957 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[32]$1959 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[33]$1961 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[34]$1963 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[35]$1965 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[36]$1967 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[37]$1969 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[38]$1971 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[39]$1973 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[40]$1975 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[41]$1977 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[42]$1979 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[43]$1981 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[44]$1983 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[45]$1985 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[46]$1987 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[47]$1989 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[48]$1991 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[49]$1993 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[50]$1995 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[51]$1997 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[52]$1999 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[53]$2001 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[54]$2003 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[55]$2005 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[56]$2007 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[57]$2009 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[58]$2011 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[59]$2013 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[60]$2015 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[61]$2017 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[62]$2019 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$199[63]$2021 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[0]$2212 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[1]$2214 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[2]$2216 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[3]$2218 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[4]$2220 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[5]$2222 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[6]$2224 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[7]$2226 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[8]$2228 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[9]$2230 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[10]$2232 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[11]$2234 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[12]$2236 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[13]$2238 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[14]$2240 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[15]$2242 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[16]$2244 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[17]$2246 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[18]$2248 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[19]$2250 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[20]$2252 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[21]$2254 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[22]$2256 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[23]$2258 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[24]$2260 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[25]$2262 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[26]$2264 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[27]$2266 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[28]$2268 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[29]$2270 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[30]$2272 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[31]$2274 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[32]$2276 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[33]$2278 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[34]$2280 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[35]$2282 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[36]$2284 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[37]$2286 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[38]$2288 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[39]$2290 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[40]$2292 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[41]$2294 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[42]$2296 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[43]$2298 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[44]$2300 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[45]$2302 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[46]$2304 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[47]$2306 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[48]$2308 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[49]$2310 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[50]$2312 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[51]$2314 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[52]$2316 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[53]$2318 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[54]$2320 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[55]$2322 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[56]$2324 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[57]$2326 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[58]$2328 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[59]$2330 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[60]$2332 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[61]$2334 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[62]$2336 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$202[63]$2338 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[0]$2529 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[1]$2531 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[2]$2533 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[3]$2535 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[4]$2537 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[5]$2539 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[6]$2541 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[7]$2543 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[8]$2545 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[9]$2547 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[10]$2549 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[11]$2551 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[12]$2553 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[13]$2555 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[14]$2557 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[15]$2559 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[16]$2561 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[17]$2563 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[18]$2565 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[19]$2567 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[20]$2569 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[21]$2571 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[22]$2573 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[23]$2575 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[24]$2577 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[25]$2579 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[26]$2581 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[27]$2583 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[28]$2585 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[29]$2587 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[30]$2589 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[31]$2591 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[32]$2593 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[33]$2595 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[34]$2597 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[35]$2599 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[36]$2601 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[37]$2603 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[38]$2605 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[39]$2607 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[40]$2609 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[41]$2611 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[42]$2613 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[43]$2615 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[44]$2617 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[45]$2619 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[46]$2621 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[47]$2623 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[48]$2625 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[49]$2627 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[50]$2629 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[51]$2631 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[52]$2633 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[53]$2635 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[54]$2637 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[55]$2639 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[56]$2641 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[57]$2643 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[58]$2645 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[59]$2647 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[60]$2649 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[61]$2651 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[62]$2653 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$205[63]$2655 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[0]$2846 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[1]$2848 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[2]$2850 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[3]$2852 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[4]$2854 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[5]$2856 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[6]$2858 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[7]$2860 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[8]$2862 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[9]$2864 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[10]$2866 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[11]$2868 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[12]$2870 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[13]$2872 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[14]$2874 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[15]$2876 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[16]$2878 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[17]$2880 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[18]$2882 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[19]$2884 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[20]$2886 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[21]$2888 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[22]$2890 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[23]$2892 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[24]$2894 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[25]$2896 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[26]$2898 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[27]$2900 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[28]$2902 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[29]$2904 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[30]$2906 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[31]$2908 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[32]$2910 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[33]$2912 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[34]$2914 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[35]$2916 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[36]$2918 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[37]$2920 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[38]$2922 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[39]$2924 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[40]$2926 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[41]$2928 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[42]$2930 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[43]$2932 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[44]$2934 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[45]$2936 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[46]$2938 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[47]$2940 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[48]$2942 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[49]$2944 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[50]$2946 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[51]$2948 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[52]$2950 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[53]$2952 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[54]$2954 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[55]$2956 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[56]$2958 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[57]$2960 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[58]$2962 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[59]$2964 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[60]$2966 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[61]$2968 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[62]$2970 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$208[63]$2972 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[0]$3163 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[1]$3165 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[2]$3167 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[3]$3169 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[4]$3171 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[5]$3173 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[6]$3175 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[7]$3177 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[8]$3179 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[9]$3181 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[10]$3183 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[11]$3185 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[12]$3187 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[13]$3189 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[14]$3191 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[15]$3193 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[16]$3195 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[17]$3197 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[18]$3199 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[19]$3201 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[20]$3203 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[21]$3205 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[22]$3207 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[23]$3209 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[24]$3211 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[25]$3213 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[26]$3215 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[27]$3217 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[28]$3219 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[29]$3221 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[30]$3223 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[31]$3225 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[32]$3227 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[33]$3229 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[34]$3231 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[35]$3233 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[36]$3235 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[37]$3237 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[38]$3239 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[39]$3241 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[40]$3243 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[41]$3245 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[42]$3247 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[43]$3249 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[44]$3251 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[45]$3253 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[46]$3255 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[47]$3257 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[48]$3259 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[49]$3261 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[50]$3263 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[51]$3265 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[52]$3267 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[53]$3269 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[54]$3271 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[55]$3273 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[56]$3275 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[57]$3277 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[58]$3279 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[59]$3281 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[60]$3283 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[61]$3285 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[62]$3287 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$211[63]$3289 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[0]$3480 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[1]$3482 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[2]$3484 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[3]$3486 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[4]$3488 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[5]$3490 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[6]$3492 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[7]$3494 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[8]$3496 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[9]$3498 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[10]$3500 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[11]$3502 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[12]$3504 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[13]$3506 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[14]$3508 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[15]$3510 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[16]$3512 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[17]$3514 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[18]$3516 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[19]$3518 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[20]$3520 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[21]$3522 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[22]$3524 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[23]$3526 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[24]$3528 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[25]$3530 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[26]$3532 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[27]$3534 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[28]$3536 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[29]$3538 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[30]$3540 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[31]$3542 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[32]$3544 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[33]$3546 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[34]$3548 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[35]$3550 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[36]$3552 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[37]$3554 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[38]$3556 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[39]$3558 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[40]$3560 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[41]$3562 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[42]$3564 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[43]$3566 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[44]$3568 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[45]$3570 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[46]$3572 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[47]$3574 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[48]$3576 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[49]$3578 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[50]$3580 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[51]$3582 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[52]$3584 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[53]$3586 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[54]$3588 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[55]$3590 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[56]$3592 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[57]$3594 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[58]$3596 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[59]$3598 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[60]$3600 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[61]$3602 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[62]$3604 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$214[63]$3606 ($dff) from module des_top (removing D path).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 1536 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.30.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce -full

3.30.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][0]$1482:
      Old ports: A=4'1110, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [1] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][10]$1512:
      Old ports: A=4'1110, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$a$1450
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$a$1450 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$a$1450 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$a$1450 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$a$1450 [2] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][11]$1515:
      Old ports: A=4'1101, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$b$1451
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$b$1451 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$b$1451 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$b$1451 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$b$1451 [2] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][12]$1518:
      Old ports: A=4'1010, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][6]$a$1453
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][6]$a$1453 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][6]$a$1453 [1:0] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][13]$1521:
      Old ports: A=4'1100, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][6]$b$1454
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][6]$b$1454 [2] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][6]$b$1454 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][6]$b$1454 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][6]$b$1454 [1] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][6]$b$1454 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][14]$1524:
      Old ports: A=4'1001, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][7]$a$1456
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][7]$a$1456 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][7]$a$1456 [1:0] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][15]$1527:
      Old ports: A=4'0011, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][7]$b$1457
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][7]$b$1457 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][7]$b$1457 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][7]$b$1457 [2:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][7]$b$1457 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][16]$1530:
      Old ports: A=4'0100, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][8]$a$1459
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][8]$a$1459 [2] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][8]$a$1459 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][8]$a$1459 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][8]$a$1459 [1] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][17]$1533:
      Old ports: A=4'1110, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][8]$b$1460
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][8]$b$1460 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][8]$b$1460 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][8]$b$1460 [0] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][8]$b$1460 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][18]$1536:
      Old ports: A=4'1101, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][9]$a$1462
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][9]$a$1462 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][9]$a$1462 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][9]$a$1462 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][19]$1539:
      Old ports: A=4'0010, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][9]$b$1463
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][9]$b$1463 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][9]$b$1463 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][9]$b$1463 [0] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][1]$1485:
      Old ports: A=4'1101, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$b$1436
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$b$1436 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$b$1436 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$b$1436 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$b$1436 [2] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][20]$1542:
      Old ports: A=4'1111, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][10]$a$1465
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][10]$a$1465 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][10]$a$1465 [3:1] = { 2'11 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][10]$a$1465 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][21]$1545:
      Old ports: A=4'1001, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][10]$b$1466
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][10]$b$1466 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][10]$b$1466 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][10]$b$1466 [2] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][10]$b$1466 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][10]$b$1466 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][22]$1548:
      Old ports: A=4'0011, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$a$1468
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$a$1468 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$a$1468 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$a$1468 [2:1] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][23]$1551:
      Old ports: A=4'0101, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$b$1469
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$b$1469 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$b$1469 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$b$1469 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][24]$1554:
      Old ports: A=4'1111, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][12]$a$1471
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][12]$a$1471 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][12]$a$1471 [3:1] = { 2'11 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][12]$a$1471 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][25]$1557:
      Old ports: A=4'1000, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][12]$b$1472
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][12]$b$1472 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][12]$b$1472 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][12]$b$1472 [2] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][12]$b$1472 [0] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][26]$1560:
      Old ports: A=4'0100, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][13]$a$1474
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][13]$a$1474 [2] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][13]$a$1474 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][13]$a$1474 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][13]$a$1474 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][13]$a$1474 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][27]$1563:
      Old ports: A=4'0001, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][13]$b$1475
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][13]$b$1475 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][13]$b$1475 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][13]$b$1475 [0] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][13]$b$1475 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][28]$1566:
      Old ports: A=4'0101, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][14]$a$1477
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][14]$a$1477 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][14]$a$1477 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][14]$a$1477 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][14]$a$1477 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][29]$1569:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][14]$b$1478
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][14]$b$1478 [2] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][14]$b$1478 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][14]$b$1478 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][14]$b$1478 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][14]$b$1478 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][2]$1488:
      Old ports: A=4'0010, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][1]$a$1438
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][1]$a$1438 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][1]$a$1438 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][1]$a$1438 [0] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][1]$a$1438 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][30]$1572:
      Old ports: A=4'1010, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][15]$a$1480
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][15]$a$1480 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][15]$a$1480 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][15]$a$1480 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][15]$a$1480 [1] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][31]$1575:
      Old ports: A=4'0110, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][15]$b$1481
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][15]$b$1481 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][15]$b$1481 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][15]$b$1481 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][3]$1491:
      Old ports: A=4'1011, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][1]$b$1439
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][1]$b$1439 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][1]$b$1439 [3:1] = { 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][1]$b$1439 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][4]$1494:
      Old ports: A=4'0011, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][2]$a$1441
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][2]$a$1441 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][2]$a$1441 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][2]$a$1441 [2:1] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][5]$1497:
      Old ports: A=4'0110, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][2]$b$1442
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][2]$b$1442 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][2]$b$1442 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][2]$b$1442 [2] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][2]$b$1442 [0] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][6]$1500:
      Old ports: A=4'0101, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][3]$a$1444
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][3]$a$1444 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][3]$a$1444 [1:0] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][7]$1503:
      Old ports: A=4'0000, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][3]$b$1445
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][3]$b$1445 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][3]$b$1445 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][3]$b$1445 [0] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][3]$b$1445 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][8]$1506:
      Old ports: A=4'0000, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$a$1447
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$a$1447 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$a$1447 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$a$1447 [0] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$a$1447 [0] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$a$1447 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][5][9]$1509:
      Old ports: A=4'0111, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$b$1448
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$b$1448 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$b$1448 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$b$1448 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][0]$1799:
      Old ports: A=4'1111, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$a$1752
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$a$1752 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$a$1752 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$a$1752 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$a$1752 [1] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$a$1752 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][10]$1829:
      Old ports: A=4'1111, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][5]$a$1767
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][5]$a$1767 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][5]$a$1767 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][5]$a$1767 [0] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][5]$a$1767 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][11]$1832:
      Old ports: A=4'1000, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][5]$b$1768
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][5]$b$1768 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][5]$b$1768 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][5]$b$1768 [0] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][5]$b$1768 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][12]$1835:
      Old ports: A=4'1100, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][6]$a$1770
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][6]$a$1770 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][6]$a$1770 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][6]$a$1770 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][6]$a$1770 [2] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][13]$1838:
      Old ports: A=4'0001, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][6]$b$1771
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][6]$b$1771 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][6]$b$1771 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][6]$b$1771 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][14]$1841:
      Old ports: A=4'0110, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][7]$a$1773
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][7]$a$1773 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][7]$a$1773 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][7]$a$1773 [0] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][7]$a$1773 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][15]$1844:
      Old ports: A=4'1011, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][7]$b$1774
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][7]$b$1774 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][7]$b$1774 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][7]$b$1774 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][7]$b$1774 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][16]$1847:
      Old ports: A=4'0000, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][8]$a$1776
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][8]$a$1776 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][8]$a$1776 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][8]$a$1776 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][8]$a$1776 [1] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][8]$a$1776 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][17]$1850:
      Old ports: A=4'0111, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][8]$b$1777
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][8]$b$1777 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][8]$b$1777 [1:0] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][18]$1853:
      Old ports: A=4'1010, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][9]$a$1779
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][9]$a$1779 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][9]$a$1779 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][9]$a$1779 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][9]$a$1779 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][19]$1856:
      Old ports: A=4'1101, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][9]$b$1780
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][9]$b$1780 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][9]$b$1780 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][9]$b$1780 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][9]$b$1780 [2] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][1]$1802:
      Old ports: A=4'1000, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$b$1753
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$b$1753 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$b$1753 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$b$1753 [0] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$b$1753 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][20]$1859:
      Old ports: A=4'0101, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][21]$1862:
      Old ports: A=4'1100, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [2] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [0] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][22]$1865:
      Old ports: A=4'1001, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][11]$a$1785
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][11]$a$1785 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][11]$a$1785 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][11]$a$1785 [2] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][11]$a$1785 [0] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][23]$1868:
      Old ports: A=4'0010, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][11]$b$1786
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][11]$b$1786 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][11]$b$1786 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][11]$b$1786 [0] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][11]$b$1786 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][24]$1871:
      Old ports: A=4'1101, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][12]$a$1788
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][12]$a$1788 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][12]$a$1788 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][12]$a$1788 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][25]$1874:
      Old ports: A=4'1010, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][12]$b$1789
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][12]$b$1789 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][12]$b$1789 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][12]$b$1789 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][26]$1877:
      Old ports: A=4'0011, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][13]$a$1791
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][13]$a$1791 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][13]$a$1791 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][13]$a$1791 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][13]$a$1791 [2] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][27]$1880:
      Old ports: A=4'0100, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][13]$b$1792
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][13]$b$1792 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][13]$b$1792 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][13]$b$1792 [0] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][28]$1883:
      Old ports: A=4'1011, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][14]$a$1794
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][14]$a$1794 [2] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][14]$a$1794 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][14]$a$1794 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][14]$a$1794 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][14]$a$1794 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][29]$1886:
      Old ports: A=4'0111, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][14]$b$1795
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][14]$b$1795 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][14]$b$1795 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][14]$b$1795 [2:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][14]$b$1795 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][2]$1805:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][1]$a$1755
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][1]$a$1755 [2] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][1]$a$1755 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][1]$a$1755 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][1]$a$1755 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][1]$a$1755 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][30]$1889:
      Old ports: A=4'0000, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][15]$a$1797
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][15]$a$1797 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][15]$a$1797 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][15]$a$1797 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][31]$1892:
      Old ports: A=4'1110, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][15]$b$1798
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][15]$b$1798 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][15]$b$1798 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][15]$b$1798 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][3]$1808:
      Old ports: A=4'0011, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][1]$b$1756
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][1]$b$1756 [2] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][1]$b$1756 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][1]$b$1756 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][1]$b$1756 [1] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][1]$b$1756 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][4]$1811:
      Old ports: A=4'1001, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][2]$a$1758
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][2]$a$1758 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][2]$a$1758 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][2]$a$1758 [2] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][2]$a$1758 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][2]$a$1758 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][5]$1814:
      Old ports: A=4'0010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][2]$b$1759
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][2]$b$1759 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][2]$b$1759 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][2]$b$1759 [0] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][2]$b$1759 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][6]$1817:
      Old ports: A=4'1100, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][3]$a$1761
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][3]$a$1761 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][3]$a$1761 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][3]$a$1761 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][3]$a$1761 [2] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][7]$1820:
      Old ports: A=4'0101, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][3]$b$1762
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][3]$b$1762 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][3]$b$1762 [3:2] = $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][3]$b$1762 [1:0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][8]$1823:
      Old ports: A=4'0011, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][4]$a$1764
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][4]$a$1764 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][4]$a$1764 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][4]$a$1764 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][4]$a$1764 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][5][9]$1826:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][4]$b$1765
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][4]$b$1765 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][4]$b$1765 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][4]$b$1765 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][0]$2116:
      Old ports: A=4'1010, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$a$2069
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$a$2069 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$a$2069 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$a$2069 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$a$2069 [1] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][10]$2146:
      Old ports: A=4'0011, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][5]$a$2084
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][5]$a$2084 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][5]$a$2084 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][5]$a$2084 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][5]$a$2084 [1] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][5]$a$2084 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][11]$2149:
      Old ports: A=4'0110, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][5]$b$2085
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][5]$b$2085 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][5]$b$2085 [1:0] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][12]$2152:
      Old ports: A=4'0010, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][6]$a$2087
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][6]$a$2087 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][6]$a$2087 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][6]$a$2087 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][6]$a$2087 [0] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][13]$2155:
      Old ports: A=4'0101, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][6]$b$2088
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][6]$b$2088 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][6]$b$2088 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][6]$b$2088 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][14]$2158:
      Old ports: A=4'1100, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][7]$a$2090
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][7]$a$2090 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][7]$a$2090 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][7]$a$2090 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][7]$a$2090 [1] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][7]$a$2090 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][15]$2161:
      Old ports: A=4'1111, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][7]$b$2091
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][7]$b$2091 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][7]$b$2091 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][7]$b$2091 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][7]$b$2091 [1] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][7]$b$2091 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][16]$2164:
      Old ports: A=4'1101, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$a$2093
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$a$2093 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$a$2093 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$a$2093 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][17]$2167:
      Old ports: A=4'0100, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$b$2094
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$b$2094 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$b$2094 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$b$2094 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$b$2094 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$b$2094 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][18]$2170:
      Old ports: A=4'1000, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$a$2096
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$a$2096 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$a$2096 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$a$2096 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$a$2096 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][19]$2173:
      Old ports: A=4'0011, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$b$2097
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$b$2097 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$b$2097 [3:1] = { 2'00 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$b$2097 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][1]$2119:
      Old ports: A=4'1001, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][20]$2176:
      Old ports: A=4'1011, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][10]$a$2099
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][10]$a$2099 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][10]$a$2099 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][10]$a$2099 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][10]$a$2099 [1] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][21]$2179:
      Old ports: A=4'0010, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][10]$b$2100
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][10]$b$2100 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][10]$b$2100 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][10]$b$2100 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][10]$b$2100 [2] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][22]$2182:
      Old ports: A=4'0101, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$a$2102
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$a$2102 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$a$2102 [3:2] = $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$a$2102 [1:0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][23]$2185:
      Old ports: A=4'1110, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [2:1] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][24]$2188:
      Old ports: A=4'0001, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][12]$a$2105
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][12]$a$2105 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][12]$a$2105 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][12]$a$2105 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][25]$2191:
      Old ports: A=4'1101, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][12]$b$2106
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][12]$b$2106 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][12]$b$2106 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][12]$b$2106 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][12]$b$2106 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][26]$2194:
      Old ports: A=4'0110, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$a$2108
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$a$2108 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$a$2108 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$a$2108 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$a$2108 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][27]$2197:
      Old ports: A=4'1000, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$b$2109
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$b$2109 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$b$2109 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$b$2109 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$b$2109 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$b$2109 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][28]$2200:
      Old ports: A=4'0100, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][14]$a$2111
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][14]$a$2111 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][14]$a$2111 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][14]$a$2111 [0] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][14]$a$2111 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][29]$2203:
      Old ports: A=4'1110, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][14]$b$2112
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][14]$b$2112 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][14]$b$2112 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][14]$b$2112 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][14]$b$2112 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][14]$b$2112 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][2]$2122:
      Old ports: A=4'0110, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][1]$a$2072
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][1]$a$2072 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][1]$a$2072 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][1]$a$2072 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][1]$a$2072 [1] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][30]$2206:
      Old ports: A=4'1011, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][15]$a$2114
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][15]$a$2114 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][15]$a$2114 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][15]$a$2114 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][15]$a$2114 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][31]$2209:
      Old ports: A=4'0010, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][15]$b$2115
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][15]$b$2115 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][15]$b$2115 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][15]$b$2115 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][15]$b$2115 [2] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][3]$2125:
      Old ports: A=4'1111, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][1]$b$2073
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][1]$b$2073 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][1]$b$2073 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][1]$b$2073 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][1]$b$2073 [1] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][4]$2128:
      Old ports: A=4'0001, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][2]$a$2075
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][2]$a$2075 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][2]$a$2075 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][2]$a$2075 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][2]$a$2075 [2] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][5]$2131:
      Old ports: A=4'1100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][2]$b$2076
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][2]$b$2076 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][2]$b$2076 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][2]$b$2076 [2:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][2]$b$2076 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][6]$2134:
      Old ports: A=4'1011, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][3]$a$2078
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][3]$a$2078 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][3]$a$2078 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][3]$a$2078 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][3]$a$2078 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][3]$a$2078 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][3]$a$2078 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][7]$2137:
      Old ports: A=4'0010, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][3]$b$2079
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][3]$b$2079 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][3]$b$2079 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][3]$b$2079 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][3]$b$2079 [0] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][8]$2140:
      Old ports: A=4'1101, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][4]$a$2081
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][4]$a$2081 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][4]$a$2081 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][4]$a$2081 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][4]$a$2081 [0] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][5][9]$2143:
      Old ports: A=4'0000, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][4]$b$2082
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][4]$b$2082 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][4]$b$2082 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][4]$b$2082 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][0]$2433:
      Old ports: A=4'0111, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][0]$a$2386
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][0]$a$2386 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][0]$a$2386 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][0]$a$2386 [2] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][0]$a$2386 [0] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][10]$2463:
      Old ports: A=4'0110, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][5]$a$2401
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][5]$a$2401 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][5]$a$2401 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][5]$a$2401 [0] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][11]$2466:
      Old ports: A=4'0000, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][5]$b$2402
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][5]$b$2402 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][5]$b$2402 [3:1] = { 2'00 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][5]$b$2402 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][12]$2469:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][6]$a$2404
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][6]$a$2404 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][6]$a$2404 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][6]$a$2404 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][13]$2472:
      Old ports: A=4'0010, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][6]$b$2405
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][6]$b$2405 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][6]$b$2405 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][6]$b$2405 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][6]$b$2405 [2] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][14]$2475:
      Old ports: A=4'0001, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][7]$a$2407
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][7]$a$2407 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][7]$a$2407 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][7]$a$2407 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][15]$2478:
      Old ports: A=4'1110, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][7]$b$2408
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][7]$b$2408 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][7]$b$2408 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][7]$b$2408 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][16]$2481:
      Old ports: A=4'1010, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][8]$a$2410
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][8]$a$2410 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][8]$a$2410 [1:0] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][17]$2484:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][8]$b$2411
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][8]$b$2411 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][8]$b$2411 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][8]$b$2411 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][18]$2487:
      Old ports: A=4'1100, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][9]$a$2413
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][9]$a$2413 [2] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][9]$a$2413 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][9]$a$2413 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][9]$a$2413 [1] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][9]$a$2413 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][19]$2490:
      Old ports: A=4'0111, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][9]$b$2414
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][9]$b$2414 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][9]$b$2414 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][9]$b$2414 [2] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][9]$b$2414 [0] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][1]$2436:
      Old ports: A=4'1110, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][0]$b$2387
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][0]$b$2387 [2] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][0]$b$2387 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][0]$b$2387 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][0]$b$2387 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][0]$b$2387 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][20]$2493:
      Old ports: A=4'1111, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$a$2416
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$a$2416 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$a$2416 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$a$2416 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$a$2416 [1] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$a$2416 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][21]$2496:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$b$2417
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$b$2417 [2] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$b$2417 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$b$2417 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$b$2417 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$b$2417 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][22]$2499:
      Old ports: A=4'0101, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][11]$a$2419
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][11]$a$2419 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][11]$a$2419 [3:2] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][11]$a$2419 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][23]$2502:
      Old ports: A=4'1000, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][11]$b$2420
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][11]$b$2420 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][11]$b$2420 [1:0] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][24]$2505:
      Old ports: A=4'0011, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$a$2422
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$a$2422 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$a$2422 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$a$2422 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$a$2422 [2] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][25]$2508:
      Old ports: A=4'0000, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$b$2423
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$b$2423 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$b$2423 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$b$2423 [0] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$b$2423 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][26]$2511:
      Old ports: A=4'1010, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][13]$a$2425
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][13]$a$2425 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][13]$a$2425 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][13]$a$2425 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][27]$2514:
      Old ports: A=4'1101, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][13]$b$2426
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][13]$b$2426 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][13]$b$2426 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][13]$b$2426 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][28]$2517:
      Old ports: A=4'1001, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][14]$a$2428
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][14]$a$2428 [2] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][14]$a$2428 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][14]$a$2428 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][14]$a$2428 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][14]$a$2428 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][29]$2520:
      Old ports: A=4'0101, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][14]$b$2429
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][14]$b$2429 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][14]$b$2429 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][14]$b$2429 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][14]$b$2429 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][2]$2439:
      Old ports: A=4'0000, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][1]$a$2389
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][1]$a$2389 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][1]$a$2389 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][1]$a$2389 [0] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][1]$a$2389 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][30]$2523:
      Old ports: A=4'1100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][15]$a$2431
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][15]$a$2431 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][15]$a$2431 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][15]$a$2431 [2:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][15]$a$2431 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][31]$2526:
      Old ports: A=4'0010, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][15]$b$2432
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][15]$b$2432 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][15]$b$2432 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][15]$b$2432 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][15]$b$2432 [2] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][3]$2442:
      Old ports: A=4'1001, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][1]$b$2390
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][1]$b$2390 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][1]$b$2390 [3:2] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][4]$2445:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][2]$a$2392
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][2]$a$2392 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][2]$a$2392 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][5]$2448:
      Old ports: A=4'1000, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][2]$b$2393
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][2]$b$2393 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][2]$b$2393 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][2]$b$2393 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][2]$b$2393 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][6]$2451:
      Old ports: A=4'1011, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$a$2395
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$a$2395 [2] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$a$2395 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$a$2395 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$a$2395 [1] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$a$2395 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][7]$2454:
      Old ports: A=4'0100, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$b$2396
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$b$2396 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$b$2396 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$b$2396 [0] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$b$2396 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][8]$2457:
      Old ports: A=4'1101, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][4]$a$2398
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][4]$a$2398 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][4]$a$2398 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][4]$a$2398 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][5][9]$2460:
      Old ports: A=4'1011, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][4]$b$2399
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][4]$b$2399 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][4]$b$2399 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][4]$b$2399 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][4]$b$2399 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][0]$2750:
      Old ports: A=4'0010, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [2] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][10]$2780:
      Old ports: A=4'0100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][5]$a$2718
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][5]$a$2718 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][5]$a$2718 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][5]$a$2718 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][11]$2783:
      Old ports: A=4'1101, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][5]$b$2719
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][5]$b$2719 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][5]$b$2719 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][5]$b$2719 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][5]$b$2719 [2] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][12]$2786:
      Old ports: A=4'0101, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$a$2721
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$a$2721 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$a$2721 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$a$2721 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][13]$2789:
      Old ports: A=4'1111, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$b$2722
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$b$2722 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$b$2722 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$b$2722 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][14]$2792:
      Old ports: A=4'0011, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][7]$a$2724
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][7]$a$2724 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][7]$a$2724 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][7]$a$2724 [2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][7]$a$2724 [0] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][15]$2795:
      Old ports: A=4'1000, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][7]$b$2725
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][7]$b$2725 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][7]$b$2725 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][7]$b$2725 [2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][7]$b$2725 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][7]$b$2725 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][16]$2798:
      Old ports: A=4'0100, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][8]$a$2727
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][8]$a$2727 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][8]$a$2727 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][8]$a$2727 [0] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][17]$2801:
      Old ports: A=4'0001, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][8]$b$2728
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][8]$b$2728 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][8]$b$2728 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][8]$b$2728 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][8]$b$2728 [1] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][18]$2804:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$a$2730
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$a$2730 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$a$2730 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$a$2730 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][19]$2807:
      Old ports: A=4'0111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$b$2731
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$b$2731 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$b$2731 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$b$2731 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$b$2731 [0] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$b$2731 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][1]$2753:
      Old ports: A=4'0100, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$b$2704
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$b$2704 [2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$b$2704 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$b$2704 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$b$2704 [1] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][20]$2810:
      Old ports: A=4'1111, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][10]$a$2733
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][10]$a$2733 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][10]$a$2733 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][10]$a$2733 [0] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][10]$a$2733 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][21]$2813:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][10]$b$2734
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][10]$b$2734 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][10]$b$2734 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][10]$b$2734 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][22]$2816:
      Old ports: A=4'0110, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][11]$a$2736
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][11]$a$2736 [2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][11]$a$2736 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][11]$a$2736 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][11]$a$2736 [1] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][23]$2819:
      Old ports: A=4'0000, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][11]$b$2737
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][11]$b$2737 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][11]$b$2737 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][11]$b$2737 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][11]$b$2737 [1] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][11]$b$2737 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][24]$2822:
      Old ports: A=4'1011, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$a$2739
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$a$2739 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$a$2739 [3:1] = { 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$a$2739 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][25]$2825:
      Old ports: A=4'1100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$b$2740
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$b$2740 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$b$2740 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$b$2740 [2:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$b$2740 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][26]$2828:
      Old ports: A=4'0001, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$a$2742
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$a$2742 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$a$2742 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$a$2742 [1] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$a$2742 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][27]$2831:
      Old ports: A=4'0010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$b$2743
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$b$2743 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$b$2743 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$b$2743 [0] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$b$2743 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][28]$2834:
      Old ports: A=4'0110, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$a$2745
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$a$2745 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$a$2745 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$a$2745 [0] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][29]$2837:
      Old ports: A=4'0000, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$b$2746
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$b$2746 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$b$2746 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$b$2746 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][2]$2756:
      Old ports: A=4'0111, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$a$2706
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$a$2706 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$a$2706 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$a$2706 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$a$2706 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][30]$2840:
      Old ports: A=4'1010, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][15]$a$2748
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][15]$a$2748 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][15]$a$2748 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][15]$a$2748 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][15]$a$2748 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][31]$2843:
      Old ports: A=4'0101, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][15]$b$2749
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][15]$b$2749 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][15]$b$2749 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][15]$b$2749 [0] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][3]$2759:
      Old ports: A=4'1011, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$b$2707
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$b$2707 [2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$b$2707 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$b$2707 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$b$2707 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$b$2707 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][4]$2762:
      Old ports: A=4'1000, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][2]$a$2709
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][2]$a$2709 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][2]$a$2709 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][2]$a$2709 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][2]$a$2709 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][5]$2765:
      Old ports: A=4'0011, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][2]$b$2710
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][2]$b$2710 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][2]$b$2710 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][2]$b$2710 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][2]$b$2710 [2] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][6]$2768:
      Old ports: A=4'1101, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][3]$a$2712
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][3]$a$2712 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][3]$a$2712 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][3]$a$2712 [0] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][3]$a$2712 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][7]$2771:
      Old ports: A=4'1110, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][3]$b$2713
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][3]$b$2713 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][3]$b$2713 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][3]$b$2713 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][8]$2774:
      Old ports: A=4'1110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][4]$a$2715
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][4]$a$2715 [2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][4]$a$2715 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][4]$a$2715 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][4]$a$2715 [1] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][5][9]$2777:
      Old ports: A=4'0010, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][4]$b$2716
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][4]$b$2716 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][4]$b$2716 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][4]$b$2716 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][4]$b$2716 [2] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][0]$3067:
      Old ports: A=4'1100, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][0]$a$3020
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][0]$a$3020 [2] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][0]$a$3020 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][0]$a$3020 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][0]$a$3020 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][0]$a$3020 [2] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][10]$3097:
      Old ports: A=4'0111, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][5]$a$3035
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][5]$a$3035 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][5]$a$3035 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][5]$a$3035 [2:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][5]$a$3035 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][11]$3100:
      Old ports: A=4'1001, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][5]$b$3036
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][5]$b$3036 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][5]$b$3036 [1:0] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][12]$3103:
      Old ports: A=4'0110, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][6]$a$3038
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][6]$a$3038 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][6]$a$3038 [3:2] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][6]$a$3038 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][13]$3106:
      Old ports: A=4'1101, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][6]$b$3039
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][6]$b$3039 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][6]$b$3039 [3:2] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][14]$3109:
      Old ports: A=4'0000, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$a$3041
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$a$3041 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$a$3041 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$a$3041 [0] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$a$3041 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][15]$3112:
      Old ports: A=4'0011, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$b$3042
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$b$3042 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$b$3042 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$b$3042 [2:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$b$3042 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][16]$3115:
      Old ports: A=4'1001, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][8]$a$3044
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][8]$a$3044 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][8]$a$3044 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][8]$a$3044 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][17]$3118:
      Old ports: A=4'1111, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][8]$b$3045
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][8]$b$3045 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][8]$b$3045 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][8]$b$3045 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][8]$b$3045 [1] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][18]$3121:
      Old ports: A=4'0010, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][9]$a$3047
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][9]$a$3047 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][9]$a$3047 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][9]$a$3047 [2] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][9]$a$3047 [0] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][19]$3124:
      Old ports: A=4'1100, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][9]$b$3048
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][9]$b$3048 [2] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][9]$b$3048 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][9]$b$3048 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][9]$b$3048 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][9]$b$3048 [2] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][9]$b$3048 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][1]$3070:
      Old ports: A=4'1010, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][0]$b$3021
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][0]$b$3021 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][0]$b$3021 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][0]$b$3021 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][20]$3127:
      Old ports: A=4'0111, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][10]$a$3050
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][10]$a$3050 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][10]$a$3050 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][10]$a$3050 [0] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][10]$a$3050 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][21]$3130:
      Old ports: A=4'0100, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][10]$b$3051
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][10]$b$3051 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][10]$b$3051 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][10]$b$3051 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][10]$b$3051 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][22]$3133:
      Old ports: A=4'0001, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][11]$a$3053
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][11]$a$3053 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][11]$a$3053 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][11]$a$3053 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][11]$a$3053 [2] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][23]$3136:
      Old ports: A=4'1011, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][11]$b$3054
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][11]$b$3054 [2] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][11]$b$3054 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][11]$b$3054 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][11]$b$3054 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][11]$b$3054 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][24]$3139:
      Old ports: A=4'0100, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][12]$a$3056
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][12]$a$3056 [2] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][12]$a$3056 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][12]$a$3056 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][12]$a$3056 [1] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][12]$a$3056 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][25]$3142:
      Old ports: A=4'0010, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][12]$b$3057
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][12]$b$3057 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][12]$b$3057 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][12]$b$3057 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][12]$b$3057 [2] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][26]$3145:
      Old ports: A=4'1001, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][13]$a$3059
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][13]$a$3059 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][13]$a$3059 [1:0] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][27]$3148:
      Old ports: A=4'1111, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][13]$b$3060
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][13]$b$3060 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][13]$b$3060 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][13]$b$3060 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][28]$3151:
      Old ports: A=4'1011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][14]$a$3062
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][14]$a$3062 [2] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][14]$a$3062 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][14]$a$3062 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][14]$a$3062 [1] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][29]$3154:
      Old ports: A=4'0001, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][14]$b$3063
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][14]$b$3063 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][14]$b$3063 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][14]$b$3063 [0] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][14]$b$3063 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][2]$3073:
      Old ports: A=4'1001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][1]$a$3023
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][1]$a$3023 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][1]$a$3023 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][1]$a$3023 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][30]$3157:
      Old ports: A=4'0110, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][15]$a$3065
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][15]$a$3065 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][15]$a$3065 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][15]$a$3065 [0] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][15]$a$3065 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][31]$3160:
      Old ports: A=4'1000, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][15]$b$3066
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][15]$b$3066 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][15]$b$3066 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][15]$b$3066 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][3]$3076:
      Old ports: A=4'0110, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][1]$b$3024
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][1]$b$3024 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][1]$b$3024 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][1]$b$3024 [2] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][1]$b$3024 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][1]$b$3024 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][4]$3079:
      Old ports: A=4'0000, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][2]$a$3026
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][2]$a$3026 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][2]$a$3026 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][2]$a$3026 [0] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][2]$a$3026 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][5]$3082:
      Old ports: A=4'0011, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][2]$b$3027
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][2]$b$3027 [2] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][2]$b$3027 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][2]$b$3027 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][2]$b$3027 [1] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][2]$b$3027 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][6]$3085:
      Old ports: A=4'1110, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][3]$a$3029
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][3]$a$3029 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][3]$a$3029 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][3]$a$3029 [2:1] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][7]$3088:
      Old ports: A=4'0101, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][3]$b$3030
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][3]$b$3030 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][3]$b$3030 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][3]$b$3030 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][3]$b$3030 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][8]$3091:
      Old ports: A=4'1010, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][4]$a$3032
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][4]$a$3032 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][4]$a$3032 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][4]$a$3032 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][5][9]$3094:
      Old ports: A=4'0100, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][4]$b$3033
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][4]$b$3033 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][4]$b$3033 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][4]$b$3033 [0] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][0]$3384:
      Old ports: A=4'0100, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][0]$a$3337
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][0]$a$3337 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][0]$a$3337 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][0]$a$3337 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][0]$a$3337 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][0]$a$3337 [0] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][0]$a$3337 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][10]$3414:
      Old ports: A=4'0100, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][5]$a$3352
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][5]$a$3352 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][5]$a$3352 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][5]$a$3352 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][5]$a$3352 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][5]$a$3352 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][11]$3417:
      Old ports: A=4'0001, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][5]$b$3353
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][5]$b$3353 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][5]$b$3353 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][5]$b$3353 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][12]$3420:
      Old ports: A=4'1110, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][6]$a$3355
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][6]$a$3355 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][6]$a$3355 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][6]$a$3355 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][6]$a$3355 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][6]$a$3355 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][13]$3423:
      Old ports: A=4'0101, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][6]$b$3356
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][6]$b$3356 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][6]$b$3356 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][6]$b$3356 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][14]$3426:
      Old ports: A=4'0010, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][7]$a$3358
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][7]$a$3358 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][7]$a$3358 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][7]$a$3358 [0] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][7]$a$3358 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][15]$3429:
      Old ports: A=4'1000, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][7]$b$3359
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][7]$b$3359 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][7]$b$3359 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][7]$b$3359 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][7]$b$3359 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][7]$b$3359 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][16]$3432:
      Old ports: A=4'0001, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][8]$a$3361
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][8]$a$3361 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][8]$a$3361 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][8]$a$3361 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][8]$a$3361 [1] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][17]$3435:
      Old ports: A=4'1011, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][8]$b$3362
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][8]$b$3362 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][8]$b$3362 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][8]$b$3362 [0] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][18]$3438:
      Old ports: A=4'1100, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][9]$a$3364
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][9]$a$3364 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][9]$a$3364 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][9]$a$3364 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][9]$a$3364 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][9]$a$3364 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][9]$a$3364 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][19]$3441:
      Old ports: A=4'0111, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][9]$b$3365
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][9]$b$3365 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][9]$b$3365 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][9]$b$3365 [2:1] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][1]$3387:
      Old ports: A=4'0010, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][0]$b$3338
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][0]$b$3338 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][0]$b$3338 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][0]$b$3338 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][0]$b$3338 [2] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][20]$3444:
      Old ports: A=4'1010, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$a$3367
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$a$3367 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$a$3367 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$a$3367 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][21]$3447:
      Old ports: A=4'0110, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$b$3368
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$b$3368 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$b$3368 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$b$3368 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$b$3368 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$b$3368 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][22]$3450:
      Old ports: A=4'0000, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][11]$a$3370
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][11]$a$3370 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][11]$a$3370 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][11]$a$3370 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][23]$3453:
      Old ports: A=4'1001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][11]$b$3371
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][11]$b$3371 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][11]$b$3371 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][11]$b$3371 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][24]$3456:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][12]$a$3373
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][12]$a$3373 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][12]$a$3373 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][12]$a$3373 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][12]$a$3373 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][12]$a$3373 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][25]$3459:
      Old ports: A=4'1101, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][12]$b$3374
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][12]$b$3374 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][12]$b$3374 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][12]$b$3374 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][26]$3462:
      Old ports: A=4'0001, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][13]$a$3376
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][13]$a$3376 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][13]$a$3376 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][13]$a$3376 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][13]$a$3376 [1] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][27]$3465:
      Old ports: A=4'1010, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][13]$b$3377
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][13]$b$3377 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][13]$b$3377 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][13]$b$3377 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][13]$b$3377 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][28]$3468:
      Old ports: A=4'1001, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][14]$a$3379
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][14]$a$3379 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][14]$a$3379 [1:0] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][29]$3471:
      Old ports: A=4'0000, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][14]$b$3380
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][14]$b$3380 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][14]$b$3380 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][14]$b$3380 [0] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][14]$b$3380 [0] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][14]$b$3380 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][2]$3390:
      Old ports: A=4'1111, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$a$3340
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$a$3340 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$a$3340 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$a$3340 [0] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$a$3340 [0] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$a$3340 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][30]$3474:
      Old ports: A=4'1110, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$a$3382
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$a$3382 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$a$3382 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$a$3382 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$a$3382 [2] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][31]$3477:
      Old ports: A=4'0011, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$b$3383
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$b$3383 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$b$3383 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$b$3383 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$b$3383 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$b$3383 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$b$3383 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][3]$3393:
      Old ports: A=4'1000, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$b$3341
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$b$3341 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$b$3341 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$b$3341 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][4]$3396:
      Old ports: A=4'0011, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][2]$a$3343
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][2]$a$3343 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][2]$a$3343 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][2]$a$3343 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][2]$a$3343 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][2]$a$3343 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][2]$a$3343 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][5]$3399:
      Old ports: A=4'1001, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][2]$b$3344
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][2]$b$3344 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][2]$b$3344 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][2]$b$3344 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][2]$b$3344 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][2]$b$3344 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][6]$3402:
      Old ports: A=4'0101, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][3]$a$3346
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][3]$a$3346 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][3]$a$3346 [3:2] = $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][3]$a$3346 [1:0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][7]$3405:
      Old ports: A=4'0110, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][3]$b$3347
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][3]$b$3347 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][3]$b$3347 [3:2] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][3]$b$3347 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][8]$3408:
      Old ports: A=4'1101, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][4]$a$3349
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][4]$a$3349 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][4]$a$3349 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][4]$a$3349 [0] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][4]$a$3349 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][5][9]$3411:
      Old ports: A=4'1011, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][4]$b$3350
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][4]$b$3350 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][4]$b$3350 [1:0] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][0]$3701:
      Old ports: A=4'1101, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$a$3654
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$a$3654 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$a$3654 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$a$3654 [0] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$a$3654 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][10]$3731:
      Old ports: A=4'1010, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][5]$a$3669
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][5]$a$3669 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][5]$a$3669 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][5]$a$3669 [2:1] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][11]$3734:
      Old ports: A=4'0111, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][5]$b$3670
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][5]$b$3670 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][5]$b$3670 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][5]$b$3670 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][12]$3737:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][6]$a$3672
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][6]$a$3672 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][6]$a$3672 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][6]$a$3672 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][13]$3740:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][6]$b$3673
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][6]$b$3673 [2] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][6]$b$3673 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][6]$b$3673 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][6]$b$3673 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][6]$b$3673 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][14]$3743:
      Old ports: A=4'0000, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][7]$a$3675
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][7]$a$3675 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][7]$a$3675 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][7]$a$3675 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][7]$a$3675 [1] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][7]$a$3675 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][15]$3746:
      Old ports: A=4'1001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][7]$b$3676
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][7]$b$3676 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][7]$b$3676 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][7]$b$3676 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][16]$3749:
      Old ports: A=4'0111, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][8]$a$3678
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][8]$a$3678 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][8]$a$3678 [1:0] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][17]$3752:
      Old ports: A=4'0100, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][8]$b$3679
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][8]$b$3679 [2] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][8]$b$3679 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][8]$b$3679 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][8]$b$3679 [1] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][18]$3755:
      Old ports: A=4'1001, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][9]$a$3681
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][9]$a$3681 [2] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][9]$a$3681 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][9]$a$3681 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][9]$a$3681 [1] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][19]$3758:
      Old ports: A=4'1110, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][9]$b$3682
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][9]$b$3682 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][9]$b$3682 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][9]$b$3682 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][9]$b$3682 [2] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][1]$3704:
      Old ports: A=4'1000, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [1:0] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][20]$3761:
      Old ports: A=4'0000, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][10]$a$3684
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][10]$a$3684 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][10]$a$3684 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][10]$a$3684 [0] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][10]$a$3684 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][21]$3764:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][10]$b$3685
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][10]$b$3685 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][10]$b$3685 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][10]$b$3685 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][22]$3767:
      Old ports: A=4'1111, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$a$3687
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$a$3687 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$a$3687 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$a$3687 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$a$3687 [2] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][23]$3770:
      Old ports: A=4'0101, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$b$3688
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$b$3688 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$b$3688 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$b$3688 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$b$3688 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][24]$3773:
      Old ports: A=4'0010, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][12]$a$3690
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][12]$a$3690 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][12]$a$3690 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][25]$3776:
      Old ports: A=4'1110, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][12]$b$3691
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][12]$b$3691 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][12]$b$3691 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][12]$b$3691 [2:1] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][26]$3779:
      Old ports: A=4'0100, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][13]$a$3693
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][13]$a$3693 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][13]$a$3693 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][13]$a$3693 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][13]$a$3693 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][27]$3782:
      Old ports: A=4'1000, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][13]$b$3694
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][13]$b$3694 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][13]$b$3694 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][13]$b$3694 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][28]$3785:
      Old ports: A=4'1111, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][14]$a$3696
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][14]$a$3696 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][14]$a$3696 [3:1] = { 2'11 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][14]$a$3696 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][29]$3788:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][14]$b$3697
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][14]$b$3697 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][14]$b$3697 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][14]$b$3697 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][2]$3707:
      Old ports: A=4'0110, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][1]$a$3657
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][1]$a$3657 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][1]$a$3657 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][1]$a$3657 [0] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][30]$3791:
      Old ports: A=4'0011, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][15]$a$3699
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][15]$a$3699 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][15]$a$3699 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][15]$a$3699 [0] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][31]$3794:
      Old ports: A=4'0110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][15]$b$3700
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][15]$b$3700 [2] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][15]$b$3700 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][15]$b$3700 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][15]$b$3700 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][15]$b$3700 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][3]$3710:
      Old ports: A=4'1011, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][1]$b$3658
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][1]$b$3658 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][1]$b$3658 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][1]$b$3658 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][1]$b$3658 [1] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][4]$3713:
      Old ports: A=4'1010, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][2]$a$3660
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][2]$a$3660 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][2]$a$3660 [3:2] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][5]$3716:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][2]$b$3661
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][2]$b$3661 [2] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][2]$b$3661 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][2]$b$3661 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][2]$b$3661 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][2]$b$3661 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][6]$3719:
      Old ports: A=4'0101, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][3]$a$3663
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][3]$a$3663 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][3]$a$3663 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][3]$a$3663 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][7]$3722:
      Old ports: A=4'1100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][3]$b$3664
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][3]$b$3664 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][3]$b$3664 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][3]$b$3664 [2:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][3]$b$3664 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][8]$3725:
      Old ports: A=4'0001, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][4]$a$3666
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][4]$a$3666 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][4]$a$3666 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][4]$a$3666 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][4]$a$3666 [1] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][4]$a$3666 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][5][9]$3728:
      Old ports: A=4'1101, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][4]$b$3667
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][4]$b$3667 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][4]$b$3667 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][4]$b$3667 [0] 1'0 }
  Optimizing cells in module \des_top.
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$1446:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$a$1447, B=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$b$1448, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][2]$a$1417
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$a$1447 [0] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$a$1447 [0] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$a$1447 [0] }, B={ 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][4]$b$1448 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][2]$a$1417 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][2]$a$1417 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][2]$a$1417 [1] = $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][2]$a$1417 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$1449:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$a$1450, B=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$b$1451, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][2]$b$1418
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$a$1450 [2] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$b$1451 [2] 2'01 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][2]$b$1418 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][2]$b$1418 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][2]$b$1418 [2]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][9]$1461:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][9]$a$1462, B=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][9]$b$1463, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][4]$b$1424
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][9]$a$1462 [1:0] }, B={ 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][9]$b$1463 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][4]$b$1424 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][4]$b$1424 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][4]$b$1424 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$1751:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$a$1752, B=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$b$1753, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][3][0]$a$1728
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$a$1752 [1] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$a$1752 [1] 1'1 }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][0]$b$1753 [1] 1'0 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][3][0]$a$1728 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][3][0]$a$1728 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][3][0]$a$1728 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][3][0]$a$1728 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$2107:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$a$2108, B=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$b$2109, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][6]$b$2064
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$a$2108 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$a$2108 [1:0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$b$2109 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$b$2109 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$b$2109 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][6]$b$2064 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][6]$b$2064 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][6]$b$2064 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][6]$b$2064 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$2092:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$a$2093, B=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$b$2094, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][4]$a$2057
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$a$2093 [1:0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$b$2094 [2] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][8]$b$2094 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][4]$a$2057 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][4]$a$2057 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][4]$a$2057 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$2095:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$a$2096, B=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$b$2097, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][4]$b$2058
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$a$2096 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$a$2096 [0] }, B={ 2'00 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][9]$b$2097 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][4]$b$2058 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][4]$b$2058 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][4]$b$2058 [1] = $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][4]$b$2058 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$2415:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$a$2416, B=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$b$2417, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][5]$a$2377
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$a$2416 [1] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$a$2416 [1] 1'1 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$b$2417 [2] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][10]$b$2417 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][5]$a$2377 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][5]$a$2377 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][5]$a$2377 [2]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$2394:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$a$2395, B=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$b$2396, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][1]$b$2366
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$a$2395 [2] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$a$2395 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$b$2396 [0] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][3]$b$2396 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][1]$b$2366 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][1]$b$2366 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][1]$b$2366 [1] = $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][1]$b$2366 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$2738:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$a$2739, B=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$b$2740, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][6]$a$2697
      New ports: A={ 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$a$2739 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$b$2740 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][12]$b$2740 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][6]$a$2697 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][6]$a$2697 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][6]$a$2697 [1] = $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][6]$a$2697 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$2741:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$a$2742, B=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$b$2743, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][6]$b$2698
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$a$2742 [1] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$a$2742 [1:0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$b$2743 [0] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][13]$b$2743 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][6]$b$2698 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][6]$b$2698 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][6]$b$2698 [2]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$2744:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$a$2745, B=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$b$2746, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][7]$a$2700
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$a$2745 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$b$2746 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][7]$a$2700 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][7]$a$2700 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][7]$a$2700 [0] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][7]$a$2700 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$2705:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$a$2706, B=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$b$2707, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][0]$b$2680
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$a$2706 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$a$2706 [0] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$a$2706 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$b$2707 [0] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$b$2707 [2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$b$2707 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][0]$b$2680 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][0]$b$2680 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][0]$b$2680 [1] = 1'1
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$2720:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$a$2721, B=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$b$2722, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][3]$a$2688
      New ports: A={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$a$2721 [0] }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$b$2722 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][3]$a$2688 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][3]$a$2688 [3:2] = $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][3]$a$2688 [1:0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$2729:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$a$2730, B=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$b$2731, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][4]$b$2692
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$a$2730 [1:0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$b$2731 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$b$2731 [0] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][9]$b$2731 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][4]$b$2692 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][4]$b$2692 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][4]$b$2692 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][4]$b$2692 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$3040:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$a$3041, B=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$b$3042, Y=$memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][3][3]$b$3006
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$a$3041 [0] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$a$3041 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$b$3042 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][4][7]$b$3042 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][3][3]$b$3006 [3] $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][3][3]$b$3006 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][3][3]$b$3006 [2:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$208$rdmux[0][3][3]$b$3006 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$3381:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$a$3382, B=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$b$3383, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][3][7]$b$3335
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$a$3382 [2] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$b$3383 [2] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$b$3383 [0] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][15]$b$3383 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][3][7]$b$3335 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][3][7]$b$3335 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][3][7]$b$3335 [2]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$3339:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$a$3340, B=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$b$3341, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][3][0]$b$3314
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$a$3340 [0] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$a$3340 [0] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$a$3340 [0] }, B={ 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][1]$b$3341 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][3][0]$b$3314 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][3][0]$b$3314 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][3][0]$b$3314 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][3][0]$b$3314 [0]
  Optimizing cells in module \des_top.
Performed a total of 274 changes.

yosys> opt_merge

3.30.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~672 debug messages>
Removed a total of 224 cells.

yosys> opt_share

3.30.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 224 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~16 debug messages>

3.30.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~24 debug messages>

yosys> opt_reduce -full

3.30.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$1434:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [3] 1'0 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [3] 2'01 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][0]$a$1411
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [3] 1'0 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [3] 2'01 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][0]$a$1411 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][0]$a$1411 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [3]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][2]$1440:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$a$1468 [3] 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$a$1468 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$a$1468 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$a$1468 [0] 1'0 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][1]$a$1414
      New ports: A={ 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$a$1468 [0] }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$a$1468 [0] 1'0 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][1]$a$1414 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][1]$a$1414 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][11]$a$1468 [3]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][5]$1449:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [3] 2'01 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][2]$b$1418 [3] $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][2]$b$1418 [1:0] }
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][2]$b$1418 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][3][2]$b$1418 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$193$rdmux[0][4][0]$a$1435 [3]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][14]$1793:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [2] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [2] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [2] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [2] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][3][7]$a$1749
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [2] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [3] 1'1 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [2] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][3][7]$a$1749 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][3][7]$a$1749 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$a$1782 [2]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][2]$1757:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [1] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [1] 1'1 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [1] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [1] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [1] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][3][1]$a$1731
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [1] 1'1 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [1] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [1] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][3][1]$a$1731 [3] $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][3][1]$a$1731 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][3][1]$a$1731 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$196$rdmux[0][4][10]$b$1783 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][13]$2107:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][6]$b$2064 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][6]$b$2064 [0] }
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [3] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][6]$b$2064 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][6]$b$2064 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][11]$b$2103 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][15]$2113:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] 1'1 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] 1'0 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][7]$b$2067
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] 1'1 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2] 1'0 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][7]$b$2067 [3] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][7]$b$2067 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][7]$b$2067 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][3]$2077:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] 1'0 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][1]$b$2049
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2] 2'00 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][1]$b$2049 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][1]$b$2049 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][1]$b$2049 [1] = $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][6]$2086:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] 1'0 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][3]$a$2054
      New ports: A={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] 1'0 }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2] $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][3]$a$2054 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][3][3]$a$2054 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$199$rdmux[0][4][0]$b$2070 [2]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$2421:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$a$2422 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$a$2422 [3] 2'11 }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$a$2422 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$a$2422 [3] 1'0 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][6]$a$2380
      New ports: A={ \u0.u3.addr [4] 2'11 }, B={ 1'0 \u0.u3.addr [4] 1'0 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][6]$a$2380 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][6]$a$2380 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][6]$a$2380 [2] = \u0.u3.addr [4]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][5]$2400:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$a$2422 [3] 2'11 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$a$2422 [3] }, B={ 2'00 $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$a$2422 [3] $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][4][12]$a$2422 [3] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][2]$b$2369
      New ports: A={ \u0.u3.addr [4] 2'11 }, B={ 2'00 \u0.u3.addr [4] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][2]$b$2369 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$202$rdmux[0][3][2]$b$2369 [0] = \u0.u3.addr [4]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][14]$2744:
      Old ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][11]$b$2737 [3] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][11]$b$2737 [3] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][7]$a$2700 [2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][7]$a$2700 [3] }
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][7]$a$2700 [2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][7]$a$2700 [3] = \u0.u4.addr [4]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][1]$2705:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [1] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [1] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [1] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [1] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][0]$b$2680 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][0]$b$2680 [0] }
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [3] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [1] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [1] $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [3] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][0]$b$2680 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][0]$b$2680 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][0]$a$2703 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][6]$2720:
      Old ports: A={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][10]$a$2733 [2] }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][10]$a$2733 [2] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][3]$a$2688 [3:2]
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][3]$a$2688 [3]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][3][3]$a$2688 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$205$rdmux[0][4][10]$a$2733 [2]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][8]$3360:
      Old ports: A={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$b$3368 [3] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$b$3368 [2] }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$b$3368 [3:2] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][3][4]$a$3325
      New ports: A={ 2'00 $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$b$3368 [2] }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$b$3368 [2] 1'1 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][3][4]$a$3325 [3] $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][3][4]$a$3325 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][3][4]$a$3325 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$211$rdmux[0][4][10]$b$3368 [3]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][12]$3689:
      Old ports: A={ 2'00 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [3:2] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [3] 2'11 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [2] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][3][6]$a$3648
      New ports: A={ 2'00 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [3] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [3] 2'11 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][3][6]$a$3648 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][3][6]$a$3648 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [2]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][14]$3695:
      Old ports: A={ 2'11 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$a$3687 [3] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$a$3687 [3] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$a$3687 [3] 2'00 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$a$3687 [3] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][3][7]$a$3651
      New ports: A={ 2'11 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$a$3687 [3] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$a$3687 [3] 2'00 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][3][7]$a$3651 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][3][7]$a$3651 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][11]$a$3687 [3]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][6]$3671:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [3] 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [2] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [2] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [2] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][3][3]$a$3639
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [3] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [2] $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][3][3]$a$3639 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][3][3]$a$3639 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$214$rdmux[0][4][0]$b$3655 [2]
  Optimizing cells in module \des_top.
Performed a total of 18 changes.

yosys> opt_merge

3.30.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.30.22. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 12 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~2 debug messages>

3.30.26. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~24 debug messages>

yosys> opt_reduce -full

3.30.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.30.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.30.30. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr -full

3.30.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.30.34. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $not.
No more expansions possible.
<suppressed ~342 debug messages>

yosys> opt -sat

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~65 debug messages>

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~1170 debug messages>
Removed a total of 390 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 91 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~16 debug messages>

3.32.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.32.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.32.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_dff -sat

3.32.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 7 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.32.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.32.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.32.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.32.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.32.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.32.23. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  1457 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.33.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1457 gates and 1584 wires to a netlist network with 125 inputs and 64 outputs.

3.33.2.1. Executing ABC.

yosys> abc -dff

3.34. Executing ABC pass (technology mapping using ABC).

3.34.1. Summary of detected clock domains:
  1967 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.34.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1967 gates and 2092 wires to a netlist network with 125 inputs and 64 outputs.

3.34.2.1. Executing ABC.

yosys> abc -dff

3.35. Executing ABC pass (technology mapping using ABC).

3.35.1. Summary of detected clock domains:
  1973 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.35.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1973 gates and 2098 wires to a netlist network with 125 inputs and 64 outputs.

3.35.2.1. Executing ABC.

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  1982 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.36.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1982 gates and 2107 wires to a netlist network with 125 inputs and 64 outputs.

3.36.2.1. Executing ABC.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~6 debug messages>

yosys> opt_merge -nomux

3.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~192 debug messages>
Removed a total of 64 cells.

yosys> opt_muxtree

3.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 6739 unused wires.
<suppressed ~23 debug messages>

yosys> opt_expr

3.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.38.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_ywKada/abc_tmp_1.scr

3.39. Executing ABC pass (technology mapping using ABC).

3.39.1. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Extracted 1835 gates and 2024 wires to a netlist network with 189 inputs and 64 outputs.

3.39.1.1. Executing ABC.
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   0.11 sec. at Pass 0]
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   7.80 sec. at Pass 1]
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   1.32 sec. at Pass 2]
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   2.29 sec. at Pass 3]
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   1.66 sec. at Pass 4]
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   3.16 sec. at Pass 5]
DE:   #PIs = 189  #Luts =   388  Max Lvl =   7  Avg Lvl =   4.19  [   6.31 sec. at Pass 6]
DE:   #PIs = 189  #Luts =   388  Max Lvl =   7  Avg Lvl =   4.19  [   1.87 sec. at Pass 7]
DE:   #PIs = 189  #Luts =   388  Max Lvl =   7  Avg Lvl =   4.19  [   2.94 sec. at Pass 8]
DE:   #PIs = 189  #Luts =   388  Max Lvl =   6  Avg Lvl =   4.00  [   2.24 sec. at Pass 9]
DE:   #PIs = 189  #Luts =   388  Max Lvl =   6  Avg Lvl =   4.00  [   4.11 sec. at Pass 10]
DE:   #PIs = 189  #Luts =   388  Max Lvl =   6  Avg Lvl =   4.00  [   2.73 sec. at Pass 11]
DE:   #PIs = 189  #Luts =   388  Max Lvl =   6  Avg Lvl =   4.00  [   3.54 sec. at Pass 12]
DE:   #PIs = 189  #Luts =   387  Max Lvl =   7  Avg Lvl =   4.12  [   8.56 sec. at Pass 13]
DE:   #PIs = 189  #Luts =   387  Max Lvl =   7  Avg Lvl =   4.12  [   2.81 sec. at Pass 14]
DE:   #PIs = 189  #Luts =   387  Max Lvl =   7  Avg Lvl =   4.12  [   6.37 sec. at Pass 15]
DE:   #PIs = 189  #Luts =   387  Max Lvl =   6  Avg Lvl =   4.00  [   3.48 sec. at Pass 16]
DE:   #PIs = 189  #Luts =   387  Max Lvl =   6  Avg Lvl =   4.00  [   4.55 sec. at Pass 17]
DE:   #PIs = 189  #Luts =   387  Max Lvl =   6  Avg Lvl =   4.00  [   2.98 sec. at Pass 18]
DE:   #PIs = 189  #Luts =   387  Max Lvl =   6  Avg Lvl =   4.00  [   3.93 sec. at Pass 19]
DE:   #PIs = 189  #Luts =   387  Max Lvl =   6  Avg Lvl =   4.00  [   8.74 sec. at Pass 20]
DE:   #PIs = 189  #Luts =   383  Max Lvl =   7  Avg Lvl =   4.12  [   0.60 sec. at Pass 21]

yosys> opt

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 2024 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.42. Printing statistics.

=== des_top ===

   Number of wires:                412
   Number of wire bits:           1178
   Number of public wires:          29
   Number of public wire bits:     795
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                447
     $_DFF_P_                       64
     $lut                          383


yosys> shregmap -minlen 8 -maxlen 20

3.43. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.45. Printing statistics.

=== des_top ===

   Number of wires:                412
   Number of wire bits:           1178
   Number of public wires:          29
   Number of public wire bits:     795
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                447
     $_DFF_P_                       64
     $lut                          383


yosys> techmap -map +/rapidsilicon/genesis/ffs_map.v

3.46. Executing TECHMAP pass (map to technology primitives).

3.46.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.46.2. Continuing TECHMAP pass.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
No more expansions possible.
<suppressed ~131 debug messages>

yosys> techmap -map +/techmap.v

3.47. Executing TECHMAP pass (map to technology primitives).

3.47.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.47.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~454 debug messages>

yosys> opt_expr -mux_undef

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~13002 debug messages>

yosys> simplemap

3.49. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.50. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge

3.51. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~6240 debug messages>
Removed a total of 2080 cells.

yosys> opt_dff -nodffe -nosdff

3.52. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 1233 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.54. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.54.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~547 debug messages>

yosys> opt_merge -nomux

3.54.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~15 debug messages>
Removed a total of 5 cells.

yosys> opt_muxtree

3.54.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.54.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.54.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 161 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.54.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.54.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.54.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.54.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.54.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.54.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.54.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_ywKada/abc_tmp_2.scr

3.55. Executing ABC pass (technology mapping using ABC).

3.55.1. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Extracted 1971 gates and 2162 wires to a netlist network with 189 inputs and 64 outputs.

3.55.1.1. Executing ABC.
DE:   #PIs = 189  #Luts =   385  Max Lvl =   7  Avg Lvl =   4.12  [   0.56 sec. at Pass 0]
DE:   #PIs = 189  #Luts =   385  Max Lvl =   7  Avg Lvl =   4.12  [  17.17 sec. at Pass 1]
DE:   #PIs = 189  #Luts =   385  Max Lvl =   7  Avg Lvl =   4.12  [   3.13 sec. at Pass 2]
DE:   #PIs = 189  #Luts =   385  Max Lvl =   7  Avg Lvl =   4.12  [   7.65 sec. at Pass 3]
DE:   #PIs = 189  #Luts =   385  Max Lvl =   7  Avg Lvl =   4.12  [   3.62 sec. at Pass 4]
DE:   #PIs = 189  #Luts =   385  Max Lvl =   7  Avg Lvl =   4.12  [   7.06 sec. at Pass 5]
DE:   #PIs = 189  #Luts =   385  Max Lvl =   7  Avg Lvl =   4.12  [  25.20 sec. at Pass 6]
DE:   #PIs = 189  #Luts =   385  Max Lvl =   7  Avg Lvl =   4.12  [   0.69 sec. at Pass 7]

yosys> opt

3.56. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.56.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.56.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.56.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.56.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.56.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.56.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.56.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 1329 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.56.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.56.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.56.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.56.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.56.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.56.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.56.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.56.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.56.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.57. Executing HIERARCHY pass (managing design hierarchy).

3.57.1. Analyzing design hierarchy..
Top module:  \des_top

3.57.2. Analyzing design hierarchy..
Top module:  \des_top
Removed 0 unused modules.

yosys> stat

3.58. Printing statistics.

=== des_top ===

   Number of wires:                414
   Number of wire bits:           1180
   Number of public wires:          29
   Number of public wire bits:     795
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                449
     $lut                          385
     dffsre                         64


yosys> opt_clean -purge

3.59. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 23 unused wires.
<suppressed ~23 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.60. Executing Verilog backend.
Dumping module `\des_top'.

Warnings: 2 unique messages, 2 total
End of script. Logfile hash: 5eb9c5ed9a, CPU: user 8.09s system 0.13s, MEM: 50.15 MB peak
Yosys 0.17+103 (git sha1 a1babadd5, gcc 9.1.0 -fPIC -Os)
Time spent: 99% 6x abc (761 sec), 0% 36x opt_expr (3 sec), ...
real 174.00
user 711.94
sys 56.85
