
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.36
 Yosys 0.17+76 (git sha1 ba67c2ec9, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -sv prim_alert_pkg.sv prim_mubi_pkg.sv prim_pad_wrapper_pkg.sv prim_pkg.sv prim_secded_pkg.sv prim_subreg_pkg.sv prim_util_pkg.sv top_pkg.sv tlul_pkg.sv

yosys> verific -sv prim_alert_pkg.sv prim_mubi_pkg.sv prim_pad_wrapper_pkg.sv prim_pkg.sv prim_secded_pkg.sv prim_subreg_pkg.sv prim_util_pkg.sv top_pkg.sv tlul_pkg.sv

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_alert_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_alert_pkg.sv:19: parameter 'ALERT_TX_DEFAULT' declared inside package 'prim_alert_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_alert_pkg.sv:22: parameter 'ALERT_RX_DEFAULT' declared inside package 'prim_alert_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_mubi_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:19: parameter 'MuBi4Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:148: parameter 'MuBi8Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:277: parameter 'MuBi12Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:406: parameter 'MuBi16Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_pad_wrapper_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:24: parameter 'DriveStrDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:25: parameter 'SlewRateDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:39: parameter 'AttrDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:42: parameter 'PokDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_secded_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:81: parameter 'Secded2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:82: parameter 'Secded2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:90: parameter 'Secded2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:91: parameter 'Secded2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:99: parameter 'Secded3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:100: parameter 'Secded3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:108: parameter 'Secded6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:109: parameter 'Secded6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:117: parameter 'Secded7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:118: parameter 'Secded7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:126: parameter 'SecdedHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:127: parameter 'SecdedHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:135: parameter 'SecdedHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:136: parameter 'SecdedHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:144: parameter 'SecdedHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:145: parameter 'SecdedHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:153: parameter 'SecdedHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:154: parameter 'SecdedHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:162: parameter 'SecdedInv2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:163: parameter 'SecdedInv2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:171: parameter 'SecdedInv2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:172: parameter 'SecdedInv2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:180: parameter 'SecdedInv3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:181: parameter 'SecdedInv3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:189: parameter 'SecdedInv6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:190: parameter 'SecdedInv6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:198: parameter 'SecdedInv7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:199: parameter 'SecdedInv7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:207: parameter 'SecdedInvHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:208: parameter 'SecdedInvHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:216: parameter 'SecdedInvHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:217: parameter 'SecdedInvHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:225: parameter 'SecdedInvHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:226: parameter 'SecdedInvHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:234: parameter 'SecdedInvHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:235: parameter 'SecdedInvHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_subreg_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_util_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'top_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_pkg.sv'
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:14: parameter 'ArbiterImpl' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:27: parameter 'H2DCmdMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:28: parameter 'H2DCmdIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:29: parameter 'H2DCmdFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:30: parameter 'D2HRspMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:31: parameter 'D2HRspIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:32: parameter 'D2HRspFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:33: parameter 'DataMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:34: parameter 'DataIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:35: parameter 'DataFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:44: parameter 'TL_A_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:84: parameter 'TL_D_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam

yosys> read -vlog2k IOBUF.v

yosys> verific -vlog2k IOBUF.v

3. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IOBUF.v'

yosys> read -sv prim_xilinx_pad_wrapper.sv

yosys> verific -sv prim_xilinx_pad_wrapper.sv

4. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_xilinx_pad_wrapper.sv'

yosys> synth_rs -top prim_xilinx_pad_wrapper -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

5. Executing synth_rs pass: v0.4.52

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

5.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

5.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top prim_xilinx_pad_wrapper

5.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] prim_xilinx_pad_wrapper.sv:9: compiling module 'prim_xilinx_pad_wrapper'
VERIFIC-INFO [VERI-1018] IOBUF.v:42: compiling module 'IOBUF'
VERIFIC-WARNING [VERI-1166] IOBUF.v:72: case condition never applies
Importing module prim_xilinx_pad_wrapper.
Importing module IOBUF.

5.3.1. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper
Used module:     \IOBUF

5.3.2. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper
Used module:     \IOBUF
Removed 0 unused modules.

yosys> proc

5.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

5.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

5.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

5.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

5.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

5.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

5.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

5.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

5.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

5.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

5.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

5.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

5.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module IOBUF.
<suppressed ~1 debug messages>
Optimizing module prim_xilinx_pad_wrapper.

yosys> flatten

5.5. Executing FLATTEN pass (flatten design).
Deleting now unused module IOBUF.
<suppressed ~1 debug messages>

yosys> tribuf -logic

5.6. Executing TRIBUF pass.

yosys> deminout

5.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

5.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_clean

5.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 2 unused cells and 12 unused wires.
<suppressed ~11 debug messages>

yosys> check

5.10. Executing CHECK pass (checking for obvious problems).
Checking module prim_xilinx_pad_wrapper...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

5.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

5.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

5.11.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.11.9. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

5.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

5.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

5.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

5.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

5.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> fsm_opt

5.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

5.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

5.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

5.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

5.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -sat

5.13.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.13.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

5.14. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

5.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

5.16. Executing PMUXTREE pass.

yosys> opt_clean

5.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> alumacc

5.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module prim_xilinx_pad_wrapper:
  created 0 $alu and 0 $macc cells.

yosys> opt

5.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> stat

5.20. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 30
   Number of wire bits:             41
   Number of public wires:          27
   Number of public wire bits:      38
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  8
     $and                            1
     $not                            2
     $or                             1
     $tribuf                         2
     $xor                            2


yosys> memory -nomap

5.21. Executing MEMORY pass.

yosys> opt_mem

5.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

5.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

5.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

5.21.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

5.21.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

5.21.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> memory_share

5.21.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

5.21.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

5.21.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> memory_collect

5.21.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

5.22. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 30
   Number of wire bits:             41
   Number of public wires:          27
   Number of public wire bits:      38
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  8
     $and                            1
     $not                            2
     $or                             1
     $tribuf                         2
     $xor                            2


yosys> opt_clean

5.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> stat

5.24. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 30
   Number of wire bits:             41
   Number of public wires:          27
   Number of public wire bits:      38
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  8
     $and                            1
     $not                            2
     $or                             1
     $tribuf                         2
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

5.25. Executing TECHMAP pass (map to technology primitives).

5.25.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

5.25.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

5.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $tribuf.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~79 debug messages>

yosys> stat

5.26. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 30
   Number of wire bits:             41
   Number of public wires:          27
   Number of public wire bits:      38
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  8
     $_AND_                          1
     $_NOT_                          2
     $_OR_                           1
     $_TBUF_                         2
     $_XOR_                          2


yosys> opt

5.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.27.9. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

5.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

5.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge

5.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

5.28.5. Finished fast OPT passes.

yosys> memory_map

5.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

5.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

5.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

5.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

5.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr -full

5.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.30.10. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

5.31. Executing TECHMAP pass (map to technology primitives).

5.31.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

5.31.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt -sat

5.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -sat

5.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.32.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

5.33. Executing ABC pass (technology mapping using ABC).

5.33.1. Summary of detected clock domains:
  8 cells in clk={ }, en={ }, arst={ }, srst={ }

5.33.2. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 6 gates and 11 wires to a netlist network with 5 inputs and 3 outputs.

5.33.2.1. Executing ABC.

yosys> abc -dff

5.34. Executing ABC pass (technology mapping using ABC).

5.34.1. Summary of detected clock domains:
  6 cells in clk={ }, en={ }, arst={ }, srst={ }

5.34.2. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 3 outputs.

5.34.2.1. Executing ABC.

yosys> abc -dff

5.35. Executing ABC pass (technology mapping using ABC).

5.35.1. Summary of detected clock domains:
  6 cells in clk={ }, en={ }, arst={ }, srst={ }

5.35.2. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 3 outputs.

5.35.2.1. Executing ABC.

yosys> abc -dff

5.36. Executing ABC pass (technology mapping using ABC).

5.36.1. Summary of detected clock domains:
  6 cells in clk={ }, en={ }, arst={ }, srst={ }

5.36.2. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 3 outputs.

5.36.2.1. Executing ABC.

yosys> opt_ffinv

5.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

5.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -sat

5.38.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 37 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

5.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

5.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -sat

5.38.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.38.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_TJY4cz/abc_tmp_1.scr

5.39. Executing ABC pass (technology mapping using ABC).

5.39.1. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 3 outputs.

5.39.1.1. Executing ABC.
DE:   #PIs =   5  #Luts =     3  Max Lvl =   2  Avg Lvl =   1.33  [   0.07 sec. at Pass 0]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   0.40 sec. at Pass 1]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   0.14 sec. at Pass 2]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   0.15 sec. at Pass 3]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   0.17 sec. at Pass 4]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   0.51 sec. at Pass 5]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   1.10 sec. at Pass 6]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   1.60 sec. at Pass 7]

yosys> opt

5.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 9 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

5.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

5.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

5.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

5.42. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 28
   Number of wire bits:             39
   Number of public wires:          27
   Number of public wire bits:      38
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  5
     $_TBUF_                         2
     $lut                            3


yosys> shregmap -minlen 8 -maxlen 20

5.43. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

5.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

5.45. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 28
   Number of wire bits:             39
   Number of public wires:          27
   Number of public wire bits:      38
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  5
     $_TBUF_                         2
     $lut                            3


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

5.46. Executing TECHMAP pass (map to technology primitives).

5.46.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

5.46.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

5.46.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~139 debug messages>

yosys> opt_expr -mux_undef

5.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
<suppressed ~11 debug messages>

yosys> simplemap

5.48. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

5.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge

5.50. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_dff -nodffe -nosdff

5.51. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.52. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

5.53. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.53.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.53.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.53.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.53.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.53.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

5.53.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.53.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.53.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.53.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_TJY4cz/abc_tmp_2.scr

5.54. Executing ABC pass (technology mapping using ABC).

5.54.1. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
Extracted 8 gates and 15 wires to a netlist network with 5 inputs and 3 outputs.

5.54.1.1. Executing ABC.
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   0.08 sec. at Pass 0]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   0.13 sec. at Pass 1]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   0.09 sec. at Pass 2]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   0.28 sec. at Pass 3]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   0.11 sec. at Pass 4]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   0.46 sec. at Pass 5]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   1.14 sec. at Pass 6]
DE:   #PIs =   5  #Luts =     3  Max Lvl =   1  Avg Lvl =   1.00  [   1.34 sec. at Pass 7]

yosys> opt

5.55. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.55.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.55.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.55.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.55.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.55.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.55.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.55.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 12 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

5.55.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.55.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

5.55.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.55.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.55.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.55.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.55.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.55.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.55.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

5.56. Executing HIERARCHY pass (managing design hierarchy).

5.56.1. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper

5.56.2. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper
Removed 0 unused modules.

yosys> stat

5.57. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 28
   Number of wire bits:             39
   Number of public wires:          27
   Number of public wire bits:      38
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  5
     $_TBUF_                         2
     $lut                            3


yosys> opt_clean -purge

5.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 8 unused wires.
<suppressed ~8 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

5.59. Executing Verilog backend.

yosys> bmuxmap

5.59.1. Executing BMUXMAP pass.

yosys> demuxmap

5.59.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\prim_xilinx_pad_wrapper'.

Warnings: 59 unique messages, 59 total
End of script. Logfile hash: c5eefe1586, CPU: user 0.53s system 0.04s, MEM: 22.29 MB peak
Yosys 0.17+76 (git sha1 ba67c2ec9, gcc 9.1.0 -fPIC -Os)
Time spent: 99% 6x abc (95 sec), 0% 8x read_verilog (0 sec), ...
real 18.64
user 51.13
sys 45.16
