
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.14+36 (git sha1 4cd3e3b51, gcc 7.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k cf_fir_24_16_16.v

yosys> verific -vlog2k cf_fir_24_16_16.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'cf_fir_24_16_16.v'

yosys> synth_rs -top top -tech genesis -goal area -de -no_dsp -no_bram -verilog top.verilog

3. Executing synth_rs pass.

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dff'.
Generating RTLIL representation for module `\dffn'.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top top

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:92: compiling module 'top'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:127: compiling module 'cf_fir_24_16_16_1'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:166: compiling module 'cf_fir_24_16_16_2'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1793: compiling module 'cf_fir_24_16_16_24'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1898: compiling module 'cf_fir_24_16_16_25'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1982: compiling module 'cf_fir_24_16_16_26'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1170: compiling module 'cf_fir_24_16_16_18'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1324: compiling module 'cf_fir_24_16_16_19'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1458: compiling module 'cf_fir_24_16_16_20'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1572: compiling module 'cf_fir_24_16_16_21'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1666: compiling module 'cf_fir_24_16_16_22'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1740: compiling module 'cf_fir_24_16_16_23'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:276: compiling module 'cf_fir_24_16_16_3'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:745: compiling module 'cf_fir_24_16_16_12'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:842: compiling module 'cf_fir_24_16_16_13'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:929: compiling module 'cf_fir_24_16_16_14'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1006: compiling module 'cf_fir_24_16_16_15'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1073: compiling module 'cf_fir_24_16_16_16'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1130: compiling module 'cf_fir_24_16_16_17'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:344: compiling module 'cf_fir_24_16_16_4'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:581: compiling module 'cf_fir_24_16_16_9'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:648: compiling module 'cf_fir_24_16_16_10'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:705: compiling module 'cf_fir_24_16_16_11'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:394: compiling module 'cf_fir_24_16_16_5'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:534: compiling module 'cf_fir_24_16_16_8'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:437: compiling module 'cf_fir_24_16_16_6'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:494: compiling module 'cf_fir_24_16_16_7'
Importing module top.
Importing module cf_fir_24_16_16_1.
Importing module cf_fir_24_16_16_2.
Importing module cf_fir_24_16_16_24.
Importing module cf_fir_24_16_16_18.
Importing module cf_fir_24_16_16_25.
Importing module cf_fir_24_16_16_26.
Importing module cf_fir_24_16_16_3.
Importing module cf_fir_24_16_16_19.
Importing module cf_fir_24_16_16_20.
Importing module cf_fir_24_16_16_21.
Importing module cf_fir_24_16_16_22.
Importing module cf_fir_24_16_16_23.
Importing module cf_fir_24_16_16_12.
Importing module cf_fir_24_16_16_4.
Importing module cf_fir_24_16_16_13.
Importing module cf_fir_24_16_16_14.
Importing module cf_fir_24_16_16_15.
Importing module cf_fir_24_16_16_16.
Importing module cf_fir_24_16_16_17.
Importing module cf_fir_24_16_16_9.
Importing module cf_fir_24_16_16_5.
Importing module cf_fir_24_16_16_10.
Importing module cf_fir_24_16_16_11.
Importing module cf_fir_24_16_16_8.
Importing module cf_fir_24_16_16_6.
Importing module cf_fir_24_16_16_7.

3.3.1. Analyzing design hierarchy..
Top module:  \top
Used module:     \cf_fir_24_16_16_1
Used module:         \cf_fir_24_16_16_2
Used module:             \cf_fir_24_16_16_3
Used module:                 \cf_fir_24_16_16_4
Used module:                     \cf_fir_24_16_16_5
Used module:                         \cf_fir_24_16_16_6
Used module:                             \cf_fir_24_16_16_7
Used module:                         \cf_fir_24_16_16_8
Used module:                     \cf_fir_24_16_16_9
Used module:                         \cf_fir_24_16_16_10
Used module:                             \cf_fir_24_16_16_11
Used module:                 \cf_fir_24_16_16_12
Used module:                     \cf_fir_24_16_16_13
Used module:                         \cf_fir_24_16_16_14
Used module:                             \cf_fir_24_16_16_15
Used module:                                 \cf_fir_24_16_16_16
Used module:                                     \cf_fir_24_16_16_17
Used module:             \cf_fir_24_16_16_18
Used module:                 \cf_fir_24_16_16_19
Used module:                     \cf_fir_24_16_16_20
Used module:                         \cf_fir_24_16_16_21
Used module:                             \cf_fir_24_16_16_22
Used module:                                 \cf_fir_24_16_16_23
Used module:             \cf_fir_24_16_16_24
Used module:                 \cf_fir_24_16_16_25
Used module:                     \cf_fir_24_16_16_26

3.3.2. Analyzing design hierarchy..
Top module:  \top
Used module:     \cf_fir_24_16_16_1
Used module:         \cf_fir_24_16_16_2
Used module:             \cf_fir_24_16_16_3
Used module:                 \cf_fir_24_16_16_4
Used module:                     \cf_fir_24_16_16_5
Used module:                         \cf_fir_24_16_16_6
Used module:                             \cf_fir_24_16_16_7
Used module:                         \cf_fir_24_16_16_8
Used module:                     \cf_fir_24_16_16_9
Used module:                         \cf_fir_24_16_16_10
Used module:                             \cf_fir_24_16_16_11
Used module:                 \cf_fir_24_16_16_12
Used module:                     \cf_fir_24_16_16_13
Used module:                         \cf_fir_24_16_16_14
Used module:                             \cf_fir_24_16_16_15
Used module:                                 \cf_fir_24_16_16_16
Used module:                                     \cf_fir_24_16_16_17
Used module:             \cf_fir_24_16_16_18
Used module:                 \cf_fir_24_16_16_19
Used module:                     \cf_fir_24_16_16_20
Used module:                         \cf_fir_24_16_16_21
Used module:                             \cf_fir_24_16_16_22
Used module:                                 \cf_fir_24_16_16_23
Used module:             \cf_fir_24_16_16_24
Used module:                 \cf_fir_24_16_16_25
Used module:                     \cf_fir_24_16_16_26
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16_7.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_6.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_8.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_11.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_10.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_5.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_9.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_17.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_16.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_15.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_14.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_13.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_4.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_12.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_23.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_22.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_21.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_20.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_19.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_3.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_26.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_25.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_18.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_24.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_2.
<suppressed ~2 debug messages>
Optimizing module cf_fir_24_16_16_1.
Optimizing module top.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module cf_fir_24_16_16_7.
Deleting now unused module cf_fir_24_16_16_6.
Deleting now unused module cf_fir_24_16_16_8.
Deleting now unused module cf_fir_24_16_16_11.
Deleting now unused module cf_fir_24_16_16_10.
Deleting now unused module cf_fir_24_16_16_5.
Deleting now unused module cf_fir_24_16_16_9.
Deleting now unused module cf_fir_24_16_16_17.
Deleting now unused module cf_fir_24_16_16_16.
Deleting now unused module cf_fir_24_16_16_15.
Deleting now unused module cf_fir_24_16_16_14.
Deleting now unused module cf_fir_24_16_16_13.
Deleting now unused module cf_fir_24_16_16_4.
Deleting now unused module cf_fir_24_16_16_12.
Deleting now unused module cf_fir_24_16_16_23.
Deleting now unused module cf_fir_24_16_16_22.
Deleting now unused module cf_fir_24_16_16_21.
Deleting now unused module cf_fir_24_16_16_20.
Deleting now unused module cf_fir_24_16_16_19.
Deleting now unused module cf_fir_24_16_16_3.
Deleting now unused module cf_fir_24_16_16_26.
Deleting now unused module cf_fir_24_16_16_25.
Deleting now unused module cf_fir_24_16_16_18.
Deleting now unused module cf_fir_24_16_16_24.
Deleting now unused module cf_fir_24_16_16_2.
Deleting now unused module cf_fir_24_16_16_1.
<suppressed ~26 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 3 unused cells and 14661 unused wires.
<suppressed ~437 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module top...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~129 debug messages>

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~25 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$n9_reg$cf_fir_24_16_16.v:527$15599 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$n6_reg$cf_fir_24_16_16.v:527$15598 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n4_reg$cf_fir_24_16_16.v:2037$5674 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$n6_reg$cf_fir_24_16_16.v:481$15386 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$n12_reg$cf_fir_24_16_16.v:481$15387 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n5_reg$cf_fir_24_16_16.v:2037$5675 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n6_reg$cf_fir_24_16_16.v:2037$5676 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$n6_reg$cf_fir_24_16_16.v:571$15350 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$n12_reg$cf_fir_24_16_16.v:571$15351 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n4_reg$cf_fir_24_16_16.v:1872$3762 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n3_reg$cf_fir_24_16_16.v:1872$3761 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n2_reg$cf_fir_24_16_16.v:1872$3760 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n1_reg$cf_fir_24_16_16.v:1872$3759 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.$verific$n6_reg$cf_fir_24_16_16.v:431$14487 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n6_reg$cf_fir_24_16_16.v:1872$3764 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n5_reg$cf_fir_24_16_16.v:1872$3763 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$n9_reg$cf_fir_24_16_16.v:738$15319 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$n6_reg$cf_fir_24_16_16.v:738$15318 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.$verific$n5_reg$cf_fir_24_16_16.v:268$957 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.$verific$n3_reg$cf_fir_24_16_16.v:268$956 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$n6_reg$cf_fir_24_16_16.v:692$15111 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$n12_reg$cf_fir_24_16_16.v:692$15112 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.$verific$n2_reg$cf_fir_24_16_16.v:268$955 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.$verific$n1_reg$cf_fir_24_16_16.v:268$954 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s7.$verific$n6_reg$cf_fir_24_16_16.v:633$14081 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s7.$verific$n12_reg$cf_fir_24_16_16.v:633$14082 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n8_reg$cf_fir_24_16_16.v:2037$5678 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n7_reg$cf_fir_24_16_16.v:2037$5677 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.$verific$n6_reg$cf_fir_24_16_16.v:388$11186 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.\s13.$verific$n9_reg$cf_fir_24_16_16.v:1163$14050 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.\s13.$verific$n6_reg$cf_fir_24_16_16.v:1163$14049 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n1_reg$cf_fir_24_16_16.v:1963$5448 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$n6_reg$cf_fir_24_16_16.v:1117$13847 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$n12_reg$cf_fir_24_16_16.v:1117$13848 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$n6_reg$cf_fir_24_16_16.v:1058$13448 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$n12_reg$cf_fir_24_16_16.v:1058$13449 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n3_reg$cf_fir_24_16_16.v:1963$5450 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n2_reg$cf_fir_24_16_16.v:1963$5449 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n5_reg$cf_fir_24_16_16.v:1963$5452 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n4_reg$cf_fir_24_16_16.v:1963$5451 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$n6_reg$cf_fir_24_16_16.v:989$12853 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$n12_reg$cf_fir_24_16_16.v:989$12854 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.$verific$n6_reg$cf_fir_24_16_16.v:910$12062 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.$verific$n12_reg$cf_fir_24_16_16.v:910$12063 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n7_reg$cf_fir_24_16_16.v:1963$5454 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n6_reg$cf_fir_24_16_16.v:1963$5453 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n2_reg$cf_fir_24_16_16.v:2037$5672 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.$verific$n6_reg$cf_fir_24_16_16.v:821$10203 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.$verific$n12_reg$cf_fir_24_16_16.v:821$10204 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n3_reg$cf_fir_24_16_16.v:2037$5673 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n7_reg$cf_fir_24_16_16.v:1872$3765 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s8.$verific$n6_reg$cf_fir_24_16_16.v:338$5709 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n1_reg$cf_fir_24_16_16.v:2037$5671 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$n8_reg$cf_fir_24_16_16.v:1783$10166 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$n6_reg$cf_fir_24_16_16.v:1783$10165 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$n4_reg$cf_fir_24_16_16.v:1783$10164 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$n2_reg$cf_fir_24_16_16.v:1783$10163 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.$verific$n8_reg$cf_fir_24_16_16.v:1549$8447 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.$verific$n6_reg$cf_fir_24_16_16.v:1549$8446 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$n8_reg$cf_fir_24_16_16.v:1725$9853 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$n6_reg$cf_fir_24_16_16.v:1725$9852 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$n4_reg$cf_fir_24_16_16.v:1725$9851 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$n2_reg$cf_fir_24_16_16.v:1725$9850 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.$verific$n4_reg$cf_fir_24_16_16.v:1549$8445 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.$verific$n2_reg$cf_fir_24_16_16.v:1549$8444 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.$verific$n4_reg$cf_fir_24_16_16.v:1431$7352 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.$verific$n2_reg$cf_fir_24_16_16.v:1431$7351 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.$verific$n8_reg$cf_fir_24_16_16.v:1431$7354 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.$verific$n6_reg$cf_fir_24_16_16.v:1431$7353 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$n8_reg$cf_fir_24_16_16.v:1647$9280 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$n6_reg$cf_fir_24_16_16.v:1647$9279 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$n4_reg$cf_fir_24_16_16.v:1647$9278 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$n2_reg$cf_fir_24_16_16.v:1647$9277 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.$verific$n8_reg$cf_fir_24_16_16.v:1293$4086 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.$verific$n6_reg$cf_fir_24_16_16.v:1293$4085 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.$verific$n4_reg$cf_fir_24_16_16.v:1293$4084 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s3.\s7.$verific$n2_reg$cf_fir_24_16_16.v:1293$4083 ($aldff) from module top.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 129 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~25 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~25 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n8_reg$cf_fir_24_16_16.v:2037$5678 ($dff) from module top (D = \s1.s3.s6.s8.s8.n7, Q = \s1.s3.s6.s8.s8.n8, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n7_reg$cf_fir_24_16_16.v:2037$5677 ($dff) from module top (D = \s1.s3.s6.s8.s8.n6, Q = \s1.s3.s6.s8.s8.n7, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n6_reg$cf_fir_24_16_16.v:2037$5676 ($dff) from module top (D = \s1.s3.s6.s8.s8.n5, Q = \s1.s3.s6.s8.s8.n6, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n5_reg$cf_fir_24_16_16.v:2037$5675 ($dff) from module top (D = \s1.s3.s6.s8.s8.n4, Q = \s1.s3.s6.s8.s8.n5, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n4_reg$cf_fir_24_16_16.v:2037$5674 ($dff) from module top (D = \s1.s3.s6.s8.s8.n3, Q = \s1.s3.s6.s8.s8.n4, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n3_reg$cf_fir_24_16_16.v:2037$5673 ($dff) from module top (D = \s1.s3.s6.s8.s8.n2, Q = \s1.s3.s6.s8.s8.n3, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n2_reg$cf_fir_24_16_16.v:2037$5672 ($dff) from module top (D = \s1.s3.s6.s8.s8.n1, Q = \s1.s3.s6.s8.s8.n2, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n1_reg$cf_fir_24_16_16.v:2037$5671 ($dff) from module top (D = \s1.s3.s6.s8.n7, Q = \s1.s3.s6.s8.s8.n1, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.$verific$n7_reg$cf_fir_24_16_16.v:1963$5454 ($dff) from module top (D = \s1.s3.s6.s8.n6, Q = \s1.s3.s6.s8.n7, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.$verific$n6_reg$cf_fir_24_16_16.v:1963$5453 ($dff) from module top (D = \s1.s3.s6.s8.n5, Q = \s1.s3.s6.s8.n6, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.$verific$n5_reg$cf_fir_24_16_16.v:1963$5452 ($dff) from module top (D = \s1.s3.s6.s8.n4, Q = \s1.s3.s6.s8.n5, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.$verific$n4_reg$cf_fir_24_16_16.v:1963$5451 ($dff) from module top (D = \s1.s3.s6.s8.n3, Q = \s1.s3.s6.s8.n4, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.$verific$n3_reg$cf_fir_24_16_16.v:1963$5450 ($dff) from module top (D = \s1.s3.s6.s8.n2, Q = \s1.s3.s6.s8.n3, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.$verific$n2_reg$cf_fir_24_16_16.v:1963$5449 ($dff) from module top (D = \s1.s3.s6.s8.n1, Q = \s1.s3.s6.s8.n2, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.\s8.$verific$n1_reg$cf_fir_24_16_16.v:1963$5448 ($dff) from module top (D = \s1.s3.s6.n7, Q = \s1.s3.s6.s8.n1, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.$verific$n7_reg$cf_fir_24_16_16.v:1872$3765 ($dff) from module top (D = \s1.s3.s6.n6, Q = \s1.s3.s6.n7, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.$verific$n6_reg$cf_fir_24_16_16.v:1872$3764 ($dff) from module top (D = \s1.s3.s6.n5, Q = \s1.s3.s6.n6, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.$verific$n5_reg$cf_fir_24_16_16.v:1872$3763 ($dff) from module top (D = \s1.s3.s6.n4, Q = \s1.s3.s6.n5, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.$verific$n4_reg$cf_fir_24_16_16.v:1872$3762 ($dff) from module top (D = \s1.s3.s6.n3, Q = \s1.s3.s6.n4, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.$verific$n3_reg$cf_fir_24_16_16.v:1872$3761 ($dff) from module top (D = \s1.s3.s6.n2, Q = \s1.s3.s6.n3, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.$verific$n2_reg$cf_fir_24_16_16.v:1872$3760 ($dff) from module top (D = \s1.s3.s6.n1, Q = \s1.s3.s6.n2, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.\s6.$verific$n1_reg$cf_fir_24_16_16.v:1872$3759 ($dff) from module top (D = \s1.s3.n3, Q = \s1.s3.s6.n1, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.$verific$n3_reg$cf_fir_24_16_16.v:268$956 ($dff) from module top (D = \s1.s3.n2, Q = \s1.s3.n3, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.$verific$n2_reg$cf_fir_24_16_16.v:268$955 ($dff) from module top (D = \s1.s3.n1, Q = \s1.s3.n2, rval = 16'0000000000000000).
Adding SRST signal on $flatten\s1.\s3.$verific$n1_reg$cf_fir_24_16_16.v:268$954 ($dff) from module top (D = \data_i, Q = \s1.s3.n1, rval = 16'0000000000000000).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 25 unused cells and 25 unused wires.
<suppressed ~26 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 34) from FF cell top.$flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$n9_reg$cf_fir_24_16_16.v:738$15319 ($dff).
Removed top 2 bits (of 35) from FF cell top.$flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$n9_reg$cf_fir_24_16_16.v:527$15599 ($dff).
Removed top 1 bits (of 33) from FF cell top.$flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.\s13.$verific$n9_reg$cf_fir_24_16_16.v:1163$14050 ($dff).
Removed top 1 bits (of 33) from FF cell top.$flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$n9_reg$cf_fir_24_16_16.v:738$15319 ($dff).
Removed top 1 bits (of 33) from FF cell top.$flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$n9_reg$cf_fir_24_16_16.v:527$15599 ($dff).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module top:
  creating $macc model for $flatten\s1.\s3.$verific$mult_32$cf_fir_24_16_16.v:269$958 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.$verific$mult_3$cf_fir_24_16_16.v:1274$4068 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.$verific$mult_34$cf_fir_24_16_16.v:1294$4087 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.$verific$mult_36$cf_fir_24_16_16.v:1295$4089 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.$verific$mult_38$cf_fir_24_16_16.v:1296$4091 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.$verific$mult_3$cf_fir_24_16_16.v:1412$7336 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.$verific$mult_34$cf_fir_24_16_16.v:1432$7355 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.$verific$mult_36$cf_fir_24_16_16.v:1433$7357 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.$verific$mult_38$cf_fir_24_16_16.v:1434$7359 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.$verific$mult_3$cf_fir_24_16_16.v:1530$8429 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.$verific$mult_34$cf_fir_24_16_16.v:1550$8448 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.$verific$mult_36$cf_fir_24_16_16.v:1551$8450 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.$verific$mult_38$cf_fir_24_16_16.v:1552$8452 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$mult_3$cf_fir_24_16_16.v:1628$9262 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$mult_34$cf_fir_24_16_16.v:1648$9281 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$mult_36$cf_fir_24_16_16.v:1649$9283 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$mult_38$cf_fir_24_16_16.v:1650$9285 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$mult_3$cf_fir_24_16_16.v:1706$9835 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$mult_34$cf_fir_24_16_16.v:1726$9854 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$mult_36$cf_fir_24_16_16.v:1727$9856 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$mult_38$cf_fir_24_16_16.v:1728$9858 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$mult_3$cf_fir_24_16_16.v:1764$10148 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$mult_34$cf_fir_24_16_16.v:1784$10167 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$mult_36$cf_fir_24_16_16.v:1785$10169 ($mul).
  creating $macc model for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$mult_38$cf_fir_24_16_16.v:1786$10171 ($mul).
  creating $macc model for $flatten\s1.\s3.\s8.$verific$add_7$cf_fir_24_16_16.v:330$5701 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.$verific$add_28$cf_fir_24_16_16.v:826$10209 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:810$10194 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.$verific$add_28$cf_fir_24_16_16.v:915$12068 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.$verific$add_7$cf_fir_24_16_16.v:899$12053 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$add_28$cf_fir_24_16_16.v:994$12859 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:978$12844 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$add_28$cf_fir_24_16_16.v:1063$13454 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1047$13439 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$add_28$cf_fir_24_16_16.v:1122$13853 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1106$13838 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1152$14040 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:380$11178 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s7.$verific$add_28$cf_fir_24_16_16.v:638$14087 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:622$14072 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$add_28$cf_fir_24_16_16.v:697$15117 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$add_7$cf_fir_24_16_16.v:681$15102 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:727$15309 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:423$14479 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$add_28$cf_fir_24_16_16.v:576$15356 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:560$15341 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$add_28$cf_fir_24_16_16.v:486$15392 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:470$15377 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$add_7$cf_fir_24_16_16.v:516$15589 ($add).
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$add_7$cf_fir_24_16_16.v:516$15589.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:470$15377.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$add_28$cf_fir_24_16_16.v:486$15392.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:560$15341.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$add_28$cf_fir_24_16_16.v:576$15356.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:423$14479.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:727$15309.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$add_7$cf_fir_24_16_16.v:681$15102.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$add_28$cf_fir_24_16_16.v:697$15117.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:622$14072.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s7.$verific$add_28$cf_fir_24_16_16.v:638$14087.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:380$11178.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1152$14040.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1106$13838.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$add_28$cf_fir_24_16_16.v:1122$13853.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1047$13439.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$add_28$cf_fir_24_16_16.v:1063$13454.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:978$12844.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$add_28$cf_fir_24_16_16.v:994$12859.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.$verific$add_7$cf_fir_24_16_16.v:899$12053.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.$verific$add_28$cf_fir_24_16_16.v:915$12068.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:810$10194.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.$verific$add_28$cf_fir_24_16_16.v:826$10209.
  creating $alu model for $macc $flatten\s1.\s3.\s8.$verific$add_7$cf_fir_24_16_16.v:330$5701.
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$mult_38$cf_fir_24_16_16.v:1786$10171: $auto$alumacc.cc:365:replace_macc$15629
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$mult_36$cf_fir_24_16_16.v:1785$10169: $auto$alumacc.cc:365:replace_macc$15630
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$mult_34$cf_fir_24_16_16.v:1784$10167: $auto$alumacc.cc:365:replace_macc$15631
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$mult_3$cf_fir_24_16_16.v:1764$10148: $auto$alumacc.cc:365:replace_macc$15632
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$mult_38$cf_fir_24_16_16.v:1728$9858: $auto$alumacc.cc:365:replace_macc$15633
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$mult_36$cf_fir_24_16_16.v:1727$9856: $auto$alumacc.cc:365:replace_macc$15634
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$mult_34$cf_fir_24_16_16.v:1726$9854: $auto$alumacc.cc:365:replace_macc$15635
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$mult_3$cf_fir_24_16_16.v:1706$9835: $auto$alumacc.cc:365:replace_macc$15636
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$mult_38$cf_fir_24_16_16.v:1650$9285: $auto$alumacc.cc:365:replace_macc$15637
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$mult_36$cf_fir_24_16_16.v:1649$9283: $auto$alumacc.cc:365:replace_macc$15638
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$mult_34$cf_fir_24_16_16.v:1648$9281: $auto$alumacc.cc:365:replace_macc$15639
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$mult_3$cf_fir_24_16_16.v:1628$9262: $auto$alumacc.cc:365:replace_macc$15640
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.$verific$mult_38$cf_fir_24_16_16.v:1552$8452: $auto$alumacc.cc:365:replace_macc$15641
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.$verific$mult_36$cf_fir_24_16_16.v:1551$8450: $auto$alumacc.cc:365:replace_macc$15642
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.$verific$mult_34$cf_fir_24_16_16.v:1550$8448: $auto$alumacc.cc:365:replace_macc$15643
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.\s9.$verific$mult_3$cf_fir_24_16_16.v:1530$8429: $auto$alumacc.cc:365:replace_macc$15644
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.$verific$mult_38$cf_fir_24_16_16.v:1434$7359: $auto$alumacc.cc:365:replace_macc$15645
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.$verific$mult_36$cf_fir_24_16_16.v:1433$7357: $auto$alumacc.cc:365:replace_macc$15646
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.$verific$mult_34$cf_fir_24_16_16.v:1432$7355: $auto$alumacc.cc:365:replace_macc$15647
  creating $macc cell for $flatten\s1.\s3.\s7.\s9.$verific$mult_3$cf_fir_24_16_16.v:1412$7336: $auto$alumacc.cc:365:replace_macc$15648
  creating $macc cell for $flatten\s1.\s3.\s7.$verific$mult_38$cf_fir_24_16_16.v:1296$4091: $auto$alumacc.cc:365:replace_macc$15649
  creating $macc cell for $flatten\s1.\s3.\s7.$verific$mult_36$cf_fir_24_16_16.v:1295$4089: $auto$alumacc.cc:365:replace_macc$15650
  creating $macc cell for $flatten\s1.\s3.\s7.$verific$mult_34$cf_fir_24_16_16.v:1294$4087: $auto$alumacc.cc:365:replace_macc$15651
  creating $macc cell for $flatten\s1.\s3.\s7.$verific$mult_3$cf_fir_24_16_16.v:1274$4068: $auto$alumacc.cc:365:replace_macc$15652
  creating $macc cell for $flatten\s1.\s3.$verific$mult_32$cf_fir_24_16_16.v:269$958: $auto$alumacc.cc:365:replace_macc$15653
  creating $alu cell for $flatten\s1.\s3.\s8.$verific$add_7$cf_fir_24_16_16.v:330$5701: $auto$alumacc.cc:485:replace_alu$15654
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.$verific$add_28$cf_fir_24_16_16.v:826$10209: $auto$alumacc.cc:485:replace_alu$15657
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:810$10194: $auto$alumacc.cc:485:replace_alu$15660
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.$verific$add_28$cf_fir_24_16_16.v:915$12068: $auto$alumacc.cc:485:replace_alu$15663
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.$verific$add_7$cf_fir_24_16_16.v:899$12053: $auto$alumacc.cc:485:replace_alu$15666
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$add_28$cf_fir_24_16_16.v:994$12859: $auto$alumacc.cc:485:replace_alu$15669
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:978$12844: $auto$alumacc.cc:485:replace_alu$15672
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$add_28$cf_fir_24_16_16.v:1063$13454: $auto$alumacc.cc:485:replace_alu$15675
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1047$13439: $auto$alumacc.cc:485:replace_alu$15678
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$add_28$cf_fir_24_16_16.v:1122$13853: $auto$alumacc.cc:485:replace_alu$15681
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1106$13838: $auto$alumacc.cc:485:replace_alu$15684
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1152$14040: $auto$alumacc.cc:485:replace_alu$15687
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:380$11178: $auto$alumacc.cc:485:replace_alu$15690
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s7.$verific$add_28$cf_fir_24_16_16.v:638$14087: $auto$alumacc.cc:485:replace_alu$15693
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:622$14072: $auto$alumacc.cc:485:replace_alu$15696
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$add_28$cf_fir_24_16_16.v:697$15117: $auto$alumacc.cc:485:replace_alu$15699
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$add_7$cf_fir_24_16_16.v:681$15102: $auto$alumacc.cc:485:replace_alu$15702
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:727$15309: $auto$alumacc.cc:485:replace_alu$15705
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:423$14479: $auto$alumacc.cc:485:replace_alu$15708
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$add_28$cf_fir_24_16_16.v:576$15356: $auto$alumacc.cc:485:replace_alu$15711
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:560$15341: $auto$alumacc.cc:485:replace_alu$15714
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$add_28$cf_fir_24_16_16.v:486$15392: $auto$alumacc.cc:485:replace_alu$15717
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:470$15377: $auto$alumacc.cc:485:replace_alu$15720
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$add_7$cf_fir_24_16_16.v:516$15589: $auto$alumacc.cc:485:replace_alu$15723
  created 24 $alu and 25 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> techmap

3.22. Executing TECHMAP pass (map to technology primitives).

3.22.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.22.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $sdff.
Using extmapper maccmap for cells of type $macc.
  add \k24_i * \s1.s3.s6.s8.s8.n8 (16x16 bits, unsigned)
Using extmapper simplemap for cells of type $dff.
Using template $paramod$cc6a978c1b57cdb49efcec348c88d8e28bf1a01f\_90_alu for cells of type $alu.
  add \k0_i * \s1.s3.n1 (16x16 bits, unsigned)
Using template $paramod$dbef6e48cd28208af1b77a9bd7dfc80580f16131\_90_alu for cells of type $alu.
Using template $paramod$7fa6970f0c97644a990ba1d0dcc56c6042128be7\_90_alu for cells of type $alu.
Using template $paramod$46bb7404051772a584cf91a8bfdc4832ffc1d8ba\_90_alu for cells of type $alu.
Using template $paramod$9fb24bf0faa43f804d3c379242188667e42c235c\_90_alu for cells of type $alu.
  add \k5_i * \s1.s3.s6.n3 (16x16 bits, unsigned)
  add \k6_i * \s1.s3.s6.n4 (16x16 bits, unsigned)
  add \k7_i * \s1.s3.s6.n5 (16x16 bits, unsigned)
  add \k8_i * \s1.s3.s6.n6 (16x16 bits, unsigned)
  add \k13_i * \s1.s3.s6.s8.n4 (16x16 bits, unsigned)
  add \k14_i * \s1.s3.s6.s8.n5 (16x16 bits, unsigned)
  add \k15_i * \s1.s3.s6.s8.n6 (16x16 bits, unsigned)
  add \k16_i * \s1.s3.s6.s8.n7 (16x16 bits, unsigned)
  add \k21_i * \s1.s3.s6.s8.s8.n5 (16x16 bits, unsigned)
  add \k22_i * \s1.s3.s6.s8.s8.n6 (16x16 bits, unsigned)
  add \k23_i * \s1.s3.s6.s8.s8.n7 (16x16 bits, unsigned)
  add \k20_i * \s1.s3.s6.s8.s8.n4 (16x16 bits, unsigned)
  add \k19_i * \s1.s3.s6.s8.s8.n3 (16x16 bits, unsigned)
  add \k18_i * \s1.s3.s6.s8.s8.n2 (16x16 bits, unsigned)
  add \k17_i * \s1.s3.s6.s8.s8.n1 (16x16 bits, unsigned)
  add \k12_i * \s1.s3.s6.s8.n3 (16x16 bits, unsigned)
  add \k11_i * \s1.s3.s6.s8.n2 (16x16 bits, unsigned)
  add \k10_i * \s1.s3.s6.s8.n1 (16x16 bits, unsigned)
  add \k9_i * \s1.s3.s6.n7 (16x16 bits, unsigned)
  add \k4_i * \s1.s3.s6.n2 (16x16 bits, unsigned)
  add \k3_i * \s1.s3.s6.n1 (16x16 bits, unsigned)
  add \k2_i * \s1.s3.n3 (16x16 bits, unsigned)
  add \k1_i * \s1.s3.n2 (16x16 bits, unsigned)
Using extmapper simplemap for cells of type $and.
Using template $paramod\_90_fa\WIDTH=32'00000000000000000000000000100000 for cells of type $fa.
Using template $paramod$fbc7873bff55778c0b3173955b7e4bce1d9d6834\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100001 for cells of type $lcu.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100100 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100011 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100000 for cells of type $lcu.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~11468 debug messages>

yosys> opt

3.23. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.23.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~36671 debug messages>

yosys> opt_merge -nomux

3.23.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~225 debug messages>
Removed a total of 75 cells.

yosys> opt_muxtree

3.23.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.23.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.23.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.23.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 2066 unused cells and 5286 unused wires.
<suppressed ~2067 debug messages>

yosys> opt_expr

3.23.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.23.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.23.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.23.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.23.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.23.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.23.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.23.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.24. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.24.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.24.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.24.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

3.24.5. Finished fast OPT passes.

yosys> memory_map

3.25. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.26.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.26.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.26.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.26.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.26.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr -full

3.26.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.26.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.27. Executing ABC pass (technology mapping using ABC).

3.27.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 45211 gates and 47588 wires to a netlist network with 2377 inputs and 1614 outputs.

3.27.1.1. Executing ABC.
Running ABC command: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/result_23-03-2022T14-57-36/All_lut_synth_rs_ade.json/cf_fir_24_16_16/abc_tmp.scr 
ABC:   #Luts = 16689  Max Lvl =  15  Avg Lvl =   8.30  [   7.44 sec. at Pass 0]
ABC:   #Luts = 12109  Max Lvl =  25  Avg Lvl =  10.62  [ 351.93 sec. at Pass 1]
ABC:   #Luts = 11935  Max Lvl =  22  Avg Lvl =  10.37  [  86.17 sec. at Pass 2]
ABC:   #Luts = 11893  Max Lvl =  22  Avg Lvl =  10.15  [ 222.96 sec. at Pass 3]
ABC:   #Luts = 11780  Max Lvl =  22  Avg Lvl =  10.13  [ 101.43 sec. at Pass 4]
ABC:   #Luts = 11780  Max Lvl =  22  Avg Lvl =  10.13  [ 168.63 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.27.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:    11780
ABC RESULTS:        internal signals:    43597
ABC RESULTS:           input signals:     2377
ABC RESULTS:          output signals:     1614
Removing temp directory.

yosys> opt

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 11195 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.28.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.28.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.28.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.28.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.28.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.28.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.28.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.29. Printing statistics.

=== top ===

   Number of wires:              11274
   Number of wire bits:          36252
   Number of public wires:        1110
   Number of public wire bits:   26088
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              13888
     $_DFF_P_                     1710
     $_SDFF_PP0_                   400
     $lut                        11778


yosys> shregmap -minlen 8 -maxlen 20

3.30. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.31. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.32. Printing statistics.

=== top ===

   Number of wires:              11674
   Number of wire bits:          36652
   Number of public wires:        1110
   Number of public wire bits:   26088
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              14288
     $_DFF_P_                     2110
     $_MUX_                        400
     $lut                        11778


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.33. Executing TECHMAP pass (map to technology primitives).

3.33.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.33.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Successfully finished Verilog frontend.

3.33.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
No more expansions possible.
<suppressed ~14016 debug messages>

yosys> opt_expr -mux_undef

3.34. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~254534 debug messages>

yosys> simplemap

3.35. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~364083 debug messages>
Removed a total of 121361 cells.

yosys> opt_dff -nodffe -nosdff

3.38. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 27113 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~8331 debug messages>

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~207 debug messages>
Removed a total of 69 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.41. Executing ABC pass (technology mapping using ABC).

3.41.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 88931 gates and 91327 wires to a netlist network with 2394 inputs and 2014 outputs.

3.41.1.1. Executing ABC.
Running ABC command: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/result_23-03-2022T14-57-36/All_lut_synth_rs_ade.json/cf_fir_24_16_16/abc_tmp.scr 
ABC:   #Luts = 12265  Max Lvl =  23  Avg Lvl =   8.38  [   7.61 sec. at Pass 0]
ABC:   #Luts = 12256  Max Lvl =  20  Avg Lvl =   8.26  [ 210.41 sec. at Pass 1]
ABC:   #Luts = 12187  Max Lvl =  21  Avg Lvl =   8.26  [  42.31 sec. at Pass 2]
ABC:   #Luts = 12187  Max Lvl =  21  Avg Lvl =   8.26  [  67.56 sec. at Pass 3]
ABC:   #Luts = 12094  Max Lvl =  24  Avg Lvl =   8.30  [  39.20 sec. at Pass 4]
ABC:   #Luts = 12094  Max Lvl =  24  Avg Lvl =   8.30  [ 292.34 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.41.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:    12094
ABC RESULTS:        internal signals:    86919
ABC RESULTS:           input signals:     2394
ABC RESULTS:          output signals:     2014
Removing temp directory.

yosys> opt

3.42. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.42.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.42.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.42.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.42.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.42.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 52169 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.42.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.42.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.42.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.42.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.42.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.42.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.42.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.43. Executing HIERARCHY pass (managing design hierarchy).

3.43.1. Analyzing design hierarchy..
Top module:  \top

3.43.2. Analyzing design hierarchy..
Top module:  \top
Removed 0 unused modules.

yosys> stat

3.44. Printing statistics.

=== top ===

   Number of wires:              11590
   Number of wire bits:          36568
   Number of public wires:        1110
   Number of public wire bits:   26088
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              14204
     $lut                        12094
     dff                          2110


yosys> opt_clean -purge

3.45. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 905 unused wires.
<suppressed ~905 debug messages>

yosys> write_verilog -noattr -nohex top.verilog

3.46. Executing Verilog backend.

yosys> bmuxmap

3.46.1. Executing BMUXMAP pass.

yosys> demuxmap

3.46.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\top'.

End of script. Logfile hash: 12c2c08ec5, CPU: user 208.89s system 5.22s, MEM: 886.07 MB peak
Yosys 0.14+36 (git sha1 4cd3e3b51, gcc 7.1.0 -fPIC -Os)
Time spent: 95% 2x abc (4597 sec), 1% 39x opt_expr (94 sec), ...
real 1892.14
user 4642.25
sys 165.77
