
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.140
 Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k i2cSlaveTop.v IR_Emitter_Modulator.v IR_Emitter_Registers.v r1024x9_1024x9.v IR_Emitter_Interface.v IR_Remote.v i2cSlave.v IR_Emitter_Carrier_Generator.v i2cSlaveSerialInterface.v

yosys> verific -vlog2k i2cSlaveTop.v IR_Emitter_Modulator.v IR_Emitter_Registers.v r1024x9_1024x9.v IR_Emitter_Interface.v IR_Remote.v i2cSlave.v IR_Emitter_Carrier_Generator.v i2cSlaveSerialInterface.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'i2cSlaveTop.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Emitter_Modulator.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Emitter_Registers.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'r1024x9_1024x9.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Emitter_Interface.v'
VERIFIC-INFO [VERI-2561] IR_Emitter_Interface.v:263: undeclared symbol 'IR_Emitter_MemRd_Stb', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Remote.v'
VERIFIC-WARNING [VERI-1407] IR_Remote.v:125: attribute target identifier 'hierarchy' not found in this scope
VERIFIC-WARNING [VERI-1407] IR_Remote.v:124: attribute target identifier 'ql_pack' not found in this scope
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'i2cSlave.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IR_Emitter_Carrier_Generator.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'i2cSlaveSerialInterface.v'

yosys> synth_rs -top top -tech genesis2 -goal area -de -verilog synthesized.v

3. Executing synth_rs pass: v0.4.116

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis2/cells_sim.v +/rapidsilicon/genesis2/dsp_sim.v +/rapidsilicon/genesis2/brams_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dff'.
Generating RTLIL representation for module `\dffn'.
Generating RTLIL representation for module `\sdff'.
Generating RTLIL representation for module `\sdffn'.
Generating RTLIL representation for module `\dffr'.
Generating RTLIL representation for module `\dffnr'.
Generating RTLIL representation for module `\dffe'.
Generating RTLIL representation for module `\dffne'.
Generating RTLIL representation for module `\sdffre'.
Generating RTLIL representation for module `\sdffnre'.
Generating RTLIL representation for module `\dffre'.
Generating RTLIL representation for module `\dffnre'.
Generating RTLIL representation for module `\latch'.
Generating RTLIL representation for module `\latchn'.
Generating RTLIL representation for module `\latchr'.
Generating RTLIL representation for module `\latchnr'.
Generating RTLIL representation for module `\fa_1bit'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP'.
Generating RTLIL representation for module `\RS_DSP_MULT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Successfully finished Verilog frontend.

3.4. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v' to AST representation.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\RS_TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top top

3.5. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] IR_Remote.v:29: compiling module 'top'
VERIFIC-INFO [VERI-1018] i2cSlaveTop.v:47: compiling module 'i2cSlaveTop(I2C_ADDRESS=7'b0101010)'
VERIFIC-INFO [VERI-1018] i2cSlave.v:48: compiling module 'i2cSlave(I2C_ADDRESS=7'b0101010)'
VERIFIC-INFO [VERI-1018] i2cSlaveSerialInterface.v:58: compiling module 'i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010)'
VERIFIC-INFO [VERI-1018] IR_Emitter_Interface.v:29: compiling module 'IR_Emitter_Interface'
VERIFIC-INFO [VERI-1018] IR_Emitter_Carrier_Generator.v:32: compiling module 'IR_Emitter_Carrier_Generator'
VERIFIC-WARNING [VERI-1209] IR_Emitter_Carrier_Generator.v:236: expression size 32 truncated to fit in target size 8
VERIFIC-WARNING [VERI-1209] IR_Emitter_Carrier_Generator.v:264: expression size 32 truncated to fit in target size 8
VERIFIC-WARNING [VERI-1209] IR_Emitter_Carrier_Generator.v:438: expression size 32 truncated to fit in target size 8
VERIFIC-WARNING [VERI-1209] IR_Emitter_Carrier_Generator.v:466: expression size 32 truncated to fit in target size 8
VERIFIC-INFO [VERI-1018] IR_Emitter_Modulator.v:32: compiling module 'IR_Emitter_Modulator'
VERIFIC-WARNING [VERI-1209] IR_Emitter_Modulator.v:478: expression size 14 truncated to fit in target size 13
VERIFIC-WARNING [VERI-1209] IR_Emitter_Modulator.v:508: expression size 32 truncated to fit in target size 16
VERIFIC-INFO [VERI-1018] IR_Emitter_Registers.v:31: compiling module 'IR_Emitter_Registers'
VERIFIC-INFO [VERI-1018] r1024x9_1024x9.v:17: compiling module 'r1024x9_1024x9'
VERIFIC-WARNING [VERI-1209] r1024x9_1024x9.v:40: expression size 22 truncated to fit in target size 9
Importing module top.
Importing module IR_Emitter_Interface.
Importing module IR_Emitter_Carrier_Generator.
Importing module IR_Emitter_Modulator.
Importing module IR_Emitter_Registers.
Importing module i2cSlaveTop(I2C_ADDRESS=7'b0101010).
Importing module i2cSlave(I2C_ADDRESS=7'b0101010).
Importing module i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010).
Importing module r1024x9_1024x9.

3.5.1. Analyzing design hierarchy..
Top module:  \top
Used module:     \IR_Emitter_Interface
Used module:         \r1024x9_1024x9
Used module:         \IR_Emitter_Registers
Used module:         \IR_Emitter_Modulator
Used module:         \IR_Emitter_Carrier_Generator
Used module:     \i2cSlaveTop(I2C_ADDRESS=7'b0101010)
Used module:         \i2cSlave(I2C_ADDRESS=7'b0101010)
Used module:             \i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010)

3.5.2. Analyzing design hierarchy..
Top module:  \top
Used module:     \IR_Emitter_Interface
Used module:         \r1024x9_1024x9
Used module:         \IR_Emitter_Registers
Used module:         \IR_Emitter_Modulator
Used module:         \IR_Emitter_Carrier_Generator
Used module:     \i2cSlaveTop(I2C_ADDRESS=7'b0101010)
Used module:         \i2cSlave(I2C_ADDRESS=7'b0101010)
Used module:             \i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010)
Removed 0 unused modules.

yosys> proc

3.6. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.6.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.6.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.6.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.6.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.6.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.6.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.6.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.6.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.6.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.6.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.6.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.6.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module r1024x9_1024x9.
Optimizing module i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010).
<suppressed ~20 debug messages>
Optimizing module i2cSlave(I2C_ADDRESS=7'b0101010).
<suppressed ~3 debug messages>
Optimizing module i2cSlaveTop(I2C_ADDRESS=7'b0101010).
Optimizing module IR_Emitter_Registers.
<suppressed ~7 debug messages>
Optimizing module IR_Emitter_Modulator.
<suppressed ~8 debug messages>
Optimizing module IR_Emitter_Carrier_Generator.
<suppressed ~11 debug messages>
Optimizing module IR_Emitter_Interface.
<suppressed ~3 debug messages>
Optimizing module top.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module IR_Emitter_Carrier_Generator.
Deleting now unused module IR_Emitter_Interface.
Deleting now unused module IR_Emitter_Modulator.
Deleting now unused module IR_Emitter_Registers.
Deleting now unused module i2cSlave(I2C_ADDRESS=7'b0101010).
Deleting now unused module i2cSlaveSerialInterface(I2C_ADDRESS=7'b0101010).
Deleting now unused module i2cSlaveTop(I2C_ADDRESS=7'b0101010).
Deleting now unused module r1024x9_1024x9.
<suppressed ~15 debug messages>

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).
Demoting inout port top.CpuScl to input.
Demoting inout port top.CpuSda to output.
Demoting inout port top.IR_Emitter_Gpio_Port_io to output.

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~32 debug messages>

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1061 unused wires.
<suppressed ~181 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module top...
Found and reported 0 problems.

yosys> opt_expr

3.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~57 debug messages>

yosys> opt_merge -nomux

3.16. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~126 debug messages>

yosys> opt_reduce

3.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$Select_125$IR_Emitter_Carrier_Generator.v:383$955: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n318$807 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n326$812 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$select_122$IR_Emitter_Carrier_Generator.v:383$952: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n319$808 $auto$opt_reduce.cc:134:opt_pmux$1885 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$select_140$IR_Emitter_Carrier_Generator.v:409$962: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n203$787 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n347$816 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$Select_153$IR_Emitter_Modulator.v:442$1140: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n296$1022 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n298$1024 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$select_143$IR_Emitter_Modulator.v:442$1136: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n296$1022 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n298$1024 }
    New ctrl vector for $pmux cell $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$select_80$IR_Emitter_Registers.v:312$1323: { $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n207$1210 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n208$1211 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n209$1212 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n6$1184 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n9$1186 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n12$1188 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n15$1190 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n18$1192 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n21$1194 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n24$1196 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n27$1198 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n30$1200 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n33$1202 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n36$1204 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n39$1206 $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n42$1208 }
    New ctrl vector for $pmux cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$Select_235$i2cSlaveSerialInterface.v:474$1852: { $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n956$1585 $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n957$1586 }
    New ctrl vector for $pmux cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$select_79$i2cSlaveSerialInterface.v:309$1757: { $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n323$1564 $auto$opt_reduce.cc:134:opt_pmux$1887 }
    New ctrl vector for $pmux cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$select_81$i2cSlaveSerialInterface.v:309$1758: $auto$opt_reduce.cc:134:opt_pmux$1889
    New ctrl vector for $pmux cell $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$select_94$i2cSlaveSerialInterface.v:322$1759: $auto$opt_reduce.cc:134:opt_pmux$1891
  Optimizing cells in module \top.
Performed a total of 12 changes.

yosys> opt_merge

3.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_share

3.20. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.21. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$txData_reg$i2cSlaveSerialInterface.v:449$1839 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$streamSt_reg$i2cSlaveSerialInterface.v:449$1838 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$rxData_reg$i2cSlaveSerialInterface.v:449$1840 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$regAddr_reg$i2cSlaveSerialInterface.v:449$1842 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$dataOut_reg$i2cSlaveSerialInterface.v:449$1836 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$bitCnt_reg$i2cSlaveSerialInterface.v:449$1841 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$CurrState_SISt_reg$i2cSlaveSerialInterface.v:424$1815 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$startStopDetState_reg$i2cSlave.v:245$1508 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaPipe_reg$i2cSlave.v:191$1482 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaDelayed_reg$i2cSlave.v:214$1491 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclPipe_reg$i2cSlave.v:191$1484 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclDelayed_reg$i2cSlave.v:214$1490 ($aldff) from module top.
Removing never-active async load on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$rstPipe_reg$i2cSlave.v:158$1464 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.$verific$RegRd_En_i_1ff_reg$IR_Emitter_Interface.v:324$185 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.$verific$RegAddr_i_1ff_reg$IR_Emitter_Interface.v:324$186 ($aldff) from module top.
Removing never-active async load on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$RegData_o_reg$IR_Emitter_Registers.v:408$1365 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$RegAddr_i_1ff_reg$IR_Emitter_Registers.v:408$1364 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_LED_Gpio_o_reg$IR_Emitter_Registers.v:408$1374 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_LED_Gpio_Polarity_o_reg$IR_Emitter_Registers.v:408$1373 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Run_Modulator_o_reg$IR_Emitter_Registers.v:408$1366 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Mode_Modulator_o_reg$IR_Emitter_Registers.v:408$1367 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Stop_o_reg$IR_Emitter_Registers.v:408$1371 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Start_o_reg$IR_Emitter_Registers.v:408$1370 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemAddr_Reg_o_reg$IR_Emitter_Registers.v:408$1372 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Interrupt_reg$IR_Emitter_Registers.v:408$1378 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Interrupt_Enable_reg$IR_Emitter_Registers.v:408$1379 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Gpio_Port_o_reg$IR_Emitter_Registers.v:408$1375 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Gpio_Dir_o_reg$IR_Emitter_Registers.v:408$1376 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Duty_Len_o_reg$IR_Emitter_Registers.v:408$1369 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Cycle_Len_o_reg$IR_Emitter_Registers.v:408$1368 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Busy_Modulator_i_1ff_reg$IR_Emitter_Registers.v:408$1377 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_LED_En_o_reg$IR_Emitter_Modulator.v:260$1113 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_tc_reg$IR_Emitter_Modulator.v:260$1109 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_reg$IR_Emitter_Modulator.v:260$1106 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_ld_upr_reg$IR_Emitter_Modulator.v:260$1108 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_ld_lwr_reg$IR_Emitter_Modulator.v:260$1107 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_Signal_reg$IR_Emitter_Modulator.v:260$1112 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Modulator_State_reg$IR_Emitter_Modulator.v:260$1114 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemData_lwr_reg$IR_Emitter_Modulator.v:260$1110 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_tc_upr_reg$IR_Emitter_Modulator.v:260$1105 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_tc_lwr_reg$IR_Emitter_Modulator.v:260$1104 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_reg$IR_Emitter_Modulator.v:260$1101 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_ld_reg$IR_Emitter_Modulator.v:260$1103 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_ce_reg$IR_Emitter_Modulator.v:260$1102 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Carrier_Enable_o_reg$IR_Emitter_Modulator.v:260$1099 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Busy_Modulator_o_reg$IR_Emitter_Modulator.v:260$1100 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Signal_o_reg$IR_Emitter_Carrier_Generator.v:216$910 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_ld_tc_reg$IR_Emitter_Carrier_Generator.v:216$908 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$907 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_cntr_ld_reg$IR_Emitter_Carrier_Generator.v:216$906 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_State_reg$IR_Emitter_Carrier_Generator.v:216$909 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_1_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$905 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_1_cntr_reg$IR_Emitter_Carrier_Generator.v:216$904 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_0_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$903 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_0_cntr_reg$IR_Emitter_Carrier_Generator.v:216$902 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_Enable_o_reg$IR_Emitter_Carrier_Generator.v:216$901 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_1_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$900 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_1_cntr_reg$IR_Emitter_Carrier_Generator.v:216$899 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_0_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$898 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_0_cntr_reg$IR_Emitter_Carrier_Generator.v:216$897 ($aldff) from module top.

yosys> opt_clean

3.22. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 9 unused cells and 17 unused wires.
<suppressed ~10 debug messages>

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_muxtree

3.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~128 debug messages>

yosys> opt_reduce

3.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.27. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.28. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.29. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.30. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 2

yosys> fsm -encoding binary

3.31. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.31.1. Executing FSM_DETECT pass (finding FSMs in design).
Found FSM state register top.u_i2cSlaveTop.u_i2cSlave.startStopDetState.

yosys> fsm_extract

3.31.2. Executing FSM_EXTRACT pass (extracting FSM from design).
Extracting FSM `\u_i2cSlaveTop.u_i2cSlave.startStopDetState' from module `\top'.
  found $dff cell for state register: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$startStopDetState_reg$i2cSlave.v:245$1508
  root of input selection tree: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n176$1457
  found reset state: 2'00 (guessed from mux tree)
  found ctrl input: \u_i2cSlaveTop.u_i2cSlave.rstPipe [1]
  found ctrl input: \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet
  found ctrl input: \u_i2cSlaveTop.u_i2cSlave.sclDeb
  found ctrl input: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n154$1431
  found ctrl input: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n160$1432
  found state code: 2'01
  found state code: 2'10
  found state code: 2'00
  found ctrl output: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n291$1559
  found ctrl output: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n323$1564
  found ctrl output: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n324$1565
  ctrl inputs: { \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n154$1431 $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n160$1432 \u_i2cSlaveTop.u_i2cSlave.rstPipe [1] \u_i2cSlaveTop.u_i2cSlave.sclDeb }
  ctrl outputs: { $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n324$1565 $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n323$1564 $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n291$1559 $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n176$1457 }
  transition:       2'00 5'0--00 ->       2'00 5'01000
  transition:       2'00 5'00001 ->       2'00 5'01000
  transition:       2'00 5'00101 ->       2'01 5'01001
  transition:       2'00 5'01-01 ->       2'10 5'01010
  transition:       2'00 5'1--0- ->       2'00 5'01000
  transition:       2'00 5'---1- ->       2'00 5'01000
  transition:       2'10 5'0--00 ->       2'10 5'00110
  transition:       2'10 5'00001 ->       2'10 5'00110
  transition:       2'10 5'00101 ->       2'01 5'00101
  transition:       2'10 5'01-01 ->       2'10 5'00110
  transition:       2'10 5'1--0- ->       2'00 5'00100
  transition:       2'10 5'---1- ->       2'00 5'00100
  transition:       2'01 5'0--00 ->       2'01 5'10001
  transition:       2'01 5'00001 ->       2'01 5'10001
  transition:       2'01 5'00101 ->       2'01 5'10001
  transition:       2'01 5'01-01 ->       2'10 5'10010
  transition:       2'01 5'1--0- ->       2'00 5'10000
  transition:       2'01 5'---1- ->       2'00 5'10000

yosys> fsm_opt

3.31.3. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$1892' from module `\top'.
  Merging pattern 5'00001 and 5'00101 from group (2 2 5'10001).
  Merging pattern 5'00101 and 5'00001 from group (2 2 5'10001).

yosys> opt_clean

3.31.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 9 unused cells and 10 unused wires.
<suppressed ~11 debug messages>

yosys> fsm_opt

3.31.5. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$1892' from module `\top'.
  Removing unused output signal $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n176$1457 [0].
  Removing unused output signal $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n176$1457 [1].

yosys> fsm_recode -encoding binary

3.31.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).
Recoding FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$1892' from module `\top' using `auto' encoding:
  mapping auto encoding to `binary` for this FSM.
  existing encoding is already a packed binary encoding.

yosys> fsm_info

3.31.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$1892' from module `top':
-------------------------------------

  Information on FSM $fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$1892 (\u_i2cSlaveTop.u_i2cSlave.startStopDetState):

  Number of input signals:    5
  Number of output signals:   3
  Number of state bits:       2

  Input signals:
    0: \u_i2cSlaveTop.u_i2cSlave.sclDeb
    1: \u_i2cSlaveTop.u_i2cSlave.rstPipe [1]
    2: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n160$1432
    3: $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n154$1431
    4: \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet

  Output signals:
    0: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n291$1559
    1: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n323$1564
    2: $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n324$1565

  State encoding:
    0:       2'00  <RESET STATE>
    1:       2'10
    2:       2'01

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 5'0--00   ->     0 3'010
      1:     0 5'00001   ->     0 3'010
      2:     0 5'1--0-   ->     0 3'010
      3:     0 5'---1-   ->     0 3'010
      4:     0 5'01-01   ->     1 3'010
      5:     0 5'00101   ->     2 3'010
      6:     1 5'1--0-   ->     0 3'001
      7:     1 5'---1-   ->     0 3'001
      8:     1 5'0--00   ->     1 3'001
      9:     1 5'00001   ->     1 3'001
     10:     1 5'01-01   ->     1 3'001
     11:     1 5'00101   ->     2 3'001
     12:     2 5'1--0-   ->     0 3'100
     13:     2 5'---1-   ->     0 3'100
     14:     2 5'01-01   ->     1 3'100
     15:     2 5'0--00   ->     2 3'100
     16:     2 5'00-01   ->     2 3'100

-------------------------------------

yosys> fsm_map

3.31.8. Executing FSM_MAP pass (mapping FSMs to basic logic).
Mapping FSM `$fsm$\u_i2cSlaveTop.u_i2cSlave.startStopDetState$1892' from module `\top'.

yosys> opt_expr

3.32. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~5 debug messages>

yosys> opt_merge -nomux

3.33. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~9 debug messages>
Removed a total of 3 cells.

yosys> opt_muxtree

3.34. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~128 debug messages>

yosys> opt_reduce

3.35. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.36. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.37. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.38. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$writeEn_reg$i2cSlaveSerialInterface.v:449$1835 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_writeEn, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.writeEn, rval = 1'0).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$txData_reg$i2cSlaveSerialInterface.v:449$1839 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_txData, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.txData, rval = 8'00000000).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$streamSt_reg$i2cSlaveSerialInterface.v:449$1838 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_streamSt, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.streamSt, rval = 2'00).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$sdaOut_reg$i2cSlaveSerialInterface.v:449$1834 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_sdaOut, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.sdaOut, rval = 1'1).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$rxData_reg$i2cSlaveSerialInterface.v:449$1840 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_rxData, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.rxData, rval = 8'00000000).
Adding EN signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$regAddr_reg$i2cSlaveSerialInterface.v:449$1842 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_regAddr, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$dataOut_reg$i2cSlaveSerialInterface.v:449$1836 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_dataOut, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, rval = 8'00000000).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$clearStartStopDet_reg$i2cSlaveSerialInterface.v:449$1837 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_clearStartStopDet, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.clearStartStopDet, rval = 1'0).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$bitCnt_reg$i2cSlaveSerialInterface.v:449$1841 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.next_bitCnt, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.bitCnt, rval = 3'000).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$I2CReadDataLatchedOut_reg$i2cSlaveSerialInterface.v:476$1854 ($dff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n959$1588, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.I2CReadDataLatchedOut, rval = 1'0).
Adding EN signal on $auto$ff.cc:262:slice$1949 ($sdff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n959$1588, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.I2CReadDataLatchedOut).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$CurrState_SISt_reg$i2cSlaveSerialInterface.v:424$1815 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.NextState_SISt, Q = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.CurrState_SISt, rval = 4'0000).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$startEdgeDet_reg$i2cSlave.v:245$1509 ($dff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n146$1429, Q = \u_i2cSlaveTop.u_i2cSlave.startEdgeDet, rval = 1'0).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaPipe_reg$i2cSlave.v:191$1482 ($dff) from module top (D = { \u_i2cSlaveTop.u_i2cSlave.sdaPipe [3:0] \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.sdaOut }, Q = \u_i2cSlaveTop.u_i2cSlave.sdaPipe, rval = 5'11111).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaDelayed_reg$i2cSlave.v:214$1491 ($dff) from module top (D = { \u_i2cSlaveTop.u_i2cSlave.sdaDelayed [0] \u_i2cSlaveTop.u_i2cSlave.sdaDeb }, Q = \u_i2cSlaveTop.u_i2cSlave.sdaDelayed, rval = 2'11).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sdaDeb_reg$i2cSlave.v:191$1483 ($dff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n65$1422, Q = \u_i2cSlaveTop.u_i2cSlave.sdaDeb, rval = 1'1).
Adding EN signal on $auto$ff.cc:262:slice$1961 ($sdff) from module top (D = 1'0, Q = \u_i2cSlaveTop.u_i2cSlave.sdaDeb).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclPipe_reg$i2cSlave.v:191$1484 ($dff) from module top (D = { \u_i2cSlaveTop.u_i2cSlave.sclPipe [3:0] \CpuScl }, Q = \u_i2cSlaveTop.u_i2cSlave.sclPipe, rval = 5'11111).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclDelayed_reg$i2cSlave.v:214$1490 ($dff) from module top (D = { \u_i2cSlaveTop.u_i2cSlave.sclDelayed [3:0] \u_i2cSlaveTop.u_i2cSlave.sclDeb }, Q = \u_i2cSlaveTop.u_i2cSlave.sclDelayed, rval = 5'11111).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$sclDeb_reg$i2cSlave.v:191$1485 ($dff) from module top (D = $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n57$1418, Q = \u_i2cSlaveTop.u_i2cSlave.sclDeb, rval = 1'1).
Adding EN signal on $auto$ff.cc:262:slice$1967 ($sdff) from module top (D = 1'0, Q = \u_i2cSlaveTop.u_i2cSlave.sclDeb).
Adding SRST signal on $flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$rstPipe_reg$i2cSlave.v:158$1464 ($dff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.rstPipe [0], Q = \u_i2cSlaveTop.u_i2cSlave.rstPipe [1], rval = 1'1).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$RAM9bit_reg$r1024x9_1024x9.v:41$1883 ($dff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$n37$1865 [8:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.RAM9bit).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_LED_Gpio_o_reg$IR_Emitter_Registers.v:408$1374 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [2], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_LED_Gpio_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_LED_Gpio_Polarity_o_reg$IR_Emitter_Registers.v:408$1373 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [3], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_LED_Gpio_Polarity_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Mode_Modulator_o_reg$IR_Emitter_Registers.v:408$1367 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [1:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Mode_Modulator_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Stop_o_reg$IR_Emitter_Registers.v:408$1371 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_o [7:0]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Stop_o_reg$IR_Emitter_Registers.v:408$1371 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [4:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_o [12:8]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Start_o_reg$IR_Emitter_Registers.v:408$1370 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_o [7:0]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemRd_Start_o_reg$IR_Emitter_Registers.v:408$1370 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [4:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_o [12:8]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_MemAddr_Reg_o_reg$IR_Emitter_Registers.v:408$1372 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [5:0], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Interrupt_reg$IR_Emitter_Registers.v:408$1378 ($adff) from module top (D = $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$n386$1229, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Interrupt).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Interrupt_Enable_reg$IR_Emitter_Registers.v:408$1379 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut [5], Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Interrupt_Enable).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Gpio_Port_o_reg$IR_Emitter_Registers.v:408$1375 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Gpio_Dir_o_reg$IR_Emitter_Registers.v:408$1376 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Duty_Len_o_reg$IR_Emitter_Registers.v:408$1369 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_o [7:0]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Duty_Len_o_reg$IR_Emitter_Registers.v:408$1369 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_o [15:8]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Cycle_Len_o_reg$IR_Emitter_Registers.v:408$1368 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_o [7:0]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$IR_Emitter_Carrier_Cycle_Len_o_reg$IR_Emitter_Registers.v:408$1368 ($adff) from module top (D = \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.dataOut, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_o [15:8]).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_tc_reg$IR_Emitter_Modulator.v:260$1109 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_tc_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_tc).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_Pulse_Modulator_o_reg$IR_Emitter_Modulator.v:260$1106 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemData_lwr_reg$IR_Emitter_Modulator.v:260$1110 ($adff) from module top (D = \u_IR_Emitter_Interface.IR_Emitter_MemData_o, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemData_lwr).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_tc_upr_reg$IR_Emitter_Modulator.v:260$1105 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_tc_lwr, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_tc_upr).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_tc_lwr_reg$IR_Emitter_Modulator.v:260$1104 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_tc_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_tc_lwr).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$IR_Emitter_MemAddr_Modulator_o_reg$IR_Emitter_Modulator.v:260$1101 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_MemAddr_Modulator_o).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_1_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$905 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Duty_1_cntr_tc_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Duty_1_cntr_tc).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Duty_1_cntr_reg$IR_Emitter_Carrier_Generator.v:216$904 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Duty_1_cntr_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Duty_1_cntr).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_1_cntr_tc_reg$IR_Emitter_Carrier_Generator.v:216$900 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Cycle_1_cntr_tc_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Cycle_1_cntr_tc).
Adding EN signal on $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$IR_Emitter_Carrier_Cycle_1_cntr_reg$IR_Emitter_Carrier_Generator.v:216$899 ($adff) from module top (D = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Cycle_1_cntr_nxt, Q = \u_IR_Emitter_Interface.u_IR_Emitter_Carrier_Generator.IR_Emitter_Carrier_Cycle_1_cntr).

yosys> opt_clean

3.39. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 56 unused cells and 63 unused wires.
<suppressed ~57 debug messages>

yosys> opt_expr

3.40. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~7 debug messages>

yosys> opt_muxtree

3.41. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~86 debug messages>

yosys> opt_reduce

3.42. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.43. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.44. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.45. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.46. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 2

yosys> wreduce -keepdc

3.48. Executing WREDUCE pass (reducing word size of cells).
Removed top 3 bits (of 4) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$1935 ($eq).
Removed top 1 bits (of 2) from port B of cell top.$auto$fsm_map.cc:215:map_fsm$1902 ($eq).
Removed top 1 bits (of 4) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$1926 ($eq).
Removed top 1 bits (of 2) from mux cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$mux_11$i2cSlave.v:156$1463 ($mux).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_25$i2cSlaveSerialInterface.v:245$1721 ($add).
Removed top 2 bits (of 3) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_48$i2cSlaveSerialInterface.v:280$1737 ($add).
Removed top 1 bits (of 7) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$equal_115$i2cSlaveSerialInterface.v:342$1772 ($eq).
Removed top 1 bits (of 2) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$equal_22$i2cSlaveSerialInterface.v:241$1719 ($eq).
Removed top 1 bits (of 4) from port B of cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$equal_232$i2cSlaveSerialInterface.v:462$1847 ($eq).
Removed top 1 bits (of 4) from mux cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$mux_138$i2cSlaveSerialInterface.v:366$1786 ($mux).
Removed top 1 bits (of 4) from mux cell top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$mux_50$i2cSlaveSerialInterface.v:282$1739 ($mux).
Removed top 2 bits (of 5) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$1933 ($eq).
Removed top 4 bits (of 5) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$1922 ($eq).
Removed top 1 bits (of 9) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911 ($sub).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911 ($sub).
Removed top 1 bits (of 9) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911 ($sub).
Removed top 1 bits (of 9) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981 ($sub).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981 ($sub).
Removed top 1 bits (of 9) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981 ($sub).
Removed top 1 bits (of 9) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968 ($sub).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968 ($sub).
Removed top 1 bits (of 9) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968 ($sub).
Removed top 1 bits (of 2) from mux cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$mux_99$IR_Emitter_Carrier_Generator.v:338$941 ($mux).
Removed top 15 bits (of 16) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_89$IR_Emitter_Carrier_Generator.v:302$937 ($eq).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_77$IR_Emitter_Carrier_Generator.v:272$928 ($eq).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_65$IR_Emitter_Carrier_Generator.v:245$920 ($eq).
Removed top 6 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_62$IR_Emitter_Carrier_Generator.v:243$917 ($eq).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_170$IR_Emitter_Carrier_Generator.v:474$987 ($eq).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_158$IR_Emitter_Carrier_Generator.v:447$977 ($eq).
Removed top 6 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$equal_155$IR_Emitter_Carrier_Generator.v:445$974 ($eq).
Removed top 2 bits (of 3) from mux cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$mux_79$IR_Emitter_Modulator.v:339$1124 ($mux).
Removed top 14 bits (of 16) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$equal_196$IR_Emitter_Modulator.v:529$1176 ($eq).
Removed top 15 bits (of 16) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$equal_193$IR_Emitter_Modulator.v:528$1173 ($eq).
Removed top 1 bits (of 2) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$equal_188$IR_Emitter_Modulator.v:507$1166 ($eq).
Removed top 1 bits (of 2) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$equal_176$IR_Emitter_Modulator.v:477$1153 ($eq).
Removed top 12 bits (of 13) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$add_173$IR_Emitter_Modulator.v:478$1152 ($add).
Removed top 5 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_8$IR_Emitter_Registers.v:240$1280 ($eq).
Removed top 6 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_64$IR_Emitter_Registers.v:285$1318 ($eq).
Removed top 7 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_63$IR_Emitter_Registers.v:283$1317 ($eq).
Removed top 5 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_5$IR_Emitter_Registers.v:239$1277 ($eq).
Removed top 3 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_41$IR_Emitter_Registers.v:257$1313 ($eq).
Removed top 3 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_38$IR_Emitter_Registers.v:256$1310 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_35$IR_Emitter_Registers.v:254$1307 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_32$IR_Emitter_Registers.v:252$1304 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_29$IR_Emitter_Registers.v:251$1301 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_26$IR_Emitter_Registers.v:249$1298 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_23$IR_Emitter_Registers.v:248$1295 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_20$IR_Emitter_Registers.v:246$1292 ($eq).
Removed top 4 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_17$IR_Emitter_Registers.v:245$1289 ($eq).
Removed top 5 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_14$IR_Emitter_Registers.v:243$1286 ($eq).
Removed top 5 bits (of 8) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Registers.$verific$equal_11$IR_Emitter_Registers.v:242$1283 ($eq).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$1954 ($ne).
Removed top 2 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_45$IR_Emitter_Interface.v:280$155 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_48$IR_Emitter_Interface.v:281$156 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_51$IR_Emitter_Interface.v:282$157 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_69$IR_Emitter_Interface.v:294$164 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_72$IR_Emitter_Interface.v:295$165 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\u_IR_Emitter_Interface.$verific$equal_75$IR_Emitter_Interface.v:296$166 ($eq).
Removed top 1 bits (of 9) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924 ($sub).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924 ($sub).
Removed top 1 bits (of 9) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924 ($sub).
Removed top 1 bits (of 17) from port A of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164 ($sub).
Removed top 16 bits (of 17) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164 ($sub).
Removed top 1 bits (of 17) from port Y of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164 ($sub).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from port B of cell top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$xor_22$r1024x9_1024x9.v:40$1879 ($xor).
Removed top 1 bits (of 9) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n175$843.
Removed top 1 bits (of 9) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n223$846.
Removed top 1 bits (of 2) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n288$851.
Removed top 1 bits (of 9) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n364$862.
Removed top 1 bits (of 9) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n412$865.
Removed top 2 bits (of 3) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n214$1056.
Removed top 1 bits (of 17) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$n432$1070.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_0.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_1.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_2.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_3.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_4.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_5.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_6.$verific$n37$1865.
Removed top 13 bits (of 22) from wire top.$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_SRAM_7.$verific$n37$1865.
Removed top 1 bits (of 2) from wire top.$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n16$1437.
Removed top 1 bits (of 4) from wire top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n247$1624.
Removed top 1 bits (of 4) from wire top.$flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$n559$1665.

yosys> peepopt

3.49. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.50. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 23 unused wires.
<suppressed ~1 debug messages>

yosys> demuxmap

3.51. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> stat

3.52. Printing statistics.

=== top ===

   Number of wires:                580
   Number of wire bits:           2034
   Number of public wires:         343
   Number of public wire bits:    1384
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                390
     $add                            3
     $adff                          25
     $adffe                         26
     $and                           44
     $bmux                          28
     $dff                            2
     $dffe                           9
     $eq                            64
     $logic_not                     14
     $mux                           81
     $ne                             2
     $not                           16
     $or                            11
     $pmux                          16
     $reduce_and                     3
     $reduce_bool                    1
     $reduce_or                     14
     $sdff                          15
     $sdffe                          3
     $sub                            5
     $xor                            8


yosys> wreduce t:$mul

3.53. Executing WREDUCE pass (reducing word size of cells).

yosys> rs_dsp_macc -genesis2 -max_dsp 154

3.54. Executing RS_DSP_MACC pass.

yosys> techmap -map +/mul2dsp_check_maxwidth.v -D DSP_A_MAXWIDTH=20 -D DSP_B_MAXWIDTH=18 -D DSP_A_MINWIDTH=11 -D DSP_B_MINWIDTH=10 -D DSP_NAME=$__RS_MUL20X18 a:valid_map

3.55. Executing TECHMAP pass (map to technology primitives).

3.55.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

3.55.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> stat

3.56. Printing statistics.

=== top ===

   Number of wires:                580
   Number of wire bits:           2034
   Number of public wires:         343
   Number of public wire bits:    1384
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                390
     $add                            3
     $adff                          25
     $adffe                         26
     $and                           44
     $bmux                          28
     $dff                            2
     $dffe                           9
     $eq                            64
     $logic_not                     14
     $mux                           81
     $ne                             2
     $not                           16
     $or                            11
     $pmux                          16
     $reduce_and                     3
     $reduce_bool                    1
     $reduce_or                     14
     $sdff                          15
     $sdffe                          3
     $sub                            5
     $xor                            8


yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/rapidsilicon/genesis2/dsp_map.v -D USE_DSP_CFG_PARAMS=0

3.57. Executing TECHMAP pass (map to technology primitives).

3.57.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_MUL20X18'.
Successfully finished Verilog frontend.

3.57.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/dsp_final_map.v

3.58. Executing TECHMAP pass (map to technology primitives).

3.58.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v' to AST representation.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Successfully finished Verilog frontend.

3.58.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> rs-pack-dsp-regs

3.59. Executing rs_pack_dsp_regs pass.

yosys> rs_dsp_io_regs

3.60. Executing RS_DSP_IO_REGS pass.

yosys> alumacc

3.61. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module top:
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968 ($sub).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981 ($sub).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911 ($sub).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924 ($sub).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$add_173$IR_Emitter_Modulator.v:478$1152 ($add).
  creating $macc model for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164 ($sub).
  creating $macc model for $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_25$i2cSlaveSerialInterface.v:245$1721 ($add).
  creating $macc model for $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_48$i2cSlaveSerialInterface.v:280$1737 ($add).
  creating $alu model for $macc $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_48$i2cSlaveSerialInterface.v:280$1737.
  creating $alu model for $macc $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_25$i2cSlaveSerialInterface.v:245$1721.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$add_173$IR_Emitter_Modulator.v:478$1152.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981.
  creating $alu model for $macc $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968.
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_149$IR_Emitter_Carrier_Generator.v:438$968: $auto$alumacc.cc:485:replace_alu$2033
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_164$IR_Emitter_Carrier_Generator.v:466$981: $auto$alumacc.cc:485:replace_alu$2036
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_56$IR_Emitter_Carrier_Generator.v:236$911: $auto$alumacc.cc:485:replace_alu$2039
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$sub_71$IR_Emitter_Carrier_Generator.v:264$924: $auto$alumacc.cc:485:replace_alu$2042
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$add_173$IR_Emitter_Modulator.v:478$1152: $auto$alumacc.cc:485:replace_alu$2045
  creating $alu cell for $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Modulator.$verific$sub_185$IR_Emitter_Modulator.v:508$1164: $auto$alumacc.cc:485:replace_alu$2048
  creating $alu cell for $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_25$i2cSlaveSerialInterface.v:245$1721: $auto$alumacc.cc:485:replace_alu$2051
  creating $alu cell for $flatten\u_i2cSlaveTop.\u_i2cSlave.\u_i2cSlaveSerialInterface.$verific$add_48$i2cSlaveSerialInterface.v:280$1737: $auto$alumacc.cc:485:replace_alu$2054
  created 8 $alu and 0 $macc cells.

yosys> opt_expr

3.62. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.63. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.64. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~86 debug messages>

yosys> opt_reduce

3.65. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.66. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_share

3.67. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.68. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.69. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 2 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.70. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_muxtree

3.71. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~84 debug messages>

yosys> opt_reduce

3.72. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.73. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.74. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.75. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.76. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.77. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 2

yosys> stat

3.78. Printing statistics.

=== top ===

   Number of wires:                594
   Number of wire bits:           2176
   Number of public wires:         343
   Number of public wire bits:    1384
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                388
     $adff                          25
     $adffe                         26
     $alu                            8
     $and                           44
     $bmux                          28
     $dff                            2
     $dffe                           9
     $eq                            64
     $logic_not                     14
     $mux                           79
     $ne                             2
     $not                           16
     $or                            11
     $pmux                          16
     $reduce_and                     3
     $reduce_bool                    1
     $reduce_or                     14
     $sdff                          15
     $sdffe                          3
     $xor                            8


yosys> memory -nomap

3.79. Executing MEMORY pass.

yosys> opt_mem

3.79.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.79.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.79.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.79.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.79.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `$auto$memory_bmux2rom.cc:63:execute$2057'[0] in module `\top': merging output FF to cell.

yosys> opt_clean

3.79.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 1 unused cells and 2 unused wires.
<suppressed ~3 debug messages>

yosys> memory_share

3.79.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.79.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.79.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_collect

3.79.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.80. Printing statistics.

=== top ===

   Number of wires:                594
   Number of wire bits:           2176
   Number of public wires:         342
   Number of public wire bits:    1383
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                388
     $adff                          24
     $adffe                         26
     $alu                            8
     $and                           44
     $bmux                          27
     $dff                            2
     $dffe                           9
     $eq                            64
     $logic_not                     15
     $mem_v2                         1
     $mux                           79
     $ne                             2
     $not                           16
     $or                            11
     $pmux                          16
     $reduce_and                     3
     $reduce_bool                    1
     $reduce_or                     14
     $sdff                          15
     $sdffe                          3
     $xor                            8


yosys> muxpack

3.81. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~62 debug messages>

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new_swap.txt -limit 150 a:read_swapped

3.83. Executing MEMORY_LIBMAP pass (mapping memories to cells).

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new.txt -limit 150

3.84. Executing MEMORY_LIBMAP pass (mapping memories to cells).
using FF mapping for memory top.$auto$memory_bmux2rom.cc:63:execute$2057
<suppressed ~97 debug messages>

yosys> rs_bram_split -new_mapping

3.85. Executing Rs_BRAM_Split pass.

yosys> techmap -autoproc -map +/rapidsilicon/genesis2/brams_map_new.v

3.86. Executing TECHMAP pass (map to technology primitives).

3.86.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v' to AST representation.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_SDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_SDP'.
Successfully finished Verilog frontend.

3.86.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~6 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/brams_final_map_new.v

3.87. Executing TECHMAP pass (map to technology primitives).

3.87.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v' to AST representation.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Successfully finished Verilog frontend.

3.87.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> pmuxtree

3.88. Executing PMUXTREE pass.

yosys> muxpack

3.89. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting top.$auto$pmuxtree.cc:65:recursive_mux_generator$2230 ... top.$auto$pmuxtree.cc:65:recursive_mux_generator$2232 to a pmux with 2 cases.
Converting top.$auto$pmuxtree.cc:65:recursive_mux_generator$2108 ... top.$auto$pmuxtree.cc:65:recursive_mux_generator$2110 to a pmux with 2 cases.
Converted 4 (p)mux cells into 2 pmux cells.
<suppressed ~101 debug messages>

yosys> memory_map

3.90. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory $auto$memory_bmux2rom.cc:63:execute$2057 in module \top:
  created 8 $dff cells and 0 static cells of width 1.
Extracted data FF from read port 0 of top.$auto$memory_bmux2rom.cc:63:execute$2057: $$auto$memory_bmux2rom.cc:63:execute$2057$rdreg[0]
  read interface: 1 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.

yosys> stat

3.91. Printing statistics.

=== top ===

   Number of wires:                716
   Number of wire bits:           2561
   Number of public wires:         342
   Number of public wire bits:    1383
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                476
     $adff                          25
     $adffe                         26
     $alu                            8
     $and                           44
     $bmux                          27
     $dff                           10
     $dffe                           9
     $eq                            64
     $logic_not                     15
     $mux                          131
     $ne                             2
     $not                           32
     $or                            18
     $pmux                           2
     $reduce_and                     3
     $reduce_bool                    1
     $reduce_or                     33
     $sdff                          15
     $sdffe                          3
     $xor                            8


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/arith_map.v

3.92. Executing TECHMAP pass (map to technology primitives).

3.92.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.92.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.92.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $sdff.
Using extmapper simplemap for cells of type $sdffe.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $bmux.
Using template $paramod$3ef7d3dd227da7627a99c5e5a6a4deb817573e39\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $logic_not.
Using template $paramod$403a3c2fa431a154c52a6a5429d7a6260b5d144f\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $dff.
Using template $paramod$521ce43182eecb9f60c72393a788160d2c356bf5\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $reduce_bool.
Using template $paramod$fc16b9f758000d363d24f130038bd99b46b4fa1b\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $adff.
Using template $paramod$a1665ef28c749ebcdbe9aecd466e644647b56463\_90_alu for cells of type $alu.
Using template $paramod$215440792383f7884e57d9c95f84e9552d0bf4ac\_90_alu for cells of type $alu.
Using template $paramod$c3cd1564c35d873179656addd6052d7ea8b6d991\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001000 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000011 for cells of type $lcu.
No more expansions possible.
<suppressed ~1870 debug messages>

yosys> stat

3.93. Printing statistics.

=== top ===

   Number of wires:               1606
   Number of wire bits:          14654
   Number of public wires:         342
   Number of public wire bits:    1383
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3550
     $_AND_                        305
     $_DFFE_PN0P_                  135
     $_DFFE_PN1P_                    9
     $_DFFE_PN_                      8
     $_DFFE_PP_                     72
     $_DFF_PN0_                     61
     $_DFF_PP0_                      1
     $_DFF_P_                       11
     $_MUX_                       1549
     $_NOT_                        183
     $_OR_                         574
     $_SDFFE_PP0P_                   1
     $_SDFFE_PP1N_                   2
     $_SDFF_PN1_                     1
     $_SDFF_PP0_                    36
     $_SDFF_PP1_                    18
     $_XOR_                        584


yosys> opt_expr

3.94. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~1327 debug messages>

yosys> opt_merge -nomux

3.95. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~1053 debug messages>
Removed a total of 351 cells.

yosys> opt_muxtree

3.96. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.97. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.98. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.99. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.100. Executing OPT_DFF pass (perform DFF optimizations).
Handling const CLK on $auto$ff.cc:262:slice$3950 ($_DFF_P_) from module top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3995 ($_DFF_P_) from module top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3996 ($_DFF_P_) from module top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3997 ($_DFF_P_) from module top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3998 ($_DFF_P_) from module top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3999 ($_DFF_P_) from module top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4000 ($_DFF_P_) from module top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4001 ($_DFF_P_) from module top (removing D path).

yosys> opt_clean

3.101. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 85 unused cells and 801 unused wires.
<suppressed ~86 debug messages>

yosys> opt_expr

3.102. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~6 debug messages>

yosys> opt_muxtree

3.103. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.104. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.105. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.106. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.107. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $auto$ff.cc:262:slice$3770 ($_DFF_P_) from module top (D = $auto$fsm_map.cc:238:map_fsm$1903 [2], Q = \u_i2cSlaveTop.u_i2cSlave.startStopDetState [0], rval = 1'0).

yosys> opt_clean

3.108. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 1 unused cells and 6 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.109. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_muxtree

3.110. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.111. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.112. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.113. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.114. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.115. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.116. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 3

yosys> opt_expr -full

3.117. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~201 debug messages>

yosys> techmap -map +/techmap.v

3.118. Executing TECHMAP pass (map to technology primitives).

3.118.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.118.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> stat

3.119. Printing statistics.

=== top ===

   Number of wires:                973
   Number of wire bits:           3616
   Number of public wires:         342
   Number of public wire bits:    1383
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2150
     $_AND_                        302
     $_DFFE_PN0P_                  135
     $_DFFE_PN1P_                    9
     $_DFFE_PN_                      8
     $_DFFE_PP_                     72
     $_DFF_PN0_                     55
     $_DFF_P_                        2
     $_MUX_                        855
     $_NOT_                        195
     $_OR_                         367
     $_SDFFE_PP0P_                   1
     $_SDFFE_PP1N_                   2
     $_SDFF_PN1_                     1
     $_SDFF_PP0_                    37
     $_SDFF_PP1_                    18
     $_XOR_                         91


yosys> dfflegalize -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 t:$_SDFFCE_*

3.120. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.121. Printing statistics.

=== top ===

   Number of wires:                973
   Number of wire bits:           3616
   Number of public wires:         342
   Number of public wire bits:    1383
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2150
     $_AND_                        302
     $_DFFE_PN0P_                  135
     $_DFFE_PN1P_                    9
     $_DFFE_PN_                      8
     $_DFFE_PP_                     72
     $_DFF_PN0_                     55
     $_DFF_P_                        2
     $_MUX_                        855
     $_NOT_                        195
     $_OR_                         367
     $_SDFFE_PP0P_                   1
     $_SDFFE_PP1N_                   2
     $_SDFF_PN1_                     1
     $_SDFF_PP0_                    37
     $_SDFF_PP1_                    18
     $_XOR_                         91


yosys> opt_expr

3.122. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.123. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.124. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.125. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.126. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -sat

3.127. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.128. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 7 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.129. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> abc -dff -keepff

3.130. Executing ABC pass (technology mapping using ABC).

3.130.1. Summary of detected clock domains:
  21 cells in clk=\Clock_i, en={ }, arst={ }, srst=$auto$fsm_map.cc:170:map_fsm$1897 [1]
  35 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL, arst={ }, srst={ }
  27 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL, arst={ }, srst={ }
  24 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL, arst={ }, srst={ }
  24 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL, arst={ }, srst={ }
  24 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL, arst={ }, srst={ }
  48 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  48 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  36 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  12 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  3 cells in clk=\Clock_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1990, arst=!\Reset_i_N, srst={ }
  30 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  28 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, arst=!\Reset_i_N, srst={ }
  29 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, arst=!\Reset_i_N, srst={ }
  16 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, arst=!\Reset_i_N, srst={ }
  80 cells in clk=\Clock_i, en=$auto$opt_dff.cc:194:make_patterns_logic$2009, arst=!\Reset_i_N, srst={ }
  4 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_ld_upr, arst=!\Reset_i_N, srst={ }
  105 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_ld_lwr, arst=!\Reset_i_N, srst={ }
  165 cells in clk=\Clock_i, en=$auto$opt_dff.cc:194:make_patterns_logic$2000, arst=!\Reset_i_N, srst={ }
  71 cells in clk=\Clock_i, en=$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n63$771, arst=!\Reset_i_N, srst={ }
  73 cells in clk=\Clock_i, en=$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, arst=!\Reset_i_N, srst={ }
  365 cells in clk=\Clock_i, en={ }, arst=!\Reset_i_N, srst={ }
  17 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  16 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  14 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, arst=!\Reset_i_N, srst={ }
  9 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, arst=!\Reset_i_N, srst={ }
  5 cells in clk=\Clock_i, en={ }, arst={ }, srst={ }
  114 cells in clk=\Clock_i, en=!\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn, arst={ }, srst={ }
  9 cells in clk=\Clock_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1955, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  24 cells in clk=\Clock_i, en=\u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL, arst={ }, srst={ }
  7 cells in clk=\Clock_i, en=!$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, arst={ }, srst=$auto$opt_dff.cc:253:combine_resets$1968
  4 cells in clk=\Clock_i, en={ }, arst={ }, srst=!\Reset_i_N
  2 cells in clk=\Clock_i, en=!$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, arst={ }, srst=$auto$opt_dff.cc:253:combine_resets$1962
  32 cells in clk=\Clock_i, en={ }, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.rstPipe [1]
  577 cells in clk=\Clock_i, en={ }, arst={ }, srst=\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn

3.130.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $auto$fsm_map.cc:170:map_fsm$1897 [1]
Extracted 21 gates and 30 wires to a netlist network with 9 inputs and 6 outputs.

3.130.2.1. Executing ABC.

3.130.3. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL
Extracted 35 gates and 59 wires to a netlist network with 24 inputs and 29 outputs.

3.130.3.1. Executing ABC.

3.130.4. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL
Extracted 26 gates and 42 wires to a netlist network with 16 inputs and 20 outputs.

3.130.4.1. Executing ABC.

3.130.5. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL
Extracted 26 gates and 42 wires to a netlist network with 16 inputs and 20 outputs.

3.130.5.1. Executing ABC.

3.130.6. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL
Extracted 27 gates and 42 wires to a netlist network with 15 inputs and 22 outputs.

3.130.6.1. Executing ABC.

3.130.7. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL
Extracted 24 gates and 38 wires to a netlist network with 14 inputs and 19 outputs.

3.130.7.1. Executing ABC.

3.130.8. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL
Extracted 24 gates and 38 wires to a netlist network with 14 inputs and 19 outputs.

3.130.8.1. Executing ABC.

3.130.9. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL
Extracted 24 gates and 38 wires to a netlist network with 14 inputs and 19 outputs.

3.130.9.1. Executing ABC.

3.130.10. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 48 gates and 82 wires to a netlist network with 33 inputs and 32 outputs.

3.130.10.1. Executing ABC.

3.130.11. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 48 gates and 84 wires to a netlist network with 35 inputs and 31 outputs.

3.130.11.1. Executing ABC.

3.130.12. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 36 gates and 66 wires to a netlist network with 29 inputs and 28 outputs.

3.130.12.1. Executing ABC.

3.130.13. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 12 gates and 24 wires to a netlist network with 12 inputs and 11 outputs.

3.130.13.1. Executing ABC.

3.130.14. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1990, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.130.14.1. Executing ABC.

3.130.15. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 30 gates and 50 wires to a netlist network with 19 inputs and 26 outputs.

3.130.15.1. Executing ABC.

3.130.16. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 28 gates and 50 wires to a netlist network with 21 inputs and 26 outputs.

3.130.16.1. Executing ABC.

3.130.17. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 29 gates and 56 wires to a netlist network with 26 inputs and 27 outputs.

3.130.17.1. Executing ABC.

3.130.18. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 30 wires to a netlist network with 14 inputs and 10 outputs.

3.130.18.1. Executing ABC.

3.130.19. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2009, asynchronously reset by !\Reset_i_N
Extracted 80 gates and 100 wires to a netlist network with 20 inputs and 31 outputs.

3.130.19.1. Executing ABC.

3.130.20. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_ld_upr, asynchronously reset by !\Reset_i_N
Extracted 4 gates and 6 wires to a netlist network with 2 inputs and 4 outputs.

3.130.20.1. Executing ABC.

3.130.21. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Modulator.IR_Emitter_Pulse_Modulator_o_ld_lwr, asynchronously reset by !\Reset_i_N
Extracted 105 gates and 199 wires to a netlist network with 93 inputs and 30 outputs.

3.130.21.1. Executing ABC.

3.130.22. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2000, asynchronously reset by !\Reset_i_N
Extracted 165 gates and 190 wires to a netlist network with 24 inputs and 19 outputs.

3.130.22.1. Executing ABC.

3.130.23. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n63$771, asynchronously reset by !\Reset_i_N
Extracted 71 gates and 85 wires to a netlist network with 13 inputs and 9 outputs.

3.130.23.1. Executing ABC.

3.130.24. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, asynchronously reset by !\Reset_i_N
Extracted 73 gates and 90 wires to a netlist network with 16 inputs and 12 outputs.

3.130.24.1. Executing ABC.

3.130.25. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, asynchronously reset by !\Reset_i_N
Extracted 365 gates and 488 wires to a netlist network with 121 inputs and 123 outputs.

3.130.25.1. Executing ABC.

3.130.26. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 17 gates and 30 wires to a netlist network with 13 inputs and 15 outputs.

3.130.26.1. Executing ABC.

3.130.27. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 28 wires to a netlist network with 12 inputs and 14 outputs.

3.130.27.1. Executing ABC.

3.130.28. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 14 gates and 25 wires to a netlist network with 10 inputs and 12 outputs.

3.130.28.1. Executing ABC.

3.130.29. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 9 gates and 18 wires to a netlist network with 9 inputs and 7 outputs.

3.130.29.1. Executing ABC.

3.130.30. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i
Extracted 5 gates and 8 wires to a netlist network with 3 inputs and 4 outputs.

3.130.30.1. Executing ABC.

3.130.31. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !\u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 114 gates and 138 wires to a netlist network with 24 inputs and 26 outputs.

3.130.31.1. Executing ABC.

3.130.32. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1955, synchronously reset by \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 9 gates and 17 wires to a netlist network with 7 inputs and 2 outputs.

3.130.32.1. Executing ABC.

3.130.33. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by \u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL
Extracted 24 gates and 39 wires to a netlist network with 15 inputs and 20 outputs.

3.130.33.1. Executing ABC.

3.130.34. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, synchronously reset by $auto$opt_dff.cc:253:combine_resets$1968
Extracted 7 gates and 14 wires to a netlist network with 6 inputs and 6 outputs.

3.130.34.1. Executing ABC.

3.130.35. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by !\Reset_i_N
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.130.35.1. Executing ABC.

3.130.36. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, synchronously reset by $abc$8795$auto$opt_dff.cc:253:combine_resets$1962
Extracted 2 gates and 5 wires to a netlist network with 2 inputs and 2 outputs.

3.130.36.1. Executing ABC.

3.130.37. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$8795$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
Extracted 32 gates and 37 wires to a netlist network with 5 inputs and 30 outputs.

3.130.37.1. Executing ABC.

3.130.38. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by \u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 577 gates and 624 wires to a netlist network with 45 inputs and 69 outputs.

3.130.38.1. Executing ABC.

yosys> abc -dff -keepff

3.131. Executing ABC pass (technology mapping using ABC).

3.131.1. Summary of detected clock domains:
  102 cells in clk=\Clock_i, en=$abc$8215$lo00, arst=!\Reset_i_N, srst={ }
  22 cells in clk=\Clock_i, en=$abc$7501$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL, arst={ }, srst={ }
  22 cells in clk=\Clock_i, en=$abc$7470$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL, arst={ }, srst={ }
  27 cells in clk=\Clock_i, en=$abc$7372$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL, arst={ }, srst={ }
  41 cells in clk=\Clock_i, en=$abc$8215$lo16, arst=!\Reset_i_N, srst={ }
  17 cells in clk=\Clock_i, en=$abc$7811$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, arst=!\Reset_i_N, srst={ }
  7 cells in clk=\Clock_i, en=!$abc$8786$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, arst={ }, srst=$abc$8786$auto$opt_dff.cc:253:combine_resets$1968
  3 cells in clk=\Clock_i, en=$abc$8215$lo26, arst=!\Reset_i_N, srst={ }
  13 cells in clk=\Clock_i, en={ }, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=$abc$7405$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL, arst={ }, srst={ }
  3 cells in clk=\Clock_i, en={ }, arst={ }, srst=!\Reset_i_N
  4 cells in clk=\Clock_i, en=!$abc$8801$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, arst={ }, srst=$abc$8795$auto$opt_dff.cc:253:combine_resets$1962
  3 cells in clk=\Clock_i, en=$abc$7700$auto$opt_dff.cc:194:make_patterns_logic$1990, arst=!\Reset_i_N, srst={ }
  7 cells in clk=\Clock_i, en=$abc$8745$auto$opt_dff.cc:219:make_patterns_logic$1955, arst={ }, srst=$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  26 cells in clk=\Clock_i, en=$abc$8589$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  37 cells in clk=\Clock_i, en=$abc$7532$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  23 cells in clk=\Clock_i, en=$abc$7680$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  21 cells in clk=\Clock_i, en=$abc$7704$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  27 cells in clk=\Clock_i, en=$abc$8614$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  31 cells in clk=\Clock_i, en=$abc$7627$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  16 cells in clk=\Clock_i, en=$abc$8638$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, arst=!\Reset_i_N, srst={ }
  27 cells in clk=\Clock_i, en=$abc$7580$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  20 cells in clk=\Clock_i, en=$abc$7774$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, arst=!\Reset_i_N, srst={ }
  14 cells in clk=\Clock_i, en=$abc$8657$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, arst=!\Reset_i_N, srst={ }
  10 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$7283$auto$fsm_map.cc:170:map_fsm$1897[1]
  27 cells in clk=\Clock_i, en=$abc$7339$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL, arst={ }, srst={ }
  33 cells in clk=\Clock_i, en=$abc$7297$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL, arst={ }, srst={ }
  78 cells in clk=\Clock_i, en=!$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn, arst={ }, srst={ }
  24 cells in clk=\Clock_i, en=$abc$8754$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL, arst={ }, srst={ }
  59 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$8795$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
  297 cells in clk=\Clock_i, en={ }, arst=!\Reset_i_N, srst={ }
  78 cells in clk=\Clock_i, en=$abc$7832$auto$opt_dff.cc:194:make_patterns_logic$2009, arst=!\Reset_i_N, srst={ }
  23 cells in clk=\Clock_i, en=$abc$7439$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL, arst={ }, srst={ }
  40 cells in clk=\Clock_i, en=$abc$8167$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, arst=!\Reset_i_N, srst={ }
  106 cells in clk=\Clock_i, en=$abc$8019$auto$opt_dff.cc:194:make_patterns_logic$2000, arst=!\Reset_i_N, srst={ }
  19 cells in clk=\Clock_i, en=$abc$7738$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, arst=!\Reset_i_N, srst={ }
  343 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn

3.131.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8215$lo00, asynchronously reset by !\Reset_i_N
Extracted 102 gates and 195 wires to a netlist network with 93 inputs and 38 outputs.

3.131.2.1. Executing ABC.

3.131.3. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7501$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL
Extracted 22 gates and 36 wires to a netlist network with 14 inputs and 19 outputs.

3.131.3.1. Executing ABC.

3.131.4. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7470$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL
Extracted 22 gates and 36 wires to a netlist network with 14 inputs and 19 outputs.

3.131.4.1. Executing ABC.

3.131.5. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7372$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL
Extracted 27 gates and 47 wires to a netlist network with 20 inputs and 23 outputs.

3.131.5.1. Executing ABC.

3.131.6. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8215$lo16, asynchronously reset by !\Reset_i_N
Extracted 41 gates and 55 wires to a netlist network with 14 inputs and 15 outputs.

3.131.6.1. Executing ABC.

3.131.7. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7811$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 17 gates and 34 wires to a netlist network with 17 inputs and 14 outputs.

3.131.7.1. Executing ABC.

3.131.8. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$8786$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, synchronously reset by $abc$8786$auto$opt_dff.cc:253:combine_resets$1968
Extracted 7 gates and 13 wires to a netlist network with 5 inputs and 6 outputs.

3.131.8.1. Executing ABC.

3.131.9. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8215$lo26, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 5 wires to a netlist network with 2 inputs and 3 outputs.

3.131.9.1. Executing ABC.

3.131.10. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i
Extracted 13 gates and 22 wires to a netlist network with 9 inputs and 7 outputs.

3.131.10.1. Executing ABC.

3.131.11. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7405$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL
Extracted 26 gates and 43 wires to a netlist network with 17 inputs and 23 outputs.

3.131.11.1. Executing ABC.

3.131.12. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by !\Reset_i_N
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 2 outputs.

3.131.12.1. Executing ABC.

3.131.13. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$8801$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, synchronously reset by $abc$9564$abc$8795$auto$opt_dff.cc:253:combine_resets$1962
Extracted 4 gates and 9 wires to a netlist network with 4 inputs and 4 outputs.

3.131.13.1. Executing ABC.

3.131.14. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7700$auto$opt_dff.cc:194:make_patterns_logic$1990, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 2 outputs.

3.131.14.1. Executing ABC.

3.131.15. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8745$auto$opt_dff.cc:219:make_patterns_logic$1955, synchronously reset by $abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 7 gates and 13 wires to a netlist network with 6 inputs and 3 outputs.

3.131.15.1. Executing ABC.

3.131.16. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8589$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 26 gates and 51 wires to a netlist network with 25 inputs and 25 outputs.

3.131.16.1. Executing ABC.

3.131.17. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7532$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 37 gates and 67 wires to a netlist network with 30 inputs and 29 outputs.

3.131.17.1. Executing ABC.

3.131.18. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7680$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 23 gates and 48 wires to a netlist network with 25 inputs and 16 outputs.

3.131.18.1. Executing ABC.

3.131.19. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7704$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 21 gates and 33 wires to a netlist network with 12 inputs and 20 outputs.

3.131.19.1. Executing ABC.

3.131.20. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8614$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 27 gates and 51 wires to a netlist network with 24 inputs and 25 outputs.

3.131.20.1. Executing ABC.

3.131.21. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7627$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 31 gates and 47 wires to a netlist network with 16 inputs and 23 outputs.

3.131.21.1. Executing ABC.

3.131.22. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8638$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 30 wires to a netlist network with 14 inputs and 15 outputs.

3.131.22.1. Executing ABC.

3.131.23. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7580$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 27 gates and 51 wires to a netlist network with 24 inputs and 22 outputs.

3.131.23.1. Executing ABC.

3.131.24. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7774$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 20 gates and 38 wires to a netlist network with 18 inputs and 19 outputs.

3.131.24.1. Executing ABC.

3.131.25. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8657$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 14 gates and 30 wires to a netlist network with 16 inputs and 13 outputs.

3.131.25.1. Executing ABC.

3.131.26. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$9514$abc$7283$auto$fsm_map.cc:170:map_fsm$1897[1]
Extracted 10 gates and 16 wires to a netlist network with 6 inputs and 3 outputs.

3.131.26.1. Executing ABC.

3.131.27. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7339$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL
Extracted 27 gates and 45 wires to a netlist network with 18 inputs and 22 outputs.

3.131.27.1. Executing ABC.

3.131.28. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7297$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL
Extracted 33 gates and 57 wires to a netlist network with 24 inputs and 20 outputs.

3.131.28.1. Executing ABC.

3.131.29. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 78 gates and 120 wires to a netlist network with 42 inputs and 35 outputs.

3.131.29.1. Executing ABC.

3.131.30. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8754$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL
Extracted 24 gates and 39 wires to a netlist network with 15 inputs and 20 outputs.

3.131.30.1. Executing ABC.

3.131.31. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$9564$abc$8795$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
Extracted 59 gates and 79 wires to a netlist network with 20 inputs and 48 outputs.

3.131.31.1. Executing ABC.

3.131.32. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, asynchronously reset by !\Reset_i_N
Extracted 297 gates and 426 wires to a netlist network with 129 inputs and 109 outputs.

3.131.32.1. Executing ABC.

3.131.33. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7832$auto$opt_dff.cc:194:make_patterns_logic$2009, asynchronously reset by !\Reset_i_N
Extracted 78 gates and 108 wires to a netlist network with 30 inputs and 40 outputs.

3.131.33.1. Executing ABC.

3.131.34. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7439$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL
Extracted 23 gates and 38 wires to a netlist network with 15 inputs and 20 outputs.

3.131.34.1. Executing ABC.

3.131.35. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10152$abc$8167$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, asynchronously reset by !\Reset_i_N
Extracted 40 gates and 53 wires to a netlist network with 13 inputs and 15 outputs.

3.131.35.1. Executing ABC.

3.131.36. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$8019$auto$opt_dff.cc:194:make_patterns_logic$2000, asynchronously reset by !\Reset_i_N
Extracted 106 gates and 136 wires to a netlist network with 30 inputs and 24 outputs.

3.131.36.1. Executing ABC.

3.131.37. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$7738$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 19 gates and 32 wires to a netlist network with 13 inputs and 19 outputs.

3.131.37.1. Executing ABC.

3.131.38. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$9979$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 343 gates and 395 wires to a netlist network with 52 inputs and 68 outputs.

3.131.38.1. Executing ABC.

yosys> abc -dff -keepff

3.132. Executing ABC pass (technology mapping using ABC).

3.132.1. Summary of detected clock domains:
  27 cells in clk=\Clock_i, en=$abc$10750$abc$7738$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, arst=!\Reset_i_N, srst={ }
  102 cells in clk=\Clock_i, en=$abc$10152$abc$8215$lo00, arst=!\Reset_i_N, srst={ }
  23 cells in clk=\Clock_i, en=$abc$9336$abc$7501$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL, arst={ }, srst={ }
  28 cells in clk=\Clock_i, en=$abc$9367$abc$7470$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=$abc$9398$abc$7372$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL, arst={ }, srst={ }
  8 cells in clk=\Clock_i, en=!$abc$9500$abc$8786$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, arst={ }, srst=$abc$9500$abc$8786$auto$opt_dff.cc:253:combine_resets$1968
  3 cells in clk=\Clock_i, en=$abc$10152$abc$8215$lo26, arst=!\Reset_i_N, srst={ }
  17 cells in clk=\Clock_i, en=$abc$9478$abc$7811$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, arst=!\Reset_i_N, srst={ }
  8 cells in clk=\Clock_i, en={ }, arst={ }, srst={ }
  3 cells in clk=\Clock_i, en={ }, arst={ }, srst=!\Reset_i_N
  4 cells in clk=\Clock_i, en=!$abc$9569$abc$8801$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, arst={ }, srst=$abc$9564$abc$8795$auto$opt_dff.cc:253:combine_resets$1962
  3 cells in clk=\Clock_i, en=$abc$9575$abc$7700$auto$opt_dff.cc:194:make_patterns_logic$1990, arst=!\Reset_i_N, srst={ }
  6 cells in clk=\Clock_i, en=$abc$9579$abc$8745$auto$opt_dff.cc:219:make_patterns_logic$1955, arst={ }, srst=$abc$9979$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  28 cells in clk=\Clock_i, en=$abc$9587$abc$8589$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  25 cells in clk=\Clock_i, en=$abc$9622$abc$7532$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  23 cells in clk=\Clock_i, en=$abc$9699$abc$7704$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  20 cells in clk=\Clock_i, en=$abc$9727$abc$8614$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  34 cells in clk=\Clock_i, en=$abc$9763$abc$7627$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  14 cells in clk=\Clock_i, en=$abc$9795$abc$8638$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, arst=!\Reset_i_N, srst={ }
  23 cells in clk=\Clock_i, en=$abc$9817$abc$7580$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  40 cells in clk=\Clock_i, en=$abc$10152$abc$8215$lo16, arst=!\Reset_i_N, srst={ }
  14 cells in clk=\Clock_i, en=$abc$9882$abc$8657$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, arst=!\Reset_i_N, srst={ }
  15 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$9514$abc$7283$auto$fsm_map.cc:170:map_fsm$1897[1]
  27 cells in clk=\Clock_i, en=$abc$9529$abc$7405$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL, arst={ }, srst={ }
  27 cells in clk=\Clock_i, en=$abc$9911$abc$7339$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL, arst={ }, srst={ }
  32 cells in clk=\Clock_i, en=$abc$9946$abc$7297$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL, arst={ }, srst={ }
  64 cells in clk=\Clock_i, en=!$abc$9979$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn, arst={ }, srst={ }
  23 cells in clk=\Clock_i, en=$abc$9853$abc$7774$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, arst=!\Reset_i_N, srst={ }
  23 cells in clk=\Clock_i, en=$abc$10048$abc$8754$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL, arst={ }, srst={ }
  52 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$9564$abc$8795$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
  20 cells in clk=\Clock_i, en=$abc$9667$abc$7680$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  326 cells in clk=\Clock_i, en={ }, arst=!\Reset_i_N, srst={ }
  70 cells in clk=\Clock_i, en=$abc$10483$abc$7832$auto$opt_dff.cc:194:make_patterns_logic$2009, arst=!\Reset_i_N, srst={ }
  24 cells in clk=\Clock_i, en=$abc$10562$abc$7439$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL, arst={ }, srst={ }
  41 cells in clk=\Clock_i, en=$abc$10152$abc$8167$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, arst=!\Reset_i_N, srst={ }
  110 cells in clk=\Clock_i, en=$abc$10641$abc$8019$auto$opt_dff.cc:194:make_patterns_logic$2000, arst=!\Reset_i_N, srst={ }
  325 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$9979$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn

3.132.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10750$abc$7738$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 27 gates and 47 wires to a netlist network with 20 inputs and 26 outputs.

3.132.2.1. Executing ABC.

3.132.3. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10152$abc$8215$lo00, asynchronously reset by !\Reset_i_N
Extracted 102 gates and 195 wires to a netlist network with 93 inputs and 38 outputs.

3.132.3.1. Executing ABC.

3.132.4. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9336$abc$7501$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL
Extracted 23 gates and 38 wires to a netlist network with 15 inputs and 20 outputs.

3.132.4.1. Executing ABC.

3.132.5. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9367$abc$7470$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL
Extracted 28 gates and 49 wires to a netlist network with 21 inputs and 25 outputs.

3.132.5.1. Executing ABC.

3.132.6. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9398$abc$7372$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL
Extracted 26 gates and 45 wires to a netlist network with 19 inputs and 19 outputs.

3.132.6.1. Executing ABC.

3.132.7. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$9500$abc$8786$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, synchronously reset by $abc$9500$abc$8786$auto$opt_dff.cc:253:combine_resets$1968
Extracted 8 gates and 15 wires to a netlist network with 6 inputs and 7 outputs.

3.132.7.1. Executing ABC.

3.132.8. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10152$abc$8215$lo26, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 5 wires to a netlist network with 2 inputs and 3 outputs.

3.132.8.1. Executing ABC.

3.132.9. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9478$abc$7811$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 17 gates and 34 wires to a netlist network with 17 inputs and 14 outputs.

3.132.9.1. Executing ABC.

3.132.10. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i
Extracted 8 gates and 13 wires to a netlist network with 5 inputs and 6 outputs.

3.132.10.1. Executing ABC.

3.132.11. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by !\Reset_i_N
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 2 outputs.

3.132.11.1. Executing ABC.

3.132.12. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$9569$abc$8801$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, synchronously reset by $abc$11387$abc$9564$abc$8795$auto$opt_dff.cc:253:combine_resets$1962
Extracted 4 gates and 9 wires to a netlist network with 4 inputs and 4 outputs.

3.132.12.1. Executing ABC.

3.132.13. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9575$abc$7700$auto$opt_dff.cc:194:make_patterns_logic$1990, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 2 outputs.

3.132.13.1. Executing ABC.

3.132.14. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9579$abc$8745$auto$opt_dff.cc:219:make_patterns_logic$1955, synchronously reset by $abc$9979$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 6 gates and 12 wires to a netlist network with 6 inputs and 2 outputs.

3.132.14.1. Executing ABC.

3.132.15. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9587$abc$8589$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 28 gates and 54 wires to a netlist network with 26 inputs and 26 outputs.

3.132.15.1. Executing ABC.

3.132.16. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9622$abc$7532$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 25 gates and 45 wires to a netlist network with 20 inputs and 23 outputs.

3.132.16.1. Executing ABC.

3.132.17. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9699$abc$7704$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 23 gates and 38 wires to a netlist network with 15 inputs and 22 outputs.

3.132.17.1. Executing ABC.

3.132.18. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9727$abc$8614$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 20 gates and 38 wires to a netlist network with 18 inputs and 19 outputs.

3.132.18.1. Executing ABC.

3.132.19. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9763$abc$7627$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 34 gates and 53 wires to a netlist network with 19 inputs and 26 outputs.

3.132.19.1. Executing ABC.

3.132.20. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9795$abc$8638$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 14 gates and 26 wires to a netlist network with 12 inputs and 13 outputs.

3.132.20.1. Executing ABC.

3.132.21. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9817$abc$7580$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 23 gates and 44 wires to a netlist network with 21 inputs and 21 outputs.

3.132.21.1. Executing ABC.

3.132.22. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10152$abc$8215$lo16, asynchronously reset by !\Reset_i_N
Extracted 40 gates and 54 wires to a netlist network with 14 inputs and 15 outputs.

3.132.22.1. Executing ABC.

3.132.23. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9882$abc$8657$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 14 gates and 30 wires to a netlist network with 16 inputs and 13 outputs.

3.132.23.1. Executing ABC.

3.132.24. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$9514$abc$7283$auto$fsm_map.cc:170:map_fsm$1897[1]
Extracted 15 gates and 22 wires to a netlist network with 7 inputs and 7 outputs.

3.132.24.1. Executing ABC.

3.132.25. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9529$abc$7405$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL
Extracted 27 gates and 45 wires to a netlist network with 18 inputs and 21 outputs.

3.132.25.1. Executing ABC.

3.132.26. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9911$abc$7339$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL
Extracted 27 gates and 44 wires to a netlist network with 17 inputs and 21 outputs.

3.132.26.1. Executing ABC.

3.132.27. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9946$abc$7297$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL
Extracted 32 gates and 56 wires to a netlist network with 24 inputs and 20 outputs.

3.132.27.1. Executing ABC.

3.132.28. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$9979$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 64 gates and 97 wires to a netlist network with 33 inputs and 30 outputs.

3.132.28.1. Executing ABC.

3.132.29. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9853$abc$7774$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 23 gates and 44 wires to a netlist network with 21 inputs and 22 outputs.

3.132.29.1. Executing ABC.

3.132.30. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10048$abc$8754$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL
Extracted 23 gates and 38 wires to a netlist network with 15 inputs and 19 outputs.

3.132.30.1. Executing ABC.

3.132.31. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$11387$abc$9564$abc$8795$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
Extracted 52 gates and 73 wires to a netlist network with 21 inputs and 45 outputs.

3.132.31.1. Executing ABC.

3.132.32. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$9667$abc$7680$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 20 gates and 42 wires to a netlist network with 22 inputs and 13 outputs.

3.132.32.1. Executing ABC.

3.132.33. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, asynchronously reset by !\Reset_i_N
Extracted 326 gates and 462 wires to a netlist network with 136 inputs and 107 outputs.

3.132.33.1. Executing ABC.

3.132.34. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10483$abc$7832$auto$opt_dff.cc:194:make_patterns_logic$2009, asynchronously reset by !\Reset_i_N
Extracted 70 gates and 92 wires to a netlist network with 22 inputs and 32 outputs.

3.132.34.1. Executing ABC.

3.132.35. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10562$abc$7439$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL
Extracted 24 gates and 40 wires to a netlist network with 16 inputs and 21 outputs.

3.132.35.1. Executing ABC.

3.132.36. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12036$abc$10152$abc$8167$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, asynchronously reset by !\Reset_i_N
Extracted 41 gates and 54 wires to a netlist network with 13 inputs and 16 outputs.

3.132.36.1. Executing ABC.

3.132.37. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$10641$abc$8019$auto$opt_dff.cc:194:make_patterns_logic$2000, asynchronously reset by !\Reset_i_N
Extracted 110 gates and 142 wires to a netlist network with 32 inputs and 26 outputs.

3.132.37.1. Executing ABC.

3.132.38. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$11811$abc$9979$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 325 gates and 373 wires to a netlist network with 48 inputs and 67 outputs.

3.132.38.1. Executing ABC.

yosys> abc -dff -keepff

3.133. Executing ABC pass (technology mapping using ABC).

3.133.1. Summary of detected clock domains:
  22 cells in clk=\Clock_i, en=$abc$11102$abc$10750$abc$7738$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, arst=!\Reset_i_N, srst={ }
  102 cells in clk=\Clock_i, en=$abc$12036$abc$10152$abc$8215$lo00, arst=!\Reset_i_N, srst={ }
  28 cells in clk=\Clock_i, en=$abc$11240$abc$9336$abc$7501$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL, arst={ }, srst={ }
  28 cells in clk=\Clock_i, en=$abc$11272$abc$9367$abc$7470$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL, arst={ }, srst={ }
  7 cells in clk=\Clock_i, en=!$abc$11341$abc$9500$abc$8786$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, arst={ }, srst=$abc$11341$abc$9500$abc$8786$auto$opt_dff.cc:253:combine_resets$1968
  3 cells in clk=\Clock_i, en=$abc$12036$abc$10152$abc$8215$lo26, arst=!\Reset_i_N, srst={ }
  17 cells in clk=\Clock_i, en=$abc$11356$abc$9478$abc$7811$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, arst=!\Reset_i_N, srst={ }
  4 cells in clk=\Clock_i, en={ }, arst={ }, srst=!\Reset_i_N
  5 cells in clk=\Clock_i, en=!$abc$11392$abc$9569$abc$8801$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, arst={ }, srst=$abc$11387$abc$9564$abc$8795$auto$opt_dff.cc:253:combine_resets$1962
  29 cells in clk=\Clock_i, en=$abc$11309$abc$9398$abc$7372$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL, arst={ }, srst={ }
  3 cells in clk=\Clock_i, en=$abc$11398$abc$9575$abc$7700$auto$opt_dff.cc:194:make_patterns_logic$1990, arst=!\Reset_i_N, srst={ }
  7 cells in clk=\Clock_i, en=$abc$11402$abc$9579$abc$8745$auto$opt_dff.cc:219:make_patterns_logic$1955, arst={ }, srst=$abc$11811$abc$9979$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
  23 cells in clk=\Clock_i, en=$abc$11409$abc$9587$abc$8589$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  21 cells in clk=\Clock_i, en=$abc$11481$abc$9699$abc$7704$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  28 cells in clk=\Clock_i, en=$abc$11511$abc$9727$abc$8614$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, arst=!\Reset_i_N, srst={ }
  35 cells in clk=\Clock_i, en=$abc$11540$abc$9763$abc$7627$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  17 cells in clk=\Clock_i, en=$abc$11575$abc$9795$abc$8638$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, arst=!\Reset_i_N, srst={ }
  30 cells in clk=\Clock_i, en=$abc$11595$abc$9817$abc$7580$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  41 cells in clk=\Clock_i, en=$abc$12036$abc$10152$abc$8215$lo16, arst=!\Reset_i_N, srst={ }
  14 cells in clk=\Clock_i, en=$abc$11675$abc$9882$abc$8657$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, arst=!\Reset_i_N, srst={ }
  14 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$11695$abc$9514$abc$7283$auto$fsm_map.cc:170:map_fsm$1897[1]
  27 cells in clk=\Clock_i, en=$abc$11711$abc$9529$abc$7405$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL, arst={ }, srst={ }
  26 cells in clk=\Clock_i, en=$abc$11744$abc$9911$abc$7339$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL, arst={ }, srst={ }
  32 cells in clk=\Clock_i, en=$abc$11778$abc$9946$abc$7297$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL, arst={ }, srst={ }
  70 cells in clk=\Clock_i, en=!$abc$11811$abc$9979$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn, arst={ }, srst={ }
  16 cells in clk=\Clock_i, en=$abc$11875$abc$9853$abc$7774$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, arst=!\Reset_i_N, srst={ }
  23 cells in clk=\Clock_i, en=$abc$11907$abc$10048$abc$8754$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL, arst={ }, srst={ }
  19 cells in clk=\Clock_i, en=$abc$12007$abc$9667$abc$7680$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, arst=!\Reset_i_N, srst={ }
  82 cells in clk=\Clock_i, en=$abc$12389$abc$10483$abc$7832$auto$opt_dff.cc:194:make_patterns_logic$2009, arst=!\Reset_i_N, srst={ }
  26 cells in clk=\Clock_i, en=$abc$11447$abc$9622$abc$7532$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, arst=!\Reset_i_N, srst={ }
  53 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$11387$abc$9564$abc$8795$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
  23 cells in clk=\Clock_i, en=$abc$12460$abc$10562$abc$7439$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL, arst={ }, srst={ }
  327 cells in clk=\Clock_i, en={ }, arst=!\Reset_i_N, srst={ }
  98 cells in clk=\Clock_i, en=$abc$12539$abc$10641$abc$8019$auto$opt_dff.cc:194:make_patterns_logic$2000, arst=!\Reset_i_N, srst={ }
  38 cells in clk=\Clock_i, en=$abc$12036$abc$10152$abc$8167$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, arst=!\Reset_i_N, srst={ }
  7 cells in clk=\Clock_i, en={ }, arst={ }, srst={ }
  314 cells in clk=\Clock_i, en={ }, arst={ }, srst=$abc$11811$abc$9979$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn

3.133.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11102$abc$10750$abc$7738$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 22 gates and 38 wires to a netlist network with 16 inputs and 22 outputs.

3.133.2.1. Executing ABC.

3.133.3. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12036$abc$10152$abc$8215$lo00, asynchronously reset by !\Reset_i_N
Extracted 102 gates and 195 wires to a netlist network with 93 inputs and 38 outputs.

3.133.3.1. Executing ABC.

3.133.4. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11240$abc$9336$abc$7501$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_0.WD_SEL
Extracted 28 gates and 48 wires to a netlist network with 20 inputs and 25 outputs.

3.133.4.1. Executing ABC.

3.133.5. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11272$abc$9367$abc$7470$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_1.WD_SEL
Extracted 28 gates and 48 wires to a netlist network with 20 inputs and 21 outputs.

3.133.5.1. Executing ABC.

3.133.6. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$11341$abc$9500$abc$8786$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n54$1416, synchronously reset by $abc$11341$abc$9500$abc$8786$auto$opt_dff.cc:253:combine_resets$1968
Extracted 7 gates and 13 wires to a netlist network with 5 inputs and 6 outputs.

3.133.6.1. Executing ABC.

3.133.7. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12036$abc$10152$abc$8215$lo26, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 5 wires to a netlist network with 2 inputs and 3 outputs.

3.133.7.1. Executing ABC.

3.133.8. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11356$abc$9478$abc$7811$u_IR_Emitter_Interface.u_IR_Emitter_Registers.control_reg_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 17 gates and 34 wires to a netlist network with 17 inputs and 14 outputs.

3.133.8.1. Executing ABC.

3.133.9. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by !\Reset_i_N
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.133.9.1. Executing ABC.

3.133.10. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$11392$abc$9569$abc$8801$flatten\u_i2cSlaveTop.\u_i2cSlave.$verific$n62$1421, synchronously reset by $abc$13200$abc$11387$abc$9564$abc$8795$auto$opt_dff.cc:253:combine_resets$1962
Extracted 5 gates and 10 wires to a netlist network with 4 inputs and 5 outputs.

3.133.10.1. Executing ABC.

3.133.11. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11309$abc$9398$abc$7372$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_4.WD_SEL
Extracted 29 gates and 49 wires to a netlist network with 20 inputs and 22 outputs.

3.133.11.1. Executing ABC.

3.133.12. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11398$abc$9575$abc$7700$auto$opt_dff.cc:194:make_patterns_logic$1990, asynchronously reset by !\Reset_i_N
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 2 outputs.

3.133.12.1. Executing ABC.

3.133.13. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11402$abc$9579$abc$8745$auto$opt_dff.cc:219:make_patterns_logic$1955, synchronously reset by $abc$11811$abc$9979$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 7 gates and 14 wires to a netlist network with 7 inputs and 3 outputs.

3.133.13.1. Executing ABC.

3.133.14. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11409$abc$9587$abc$8589$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 23 gates and 44 wires to a netlist network with 21 inputs and 22 outputs.

3.133.14.1. Executing ABC.

3.133.15. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11481$abc$9699$abc$7704$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemAddr_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 21 gates and 33 wires to a netlist network with 12 inputs and 20 outputs.

3.133.15.1. Executing ABC.

3.133.16. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11511$abc$9727$abc$8614$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 28 gates and 54 wires to a netlist network with 26 inputs and 27 outputs.

3.133.16.1. Executing ABC.

3.133.17. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11540$abc$9763$abc$7627$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Dir_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 35 gates and 55 wires to a netlist network with 20 inputs and 27 outputs.

3.133.17.1. Executing ABC.

3.133.18. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11575$abc$9795$abc$8638$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Start_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 17 gates and 32 wires to a netlist network with 15 inputs and 16 outputs.

3.133.18.1. Executing ABC.

3.133.19. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11595$abc$9817$abc$7580$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Duty_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 30 gates and 57 wires to a netlist network with 27 inputs and 27 outputs.

3.133.19.1. Executing ABC.

3.133.20. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12036$abc$10152$abc$8215$lo16, asynchronously reset by !\Reset_i_N
Extracted 41 gates and 56 wires to a netlist network with 15 inputs and 15 outputs.

3.133.20.1. Executing ABC.

3.133.21. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11675$abc$9882$abc$8657$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_H_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 14 gates and 30 wires to a netlist network with 16 inputs and 13 outputs.

3.133.21.1. Executing ABC.

3.133.22. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$11695$abc$9514$abc$7283$auto$fsm_map.cc:170:map_fsm$1897[1]
Extracted 14 gates and 21 wires to a netlist network with 7 inputs and 6 outputs.

3.133.22.1. Executing ABC.

3.133.23. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11711$abc$9529$abc$7405$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_3.WD_SEL
Extracted 27 gates and 45 wires to a netlist network with 18 inputs and 20 outputs.

3.133.23.1. Executing ABC.

3.133.24. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11744$abc$9911$abc$7339$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_5.WD_SEL
Extracted 26 gates and 43 wires to a netlist network with 17 inputs and 19 outputs.

3.133.24.1. Executing ABC.

3.133.25. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11778$abc$9946$abc$7297$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_6.WD_SEL
Extracted 32 gates and 56 wires to a netlist network with 24 inputs and 20 outputs.

3.133.25.1. Executing ABC.

3.133.26. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by !$abc$11811$abc$9979$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 70 gates and 113 wires to a netlist network with 43 inputs and 37 outputs.

3.133.26.1. Executing ABC.

3.133.27. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11875$abc$9853$abc$7774$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_MemRd_Stop_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 16 gates and 30 wires to a netlist network with 14 inputs and 15 outputs.

3.133.27.1. Executing ABC.

3.133.28. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11907$abc$10048$abc$8754$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_7.WD_SEL
Extracted 23 gates and 38 wires to a netlist network with 15 inputs and 19 outputs.

3.133.28.1. Executing ABC.

3.133.29. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12007$abc$9667$abc$7680$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Gpio_Port_Reg_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 19 gates and 40 wires to a netlist network with 21 inputs and 12 outputs.

3.133.29.1. Executing ABC.

3.133.30. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12389$abc$10483$abc$7832$auto$opt_dff.cc:194:make_patterns_logic$2009, asynchronously reset by !\Reset_i_N
Extracted 82 gates and 115 wires to a netlist network with 33 inputs and 44 outputs.

3.133.30.1. Executing ABC.

3.133.31. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$11447$abc$9622$abc$7532$u_IR_Emitter_Interface.u_IR_Emitter_Registers.IR_Emitter_Carrier_Cycle_Len_L_we_dcd, asynchronously reset by !\Reset_i_N
Extracted 26 gates and 47 wires to a netlist network with 21 inputs and 24 outputs.

3.133.31.1. Executing ABC.

3.133.32. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$13200$abc$11387$abc$9564$abc$8795$u_i2cSlaveTop.u_i2cSlave.rstPipe[1]
Extracted 53 gates and 74 wires to a netlist network with 21 inputs and 45 outputs.

3.133.32.1. Executing ABC.

3.133.33. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12460$abc$10562$abc$7439$u_IR_Emitter_Interface.u_IR_Emitter_SRAM_2.WD_SEL
Extracted 23 gates and 38 wires to a netlist network with 15 inputs and 19 outputs.

3.133.33.1. Executing ABC.

3.133.34. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, asynchronously reset by !\Reset_i_N
Extracted 327 gates and 458 wires to a netlist network with 131 inputs and 101 outputs.

3.133.34.1. Executing ABC.

3.133.35. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12539$abc$10641$abc$8019$auto$opt_dff.cc:194:make_patterns_logic$2000, asynchronously reset by !\Reset_i_N
Extracted 98 gates and 124 wires to a netlist network with 26 inputs and 20 outputs.

3.133.35.1. Executing ABC.

3.133.36. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, enabled by $abc$12036$abc$10152$abc$8167$flatten\u_IR_Emitter_Interface.\u_IR_Emitter_Carrier_Generator.$verific$n99$780, asynchronously reset by !\Reset_i_N
Extracted 38 gates and 53 wires to a netlist network with 15 inputs and 19 outputs.

3.133.36.1. Executing ABC.

3.133.37. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i
Extracted 7 gates and 12 wires to a netlist network with 5 inputs and 5 outputs.

3.133.37.1. Executing ABC.

3.133.38. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \Clock_i, synchronously reset by $abc$13631$abc$11811$abc$9979$abc$8854$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.ResetIn
Extracted 314 gates and 363 wires to a netlist network with 49 inputs and 66 outputs.

3.133.38.1. Executing ABC.

yosys> opt_ffinv

3.134. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 2 inverters.

yosys> opt_expr

3.135. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~7 debug messages>

yosys> opt_merge -nomux

3.136. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~156 debug messages>
Removed a total of 52 cells.

yosys> opt_muxtree

3.137. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.138. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.139. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.140. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.141. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$13631$auto$blifparse.cc:362:parse_blif$13639 ($_DFFE_PN_) from module top (D = $abc$13631$n190_li7, Q = $abc$13631$abc$11811$abc$9979$abc$8678$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr[1]).
Adding EN signal on $abc$13631$auto$blifparse.cc:362:parse_blif$13638 ($_DFFE_PN_) from module top (D = $abc$13631$n186_li6, Q = $abc$13631$abc$11811$abc$9979$abc$8678$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr[5]).
Adding EN signal on $abc$13631$auto$blifparse.cc:362:parse_blif$13637 ($_DFFE_PN_) from module top (D = $abc$13631$n182_li5, Q = $abc$13631$abc$11811$abc$9979$abc$8678$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr[7]).
Adding EN signal on $abc$13631$auto$blifparse.cc:362:parse_blif$13636 ($_DFFE_PN_) from module top (D = $abc$13631$n178_li4, Q = $abc$13631$abc$11811$abc$9979$abc$8678$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr[6]).
Adding EN signal on $abc$13631$auto$blifparse.cc:362:parse_blif$13635 ($_DFFE_PN_) from module top (D = $abc$13631$n174_li3, Q = $abc$13631$abc$11811$abc$9979$abc$8678$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr[0]).
Adding EN signal on $abc$13631$auto$blifparse.cc:362:parse_blif$13634 ($_DFFE_PN_) from module top (D = $abc$13631$n170_li2, Q = $abc$13631$abc$11811$abc$9979$abc$8678$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr[2]).
Adding EN signal on $abc$13631$auto$blifparse.cc:362:parse_blif$13633 ($_DFFE_PN_) from module top (D = $abc$13631$n166_li1, Q = $abc$13631$abc$11811$abc$9979$abc$8678$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr[4]).
Adding EN signal on $abc$13631$auto$blifparse.cc:362:parse_blif$13632 ($_DFFE_PN_) from module top (D = $abc$13631$n162_li0, Q = $abc$13631$abc$11811$abc$9979$abc$8678$u_i2cSlaveTop.u_i2cSlave.u_i2cSlaveSerialInterface.regAddr[3]).

yosys> opt_clean

3.142. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 4 unused cells and 9178 unused wires.
<suppressed ~52 debug messages>

yosys> opt_expr

3.143. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~29 debug messages>

yosys> opt_muxtree

3.144. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.145. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.146. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~135 debug messages>
Removed a total of 45 cells.

yosys> opt_share

3.147. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.148. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.149. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 54 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.150. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_muxtree

3.151. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.152. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.153. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.154. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.155. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.156. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.157. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 3

yosys> bmuxmap

3.158. Executing BMUXMAP pass.

yosys> demuxmap

3.159. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_CxDzmD/abc_tmp_1.scr

3.160. Executing ABC pass (technology mapping using ABC).

3.160.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 1275 gates and 1606 wires to a netlist network with 330 inputs and 216 outputs.

3.160.1.1. Executing ABC.
DE:   #PIs = 330  #Luts =   450  Max Lvl =   5  Avg Lvl =   2.32  [   0.09 sec. at Pass 0]{firstMap}[1]
DE:   #PIs = 330  #Luts =   428  Max Lvl =   8  Avg Lvl =   2.98  [   1.33 sec. at Pass 1]{initMapFlow}[2]
DE:   #PIs = 330  #Luts =   416  Max Lvl =   7  Avg Lvl =   2.84  [   0.50 sec. at Pass 2]{map}[2]
DE:   #PIs = 330  #Luts =   402  Max Lvl =   6  Avg Lvl =   2.67  [   0.62 sec. at Pass 3]{postMap}[6]
DE:   #PIs = 330  #Luts =   393  Max Lvl =   7  Avg Lvl =   2.74  [   0.47 sec. at Pass 4]{map}[12]
DE:   #PIs = 330  #Luts =   388  Max Lvl =   6  Avg Lvl =   2.69  [   0.64 sec. at Pass 5]{postMap}[16]
DE:   #PIs = 330  #Luts =   388  Max Lvl =   6  Avg Lvl =   2.69  [   0.56 sec. at Pass 6]{map}[16]
DE:   #PIs = 330  #Luts =   387  Max Lvl =   7  Avg Lvl =   2.66  [   0.57 sec. at Pass 7]{postMap}[16]
DE:   #PIs = 330  #Luts =   384  Max Lvl =   7  Avg Lvl =   2.69  [   0.56 sec. at Pass 8]{map}[16]
DE:   #PIs = 330  #Luts =   382  Max Lvl =   6  Avg Lvl =   2.64  [   0.64 sec. at Pass 9]{postMap}[16]
DE:   #PIs = 330  #Luts =   381  Max Lvl =   7  Avg Lvl =   2.61  [   0.52 sec. at Pass 10]{map}[16]
DE:   #PIs = 330  #Luts =   380  Max Lvl =   6  Avg Lvl =   2.65  [   0.66 sec. at Pass 11]{postMap}[16]
DE:   #PIs = 330  #Luts =   378  Max Lvl =   7  Avg Lvl =   2.62  [   0.53 sec. at Pass 12]{map}[16]
DE:   #PIs = 330  #Luts =   378  Max Lvl =   7  Avg Lvl =   2.62  [   0.62 sec. at Pass 13]{postMap}[16]
DE:   #PIs = 330  #Luts =   377  Max Lvl =   7  Avg Lvl =   2.69  [   0.50 sec. at Pass 14]{map}[16]
DE:   #PIs = 330  #Luts =   375  Max Lvl =   7  Avg Lvl =   2.69  [   0.65 sec. at Pass 15]{postMap}[16]
DE:   #PIs = 330  #Luts =   375  Max Lvl =   7  Avg Lvl =   2.69  [   0.52 sec. at Pass 16]{map}[16]
DE:   #PIs = 330  #Luts =   374  Max Lvl =   7  Avg Lvl =   2.69  [   0.62 sec. at Pass 17]{postMap}[16]
DE:   #PIs = 330  #Luts =   373  Max Lvl =   7  Avg Lvl =   2.70  [   0.53 sec. at Pass 18]{map}[16]
DE:   #PIs = 330  #Luts =   373  Max Lvl =   7  Avg Lvl =   2.70  [   0.64 sec. at Pass 19]{postMap}[16]
DE:   #PIs = 330  #Luts =   373  Max Lvl =   7  Avg Lvl =   2.70  [   0.68 sec. at Pass 20]{map}[16]
DE:   #PIs = 330  #Luts =   372  Max Lvl =   7  Avg Lvl =   2.70  [   0.68 sec. at Pass 21]{postMap}[16]
DE:   #PIs = 330  #Luts =   372  Max Lvl =   7  Avg Lvl =   2.70  [   0.56 sec. at Pass 22]{map}[16]
DE:   #PIs = 330  #Luts =   371  Max Lvl =   7  Avg Lvl =   2.77  [   0.70 sec. at Pass 23]{postMap}[16]
DE:   #PIs = 330  #Luts =   371  Max Lvl =   7  Avg Lvl =   2.77  [   0.69 sec. at Pass 24]{map}[16]
DE:   #PIs = 330  #Luts =   371  Max Lvl =   7  Avg Lvl =   2.77  [   0.60 sec. at Pass 25]{postMap}[16]
DE:   #PIs = 330  #Luts =   371  Max Lvl =   7  Avg Lvl =   2.77  [   0.52 sec. at Pass 26]{map}[16]
DE:   #PIs = 330  #Luts =   371  Max Lvl =   6  Avg Lvl =   2.59  [   1.96 sec. at Pass 27]{pushMap}[16]
DE:   #PIs = 330  #Luts =   371  Max Lvl =   6  Avg Lvl =   2.59  [   0.71 sec. at Pass 28]{postMap}[16]
DE:   #PIs = 330  #Luts =   371  Max Lvl =   6  Avg Lvl =   2.59  [   0.51 sec. at Pass 29]{map}[16]
DE:   #PIs = 330  #Luts =   371  Max Lvl =   6  Avg Lvl =   2.59  [   0.64 sec. at Pass 30]{postMap}[16]
DE:   #PIs = 330  #Luts =   370  Max Lvl =   6  Avg Lvl =   2.64  [   2.30 sec. at Pass 31]{pushMap}[16]
DE:   #PIs = 330  #Luts =   370  Max Lvl =   6  Avg Lvl =   2.64  [   0.55 sec. at Pass 32]{map}[16]
DE:   #PIs = 330  #Luts =   369  Max Lvl =   7  Avg Lvl =   2.71  [   0.73 sec. at Pass 33]{postMap}[16]
DE:   #PIs = 330  #Luts =   369  Max Lvl =   6  Avg Lvl =   2.67  [   0.50 sec. at Pass 34]{map}[16]
DE:   #PIs = 330  #Luts =   368  Max Lvl =   7  Avg Lvl =   2.67  [   0.63 sec. at Pass 35]{postMap}[16]
DE:   #PIs = 330  #Luts =   368  Max Lvl =   7  Avg Lvl =   2.67  [   0.52 sec. at Pass 36]{map}[16]
DE:   #PIs = 330  #Luts =   368  Max Lvl =   7  Avg Lvl =   2.67  [   0.96 sec. at Pass 37]{postMap}[16]
DE:   #PIs = 330  #Luts =   368  Max Lvl =   7  Avg Lvl =   2.67  [   0.53 sec. at Pass 38]{map}[16]
DE:   #PIs = 330  #Luts =   367  Max Lvl =   7  Avg Lvl =   2.68  [   3.43 sec. at Pass 39]{pushMap}[16]
DE:   #PIs = 330  #Luts =   367  Max Lvl =   7  Avg Lvl =   2.68  [   1.16 sec. at Pass 40]{postMap}[16]
DE:   #PIs = 330  #Luts =   367  Max Lvl =   7  Avg Lvl =   2.68  [   1.03 sec. at Pass 41]{map}[16]
DE:   #PIs = 330  #Luts =   367  Max Lvl =   7  Avg Lvl =   2.68  [   1.98 sec. at Pass 42]{postMap}[16]
DE:   #PIs = 330  #Luts =   367  Max Lvl =   6  Avg Lvl =   2.67  [   3.71 sec. at Pass 43]{pushMap}[16]
DE:   #PIs = 330  #Luts =   367  Max Lvl =   6  Avg Lvl =   2.67  [   1.23 sec. at Pass 44]{map}[16]
DE:   #PIs = 330  #Luts =   367  Max Lvl =   6  Avg Lvl =   2.67  [   2.11 sec. at Pass 45]{postMap}[16]
DE:   #PIs = 330  #Luts =   367  Max Lvl =   6  Avg Lvl =   2.67  [   0.96 sec. at Pass 46]{map}[16]
DE:   #PIs = 330  #Luts =   367  Max Lvl =   6  Avg Lvl =   2.67  [   1.08 sec. at Pass 47]{finalMap}[16]

yosys> opt_expr

3.161. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.162. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.163. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.164. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.165. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.166. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.167. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.168. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1530 unused wires.
<suppressed ~20 debug messages>

yosys> opt_expr

3.169. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.170. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 6 inverters.

yosys> stat

3.171. Printing statistics.

=== top ===

   Number of wires:               1617
   Number of wire bits:           2438
   Number of public wires:         276
   Number of public wire bits:    1097
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                706
     $_DFFE_PN0P_                  138
     $_DFFE_PN1P_                    6
     $_DFFE_PP_                     80
     $_DFF_PN0_                     53
     $_DFF_PN1_                      1
     $_DFF_P_                        2
     $_SDFFE_PP0N_                   2
     $_SDFFE_PP0P_                   1
     $_SDFF_PN0_                     1
     $_SDFF_PP0_                    55
     $lut                          367


yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFFE_??_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 -cell $_DLATCH_?_ 0 -cell $_DLATCH_???_ 0

3.172. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.173. Printing statistics.

=== top ===

   Number of wires:               1617
   Number of wire bits:           2438
   Number of public wires:         276
   Number of public wire bits:    1097
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                706
     $_DFFE_PN0P_                  138
     $_DFFE_PN1P_                    6
     $_DFFE_PP_                     80
     $_DFF_PN0_                     53
     $_DFF_PN1_                      1
     $_DFF_P_                        2
     $_SDFFE_PP0N_                   2
     $_SDFFE_PP0P_                   1
     $_SDFF_PN0_                     1
     $_SDFF_PP0_                    55
     $lut                          367


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/ffs_map.v

3.174. Executing TECHMAP pass (map to technology primitives).

3.174.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.174.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Generating RTLIL representation for module `\$_SDFFE_PP0P_'.
Generating RTLIL representation for module `\$_SDFFE_PP0N_'.
Generating RTLIL representation for module `\$_SDFFE_PN0P_'.
Generating RTLIL representation for module `\$_SDFFE_PN0N_'.
Generating RTLIL representation for module `\$_SDFFE_PP1P_'.
Generating RTLIL representation for module `\$_SDFFE_PP1N_'.
Generating RTLIL representation for module `\$_SDFFE_PN1P_'.
Generating RTLIL representation for module `\$_SDFFE_PN1N_'.
Generating RTLIL representation for module `\$_SDFFE_NP0P_'.
Generating RTLIL representation for module `\$_SDFFE_NP0N_'.
Generating RTLIL representation for module `\$_SDFFE_NN0P_'.
Generating RTLIL representation for module `\$_SDFFE_NN0N_'.
Generating RTLIL representation for module `\$_SDFFE_NP1P_'.
Generating RTLIL representation for module `\$_SDFFE_NP1N_'.
Generating RTLIL representation for module `\$_SDFFE_NN1P_'.
Generating RTLIL representation for module `\$_SDFFE_NN1N_'.
Generating RTLIL representation for module `\$_DLATCH_P_'.
Generating RTLIL representation for module `\$_DLATCH_N_'.
Generating RTLIL representation for module `\$_DLATCH_PP0_'.
Generating RTLIL representation for module `\$_DLATCH_NP0_'.
Generating RTLIL representation for module `\$_DLATCH_PN0_'.
Generating RTLIL representation for module `\$_DLATCH_NN0_'.
Generating RTLIL representation for module `\$_DLATCH_PP1_'.
Generating RTLIL representation for module `\$_DLATCH_NP1_'.
Generating RTLIL representation for module `\$_DLATCH_PN1_'.
Generating RTLIL representation for module `\$_DLATCH_NN1_'.
Successfully finished Verilog frontend.

3.174.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP_ for cells of type $_DFFE_PP_.
Using template \$_SDFFE_PP0N_ for cells of type $_SDFFE_PP0N_.
Using template \$_SDFFE_PP0P_ for cells of type $_SDFFE_PP0P_.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_SDFF_PP0_ for cells of type $_SDFF_PP0_.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using template \$_SDFF_PN0_ for cells of type $_SDFF_PN0_.
Using template \$_DFFE_PN1P_ for cells of type $_DFFE_PN1P_.
Using template \$_DFF_PN1_ for cells of type $_DFF_PN1_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~1056 debug messages>

yosys> opt_expr -mux_undef

3.175. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~8866 debug messages>

yosys> simplemap

3.176. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.177. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.178. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~3132 debug messages>
Removed a total of 1044 cells.

yosys> opt_dff -nodffe -nosdff

3.179. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.180. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 2430 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.181. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~214 debug messages>

yosys> opt_merge -nomux

3.182. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.183. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.184. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.185. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.186. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.187. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.188. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 51 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.189. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_CxDzmD/abc_tmp_2.scr

3.190. Executing ABC pass (technology mapping using ABC).

3.190.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 1546 gates and 1871 wires to a netlist network with 323 inputs and 225 outputs.

3.190.1.1. Executing ABC.
DE:   #PIs = 323  #Luts =   380  Max Lvl =   5  Avg Lvl =   2.09  [   0.12 sec. at Pass 0]{firstMap}[1]
DE:   #PIs = 323  #Luts =   380  Max Lvl =   5  Avg Lvl =   2.09  [   2.23 sec. at Pass 1]{initMapFlow}[2]
DE:   #PIs = 323  #Luts =   377  Max Lvl =   7  Avg Lvl =   2.65  [   0.57 sec. at Pass 2]{map}[2]
DE:   #PIs = 323  #Luts =   377  Max Lvl =   7  Avg Lvl =   2.65  [   1.29 sec. at Pass 3]{postMap}[6]
DE:   #PIs = 323  #Luts =   377  Max Lvl =   7  Avg Lvl =   2.65  [   1.80 sec. at Pass 4]{map}[12]
DE:   #PIs = 323  #Luts =   377  Max Lvl =   7  Avg Lvl =   2.65  [   1.39 sec. at Pass 5]{postMap}[16]
DE:   #PIs = 323  #Luts =   376  Max Lvl =   7  Avg Lvl =   2.57  [   3.43 sec. at Pass 6]{pushMap}[16]
DE:   #PIs = 323  #Luts =   376  Max Lvl =   7  Avg Lvl =   2.57  [   1.53 sec. at Pass 7]{map}[16]
DE:   #PIs = 323  #Luts =   376  Max Lvl =   7  Avg Lvl =   2.57  [   1.77 sec. at Pass 8]{postMap}[16]
DE:   #PIs = 323  #Luts =   376  Max Lvl =   7  Avg Lvl =   2.57  [   1.60 sec. at Pass 9]{map}[16]
DE:   #PIs = 323  #Luts =   374  Max Lvl =   7  Avg Lvl =   2.58  [   2.98 sec. at Pass 10]{pushMap}[16]
DE:   #PIs = 323  #Luts =   374  Max Lvl =   7  Avg Lvl =   2.58  [   1.47 sec. at Pass 11]{postMap}[16]
DE:   #PIs = 323  #Luts =   374  Max Lvl =   7  Avg Lvl =   2.58  [   0.82 sec. at Pass 12]{map}[16]
DE:   #PIs = 323  #Luts =   373  Max Lvl =   7  Avg Lvl =   2.57  [   1.51 sec. at Pass 13]{postMap}[16]
DE:   #PIs = 323  #Luts =   373  Max Lvl =   7  Avg Lvl =   2.57  [   0.83 sec. at Pass 14]{map}[16]
DE:   #PIs = 323  #Luts =   373  Max Lvl =   7  Avg Lvl =   2.57  [   0.99 sec. at Pass 15]{postMap}[16]
DE:   #PIs = 323  #Luts =   373  Max Lvl =   7  Avg Lvl =   2.57  [   1.00 sec. at Pass 16]{map}[16]
DE:   #PIs = 323  #Luts =   373  Max Lvl =   7  Avg Lvl =   2.57  [   4.50 sec. at Pass 17]{pushMap}[16]
DE:   #PIs = 323  #Luts =   373  Max Lvl =   7  Avg Lvl =   2.57  [   0.94 sec. at Pass 18]{finalMap}[16]

yosys> opt_expr

3.191. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.192. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.193. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.194. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.195. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.196. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.197. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.198. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1568 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.199. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.200. Executing HIERARCHY pass (managing design hierarchy).

3.200.1. Analyzing design hierarchy..
Top module:  \top

3.200.2. Analyzing design hierarchy..
Top module:  \top
Removed 0 unused modules.

yosys> stat

3.201. Printing statistics.

=== top ===

   Number of wires:               1623
   Number of wire bits:           2444
   Number of public wires:         276
   Number of public wire bits:    1097
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                712
     $lut                          373
     dff                             2
     dffe                           80
     dffr                           54
     dffre                         144
     sdffre                         59


yosys> opt_clean -purge

3.202. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 168 unused wires.
<suppressed ~168 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.203. Executing Verilog backend.
Dumping module `\top'.

Warnings: 9 unique messages, 9 total
End of script. Logfile hash: 3fbf36c901, CPU: user 7.31s system 0.40s, MEM: 52.31 MB peak
Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)
Time spent: 99% 6x abc (600 sec), 0% 38x opt_expr (1 sec), ...
real 95.58
user 534.97
sys 71.35
