
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.8
 Yosys 0.16+6 (git sha1 7f5477eb1, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k crp.v des.v des3.v key_sel.v key_sel3.v sbox1.v sbox2.v sbox3.v sbox4.v sbox5.v sbox6.v sbox7.v sbox8.v

yosys> verific -vlog2k crp.v des.v des3.v key_sel.v key_sel3.v sbox1.v sbox2.v sbox3.v sbox4.v sbox5.v sbox6.v sbox7.v sbox8.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'crp.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'des.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'des3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'key_sel.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'key_sel3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox1.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox2.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox4.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox5.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox6.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox7.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox8.v'

yosys> synth_rs -top des3 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.2.37

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top des3

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] des3.v:35: compiling module 'des3'
VERIFIC-WARNING [VERI-2371] des3.v:57: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des3.v:61: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des3.v:65: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des3.v:69: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] des.v:35: compiling module 'des'
VERIFIC-WARNING [VERI-2371] des.v:54: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:58: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] key_sel.v:36: compiling module 'key_sel'
VERIFIC-WARNING [VERI-2371] key_sel.v:51: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:52: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:53: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:54: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:55: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:56: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:57: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:58: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:59: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:60: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:61: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:62: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:63: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:64: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:65: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] crp.v:35: compiling module 'crp'
VERIFIC-INFO [VERI-1018] sbox1.v:35: compiling module 'sbox1'
VERIFIC-INFO [VERI-1018] sbox2.v:35: compiling module 'sbox2'
VERIFIC-INFO [VERI-1018] sbox3.v:35: compiling module 'sbox3'
VERIFIC-INFO [VERI-1018] sbox4.v:35: compiling module 'sbox4'
VERIFIC-INFO [VERI-1018] sbox5.v:35: compiling module 'sbox5'
VERIFIC-INFO [VERI-1018] sbox6.v:35: compiling module 'sbox6'
VERIFIC-INFO [VERI-1018] sbox7.v:35: compiling module 'sbox7'
VERIFIC-INFO [VERI-1018] sbox8.v:35: compiling module 'sbox8'
VERIFIC-WARNING [VERI-2371] des.v:109: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:113: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:117: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:121: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:125: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:129: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:132: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:135: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:138: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:141: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:144: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:147: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:150: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:153: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:156: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:159: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:162: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:165: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:168: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:171: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:174: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:177: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:180: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:183: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:186: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:189: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:192: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:195: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:198: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:201: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:205: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:209: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:233: delay control is not supported for synthesis
Importing module des3.
Importing module des.
Importing module crp.
Importing module key_sel.
Importing module sbox1.
Importing module sbox2.
Importing module sbox3.
Importing module sbox4.
Importing module sbox5.
Importing module sbox6.
Importing module sbox7.
Importing module sbox8.

3.3.1. Analyzing design hierarchy..
Top module:  \des3
Used module:     \des
Used module:         \crp
Used module:             \sbox8
Used module:             \sbox7
Used module:             \sbox6
Used module:             \sbox5
Used module:             \sbox4
Used module:             \sbox3
Used module:             \sbox2
Used module:             \sbox1
Used module:         \key_sel

3.3.2. Analyzing design hierarchy..
Top module:  \des3
Used module:     \des
Used module:         \crp
Used module:             \sbox8
Used module:             \sbox7
Used module:             \sbox6
Used module:             \sbox5
Used module:             \sbox4
Used module:             \sbox3
Used module:             \sbox2
Used module:             \sbox1
Used module:         \key_sel
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module sbox8.
Optimizing module sbox7.
Optimizing module sbox6.
Optimizing module sbox5.
Optimizing module sbox4.
Optimizing module sbox3.
Optimizing module sbox2.
Optimizing module sbox1.
Optimizing module key_sel.
Optimizing module crp.
Optimizing module des.
Optimizing module des3.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module sbox8.
Deleting now unused module sbox7.
Deleting now unused module sbox6.
Deleting now unused module sbox5.
Deleting now unused module sbox4.
Deleting now unused module sbox3.
Deleting now unused module sbox2.
Deleting now unused module sbox1.
Deleting now unused module key_sel.
Deleting now unused module crp.
Deleting now unused module des.
<suppressed ~28 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~16 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 7 unused cells and 2786 unused wires.
<suppressed ~419 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module des3...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~50 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$key_c_r[9]_reg$des3.v:69$155 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[8]_reg$des3.v:69$156 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[7]_reg$des3.v:69$157 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[6]_reg$des3.v:69$158 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[5]_reg$des3.v:69$159 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[4]_reg$des3.v:69$160 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[3]_reg$des3.v:69$161 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[33]_reg$des3.v:69$65 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[32]_reg$des3.v:69$132 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[31]_reg$des3.v:69$133 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[30]_reg$des3.v:69$134 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[2]_reg$des3.v:69$162 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[29]_reg$des3.v:69$135 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[28]_reg$des3.v:69$136 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[27]_reg$des3.v:69$137 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[26]_reg$des3.v:69$138 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[25]_reg$des3.v:69$139 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[24]_reg$des3.v:69$140 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[23]_reg$des3.v:69$141 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[22]_reg$des3.v:69$142 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[21]_reg$des3.v:69$143 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[20]_reg$des3.v:69$144 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[1]_reg$des3.v:69$163 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[19]_reg$des3.v:69$145 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[18]_reg$des3.v:69$146 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[17]_reg$des3.v:69$147 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[16]_reg$des3.v:69$148 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[15]_reg$des3.v:69$149 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[14]_reg$des3.v:69$150 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[13]_reg$des3.v:69$151 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[12]_reg$des3.v:69$152 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[11]_reg$des3.v:69$153 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[10]_reg$des3.v:69$154 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[0]_reg$des3.v:65$164 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[9]_reg$des3.v:61$88 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[8]_reg$des3.v:61$89 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[7]_reg$des3.v:61$90 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[6]_reg$des3.v:61$91 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[5]_reg$des3.v:61$92 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[4]_reg$des3.v:61$93 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[3]_reg$des3.v:61$94 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[2]_reg$des3.v:61$95 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[1]_reg$des3.v:61$96 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[16]_reg$des3.v:61$724 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[15]_reg$des3.v:61$82 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[14]_reg$des3.v:61$83 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[13]_reg$des3.v:61$84 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[12]_reg$des3.v:61$85 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[11]_reg$des3.v:61$86 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[10]_reg$des3.v:61$87 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[0]_reg$des3.v:57$97 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r9_reg$key_sel.v:66$1070 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r8_reg$key_sel.v:66$1069 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r7_reg$key_sel.v:66$1068 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r6_reg$key_sel.v:66$1067 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r5_reg$key_sel.v:66$1066 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r4_reg$key_sel.v:66$1065 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r3_reg$key_sel.v:66$1064 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r2_reg$key_sel.v:66$1063 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r1_reg$key_sel.v:66$1062 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r14_reg$key_sel.v:66$1075 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r13_reg$key_sel.v:66$1074 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r12_reg$key_sel.v:66$1073 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r11_reg$key_sel.v:66$1072 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r10_reg$key_sel.v:66$1071 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r0_reg$key_sel.v:66$1061 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$key_r_reg$des.v:54$781 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$desOut_reg$des.v:233$989 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$desIn_r_reg$des.v:58$783 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R9_reg$des.v:171$957 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R8_reg$des.v:165$952 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R7_reg$des.v:159$947 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R6_reg$des.v:153$942 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R5_reg$des.v:147$937 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R4_reg$des.v:141$932 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R3_reg$des.v:135$927 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R2_reg$des.v:129$922 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R1_reg$des.v:121$917 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R14_reg$des.v:201$982 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R13_reg$des.v:195$977 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R12_reg$des.v:189$972 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R11_reg$des.v:183$967 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R10_reg$des.v:177$962 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R0_reg$des.v:113$912 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L9_reg$des.v:168$954 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L8_reg$des.v:162$949 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L7_reg$des.v:156$944 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L6_reg$des.v:150$939 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L5_reg$des.v:144$934 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L4_reg$des.v:138$929 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L3_reg$des.v:132$924 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L2_reg$des.v:125$919 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L1_reg$des.v:117$914 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L14_reg$des.v:198$979 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L13_reg$des.v:192$974 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L12_reg$des.v:186$969 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L11_reg$des.v:180$964 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L10_reg$des.v:174$959 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L0_reg$des.v:109$909 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r9_reg$key_sel.v:66$1070 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r8_reg$key_sel.v:66$1069 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r7_reg$key_sel.v:66$1068 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r6_reg$key_sel.v:66$1067 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r5_reg$key_sel.v:66$1066 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r4_reg$key_sel.v:66$1065 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r3_reg$key_sel.v:66$1064 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r2_reg$key_sel.v:66$1063 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r1_reg$key_sel.v:66$1062 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r14_reg$key_sel.v:66$1075 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r13_reg$key_sel.v:66$1074 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r12_reg$key_sel.v:66$1073 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r11_reg$key_sel.v:66$1072 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r10_reg$key_sel.v:66$1071 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r0_reg$key_sel.v:66$1061 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$key_r_reg$des.v:54$781 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$desOut_reg$des.v:233$989 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$desIn_r_reg$des.v:58$783 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R9_reg$des.v:171$957 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R8_reg$des.v:165$952 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R7_reg$des.v:159$947 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R6_reg$des.v:153$942 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R5_reg$des.v:147$937 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R4_reg$des.v:141$932 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R3_reg$des.v:135$927 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R2_reg$des.v:129$922 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R1_reg$des.v:121$917 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R14_reg$des.v:201$982 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R13_reg$des.v:195$977 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R12_reg$des.v:189$972 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R11_reg$des.v:183$967 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R10_reg$des.v:177$962 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R0_reg$des.v:113$912 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L9_reg$des.v:168$954 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L8_reg$des.v:162$949 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L7_reg$des.v:156$944 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L6_reg$des.v:150$939 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L5_reg$des.v:144$934 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L4_reg$des.v:138$929 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L3_reg$des.v:132$924 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L2_reg$des.v:125$919 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L1_reg$des.v:117$914 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L14_reg$des.v:198$979 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L13_reg$des.v:192$974 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L12_reg$des.v:186$969 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L11_reg$des.v:180$964 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L10_reg$des.v:174$959 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L0_reg$des.v:109$909 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r9_reg$key_sel.v:66$1070 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r8_reg$key_sel.v:66$1069 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r7_reg$key_sel.v:66$1068 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r6_reg$key_sel.v:66$1067 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r5_reg$key_sel.v:66$1066 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r4_reg$key_sel.v:66$1065 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r3_reg$key_sel.v:66$1064 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r2_reg$key_sel.v:66$1063 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r1_reg$key_sel.v:66$1062 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r14_reg$key_sel.v:66$1075 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r13_reg$key_sel.v:66$1074 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r12_reg$key_sel.v:66$1073 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r11_reg$key_sel.v:66$1072 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r10_reg$key_sel.v:66$1071 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r0_reg$key_sel.v:66$1061 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$key_r_reg$des.v:54$781 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$desOut_reg$des.v:233$989 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$desIn_r_reg$des.v:58$783 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R9_reg$des.v:171$957 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R8_reg$des.v:165$952 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R7_reg$des.v:159$947 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R6_reg$des.v:153$942 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R5_reg$des.v:147$937 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R4_reg$des.v:141$932 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R3_reg$des.v:135$927 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R2_reg$des.v:129$922 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R1_reg$des.v:121$917 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R14_reg$des.v:201$982 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R13_reg$des.v:195$977 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R12_reg$des.v:189$972 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R11_reg$des.v:183$967 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R10_reg$des.v:177$962 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R0_reg$des.v:113$912 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L9_reg$des.v:168$954 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L8_reg$des.v:162$949 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L7_reg$des.v:156$944 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L6_reg$des.v:150$939 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L5_reg$des.v:144$934 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L4_reg$des.v:138$929 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L3_reg$des.v:132$924 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L2_reg$des.v:125$919 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L1_reg$des.v:117$914 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L14_reg$des.v:198$979 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L13_reg$des.v:192$974 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L12_reg$des.v:186$969 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L11_reg$des.v:180$964 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L10_reg$des.v:174$959 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L0_reg$des.v:109$909 ($aldff) from module des3.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~50 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~50 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.13.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module des3:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~50 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> stat

3.22. Printing statistics.

=== des3 ===

   Number of wires:               1477
   Number of wire bits:          33268
   Number of public wires:        1432
   Number of public wire bits:   31828
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                725
     $bmux                         384
     $dff                          195
     $mux                           50
     $xor                           96


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.23. Executing TECHMAP pass (map to technology primitives).

3.23.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.23.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.23.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $bmux.
No more expansions possible.
<suppressed ~796 debug messages>

yosys> stat

3.24. Printing statistics.

=== des3 ===

   Number of wires:               3781
   Number of wire bits:         130036
   Number of public wires:        1432
   Number of public wire bits:   31828
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:             111832
     $_DFF_P_                     8808
     $_MUX_                      99184
     $_XOR_                       3840


yosys> opt

3.25. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.25.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~36912 debug messages>

yosys> opt_merge -nomux

3.25.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
<suppressed ~102528 debug messages>
Removed a total of 34176 cells.

yosys> opt_muxtree

3.25.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.25.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 384 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.25.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~768 debug messages>

3.25.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.25.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.25.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.25.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.25.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.25.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.25.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.25.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.25.23. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~1584 debug messages>

yosys> opt_merge

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.26.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

3.26.5. Finished fast OPT passes.

yosys> memory_map

3.27. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_share

3.28.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.28.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr -full

3.28.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.28.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.29. Executing ABC pass (technology mapping using ABC).

3.29.1. Extracting gate netlist of module `\des3' to `<abc-temp-dir>/input.blif'..
Extracted 31168 gates and 36995 wires to a netlist network with 5825 inputs and 1648 outputs.

3.29.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/yosys_verific_rs/result_04-05-2022T15-08-45/Golden_synth_rs_ade.json/des/abc_tmp.scr 
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [   4.16 sec. at Pass 0]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 278.47 sec. at Pass 1]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  59.45 sec. at Pass 2]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 272.15 sec. at Pass 3]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  65.59 sec. at Pass 4]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 390.40 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     5488
ABC RESULTS:        internal signals:    29522
ABC RESULTS:           input signals:     5825
ABC RESULTS:          output signals:     1648
Removing temp directory.

yosys> opt

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.30.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 9101 unused wires.
<suppressed ~1105 debug messages>

yosys> opt_expr

3.30.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.30.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.30.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.30.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.30.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.30.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.30.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.31. Printing statistics.

=== des3 ===

   Number of wires:               5608
   Number of wire bits:          19444
   Number of public wires:         328
   Number of public wire bits:   14164
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              14296
     $_DFF_P_                     8808
     $lut                         5488


yosys> shregmap -minlen 8 -maxlen 20

3.32. Executing SHREGMAP pass (map shift registers).
Converting des3.$auto$ff.cc:262:slice$2240 ... des3.$auto$ff.cc:262:slice$78256 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2241 ... des3.$auto$ff.cc:262:slice$78257 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2242 ... des3.$auto$ff.cc:262:slice$78258 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2243 ... des3.$auto$ff.cc:262:slice$78259 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2244 ... des3.$auto$ff.cc:262:slice$78260 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2245 ... des3.$auto$ff.cc:262:slice$78261 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2246 ... des3.$auto$ff.cc:262:slice$78262 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2247 ... des3.$auto$ff.cc:262:slice$78263 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2248 ... des3.$auto$ff.cc:262:slice$78264 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2249 ... des3.$auto$ff.cc:262:slice$78265 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2250 ... des3.$auto$ff.cc:262:slice$78266 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2251 ... des3.$auto$ff.cc:262:slice$78267 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2252 ... des3.$auto$ff.cc:262:slice$78268 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2253 ... des3.$auto$ff.cc:262:slice$78269 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2254 ... des3.$auto$ff.cc:262:slice$78270 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2255 ... des3.$auto$ff.cc:262:slice$78271 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2256 ... des3.$auto$ff.cc:262:slice$78272 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2257 ... des3.$auto$ff.cc:262:slice$78273 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2258 ... des3.$auto$ff.cc:262:slice$78274 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2259 ... des3.$auto$ff.cc:262:slice$78275 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2260 ... des3.$auto$ff.cc:262:slice$78276 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2261 ... des3.$auto$ff.cc:262:slice$78277 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2262 ... des3.$auto$ff.cc:262:slice$78278 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2263 ... des3.$auto$ff.cc:262:slice$78279 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2264 ... des3.$auto$ff.cc:262:slice$78280 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2265 ... des3.$auto$ff.cc:262:slice$78281 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2266 ... des3.$auto$ff.cc:262:slice$78282 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2267 ... des3.$auto$ff.cc:262:slice$78283 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2268 ... des3.$auto$ff.cc:262:slice$78284 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2269 ... des3.$auto$ff.cc:262:slice$78285 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2270 ... des3.$auto$ff.cc:262:slice$78286 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2271 ... des3.$auto$ff.cc:262:slice$78287 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2272 ... des3.$auto$ff.cc:262:slice$78288 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2273 ... des3.$auto$ff.cc:262:slice$78289 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2274 ... des3.$auto$ff.cc:262:slice$78290 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2275 ... des3.$auto$ff.cc:262:slice$78291 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2276 ... des3.$auto$ff.cc:262:slice$78292 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2277 ... des3.$auto$ff.cc:262:slice$78293 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2278 ... des3.$auto$ff.cc:262:slice$78294 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2279 ... des3.$auto$ff.cc:262:slice$78295 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2280 ... des3.$auto$ff.cc:262:slice$78296 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2281 ... des3.$auto$ff.cc:262:slice$78297 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2282 ... des3.$auto$ff.cc:262:slice$78298 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2283 ... des3.$auto$ff.cc:262:slice$78299 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2284 ... des3.$auto$ff.cc:262:slice$78300 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2285 ... des3.$auto$ff.cc:262:slice$78301 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2286 ... des3.$auto$ff.cc:262:slice$78302 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2287 ... des3.$auto$ff.cc:262:slice$78303 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2288 ... des3.$auto$ff.cc:262:slice$78304 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2289 ... des3.$auto$ff.cc:262:slice$78305 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2290 ... des3.$auto$ff.cc:262:slice$78306 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2291 ... des3.$auto$ff.cc:262:slice$78307 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2292 ... des3.$auto$ff.cc:262:slice$78308 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2293 ... des3.$auto$ff.cc:262:slice$78309 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2294 ... des3.$auto$ff.cc:262:slice$78310 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$2295 ... des3.$auto$ff.cc:262:slice$78311 to a shift register with depth 18.
Converting des3.$auto$ff.cc:262:slice$4088 ... des3.$auto$ff.cc:262:slice$3024 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2968 ... des3.$auto$ff.cc:262:slice$115312 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4089 ... des3.$auto$ff.cc:262:slice$3025 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2969 ... des3.$auto$ff.cc:262:slice$115313 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4090 ... des3.$auto$ff.cc:262:slice$3026 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2970 ... des3.$auto$ff.cc:262:slice$115314 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4091 ... des3.$auto$ff.cc:262:slice$3027 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2971 ... des3.$auto$ff.cc:262:slice$115315 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4092 ... des3.$auto$ff.cc:262:slice$3028 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2972 ... des3.$auto$ff.cc:262:slice$115316 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4093 ... des3.$auto$ff.cc:262:slice$3029 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2973 ... des3.$auto$ff.cc:262:slice$115317 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4094 ... des3.$auto$ff.cc:262:slice$3030 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2974 ... des3.$auto$ff.cc:262:slice$115318 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4095 ... des3.$auto$ff.cc:262:slice$3031 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2975 ... des3.$auto$ff.cc:262:slice$115319 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4096 ... des3.$auto$ff.cc:262:slice$3032 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2976 ... des3.$auto$ff.cc:262:slice$115320 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4097 ... des3.$auto$ff.cc:262:slice$3033 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2977 ... des3.$auto$ff.cc:262:slice$115321 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4098 ... des3.$auto$ff.cc:262:slice$3034 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2978 ... des3.$auto$ff.cc:262:slice$115322 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4099 ... des3.$auto$ff.cc:262:slice$3035 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2979 ... des3.$auto$ff.cc:262:slice$115323 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4100 ... des3.$auto$ff.cc:262:slice$3036 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2980 ... des3.$auto$ff.cc:262:slice$115324 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4101 ... des3.$auto$ff.cc:262:slice$3037 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2981 ... des3.$auto$ff.cc:262:slice$115325 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4102 ... des3.$auto$ff.cc:262:slice$3038 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2982 ... des3.$auto$ff.cc:262:slice$115326 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4103 ... des3.$auto$ff.cc:262:slice$3039 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2983 ... des3.$auto$ff.cc:262:slice$115327 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4104 ... des3.$auto$ff.cc:262:slice$3040 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2984 ... des3.$auto$ff.cc:262:slice$115328 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4105 ... des3.$auto$ff.cc:262:slice$3041 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2985 ... des3.$auto$ff.cc:262:slice$115329 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4106 ... des3.$auto$ff.cc:262:slice$3042 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2986 ... des3.$auto$ff.cc:262:slice$115330 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4107 ... des3.$auto$ff.cc:262:slice$3043 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2987 ... des3.$auto$ff.cc:262:slice$115331 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4108 ... des3.$auto$ff.cc:262:slice$3044 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2988 ... des3.$auto$ff.cc:262:slice$115332 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4109 ... des3.$auto$ff.cc:262:slice$3045 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2989 ... des3.$auto$ff.cc:262:slice$115333 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4110 ... des3.$auto$ff.cc:262:slice$3046 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2990 ... des3.$auto$ff.cc:262:slice$115334 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4111 ... des3.$auto$ff.cc:262:slice$3047 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2991 ... des3.$auto$ff.cc:262:slice$115335 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4112 ... des3.$auto$ff.cc:262:slice$3048 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2992 ... des3.$auto$ff.cc:262:slice$115336 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4113 ... des3.$auto$ff.cc:262:slice$3049 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2993 ... des3.$auto$ff.cc:262:slice$115337 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4114 ... des3.$auto$ff.cc:262:slice$3050 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2994 ... des3.$auto$ff.cc:262:slice$115338 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4115 ... des3.$auto$ff.cc:262:slice$3051 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2995 ... des3.$auto$ff.cc:262:slice$115339 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4116 ... des3.$auto$ff.cc:262:slice$3052 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2996 ... des3.$auto$ff.cc:262:slice$115340 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4117 ... des3.$auto$ff.cc:262:slice$3053 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2997 ... des3.$auto$ff.cc:262:slice$115341 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4118 ... des3.$auto$ff.cc:262:slice$3054 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2998 ... des3.$auto$ff.cc:262:slice$115342 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4119 ... des3.$auto$ff.cc:262:slice$3055 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$2999 ... des3.$auto$ff.cc:262:slice$115343 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4120 ... des3.$auto$ff.cc:262:slice$3056 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3000 ... des3.$auto$ff.cc:262:slice$115344 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4121 ... des3.$auto$ff.cc:262:slice$3057 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3001 ... des3.$auto$ff.cc:262:slice$115345 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4122 ... des3.$auto$ff.cc:262:slice$3058 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3002 ... des3.$auto$ff.cc:262:slice$115346 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4123 ... des3.$auto$ff.cc:262:slice$3059 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3003 ... des3.$auto$ff.cc:262:slice$115347 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4124 ... des3.$auto$ff.cc:262:slice$3060 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3004 ... des3.$auto$ff.cc:262:slice$115348 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4125 ... des3.$auto$ff.cc:262:slice$3061 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3005 ... des3.$auto$ff.cc:262:slice$115349 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4126 ... des3.$auto$ff.cc:262:slice$3062 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3006 ... des3.$auto$ff.cc:262:slice$115350 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4127 ... des3.$auto$ff.cc:262:slice$3063 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3007 ... des3.$auto$ff.cc:262:slice$115351 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4128 ... des3.$auto$ff.cc:262:slice$3064 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3008 ... des3.$auto$ff.cc:262:slice$115352 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4129 ... des3.$auto$ff.cc:262:slice$3065 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3009 ... des3.$auto$ff.cc:262:slice$115353 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4130 ... des3.$auto$ff.cc:262:slice$3066 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3010 ... des3.$auto$ff.cc:262:slice$115354 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4131 ... des3.$auto$ff.cc:262:slice$3067 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3011 ... des3.$auto$ff.cc:262:slice$115355 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4132 ... des3.$auto$ff.cc:262:slice$3068 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3012 ... des3.$auto$ff.cc:262:slice$115356 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4133 ... des3.$auto$ff.cc:262:slice$3069 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3013 ... des3.$auto$ff.cc:262:slice$115357 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4134 ... des3.$auto$ff.cc:262:slice$3070 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3014 ... des3.$auto$ff.cc:262:slice$115358 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4135 ... des3.$auto$ff.cc:262:slice$3071 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3015 ... des3.$auto$ff.cc:262:slice$115359 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4136 ... des3.$auto$ff.cc:262:slice$3072 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3016 ... des3.$auto$ff.cc:262:slice$115360 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4137 ... des3.$auto$ff.cc:262:slice$3073 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3017 ... des3.$auto$ff.cc:262:slice$115361 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4138 ... des3.$auto$ff.cc:262:slice$3074 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3018 ... des3.$auto$ff.cc:262:slice$115362 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4139 ... des3.$auto$ff.cc:262:slice$3075 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3019 ... des3.$auto$ff.cc:262:slice$115363 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4140 ... des3.$auto$ff.cc:262:slice$3076 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3020 ... des3.$auto$ff.cc:262:slice$115364 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4141 ... des3.$auto$ff.cc:262:slice$3077 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3021 ... des3.$auto$ff.cc:262:slice$115365 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4142 ... des3.$auto$ff.cc:262:slice$3078 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3022 ... des3.$auto$ff.cc:262:slice$115366 to a shift register with depth 15.
Converting des3.$auto$ff.cc:262:slice$4143 ... des3.$auto$ff.cc:262:slice$3079 to a shift register with depth 20.
Converting des3.$auto$ff.cc:262:slice$3023 ... des3.$auto$ff.cc:262:slice$115367 to a shift register with depth 15.
Converted 2968 dff cells into 168 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.33. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.34. Printing statistics.

=== des3 ===

   Number of wires:               5608
   Number of wire bits:          19444
   Number of public wires:         328
   Number of public wire bits:   14164
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              11496
     $_DFF_P_                     5840
     $__SHREG_DFF_P_               168
     $lut                         5488


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.35. Executing TECHMAP pass (map to technology primitives).

3.35.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.35.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.35.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000010010 for cells of type $__SHREG_DFF_P_.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000010100 for cells of type $__SHREG_DFF_P_.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000001111 for cells of type $__SHREG_DFF_P_.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
No more expansions possible.
<suppressed ~11665 debug messages>

yosys> opt_expr -mux_undef

3.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~61152 debug messages>

yosys> simplemap

3.37. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.38. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge

3.39. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
<suppressed ~77616 debug messages>
Removed a total of 25872 cells.

yosys> opt_dff -nodffe -nosdff

3.40. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.41. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 25501 unused wires.
<suppressed ~49 debug messages>

yosys> opt -nodffe -nosdff

3.42. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.42.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~3696 debug messages>

yosys> opt_merge -nomux

3.42.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
<suppressed ~288 debug messages>
Removed a total of 96 cells.

yosys> opt_muxtree

3.42.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.42.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.42.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 1003 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.42.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.42.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.42.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.42.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.42.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.42.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.42.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.43. Executing ABC pass (technology mapping using ABC).

3.43.1. Extracting gate netlist of module `\des3' to `<abc-temp-dir>/input.blif'..
Extracted 45904 gates and 51731 wires to a netlist network with 5825 inputs and 1648 outputs.

3.43.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/yosys_verific_rs/result_04-05-2022T15-08-45/Golden_synth_rs_ade.json/des/abc_tmp.scr 
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [   6.47 sec. at Pass 0]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 293.05 sec. at Pass 1]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  51.62 sec. at Pass 2]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 234.76 sec. at Pass 3]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  42.55 sec. at Pass 4]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 366.52 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.43.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     5488
ABC RESULTS:        internal signals:    44258
ABC RESULTS:           input signals:     5825
ABC RESULTS:          output signals:     1648
Removing temp directory.

yosys> opt

3.44. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.44.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.44.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.44.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.44.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.44.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.44.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.44.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 24721 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.44.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.44.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.44.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.44.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.44.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.44.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.44.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.44.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.44.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.45. Executing HIERARCHY pass (managing design hierarchy).

3.45.1. Analyzing design hierarchy..
Top module:  \des3

3.45.2. Analyzing design hierarchy..
Top module:  \des3
Removed 0 unused modules.

yosys> stat

3.46. Printing statistics.

=== des3 ===

   Number of wires:               5728
   Number of wire bits:          19556
   Number of public wires:         280
   Number of public wire bits:   11476
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              14296
     $lut                         5488
     dffsre                       5840
     sh_dff                       2968


yosys> opt_clean -purge

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 127 unused wires.
<suppressed ~127 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.48. Executing Verilog backend.

yosys> bmuxmap

3.48.1. Executing BMUXMAP pass.

yosys> demuxmap

3.48.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\des3'.

Warnings: 54 unique messages, 54 total
End of script. Logfile hash: 701ed39665, CPU: user 130.08s system 1.23s, MEM: 325.28 MB peak
Yosys 0.16+6 (git sha1 7f5477eb1, gcc 9.1.0 -fPIC -Os)
Time spent: 97% 2x abc (6204 sec), 0% 27x opt_expr (53 sec), ...
real 2243.72
user 6084.68
sys 249.29
