
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.19
 Yosys 0.16+65 (git sha1 91803ad5c, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k crp.v des.v des3.v key_sel.v key_sel3.v sbox1.v sbox2.v sbox3.v sbox4.v sbox5.v sbox6.v sbox7.v sbox8.v

yosys> verific -vlog2k crp.v des.v des3.v key_sel.v key_sel3.v sbox1.v sbox2.v sbox3.v sbox4.v sbox5.v sbox6.v sbox7.v sbox8.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'crp.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'des.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'des3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'key_sel.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'key_sel3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox1.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox2.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox4.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox5.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox6.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox7.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox8.v'

yosys> synth_rs -top des3 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.44

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top des3

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] des3.v:35: compiling module 'des3'
VERIFIC-WARNING [VERI-2371] des3.v:57: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des3.v:61: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des3.v:65: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des3.v:69: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] des.v:35: compiling module 'des'
VERIFIC-WARNING [VERI-2371] des.v:54: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:58: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] key_sel.v:36: compiling module 'key_sel'
VERIFIC-WARNING [VERI-2371] key_sel.v:51: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:52: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:53: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:54: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:55: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:56: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:57: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:58: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:59: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:60: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:61: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:62: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:63: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:64: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:65: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] crp.v:35: compiling module 'crp'
VERIFIC-INFO [VERI-1018] sbox1.v:35: compiling module 'sbox1'
VERIFIC-INFO [VERI-1018] sbox2.v:35: compiling module 'sbox2'
VERIFIC-INFO [VERI-1018] sbox3.v:35: compiling module 'sbox3'
VERIFIC-INFO [VERI-1018] sbox4.v:35: compiling module 'sbox4'
VERIFIC-INFO [VERI-1018] sbox5.v:35: compiling module 'sbox5'
VERIFIC-INFO [VERI-1018] sbox6.v:35: compiling module 'sbox6'
VERIFIC-INFO [VERI-1018] sbox7.v:35: compiling module 'sbox7'
VERIFIC-INFO [VERI-1018] sbox8.v:35: compiling module 'sbox8'
VERIFIC-WARNING [VERI-2371] des.v:109: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:113: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:117: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:121: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:125: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:129: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:132: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:135: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:138: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:141: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:144: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:147: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:150: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:153: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:156: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:159: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:162: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:165: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:168: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:171: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:174: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:177: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:180: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:183: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:186: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:189: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:192: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:195: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:198: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:201: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:205: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:209: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:233: delay control is not supported for synthesis
Importing module des3.
Importing module des.
Importing module crp.
Importing module key_sel.
Importing module sbox1.
Importing module sbox2.
Importing module sbox3.
Importing module sbox4.
Importing module sbox5.
Importing module sbox6.
Importing module sbox7.
Importing module sbox8.

3.3.1. Analyzing design hierarchy..
Top module:  \des3
Used module:     \des
Used module:         \crp
Used module:             \sbox8
Used module:             \sbox7
Used module:             \sbox6
Used module:             \sbox5
Used module:             \sbox4
Used module:             \sbox3
Used module:             \sbox2
Used module:             \sbox1
Used module:         \key_sel

3.3.2. Analyzing design hierarchy..
Top module:  \des3
Used module:     \des
Used module:         \crp
Used module:             \sbox8
Used module:             \sbox7
Used module:             \sbox6
Used module:             \sbox5
Used module:             \sbox4
Used module:             \sbox3
Used module:             \sbox2
Used module:             \sbox1
Used module:         \key_sel
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module sbox8.
Optimizing module sbox7.
Optimizing module sbox6.
Optimizing module sbox5.
Optimizing module sbox4.
Optimizing module sbox3.
Optimizing module sbox2.
Optimizing module sbox1.
Optimizing module key_sel.
Optimizing module crp.
Optimizing module des.
Optimizing module des3.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module sbox8.
Deleting now unused module sbox7.
Deleting now unused module sbox6.
Deleting now unused module sbox5.
Deleting now unused module sbox4.
Deleting now unused module sbox3.
Deleting now unused module sbox2.
Deleting now unused module sbox1.
Deleting now unused module key_sel.
Deleting now unused module crp.
Deleting now unused module des.
<suppressed ~28 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~16 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 7 unused cells and 2786 unused wires.
<suppressed ~419 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module des3...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~50 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$key_c_r[9]_reg$des3.v:69$155 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[8]_reg$des3.v:69$156 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[7]_reg$des3.v:69$157 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[6]_reg$des3.v:69$158 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[5]_reg$des3.v:69$159 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[4]_reg$des3.v:69$160 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[3]_reg$des3.v:69$161 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[33]_reg$des3.v:69$65 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[32]_reg$des3.v:69$132 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[31]_reg$des3.v:69$133 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[30]_reg$des3.v:69$134 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[2]_reg$des3.v:69$162 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[29]_reg$des3.v:69$135 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[28]_reg$des3.v:69$136 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[27]_reg$des3.v:69$137 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[26]_reg$des3.v:69$138 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[25]_reg$des3.v:69$139 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[24]_reg$des3.v:69$140 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[23]_reg$des3.v:69$141 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[22]_reg$des3.v:69$142 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[21]_reg$des3.v:69$143 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[20]_reg$des3.v:69$144 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[1]_reg$des3.v:69$163 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[19]_reg$des3.v:69$145 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[18]_reg$des3.v:69$146 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[17]_reg$des3.v:69$147 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[16]_reg$des3.v:69$148 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[15]_reg$des3.v:69$149 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[14]_reg$des3.v:69$150 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[13]_reg$des3.v:69$151 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[12]_reg$des3.v:69$152 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[11]_reg$des3.v:69$153 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[10]_reg$des3.v:69$154 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[0]_reg$des3.v:65$164 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[9]_reg$des3.v:61$88 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[8]_reg$des3.v:61$89 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[7]_reg$des3.v:61$90 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[6]_reg$des3.v:61$91 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[5]_reg$des3.v:61$92 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[4]_reg$des3.v:61$93 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[3]_reg$des3.v:61$94 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[2]_reg$des3.v:61$95 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[1]_reg$des3.v:61$96 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[16]_reg$des3.v:61$724 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[15]_reg$des3.v:61$82 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[14]_reg$des3.v:61$83 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[13]_reg$des3.v:61$84 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[12]_reg$des3.v:61$85 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[11]_reg$des3.v:61$86 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[10]_reg$des3.v:61$87 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[0]_reg$des3.v:57$97 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r9_reg$key_sel.v:66$1070 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r8_reg$key_sel.v:66$1069 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r7_reg$key_sel.v:66$1068 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r6_reg$key_sel.v:66$1067 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r5_reg$key_sel.v:66$1066 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r4_reg$key_sel.v:66$1065 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r3_reg$key_sel.v:66$1064 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r2_reg$key_sel.v:66$1063 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r1_reg$key_sel.v:66$1062 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r14_reg$key_sel.v:66$1075 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r13_reg$key_sel.v:66$1074 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r12_reg$key_sel.v:66$1073 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r11_reg$key_sel.v:66$1072 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r10_reg$key_sel.v:66$1071 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r0_reg$key_sel.v:66$1061 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$key_r_reg$des.v:54$781 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$desOut_reg$des.v:233$989 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$desIn_r_reg$des.v:58$783 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R9_reg$des.v:171$957 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R8_reg$des.v:165$952 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R7_reg$des.v:159$947 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R6_reg$des.v:153$942 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R5_reg$des.v:147$937 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R4_reg$des.v:141$932 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R3_reg$des.v:135$927 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R2_reg$des.v:129$922 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R1_reg$des.v:121$917 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R14_reg$des.v:201$982 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R13_reg$des.v:195$977 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R12_reg$des.v:189$972 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R11_reg$des.v:183$967 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R10_reg$des.v:177$962 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R0_reg$des.v:113$912 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L9_reg$des.v:168$954 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L8_reg$des.v:162$949 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L7_reg$des.v:156$944 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L6_reg$des.v:150$939 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L5_reg$des.v:144$934 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L4_reg$des.v:138$929 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L3_reg$des.v:132$924 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L2_reg$des.v:125$919 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L1_reg$des.v:117$914 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L14_reg$des.v:198$979 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L13_reg$des.v:192$974 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L12_reg$des.v:186$969 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L11_reg$des.v:180$964 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L10_reg$des.v:174$959 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L0_reg$des.v:109$909 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r9_reg$key_sel.v:66$1070 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r8_reg$key_sel.v:66$1069 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r7_reg$key_sel.v:66$1068 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r6_reg$key_sel.v:66$1067 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r5_reg$key_sel.v:66$1066 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r4_reg$key_sel.v:66$1065 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r3_reg$key_sel.v:66$1064 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r2_reg$key_sel.v:66$1063 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r1_reg$key_sel.v:66$1062 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r14_reg$key_sel.v:66$1075 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r13_reg$key_sel.v:66$1074 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r12_reg$key_sel.v:66$1073 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r11_reg$key_sel.v:66$1072 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r10_reg$key_sel.v:66$1071 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r0_reg$key_sel.v:66$1061 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$key_r_reg$des.v:54$781 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$desOut_reg$des.v:233$989 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$desIn_r_reg$des.v:58$783 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R9_reg$des.v:171$957 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R8_reg$des.v:165$952 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R7_reg$des.v:159$947 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R6_reg$des.v:153$942 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R5_reg$des.v:147$937 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R4_reg$des.v:141$932 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R3_reg$des.v:135$927 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R2_reg$des.v:129$922 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R1_reg$des.v:121$917 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R14_reg$des.v:201$982 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R13_reg$des.v:195$977 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R12_reg$des.v:189$972 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R11_reg$des.v:183$967 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R10_reg$des.v:177$962 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R0_reg$des.v:113$912 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L9_reg$des.v:168$954 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L8_reg$des.v:162$949 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L7_reg$des.v:156$944 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L6_reg$des.v:150$939 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L5_reg$des.v:144$934 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L4_reg$des.v:138$929 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L3_reg$des.v:132$924 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L2_reg$des.v:125$919 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L1_reg$des.v:117$914 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L14_reg$des.v:198$979 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L13_reg$des.v:192$974 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L12_reg$des.v:186$969 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L11_reg$des.v:180$964 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L10_reg$des.v:174$959 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L0_reg$des.v:109$909 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r9_reg$key_sel.v:66$1070 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r8_reg$key_sel.v:66$1069 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r7_reg$key_sel.v:66$1068 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r6_reg$key_sel.v:66$1067 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r5_reg$key_sel.v:66$1066 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r4_reg$key_sel.v:66$1065 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r3_reg$key_sel.v:66$1064 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r2_reg$key_sel.v:66$1063 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r1_reg$key_sel.v:66$1062 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r14_reg$key_sel.v:66$1075 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r13_reg$key_sel.v:66$1074 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r12_reg$key_sel.v:66$1073 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r11_reg$key_sel.v:66$1072 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r10_reg$key_sel.v:66$1071 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r0_reg$key_sel.v:66$1061 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$key_r_reg$des.v:54$781 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$desOut_reg$des.v:233$989 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$desIn_r_reg$des.v:58$783 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R9_reg$des.v:171$957 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R8_reg$des.v:165$952 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R7_reg$des.v:159$947 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R6_reg$des.v:153$942 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R5_reg$des.v:147$937 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R4_reg$des.v:141$932 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R3_reg$des.v:135$927 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R2_reg$des.v:129$922 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R1_reg$des.v:121$917 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R14_reg$des.v:201$982 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R13_reg$des.v:195$977 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R12_reg$des.v:189$972 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R11_reg$des.v:183$967 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R10_reg$des.v:177$962 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R0_reg$des.v:113$912 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L9_reg$des.v:168$954 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L8_reg$des.v:162$949 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L7_reg$des.v:156$944 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L6_reg$des.v:150$939 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L5_reg$des.v:144$934 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L4_reg$des.v:138$929 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L3_reg$des.v:132$924 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L2_reg$des.v:125$919 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L1_reg$des.v:117$914 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L14_reg$des.v:198$979 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L13_reg$des.v:192$974 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L12_reg$des.v:186$969 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L11_reg$des.v:180$964 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L10_reg$des.v:174$959 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L0_reg$des.v:109$909 ($aldff) from module des3.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~50 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~50 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.13.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module des3:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~50 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== des3 ===

   Number of wires:               1477
   Number of wire bits:          33268
   Number of public wires:        1432
   Number of public wire bits:   31828
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                725
     $bmux                         384
     $dff                          195
     $mux                           50
     $xor                           96


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.21.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> memory_share

3.21.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> memory_collect

3.21.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== des3 ===

   Number of wires:               1477
   Number of wire bits:          33268
   Number of public wires:        1432
   Number of public wire bits:   31828
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                725
     $bmux                         384
     $dff                          195
     $mux                           50
     $xor                           96


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> stat

3.24. Printing statistics.

=== des3 ===

   Number of wires:               1477
   Number of wire bits:          33268
   Number of public wires:        1432
   Number of public wire bits:   31828
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                725
     $bmux                         384
     $dff                          195
     $mux                           50
     $xor                           96


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $bmux.
No more expansions possible.
<suppressed ~796 debug messages>

yosys> stat

3.26. Printing statistics.

=== des3 ===

   Number of wires:               3781
   Number of wire bits:         130036
   Number of public wires:        1432
   Number of public wire bits:   31828
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:             111832
     $_DFF_P_                     8808
     $_MUX_                      99184
     $_XOR_                       3840


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~36912 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
<suppressed ~102528 debug messages>
Removed a total of 34176 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 384 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~768 debug messages>

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.27.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.27.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.27.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.27.23. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~1584 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.30.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.31. Executing ABC pass (technology mapping using ABC).

3.31.1. Summary of detected clock domains:
  39976 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.31.2. Extracting gate netlist of module `\des3' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 39976 gates and 40211 wires to a netlist network with 233 inputs and 64 outputs.

3.31.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: Warning: 8808 registers in this network have don't-care init values.
ABC: The don't-care are assumed to be 0. The result may not verify.
ABC: Use command "print_latch" to see the init values of registers.
ABC: Use command "zero" to convert or "init" to change the values.
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:     8808
ABC RESULTS:               NOT cells:      606
ABC RESULTS:            ANDNOT cells:     1622
ABC RESULTS:               NOR cells:     2133
ABC RESULTS:             ORNOT cells:     3062
ABC RESULTS:                OR cells:     3509
ABC RESULTS:              NAND cells:    11029
ABC RESULTS:               AND cells:     6161
ABC RESULTS:              XNOR cells:     4665
ABC RESULTS:               MUX cells:     6724
ABC RESULTS:               XOR cells:      478
ABC RESULTS:               BUF cells:     7224
ABC RESULTS:        internal signals:    39914
ABC RESULTS:           input signals:      233
ABC RESULTS:          output signals:       64
Removing temp directory.

yosys> abc -script /tmp/yosys_nj1YN4/abc_tmp_1.scr

3.32. Executing ABC pass (technology mapping using ABC).

3.32.1. Extracting gate netlist of module `\des3' to `<abc-temp-dir>/input.blif'..
Extracted 39989 gates and 45814 wires to a netlist network with 5825 inputs and 1648 outputs.

3.32.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /tmp/yosys_nj1YN4/abc_tmp_1.scr 
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [   3.88 sec. at Pass 0]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 213.74 sec. at Pass 1]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  32.43 sec. at Pass 2]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 255.77 sec. at Pass 3]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  62.13 sec. at Pass 4]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 480.85 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     5488
ABC RESULTS:        internal signals:    38341
ABC RESULTS:           input signals:     5825
ABC RESULTS:          output signals:     1648
Removing temp directory.

yosys> opt

3.33. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.33.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.33.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.33.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.33.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.33.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.33.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.33.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 56699 unused wires.
<suppressed ~1401 debug messages>

yosys> opt_expr

3.33.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.33.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.33.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.33.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.33.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.33.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.33.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.33.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.33.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.34. Printing statistics.

=== des3 ===

   Number of wires:              14264
   Number of wire bits:          15444
   Number of public wires:          32
   Number of public wire bits:    1212
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              14296
     $_DFF_P_                     8808
     $lut                         5488


yosys> shregmap -minlen 8 -maxlen 20

3.35. Executing SHREGMAP pass (map shift registers).
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118369 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122257 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118370 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122259 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118371 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122261 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118372 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122263 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118373 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122265 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118374 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122267 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118375 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122269 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118376 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122271 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118377 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122273 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118378 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122275 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118379 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122277 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118380 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122279 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118381 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122281 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118382 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122283 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118383 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122285 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118384 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122287 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118385 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122289 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118386 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122291 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118387 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122293 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118388 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122295 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118389 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122297 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118390 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122299 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118391 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122301 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118392 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122303 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118393 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122305 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118394 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122307 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118395 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122309 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118396 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122311 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118397 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122313 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118398 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122315 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118399 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122317 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118400 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122319 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118401 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122321 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118402 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122323 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118403 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122325 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118404 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122327 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118405 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122329 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118406 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122331 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118407 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122333 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118408 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122335 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118409 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122337 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118410 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122339 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118411 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122341 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118412 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122343 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118413 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122345 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118414 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122347 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118415 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122349 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118416 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122351 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118417 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122353 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118418 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122355 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118419 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122357 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118420 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122359 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118421 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122361 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118422 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122363 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118423 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122365 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$118424 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$122367 to a shift register with depth 18.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121569 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119097 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119041 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115369 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121590 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119098 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119042 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115371 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121603 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119099 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119043 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115373 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121604 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119100 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119044 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115375 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121605 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119101 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119045 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115377 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121606 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119102 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119046 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115379 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121607 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119103 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119047 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115381 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121608 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119104 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119048 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115383 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121609 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119105 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119049 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115385 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121630 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119106 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119050 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115387 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121651 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119107 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119051 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115389 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121672 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119108 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119052 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115391 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121677 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119109 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119053 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115393 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121678 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119110 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119054 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115395 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121679 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119111 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119055 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115397 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121680 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119112 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119056 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115399 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121681 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119113 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119057 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115401 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121682 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119114 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119058 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115403 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121691 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119115 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119059 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115405 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121712 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119116 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119060 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115407 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121733 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119117 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119061 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115409 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121750 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119118 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119062 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115411 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121751 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119119 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119063 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115413 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121752 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119120 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119064 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115415 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121753 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119121 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119065 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115417 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121754 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119122 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119066 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115419 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121755 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119123 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119067 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115421 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121756 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119124 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119068 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115423 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121773 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119125 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119069 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115425 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121794 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119126 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119070 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115427 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121815 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119127 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119071 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115429 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121824 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119128 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119072 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115431 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121825 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119129 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119073 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115433 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121826 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119130 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119074 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115435 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121827 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119131 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119075 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115437 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121828 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119132 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119076 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115439 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121829 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119133 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119077 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115441 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121834 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119134 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119078 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115443 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121855 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119135 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119079 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115445 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121876 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119136 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119080 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115447 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121897 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119137 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119081 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115449 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121898 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119138 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119082 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115451 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121899 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119139 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119083 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115453 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121900 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119140 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119084 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115455 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121901 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119141 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119085 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115457 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121902 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119142 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119086 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115459 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121903 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119143 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119087 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115461 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121916 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119144 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119088 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115463 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121937 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119145 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119089 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115465 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121958 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119146 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119090 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115467 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121971 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119147 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119091 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115469 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121972 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119148 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119092 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115471 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121973 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119149 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119093 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115473 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121974 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119150 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119094 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115475 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121975 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119151 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119095 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115477 to a shift register with depth 15.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$121976 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119152 to a shift register with depth 20.
Converting des3.$abc$115368$auto$blifparse.cc:362:parse_blif$119096 ... des3.$abc$115368$auto$blifparse.cc:362:parse_blif$115479 to a shift register with depth 15.
Converted 2968 dff cells into 168 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.36. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.37. Printing statistics.

=== des3 ===

   Number of wires:              14264
   Number of wire bits:          15444
   Number of public wires:          32
   Number of public wire bits:    1212
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              11496
     $_DFF_P_                     5840
     $__SHREG_DFF_P_               168
     $lut                         5488


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.38. Executing TECHMAP pass (map to technology primitives).

3.38.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.38.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.38.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000010010 for cells of type $__SHREG_DFF_P_.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000010100 for cells of type $__SHREG_DFF_P_.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000001111 for cells of type $__SHREG_DFF_P_.
No more expansions possible.
<suppressed ~11665 debug messages>

yosys> opt_expr -mux_undef

3.39. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~61379 debug messages>

yosys> simplemap

3.40. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge

3.42. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
<suppressed ~76458 debug messages>
Removed a total of 25486 cells.

yosys> opt_dff -nodffe -nosdff

3.43. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.44. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 27985 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.45. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.45.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~3561 debug messages>

yosys> opt_merge -nomux

3.45.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
<suppressed ~405 debug messages>
Removed a total of 135 cells.

yosys> opt_muxtree

3.45.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.45.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.45.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 1000 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.45.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.45.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.45.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.45.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.45.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.45.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.45.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_nj1YN4/abc_tmp_2.scr

3.46. Executing ABC pass (technology mapping using ABC).

3.46.1. Extracting gate netlist of module `\des3' to `<abc-temp-dir>/input.blif'..
Extracted 46159 gates and 51986 wires to a netlist network with 5825 inputs and 1648 outputs.

3.46.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /tmp/yosys_nj1YN4/abc_tmp_2.scr 
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [   5.12 sec. at Pass 0]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 269.43 sec. at Pass 1]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  36.25 sec. at Pass 2]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 272.35 sec. at Pass 3]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  43.66 sec. at Pass 4]
ABC:   #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 347.22 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.46.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     5488
ABC RESULTS:        internal signals:    44513
ABC RESULTS:           input signals:     5825
ABC RESULTS:          output signals:     1648
Removing temp directory.

yosys> opt

3.47. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.47.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.47.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.47.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.47.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.47.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.47.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 24992 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.47.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.47.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.47.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.47.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.47.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.47.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.47.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.47.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.48. Executing HIERARCHY pass (managing design hierarchy).

3.48.1. Analyzing design hierarchy..
Top module:  \des3

3.48.2. Analyzing design hierarchy..
Top module:  \des3
Removed 0 unused modules.

yosys> stat

3.49. Printing statistics.

=== des3 ===

   Number of wires:              11632
   Number of wire bits:          15444
   Number of public wires:          32
   Number of public wire bits:    1212
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              14296
     $lut                         5488
     dffsre                       5840
     sh_dff                       2968


yosys> opt_clean -purge

3.50. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 25 unused wires.
<suppressed ~25 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.51. Executing Verilog backend.

yosys> bmuxmap

3.51.1. Executing BMUXMAP pass.

yosys> demuxmap

3.51.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\des3'.

Warnings: 54 unique messages, 54 total
End of script. Logfile hash: ed9ee91f4f, CPU: user 137.27s system 1.75s, MEM: 332.51 MB peak
Yosys 0.16+65 (git sha1 91803ad5c, gcc 9.1.0 -fPIC -Os)
Time spent: 98% 3x abc (6683 sec), 0% 27x opt_expr (55 sec), ...
real 2243.96
user 6546.54
sys 269.95
