
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.45
 Yosys 0.17+103 (git sha1 a1babadd5, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl b13.vhd

yosys> verific -vhdl b13.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/home/users/aram/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'b13.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/home/users/aram/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-INFO [VHDL-1012] b13.vhd:1: analyzing entity 'b13'
VERIFIC-INFO [VHDL-1010] b13.vhd:21: analyzing architecture 'behav'

yosys> synth_rs -top b13 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.56

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top b13

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] b13.vhd:1: processing 'b13(BEHAV)'
VERIFIC-INFO [VHDL-1172] b13.vhd:125: 'others' clause is never selected
VERIFIC-INFO [VHDL-1172] b13.vhd:167: 'others' clause is never selected
VERIFIC-INFO [VHDL-1172] b13.vhd:203: 'others' clause is never selected
Importing module b13.

3.3.1. Analyzing design hierarchy..
Top module:  \b13

3.3.2. Analyzing design hierarchy..
Top module:  \b13
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.
<suppressed ~25 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 3 unused cells and 57 unused wires.
<suppressed ~18 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module b13...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~27 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$tx_end_reg$b13.vhd:294$235 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$tx_conta_reg$b13.vhd:294$238 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$tre_reg$b13.vhd:239$212 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$soc_reg$b13.vhd:127$150 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$shot_reg$b13.vhd:169$180 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$send_reg$b13.vhd:205$190 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$send_en_reg$b13.vhd:239$210 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$send_data_reg$b13.vhd:127$153 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$rdy_reg$b13.vhd:169$177 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$out_reg_reg$b13.vhd:239$211 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$next_bit_reg$b13.vhd:294$237 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$mux_en_reg$b13.vhd:127$155 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$mpx_reg$b13.vhd:169$179 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$load_reg$b13.vhd:205$189 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$load_dato_reg$b13.vhd:127$154 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$itfc_state_reg$b13.vhd:205$192 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$error_reg$b13.vhd:239$213 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$data_out_reg$b13.vhd:294$236 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$conta_tmp_reg$b13.vhd:127$152 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$confirm_reg$b13.vhd:205$191 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$canale_reg$b13.vhd:127$151 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$add_mpx2_reg$b13.vhd:169$178 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$S2_reg$b13.vhd:169$176 ($aldff) from module b13.
Changing const-value async load to async reset on $verific$S1_reg$b13.vhd:127$149 ($aldff) from module b13.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~27 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~27 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$tx_conta_reg$b13.vhd:294$238 ($adff) from module b13 (D = $verific$n1576$120, Q = \tx_conta).
Adding EN signal on $verific$out_reg_reg$b13.vhd:239$211 ($adff) from module b13 (D = \data_in, Q = \out_reg).
Adding EN signal on $verific$next_bit_reg$b13.vhd:294$237 ($adff) from module b13 (D = $verific$n1506$115, Q = \next_bit).
Adding EN signal on $verific$error_reg$b13.vhd:239$213 ($adff) from module b13 (D = $verific$n1079$46, Q = \error).
Setting constant 0-bit at position 3 on $verific$conta_tmp_reg$b13.vhd:127$152 ($adff) from module b13.
Setting constant 0-bit at position 7 on $auto$ff.cc:262:slice$248 ($adffe) from module b13.
Setting constant 0-bit at position 8 on $auto$ff.cc:262:slice$248 ($adffe) from module b13.
Setting constant 0-bit at position 9 on $auto$ff.cc:262:slice$248 ($adffe) from module b13.

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 5 unused cells and 5 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.
<suppressed ~1 debug messages>

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~25 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 3 on $verific$canale_reg$b13.vhd:127$151 ($adff) from module b13.

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.13.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~25 debug messages>

yosys> opt_reduce

3.13.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.13.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> opt_expr

3.13.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.13.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 3) from mux cell b13.$verific$mux_18$b13.vhd:103$130 ($mux).
Removed top 1 bits (of 4) from port A of cell b13.$verific$add_23$b13.vhd:107$133 ($add).
Removed top 3 bits (of 4) from port B of cell b13.$verific$add_23$b13.vhd:107$133 ($add).
Removed top 1 bits (of 5) from port Y of cell b13.$verific$add_23$b13.vhd:107$133 ($add).
Removed top 1 bits (of 3) from mux cell b13.$verific$mux_36$b13.vhd:124$140 ($mux).
Removed top 1 bits (of 2) from mux cell b13.$verific$mux_61$b13.vhd:146$157 ($mux).
Removed top 1 bits (of 2) from mux cell b13.$verific$mux_105$b13.vhd:190$182 ($mux).
Removed top 3 bits (of 10) from port A of cell b13.$verific$LessThan_162$b13.vhd:255$214 ($lt).
Removed top 3 bits (of 10) from port B of cell b13.$verific$LessThan_162$b13.vhd:255$214 ($lt).
Removed top 3 bits (of 10) from port A of cell b13.$verific$add_188$b13.vhd:291$226 ($add).
Removed top 9 bits (of 10) from port B of cell b13.$verific$add_188$b13.vhd:291$226 ($add).
Removed top 2 bits (of 10) from port Y of cell b13.$verific$add_188$b13.vhd:291$226 ($add).
Removed top 3 bits (of 10) from mux cell b13.$verific$mux_193$b13.vhd:292$230 ($mux).
Removed top 1 bits (of 8) from port Y of cell b13.$verific$add_188$b13.vhd:291$226 ($add).
Removed top 3 bits (of 10) from wire b13.$verific$n1546$117.
Removed top 3 bits (of 10) from wire b13.$verific$n1576$120.
Removed top 1 bits (of 3) from wire b13.$verific$n243$70.
Removed top 1 bits (of 3) from wire b13.$verific$n442$80.
Removed top 1 bits (of 2) from wire b13.$verific$n588$86.
Removed top 1 bits (of 2) from wire b13.$verific$n898$95.
Removed top 1 bits (of 4) from wire b13.conta_tmp.
Removed top 3 bits (of 10) from wire b13.tx_conta.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 0 unused cells and 9 unused wires.
<suppressed ~1 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module b13:
  creating $macc model for $verific$add_188$b13.vhd:291$226 ($add).
  creating $macc model for $verific$add_23$b13.vhd:107$133 ($add).
  creating $alu model for $macc $verific$add_23$b13.vhd:107$133.
  creating $alu model for $macc $verific$add_188$b13.vhd:291$226.
  creating $alu model for $verific$LessThan_162$b13.vhd:255$214 ($lt): new $alu
  creating $alu cell for $verific$LessThan_162$b13.vhd:255$214: $auto$alumacc.cc:485:replace_alu$272
  creating $alu cell for $verific$add_188$b13.vhd:291$226: $auto$alumacc.cc:485:replace_alu$277
  creating $alu cell for $verific$add_23$b13.vhd:107$133: $auto$alumacc.cc:485:replace_alu$280
  created 3 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.
<suppressed ~3 debug messages>

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~25 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~25 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== b13 ===

   Number of wires:                101
   Number of wire bits:            215
   Number of public wires:          29
   Number of public wire bits:      61
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 90
     $adff                          20
     $adffe                          4
     $alu                            3
     $bmux                          19
     $eq                             1
     $mux                           36
     $not                            3
     $or                             1
     $reduce_and                     2
     $reduce_bool                    1


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.21.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.21.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `$auto$memory_bmux2rom.cc:63:execute$286'[0] in module `\b13': merging output FF to cell.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$283'[0] in module `\b13': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$283'[0] in module `\b13': no address FF found.

yosys> opt_clean

3.21.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 1 unused cells and 5 unused wires.
<suppressed ~2 debug messages>

yosys> memory_share

3.21.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> memory_collect

3.21.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== b13 ===

   Number of wires:                100
   Number of wire bits:            211
   Number of public wires:          29
   Number of public wire bits:      61
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 89
     $adff                          20
     $adffe                          3
     $alu                            3
     $bmux                          17
     $eq                             1
     $mem_v2                         2
     $mux                           36
     $not                            3
     $or                             1
     $reduce_and                     2
     $reduce_bool                    1


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> stat

3.24. Printing statistics.

=== b13 ===

   Number of wires:                100
   Number of wire bits:            211
   Number of public wires:          29
   Number of public wire bits:      61
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 89
     $adff                          20
     $adffe                          3
     $alu                            3
     $bmux                          17
     $eq                             1
     $mem_v2                         2
     $mux                           36
     $not                            3
     $or                             1
     $reduce_and                     2
     $reduce_bool                    1


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $not.
Using template $paramod$dbcdc7e8aa1a4080cea2deda6fdc8772064f4d90\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $or.
Using template $paramod$103b4016182df467cceab67bcf3e18e6361ec0fd\_90_alu for cells of type $alu.
Using template $paramod$bfceb922395790c0ce92e9f9b5b428d4fc72cc30\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $and.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000111 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
No more expansions possible.
<suppressed ~719 debug messages>

yosys> stat

3.26. Printing statistics.

=== b13 ===

   Number of wires:                258
   Number of wire bits:           4016
   Number of public wires:          29
   Number of public wire bits:      61
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                408
     $_AND_                         48
     $_DFFE_PP0P_                   16
     $_DFF_PP0_                     28
     $_MUX_                        221
     $_NOT_                         22
     $_OR_                          28
     $_XOR_                         43
     $mem_v2                         2


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.
<suppressed ~167 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
<suppressed ~48 debug messages>
Removed a total of 16 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 16 unused cells and 137 unused wires.
<suppressed ~17 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$665 ($_DFF_PP0_) from module b13 (D = $verific$n264$73 [2], Q = \conta_tmp [2]).
Adding EN signal on $auto$ff.cc:262:slice$664 ($_DFF_PP0_) from module b13 (D = $verific$n264$73 [1], Q = \conta_tmp [1]).
Adding EN signal on $auto$ff.cc:262:slice$663 ($_DFF_PP0_) from module b13 (D = $verific$n264$73 [0], Q = \conta_tmp [0]).
Adding EN signal on $auto$ff.cc:262:slice$650 ($_DFF_PP0_) from module b13 (D = $verific$n264$73 [2], Q = \canale [2]).
Adding EN signal on $auto$ff.cc:262:slice$649 ($_DFF_PP0_) from module b13 (D = $verific$n264$73 [1], Q = \canale [1]).
Adding EN signal on $auto$ff.cc:262:slice$648 ($_DFF_PP0_) from module b13 (D = $verific$n264$73 [0], Q = \canale [0]).
Adding EN signal on $auto$ff.cc:262:slice$645 ($_DFF_PP0_) from module b13 (D = $auto$simplemap.cc:309:simplemap_bmux$633 [1], Q = \itfc_state [1]).
Adding EN signal on $auto$ff.cc:262:slice$644 ($_DFF_PP0_) from module b13 (D = $auto$simplemap.cc:309:simplemap_bmux$633 [0], Q = \itfc_state [0]).
Adding EN signal on $auto$ff.cc:262:slice$643 ($_DFF_PP0_) from module b13 (D = $auto$simplemap.cc:309:simplemap_bmux$626, Q = \confirm).
Adding EN signal on $auto$ff.cc:262:slice$642 ($_DFF_PP0_) from module b13 (D = $auto$simplemap.cc:309:simplemap_bmux$639, Q = \send).
Adding EN signal on $auto$ff.cc:262:slice$641 ($_DFF_PP0_) from module b13 (D = $auto$simplemap.cc:309:simplemap_bmux$618 [0], Q = \load).
Adding EN signal on $auto$ff.cc:262:slice$612 ($_DFF_PP0_) from module b13 (D = $auto$simplemap.cc:309:simplemap_bmux$595, Q = \shot).
Adding EN signal on $auto$ff.cc:262:slice$611 ($_DFF_PP0_) from module b13 (D = $verific$n732$20, Q = \mpx).
Adding EN signal on $auto$ff.cc:262:slice$610 ($_DFF_PP0_) from module b13 (D = 1'1, Q = \add_mpx2).
Adding EN signal on $auto$ff.cc:262:slice$609 ($_DFF_PP0_) from module b13 (D = $auto$simplemap.cc:309:simplemap_bmux$582, Q = \rdy).
Adding EN signal on $auto$ff.cc:262:slice$565 ($_DFF_PP0_) from module b13 (D = $auto$simplemap.cc:309:simplemap_bmux$434, Q = \mux_en).
Adding EN signal on $auto$ff.cc:262:slice$564 ($_DFF_PP0_) from module b13 (D = $auto$simplemap.cc:309:simplemap_bmux$475 [1], Q = \load_dato).
Adding EN signal on $auto$ff.cc:262:slice$563 ($_DFF_PP0_) from module b13 (D = $auto$simplemap.cc:309:simplemap_bmux$550, Q = \send_data).
Adding EN signal on $auto$ff.cc:262:slice$555 ($_DFF_PP0_) from module b13 (D = $auto$simplemap.cc:309:simplemap_bmux$468, Q = \soc).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 27 unused cells and 65 unused wires.
<suppressed ~28 debug messages>

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.
<suppressed ~85 debug messages>

3.27.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.27.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
<suppressed ~237 debug messages>
Removed a total of 79 cells.

yosys> opt_dff

3.27.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 0 unused cells and 101 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.27.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.27.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> opt_expr

3.27.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.27.30. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.
<suppressed ~50 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
<suppressed ~30 debug messages>
Removed a total of 10 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 0 unused cells and 31 unused wires.
<suppressed ~1 debug messages>

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory $auto$memory_bmux2rom.cc:63:execute$283 in module \b13:
  created 16 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$286 in module \b13:
  created 16 $dff cells and 0 static cells of width 4.
Extracted data FF from read port 0 of b13.$auto$memory_bmux2rom.cc:63:execute$286: $$auto$memory_bmux2rom.cc:63:execute$286$rdreg[0]
  read interface: 1 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[0]$1519 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[1]$1521 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[2]$1523 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[3]$1525 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[4]$1527 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[5]$1529 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[6]$1531 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[7]$1533 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[8]$1535 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[9]$1537 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[10]$1539 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[11]$1541 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[12]$1543 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[13]$1545 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[14]$1547 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$283[15]$1549 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[0]$1596 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[1]$1598 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[2]$1600 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[3]$1602 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[4]$1604 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[5]$1606 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[6]$1608 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[7]$1610 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[8]$1612 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[9]$1614 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[10]$1616 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[11]$1618 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[12]$1620 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[13]$1622 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[14]$1624 ($dff) from module b13 (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$286[15]$1626 ($dff) from module b13 (removing D path).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 0 unused cells and 96 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.
<suppressed ~14 debug messages>

3.30.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce -full

3.30.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][3][0]$1649:
      Old ports: A=4'0010, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$a$1638
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$a$1638 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$a$1638 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$a$1638 [0] } = 3'000
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][3][1]$1652:
      Old ports: A=4'0011, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [2] $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [3] $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [1] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][3][2]$1655:
      Old ports: A=4'0101, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][1]$a$1641
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][1]$a$1641 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][1]$a$1641 [3:2] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][3][3]$1658:
      Old ports: A=4'0111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][1]$b$1642
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][1]$b$1642 [3] $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][1]$b$1642 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][1]$b$1642 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][1]$b$1642 [0] $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][1]$b$1642 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][3][4]$1661:
      Old ports: A=4'1001, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][2]$a$1644
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][2]$a$1644 [3]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][2]$a$1644 [2:0] = 3'001
  Optimizing cells in module \b13.
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$1637:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$a$1638, B=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][0]$a$1632
      New ports: A={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$a$1638 [1] 1'0 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [2] $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [0] $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][0]$a$1632 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][0]$a$1632 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][2]$1643:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][2]$a$1644, B=4'x, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][1]$a$1635
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][2]$a$1644 [3] 2'01 }, B=3'x, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][1]$a$1635 [3] $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][1]$a$1635 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][1]$a$1635 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][1]$a$1635 [1]
  Optimizing cells in module \b13.
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][1]$1634:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][1]$a$1635, B=4'x, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][0][0]$b$1630
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][1]$a$1635 [3] $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][1]$a$1635 [1:0] }, B=3'x, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][0][0]$b$1630 [3] $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][0][0]$b$1630 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][0][0]$b$1630 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][0][0]$b$1630 [1]
  Optimizing cells in module \b13.
Performed a total of 8 changes.

yosys> opt_merge

3.30.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
<suppressed ~9 debug messages>
Removed a total of 3 cells.

yosys> opt_share

3.30.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 0 unused cells and 17 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.
<suppressed ~5 debug messages>

3.30.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce -full

3.30.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][1]$1640:
      Old ports: A={ 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [2:1] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [2:1] $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [1] $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [1] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][0]$b$1633
      New ports: A={ 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [2] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [2:1] $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [1] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][0]$b$1633 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][1][0]$b$1633 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$286$rdmux[0][2][0]$b$1639 [1]
  Optimizing cells in module \b13.
Performed a total of 1 changes.

yosys> opt_merge

3.30.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_share

3.30.22. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.30.26. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce -full

3.30.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.30.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_share

3.30.30. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> opt_expr -full

3.30.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.30.34. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $not.
No more expansions possible.
<suppressed ~81 debug messages>

yosys> opt -sat

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.
<suppressed ~1 debug messages>

3.32.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.32.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.32.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> opt_expr

3.32.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.32.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  12 cells in clk=\clock, en=$auto$opt_dff.cc:194:make_patterns_logic$1012, arst=\reset, srst={ }
  16 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$934, arst=\reset, srst={ }
  13 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$252, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$auto$opt_dff.cc:194:make_patterns_logic$258, arst=\reset, srst={ }
  43 cells in clk=\clock, en=\send_en, arst=\reset, srst={ }
  68 cells in clk=\clock, en={ }, arst=\reset, srst={ }
  24 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$255, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1424, arst=\reset, srst={ }
  7 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1372, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1308, arst=\reset, srst={ }
  8 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1268, arst=\reset, srst={ }
  9 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1202, arst=\reset, srst={ }
  2 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1138, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1127, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1118, arst=\reset, srst={ }
  2 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1083, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1067, arst=\reset, srst={ }
  6 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1042, arst=\reset, srst={ }

3.33.2. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1012, asynchronously reset by \reset
Extracted 12 gates and 15 wires to a netlist network with 2 inputs and 8 outputs.

3.33.2.1. Executing ABC.

3.33.3. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$934, asynchronously reset by \reset
Extracted 16 gates and 18 wires to a netlist network with 2 inputs and 4 outputs.

3.33.3.1. Executing ABC.

3.33.4. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$252, asynchronously reset by \reset
Extracted 13 gates and 24 wires to a netlist network with 11 inputs and 5 outputs.

3.33.4.1. Executing ABC.

3.33.5. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:194:make_patterns_logic$258, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.33.5.1. Executing ABC.

3.33.6. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by \send_en, asynchronously reset by \reset
Extracted 43 gates and 43 wires to a netlist network with 0 inputs and 1 outputs.

3.33.6.1. Executing ABC.

3.33.7. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, asynchronously reset by \reset
Extracted 68 gates and 84 wires to a netlist network with 14 inputs and 33 outputs.

3.33.7.1. Executing ABC.

3.33.8. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$1858$auto$opt_dff.cc:219:make_patterns_logic$255, asynchronously reset by \reset
Extracted 24 gates and 30 wires to a netlist network with 4 inputs and 3 outputs.

3.33.8.1. Executing ABC.

3.33.9. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1424, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 2 outputs.

3.33.9.1. Executing ABC.

3.33.10. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1372, asynchronously reset by \reset
Extracted 7 gates and 15 wires to a netlist network with 8 inputs and 2 outputs.

3.33.10.1. Executing ABC.

3.33.11. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1308, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 2 outputs.

3.33.11.1. Executing ABC.

3.33.12. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1268, asynchronously reset by \reset
Extracted 8 gates and 15 wires to a netlist network with 7 inputs and 2 outputs.

3.33.12.1. Executing ABC.

3.33.13. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1202, asynchronously reset by \reset
Extracted 9 gates and 17 wires to a netlist network with 8 inputs and 3 outputs.

3.33.13.1. Executing ABC.

3.33.14. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1138, asynchronously reset by \reset
Extracted 2 gates and 5 wires to a netlist network with 2 inputs and 2 outputs.

3.33.14.1. Executing ABC.

3.33.15. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$1858$auto$opt_dff.cc:219:make_patterns_logic$1127, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 2 inputs and 3 outputs.

3.33.15.1. Executing ABC.

3.33.16. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1118, asynchronously reset by \reset
Extracted 5 gates and 9 wires to a netlist network with 4 inputs and 3 outputs.

3.33.16.1. Executing ABC.

3.33.17. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1083, asynchronously reset by \reset
Extracted 2 gates and 5 wires to a netlist network with 3 inputs and 2 outputs.

3.33.17.1. Executing ABC.

3.33.18. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1067, asynchronously reset by \reset
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 2 outputs.

3.33.18.1. Executing ABC.

3.33.19. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1042, asynchronously reset by \reset
Extracted 6 gates and 12 wires to a netlist network with 6 inputs and 5 outputs.

3.33.19.1. Executing ABC.

yosys> abc -dff

3.34. Executing ABC pass (technology mapping using ABC).

3.34.1. Summary of detected clock domains:
  10 cells in clk=\clock, en=$abc$1956$auto$opt_dff.cc:219:make_patterns_logic$1372, arst=\reset, srst={ }
  6 cells in clk=\clock, en=$abc$2012$auto$opt_dff.cc:219:make_patterns_logic$1083, arst=\reset, srst={ }
  11 cells in clk=\clock, en=$abc$1774$auto$opt_dff.cc:194:make_patterns_logic$1012, arst=\reset, srst={ }
  6 cells in clk=\clock, en=$abc$2017$auto$opt_dff.cc:219:make_patterns_logic$1067, arst=\reset, srst={ }
  1 cells in clk=\clock, en=$abc$1822$auto$opt_dff.cc:194:make_patterns_logic$258, arst=\reset, srst={ }
  2 cells in clk=\clock, en=$abc$1993$auto$opt_dff.cc:219:make_patterns_logic$1138, arst=\reset, srst={ }
  6 cells in clk=\clock, en=$abc$1858$auto$opt_dff.cc:219:make_patterns_logic$1127, arst=\reset, srst={ }
  11 cells in clk=\clock, en=$abc$1982$auto$opt_dff.cc:219:make_patterns_logic$1202, arst=\reset, srst={ }
  9 cells in clk=\clock, en=$abc$1788$auto$opt_dff.cc:219:make_patterns_logic$934, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$2004$auto$opt_dff.cc:219:make_patterns_logic$1118, arst=\reset, srst={ }
  49 cells in clk=\clock, en={ }, arst=\reset, srst={ }
  29 cells in clk=\clock, en=$abc$1858$lo5, arst=\reset, srst={ }
  12 cells in clk=\clock, en=$abc$1800$auto$opt_dff.cc:219:make_patterns_logic$252, arst=\reset, srst={ }
  24 cells in clk=\clock, en=$abc$1858$auto$opt_dff.cc:219:make_patterns_logic$255, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$abc$1966$auto$opt_dff.cc:219:make_patterns_logic$1308, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$1948$auto$opt_dff.cc:219:make_patterns_logic$1424, arst=\reset, srst={ }
  7 cells in clk=\clock, en=$abc$1972$auto$opt_dff.cc:219:make_patterns_logic$1268, arst=\reset, srst={ }
  7 cells in clk=\clock, en=$abc$2023$auto$opt_dff.cc:219:make_patterns_logic$1042, arst=\reset, srst={ }

3.34.2. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$1956$auto$opt_dff.cc:219:make_patterns_logic$1372, asynchronously reset by \reset
Extracted 10 gates and 19 wires to a netlist network with 9 inputs and 3 outputs.

3.34.2.1. Executing ABC.

3.34.3. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2012$auto$opt_dff.cc:219:make_patterns_logic$1083, asynchronously reset by \reset
Extracted 6 gates and 12 wires to a netlist network with 6 inputs and 5 outputs.

3.34.3.1. Executing ABC.

3.34.4. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$1774$auto$opt_dff.cc:194:make_patterns_logic$1012, asynchronously reset by \reset
Extracted 11 gates and 14 wires to a netlist network with 3 inputs and 8 outputs.

3.34.4.1. Executing ABC.

3.34.5. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2017$auto$opt_dff.cc:219:make_patterns_logic$1067, asynchronously reset by \reset
Extracted 6 gates and 12 wires to a netlist network with 6 inputs and 4 outputs.

3.34.5.1. Executing ABC.

3.34.6. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2043$abc$1822$auto$opt_dff.cc:194:make_patterns_logic$258, asynchronously reset by \reset
Extracted 1 gates and 2 wires to a netlist network with 1 inputs and 1 outputs.

3.34.6.1. Executing ABC.

3.34.7. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$1993$auto$opt_dff.cc:219:make_patterns_logic$1138, asynchronously reset by \reset
Extracted 2 gates and 5 wires to a netlist network with 2 inputs and 2 outputs.

3.34.7.1. Executing ABC.

3.34.8. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$1858$auto$opt_dff.cc:219:make_patterns_logic$1127, asynchronously reset by \reset
Extracted 6 gates and 10 wires to a netlist network with 4 inputs and 4 outputs.

3.34.8.1. Executing ABC.

3.34.9. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$1982$auto$opt_dff.cc:219:make_patterns_logic$1202, asynchronously reset by \reset
Extracted 11 gates and 19 wires to a netlist network with 8 inputs and 4 outputs.

3.34.9.1. Executing ABC.

3.34.10. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$1788$auto$opt_dff.cc:219:make_patterns_logic$934, asynchronously reset by \reset
Extracted 9 gates and 11 wires to a netlist network with 2 inputs and 5 outputs.

3.34.10.1. Executing ABC.

3.34.11. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2004$auto$opt_dff.cc:219:make_patterns_logic$1118, asynchronously reset by \reset
Extracted 5 gates and 9 wires to a netlist network with 4 inputs and 3 outputs.

3.34.11.1. Executing ABC.

3.34.12. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, asynchronously reset by \reset
Extracted 49 gates and 62 wires to a netlist network with 13 inputs and 28 outputs.

3.34.12.1. Executing ABC.

3.34.13. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2124$lo7, asynchronously reset by \reset
Extracted 29 gates and 29 wires to a netlist network with 0 inputs and 1 outputs.

3.34.13.1. Executing ABC.

3.34.14. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2043$abc$1800$auto$opt_dff.cc:219:make_patterns_logic$252, asynchronously reset by \reset
Extracted 12 gates and 21 wires to a netlist network with 9 inputs and 4 outputs.

3.34.14.1. Executing ABC.

3.34.15. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2124$abc$1858$auto$opt_dff.cc:219:make_patterns_logic$255, asynchronously reset by \reset
Extracted 24 gates and 28 wires to a netlist network with 4 inputs and 3 outputs.

3.34.15.1. Executing ABC.

3.34.16. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$1966$auto$opt_dff.cc:219:make_patterns_logic$1308, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 2 outputs.

3.34.16.1. Executing ABC.

3.34.17. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$1948$auto$opt_dff.cc:219:make_patterns_logic$1424, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 2 outputs.

3.34.17.1. Executing ABC.

3.34.18. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$1972$auto$opt_dff.cc:219:make_patterns_logic$1268, asynchronously reset by \reset
Extracted 7 gates and 14 wires to a netlist network with 7 inputs and 2 outputs.

3.34.18.1. Executing ABC.

3.34.19. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2023$auto$opt_dff.cc:219:make_patterns_logic$1042, asynchronously reset by \reset
Extracted 7 gates and 14 wires to a netlist network with 7 inputs and 6 outputs.

3.34.19.1. Executing ABC.

yosys> abc -dff

3.35. Executing ABC pass (technology mapping using ABC).

3.35.1. Summary of detected clock domains:
  8 cells in clk=\clock, en=$abc$2274$abc$1972$auto$opt_dff.cc:219:make_patterns_logic$1268, arst=\reset, srst={ }
  10 cells in clk=\clock, en=$abc$2032$abc$1956$auto$opt_dff.cc:219:make_patterns_logic$1372, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$2043$abc$2012$auto$opt_dff.cc:219:make_patterns_logic$1083, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$2065$abc$2017$auto$opt_dff.cc:219:make_patterns_logic$1067, arst=\reset, srst={ }
  1 cells in clk=\clock, en=$abc$2043$abc$1822$auto$opt_dff.cc:194:make_patterns_logic$258, arst=\reset, srst={ }
  2 cells in clk=\clock, en=$abc$2079$abc$1993$auto$opt_dff.cc:219:make_patterns_logic$1138, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$2084$abc$1858$auto$opt_dff.cc:219:make_patterns_logic$1127, arst=\reset, srst={ }
  8 cells in clk=\clock, en=$abc$2091$abc$1982$auto$opt_dff.cc:219:make_patterns_logic$1202, arst=\reset, srst={ }
  6 cells in clk=\clock, en=$abc$2116$abc$2004$auto$opt_dff.cc:219:make_patterns_logic$1118, arst=\reset, srst={ }
  29 cells in clk=\clock, en=$abc$2124$lo7, arst=\reset, srst={ }
  56 cells in clk=\clock, en={ }, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$abc$2260$abc$1966$auto$opt_dff.cc:219:make_patterns_logic$1308, arst=\reset, srst={ }
  12 cells in clk=\clock, en=$abc$2043$abc$1800$auto$opt_dff.cc:219:make_patterns_logic$252, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$2266$abc$1948$auto$opt_dff.cc:219:make_patterns_logic$1424, arst=\reset, srst={ }
  8 cells in clk=\clock, en=$abc$2103$abc$1788$auto$opt_dff.cc:219:make_patterns_logic$934, arst=\reset, srst={ }
  10 cells in clk=\clock, en=$abc$2051$abc$1774$auto$opt_dff.cc:194:make_patterns_logic$1012, arst=\reset, srst={ }
  28 cells in clk=\clock, en=$abc$2124$abc$1858$auto$opt_dff.cc:219:make_patterns_logic$255, arst=\reset, srst={ }
  7 cells in clk=\clock, en=$abc$2284$abc$2023$auto$opt_dff.cc:219:make_patterns_logic$1042, arst=\reset, srst={ }

3.35.2. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2274$abc$1972$auto$opt_dff.cc:219:make_patterns_logic$1268, asynchronously reset by \reset
Extracted 8 gates and 15 wires to a netlist network with 7 inputs and 3 outputs.

3.35.2.1. Executing ABC.

3.35.3. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2032$abc$1956$auto$opt_dff.cc:219:make_patterns_logic$1372, asynchronously reset by \reset
Extracted 10 gates and 18 wires to a netlist network with 8 inputs and 3 outputs.

3.35.3.1. Executing ABC.

3.35.4. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2043$abc$2012$auto$opt_dff.cc:219:make_patterns_logic$1083, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 4 outputs.

3.35.4.1. Executing ABC.

3.35.5. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2065$abc$2017$auto$opt_dff.cc:219:make_patterns_logic$1067, asynchronously reset by \reset
Extracted 5 gates and 8 wires to a netlist network with 3 inputs and 4 outputs.

3.35.5.1. Executing ABC.

3.35.6. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2314$abc$2043$abc$1822$auto$opt_dff.cc:194:make_patterns_logic$258, asynchronously reset by \reset
Extracted 1 gates and 2 wires to a netlist network with 1 inputs and 1 outputs.

3.35.6.1. Executing ABC.

3.35.7. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2079$abc$1993$auto$opt_dff.cc:219:make_patterns_logic$1138, asynchronously reset by \reset
Extracted 2 gates and 5 wires to a netlist network with 2 inputs and 2 outputs.

3.35.7.1. Executing ABC.

3.35.8. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2084$abc$1858$auto$opt_dff.cc:219:make_patterns_logic$1127, asynchronously reset by \reset
Extracted 5 gates and 7 wires to a netlist network with 2 inputs and 3 outputs.

3.35.8.1. Executing ABC.

3.35.9. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2091$abc$1982$auto$opt_dff.cc:219:make_patterns_logic$1202, asynchronously reset by \reset
Extracted 8 gates and 16 wires to a netlist network with 8 inputs and 3 outputs.

3.35.9.1. Executing ABC.

3.35.10. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2116$abc$2004$auto$opt_dff.cc:219:make_patterns_logic$1118, asynchronously reset by \reset
Extracted 6 gates and 11 wires to a netlist network with 5 inputs and 4 outputs.

3.35.10.1. Executing ABC.

3.35.11. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2124$lo7, asynchronously reset by \reset
Extracted 29 gates and 29 wires to a netlist network with 0 inputs and 1 outputs.

3.35.11.1. Executing ABC.

3.35.12. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, asynchronously reset by \reset
Extracted 56 gates and 72 wires to a netlist network with 16 inputs and 28 outputs.

3.35.12.1. Executing ABC.

3.35.13. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2260$abc$1966$auto$opt_dff.cc:219:make_patterns_logic$1308, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 2 outputs.

3.35.13.1. Executing ABC.

3.35.14. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2314$abc$2043$abc$1800$auto$opt_dff.cc:219:make_patterns_logic$252, asynchronously reset by \reset
Extracted 12 gates and 21 wires to a netlist network with 9 inputs and 4 outputs.

3.35.14.1. Executing ABC.

3.35.15. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2266$abc$1948$auto$opt_dff.cc:219:make_patterns_logic$1424, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 2 outputs.

3.35.15.1. Executing ABC.

3.35.16. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2103$abc$1788$auto$opt_dff.cc:219:make_patterns_logic$934, asynchronously reset by \reset
Extracted 8 gates and 10 wires to a netlist network with 2 inputs and 4 outputs.

3.35.16.1. Executing ABC.

3.35.17. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2051$abc$1774$auto$opt_dff.cc:194:make_patterns_logic$1012, asynchronously reset by \reset
Extracted 10 gates and 13 wires to a netlist network with 3 inputs and 8 outputs.

3.35.17.1. Executing ABC.

3.35.18. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2124$abc$1858$auto$opt_dff.cc:219:make_patterns_logic$255, asynchronously reset by \reset
Extracted 28 gates and 34 wires to a netlist network with 6 inputs and 4 outputs.

3.35.18.1. Executing ABC.

3.35.19. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2284$abc$2023$auto$opt_dff.cc:219:make_patterns_logic$1042, asynchronously reset by \reset
Extracted 7 gates and 14 wires to a netlist network with 7 inputs and 6 outputs.

3.35.19.1. Executing ABC.

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  6 cells in clk=\clock, en=$abc$2294$abc$2274$abc$1972$auto$opt_dff.cc:219:make_patterns_logic$1268, arst=\reset, srst={ }
  7 cells in clk=\clock, en=$abc$2305$abc$2032$abc$1956$auto$opt_dff.cc:219:make_patterns_logic$1372, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$2314$abc$2043$abc$2012$auto$opt_dff.cc:219:make_patterns_logic$1083, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$2321$abc$2065$abc$2017$auto$opt_dff.cc:219:make_patterns_logic$1067, arst=\reset, srst={ }
  1 cells in clk=\clock, en=$abc$2314$abc$2043$abc$1822$auto$opt_dff.cc:194:make_patterns_logic$258, arst=\reset, srst={ }
  2 cells in clk=\clock, en=$abc$2333$abc$2079$abc$1993$auto$opt_dff.cc:219:make_patterns_logic$1138, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$2393$abc$2084$abc$1858$auto$opt_dff.cc:219:make_patterns_logic$1127, arst=\reset, srst={ }
  8 cells in clk=\clock, en=$abc$2344$abc$2091$abc$1982$auto$opt_dff.cc:219:make_patterns_logic$1202, arst=\reset, srst={ }
  7 cells in clk=\clock, en=$abc$2354$abc$2116$abc$2004$auto$opt_dff.cc:219:make_patterns_logic$1118, arst=\reset, srst={ }
  29 cells in clk=\clock, en=$abc$2393$lo0, arst=\reset, srst={ }
  56 cells in clk=\clock, en={ }, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$abc$2453$abc$2260$abc$1966$auto$opt_dff.cc:219:make_patterns_logic$1308, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$2480$abc$2266$abc$1948$auto$opt_dff.cc:219:make_patterns_logic$1424, arst=\reset, srst={ }
  13 cells in clk=\clock, en=$abc$2314$abc$2043$abc$1800$auto$opt_dff.cc:219:make_patterns_logic$252, arst=\reset, srst={ }
  25 cells in clk=\clock, en=$abc$2513$abc$2124$abc$1858$auto$opt_dff.cc:219:make_patterns_logic$255, arst=\reset, srst={ }
  11 cells in clk=\clock, en=$abc$2500$abc$2051$abc$1774$auto$opt_dff.cc:194:make_patterns_logic$1012, arst=\reset, srst={ }
  8 cells in clk=\clock, en=$abc$2488$abc$2103$abc$1788$auto$opt_dff.cc:219:make_patterns_logic$934, arst=\reset, srst={ }
  8 cells in clk=\clock, en=$abc$2540$abc$2284$abc$2023$auto$opt_dff.cc:219:make_patterns_logic$1042, arst=\reset, srst={ }

3.36.2. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2294$abc$2274$abc$1972$auto$opt_dff.cc:219:make_patterns_logic$1268, asynchronously reset by \reset
Extracted 6 gates and 12 wires to a netlist network with 6 inputs and 2 outputs.

3.36.2.1. Executing ABC.

3.36.3. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2305$abc$2032$abc$1956$auto$opt_dff.cc:219:make_patterns_logic$1372, asynchronously reset by \reset
Extracted 7 gates and 14 wires to a netlist network with 7 inputs and 3 outputs.

3.36.3.1. Executing ABC.

3.36.4. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2314$abc$2043$abc$2012$auto$opt_dff.cc:219:make_patterns_logic$1083, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 4 outputs.

3.36.4.1. Executing ABC.

3.36.5. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2321$abc$2065$abc$2017$auto$opt_dff.cc:219:make_patterns_logic$1067, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 4 outputs.

3.36.5.1. Executing ABC.

3.36.6. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2567$abc$2314$abc$2043$abc$1822$auto$opt_dff.cc:194:make_patterns_logic$258, asynchronously reset by \reset
Extracted 1 gates and 2 wires to a netlist network with 1 inputs and 1 outputs.

3.36.6.1. Executing ABC.

3.36.7. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2333$abc$2079$abc$1993$auto$opt_dff.cc:219:make_patterns_logic$1138, asynchronously reset by \reset
Extracted 2 gates and 5 wires to a netlist network with 2 inputs and 2 outputs.

3.36.7.1. Executing ABC.

3.36.8. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2393$abc$2084$abc$1858$auto$opt_dff.cc:219:make_patterns_logic$1127, asynchronously reset by \reset
Extracted 5 gates and 7 wires to a netlist network with 2 inputs and 3 outputs.

3.36.8.1. Executing ABC.

3.36.9. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2344$abc$2091$abc$1982$auto$opt_dff.cc:219:make_patterns_logic$1202, asynchronously reset by \reset
Extracted 8 gates and 16 wires to a netlist network with 8 inputs and 3 outputs.

3.36.9.1. Executing ABC.

3.36.10. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2354$abc$2116$abc$2004$auto$opt_dff.cc:219:make_patterns_logic$1118, asynchronously reset by \reset
Extracted 7 gates and 13 wires to a netlist network with 6 inputs and 4 outputs.

3.36.10.1. Executing ABC.

3.36.11. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2393$lo0, asynchronously reset by \reset
Extracted 29 gates and 29 wires to a netlist network with 0 inputs and 1 outputs.

3.36.11.1. Executing ABC.

3.36.12. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, asynchronously reset by \reset
Extracted 56 gates and 70 wires to a netlist network with 14 inputs and 31 outputs.

3.36.12.1. Executing ABC.

3.36.13. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2453$abc$2260$abc$1966$auto$opt_dff.cc:219:make_patterns_logic$1308, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 2 outputs.

3.36.13.1. Executing ABC.

3.36.14. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2480$abc$2266$abc$1948$auto$opt_dff.cc:219:make_patterns_logic$1424, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 2 outputs.

3.36.14.1. Executing ABC.

3.36.15. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2314$abc$2043$abc$1800$auto$opt_dff.cc:219:make_patterns_logic$252, asynchronously reset by \reset
Extracted 13 gates and 24 wires to a netlist network with 11 inputs and 5 outputs.

3.36.15.1. Executing ABC.

3.36.16. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2513$abc$2124$abc$1858$auto$opt_dff.cc:219:make_patterns_logic$255, asynchronously reset by \reset
Extracted 25 gates and 31 wires to a netlist network with 6 inputs and 4 outputs.

3.36.16.1. Executing ABC.

3.36.17. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2500$abc$2051$abc$1774$auto$opt_dff.cc:194:make_patterns_logic$1012, asynchronously reset by \reset
Extracted 11 gates and 13 wires to a netlist network with 2 inputs and 9 outputs.

3.36.17.1. Executing ABC.

3.36.18. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2488$abc$2103$abc$1788$auto$opt_dff.cc:219:make_patterns_logic$934, asynchronously reset by \reset
Extracted 8 gates and 10 wires to a netlist network with 2 inputs and 4 outputs.

3.36.18.1. Executing ABC.

3.36.19. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$2540$abc$2284$abc$2023$auto$opt_dff.cc:219:make_patterns_logic$1042, asynchronously reset by \reset
Extracted 8 gates and 15 wires to a netlist network with 7 inputs and 7 outputs.

3.36.19.1. Executing ABC.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
<suppressed ~15 debug messages>
Removed a total of 5 cells.

yosys> opt_muxtree

3.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$2645$auto$blifparse.cc:362:parse_blif$2649 ($_DFF_PP0_) from module b13 (D = $abc$2645$lo4, Q = $abc$2645$lo3).

yosys> opt_clean

3.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 2 unused cells and 1294 unused wires.
<suppressed ~13 debug messages>

yosys> opt_expr

3.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> opt_expr

3.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.38.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_WwAk8j/abc_tmp_1.scr

3.39. Executing ABC pass (technology mapping using ABC).

3.39.1. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Extracted 153 gates and 194 wires to a netlist network with 41 inputs and 47 outputs.

3.39.1.1. Executing ABC.
DE:   #PIs =  41  #Luts =    53  Max Lvl =   4  Avg Lvl =   1.15  [   0.13 sec. at Pass 0]
DE:   #PIs =  41  #Luts =    52  Max Lvl =   4  Avg Lvl =   1.28  [   0.33 sec. at Pass 1]
DE:   #PIs =  41  #Luts =    51  Max Lvl =   3  Avg Lvl =   1.13  [   0.13 sec. at Pass 2]
DE:   #PIs =  41  #Luts =    51  Max Lvl =   3  Avg Lvl =   1.13  [   0.43 sec. at Pass 3]
DE:   #PIs =  41  #Luts =    51  Max Lvl =   3  Avg Lvl =   1.13  [   0.17 sec. at Pass 4]
DE:   #PIs =  41  #Luts =    51  Max Lvl =   3  Avg Lvl =   1.13  [   0.57 sec. at Pass 5]
DE:   #PIs =  41  #Luts =    51  Max Lvl =   3  Avg Lvl =   1.13  [   2.34 sec. at Pass 6]
DE:   #PIs =  41  #Luts =    51  Max Lvl =   3  Avg Lvl =   1.13  [   1.11 sec. at Pass 7]

yosys> opt

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 0 unused cells and 195 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 2 inverters.

yosys> stat

3.42. Printing statistics.

=== b13 ===

   Number of wires:                 99
   Number of wire bits:            117
   Number of public wires:          19
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 95
     $_DFFE_PP0N_                    1
     $_DFFE_PP0P_                   34
     $_DFFE_PP1P_                    2
     $_DFF_PP0_                      8
     $lut                           50


yosys> shregmap -minlen 8 -maxlen 20

3.43. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.45. Printing statistics.

=== b13 ===

   Number of wires:                 99
   Number of wire bits:            117
   Number of public wires:          19
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 95
     $_DFFE_PP0N_                    1
     $_DFFE_PP0P_                   34
     $_DFFE_PP1P_                    2
     $_DFF_PP0_                      8
     $lut                           50


yosys> techmap -map +/rapidsilicon/genesis/ffs_map.v

3.46. Executing TECHMAP pass (map to technology primitives).

3.46.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.46.2. Continuing TECHMAP pass.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using template \$_DFFE_PP0N_ for cells of type $_DFFE_PP0N_.
Using template \$_DFFE_PP1P_ for cells of type $_DFFE_PP1P_.
No more expansions possible.
<suppressed ~112 debug messages>

yosys> techmap -map +/techmap.v

3.47. Executing TECHMAP pass (map to technology primitives).

3.47.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.47.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~167 debug messages>

yosys> opt_expr -mux_undef

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.
<suppressed ~542 debug messages>

yosys> simplemap

3.49. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.50. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

yosys> opt_merge

3.51. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
<suppressed ~330 debug messages>
Removed a total of 110 cells.

yosys> opt_dff -nodffe -nosdff

3.52. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 1 unused cells and 346 unused wires.
<suppressed ~2 debug messages>

yosys> opt -nodffe -nosdff

3.54. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.54.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.
<suppressed ~15 debug messages>

yosys> opt_merge -nomux

3.54.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.54.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.54.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.54.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.54.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.54.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.54.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.54.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.54.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> opt_expr

3.54.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.54.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_WwAk8j/abc_tmp_2.scr

3.55. Executing ABC pass (technology mapping using ABC).

3.55.1. Extracting gate netlist of module `\b13' to `<abc-temp-dir>/input.blif'..
Extracted 147 gates and 191 wires to a netlist network with 42 inputs and 46 outputs.

3.55.1.1. Executing ABC.
DE:   #PIs =  42  #Luts =    51  Max Lvl =   3  Avg Lvl =   1.20  [   0.08 sec. at Pass 0]
DE:   #PIs =  42  #Luts =    51  Max Lvl =   3  Avg Lvl =   1.20  [   0.37 sec. at Pass 1]
DE:   #PIs =  42  #Luts =    50  Max Lvl =   3  Avg Lvl =   1.13  [   0.19 sec. at Pass 2]
DE:   #PIs =  42  #Luts =    50  Max Lvl =   3  Avg Lvl =   1.13  [   0.32 sec. at Pass 3]
DE:   #PIs =  42  #Luts =    50  Max Lvl =   3  Avg Lvl =   1.13  [   0.15 sec. at Pass 4]
DE:   #PIs =  42  #Luts =    50  Max Lvl =   3  Avg Lvl =   1.13  [   0.54 sec. at Pass 5]
DE:   #PIs =  42  #Luts =    50  Max Lvl =   3  Avg Lvl =   1.13  [   2.06 sec. at Pass 6]
DE:   #PIs =  42  #Luts =    50  Max Lvl =   3  Avg Lvl =   1.13  [   2.05 sec. at Pass 7]

yosys> opt

3.56. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.56.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

yosys> opt_merge -nomux

3.56.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.56.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.56.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.56.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff

3.56.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.56.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 0 unused cells and 168 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.56.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.56.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.56.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b13..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.56.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b13.
Performed a total of 0 changes.

yosys> opt_merge

3.56.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b13'.
Removed a total of 0 cells.

yosys> opt_dff

3.56.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.56.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..

yosys> opt_expr

3.56.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b13.

3.56.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.57. Executing HIERARCHY pass (managing design hierarchy).

3.57.1. Analyzing design hierarchy..
Top module:  \b13

3.57.2. Analyzing design hierarchy..
Top module:  \b13
Removed 0 unused modules.

yosys> stat

3.58. Printing statistics.

=== b13 ===

   Number of wires:                 99
   Number of wire bits:            117
   Number of public wires:          19
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 95
     $lut                           50
     dffsre                         45


yosys> opt_clean -purge

3.59. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b13..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.60. Executing Verilog backend.
Dumping module `\b13'.

End of script. Logfile hash: 7af8aa20ed, CPU: user 2.13s system 0.62s, MEM: 21.86 MB peak
Yosys 0.17+103 (git sha1 a1babadd5, gcc 9.1.0 -fPIC -Os)
Time spent: 98% 6x abc (122 sec), 0% 44x opt_expr (0 sec), ...
real 36.73
user 99.69
sys 24.43
