
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.140
 Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl aes_lib.vhd dual_mem.vhd aes_enc.vhd aes_fsm_enc.vhd

yosys> verific -vhdl aes_lib.vhd dual_mem.vhd aes_enc.vhd aes_fsm_enc.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'aes_lib.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_1164' from file '/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_1164.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.textio' from file '/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/textio.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_arith' from file '/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_arith.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_unsigned' from file '/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_unsigned.vdb'
VERIFIC-INFO [VHDL-1014] aes_lib.vhd:11: analyzing package 'aes_lib'
VERIFIC-INFO [VHDL-1013] aes_lib.vhd:25: analyzing package body 'aes_lib'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'dual_mem.vhd'
VERIFIC-INFO [VHDL-1012] dual_mem.vhd:20: analyzing entity 'dual_mem'
VERIFIC-INFO [VHDL-1010] dual_mem.vhd:33: analyzing architecture 'rtl'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'aes_enc.vhd'
VERIFIC-INFO [VHDL-1012] aes_enc.vhd:24: analyzing entity 'aes_enc'
VERIFIC-INFO [VHDL-1010] aes_enc.vhd:36: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'aes_fsm_enc.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.numeric_std' from file '/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/numeric_std.vdb'
VERIFIC-INFO [VHDL-1012] aes_fsm_enc.vhd:26: analyzing entity 'aes_fsm_enc'
VERIFIC-INFO [VHDL-1010] aes_fsm_enc.vhd:37: analyzing architecture 'behavioral'

yosys> synth_rs -top aes_fsm_enc -tech genesis2 -goal area -de -verilog synthesized.v

3. Executing synth_rs pass: v0.4.116

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis2/cells_sim.v +/rapidsilicon/genesis2/dsp_sim.v +/rapidsilicon/genesis2/brams_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dff'.
Generating RTLIL representation for module `\dffn'.
Generating RTLIL representation for module `\sdff'.
Generating RTLIL representation for module `\sdffn'.
Generating RTLIL representation for module `\dffr'.
Generating RTLIL representation for module `\dffnr'.
Generating RTLIL representation for module `\dffe'.
Generating RTLIL representation for module `\dffne'.
Generating RTLIL representation for module `\sdffre'.
Generating RTLIL representation for module `\sdffnre'.
Generating RTLIL representation for module `\dffre'.
Generating RTLIL representation for module `\dffnre'.
Generating RTLIL representation for module `\latch'.
Generating RTLIL representation for module `\latchn'.
Generating RTLIL representation for module `\latchr'.
Generating RTLIL representation for module `\latchnr'.
Generating RTLIL representation for module `\fa_1bit'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP'.
Generating RTLIL representation for module `\RS_DSP_MULT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Successfully finished Verilog frontend.

3.4. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v' to AST representation.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\RS_TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top aes_fsm_enc

3.5. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] aes_fsm_enc.vhd:26: processing 'aes_fsm_enc(Behavioral)'
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:98: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:133: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:136: 'count' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1613] aes_fsm_enc.vhd:183: incomplete sensitivity list specified; assuming completeness
VERIFIC-WARNING [VHDL-1840] aes_fsm_enc.vhd:183: latch inferred for net 'rst_cnt'
VERIFIC-INFO [VHDL-1067] aes_enc.vhd:24: processing 'aes_enc(Behavioral)'
VERIFIC-INFO [VHDL-1067] dual_mem.vhd:20: processing 'dual_mem(rtl)'
VERIFIC-INFO [VHDL-1754] dual_mem.vhd:36: extracting RAM for identifier 'RAM'
VERIFIC-INFO [VHDL-1067] dual_mem.vhd:20: processing 'dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl)'
VERIFIC-INFO [VHDL-1754] dual_mem.vhd:36: extracting RAM for identifier 'RAM'
Importing module aes_fsm_enc.
Importing module aes_enc(Behavioral).
Importing module dual_mem(rtl).
Importing module dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl).

3.5.1. Analyzing design hierarchy..
Top module:  \aes_fsm_enc
Used module:     \dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl)
Used module:     \aes_enc(Behavioral)
Used module:         \dual_mem(rtl)

3.5.2. Analyzing design hierarchy..
Top module:  \aes_fsm_enc
Used module:     \dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl)
Used module:     \aes_enc(Behavioral)
Used module:         \dual_mem(rtl)
Removed 0 unused modules.

yosys> proc

3.6. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.6.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.6.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.6.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.6.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.6.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.6.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.6.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.6.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.6.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.6.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.6.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.6.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl).
Optimizing module dual_mem(rtl).
Optimizing module aes_enc(Behavioral).
<suppressed ~4 debug messages>
Optimizing module aes_fsm_enc.
<suppressed ~5 debug messages>

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module aes_enc(Behavioral).
Deleting now unused module dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl).
Deleting now unused module dual_mem(rtl).
<suppressed ~4 debug messages>

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~3 debug messages>

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 4 unused cells and 130 unused wires.
<suppressed ~66 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module aes_fsm_enc...
Found and reported 0 problems.

yosys> opt_expr

3.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.16. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~10 debug messages>

yosys> opt_reduce

3.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.20. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.21. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$state_reg$aes_fsm_enc.vhd:63$51 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $verific$count_reg$aes_fsm_enc.vhd:197$83 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\SUB_KEYS_DRAM.$verific$read_a_reg$dual_mem.vhd:52$295 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_2.$verific$read_dpra_reg$dual_mem.vhd:52$271 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_2.$verific$read_a_reg$dual_mem.vhd:52$270 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_1.$verific$read_dpra_reg$dual_mem.vhd:52$271 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_1.$verific$read_a_reg$dual_mem.vhd:52$270 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.$verific$sum_proc_1.reg_v_reg$aes_enc.vhd:88$193 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.$verific$sum_proc_1.key_reg_v_reg$aes_enc.vhd:88$194 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.$verific$key_reg_delayed_reg$aes_enc.vhd:122$246 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.$verific$gen_output.out_buffer_v_reg$aes_enc.vhd:133$250 ($aldff) from module aes_fsm_enc.

yosys> opt_clean

3.22. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.24. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.24.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.24.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.24.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> fsm_opt

3.24.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.24.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.24.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.24.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~10 debug messages>

yosys> opt_reduce

3.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.30. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.31. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $verific$count_reg$aes_fsm_enc.vhd:197$83 ($dff) from module aes_fsm_enc (D = $verific$n1676$42, Q = \count, rval = 4'0000).
Adding EN signal on $auto$ff.cc:262:slice$303 ($sdff) from module aes_fsm_enc (D = $verific$n1671$41, Q = \count).
Adding SRST signal on $flatten\AES_ROUND_N.$verific$sum_proc_1.reg_v_reg$aes_enc.vhd:88$193 ($dff) from module aes_fsm_enc (D = $flatten\AES_ROUND_N.$verific$n734$113, Q = \AES_ROUND_N.sum_proc_1.reg_v, rval = 128'00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000).
Adding EN signal on $auto$ff.cc:262:slice$305 ($sdff) from module aes_fsm_enc (D = $flatten\AES_ROUND_N.$verific$n734$113, Q = \AES_ROUND_N.sum_proc_1.reg_v).
Adding SRST signal on $flatten\AES_ROUND_N.$verific$sum_proc_1.key_reg_v_reg$aes_enc.vhd:88$194 ($dff) from module aes_fsm_enc (D = $flatten\AES_ROUND_N.$verific$n1121$116, Q = \AES_ROUND_N.sum_proc_1.key_reg_v, rval = 128'00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000).
Adding EN signal on $auto$ff.cc:262:slice$309 ($sdff) from module aes_fsm_enc (D = $flatten\AES_ROUND_N.$verific$n1121$116, Q = \AES_ROUND_N.sum_proc_1.key_reg_v).
Adding EN signal on $flatten\AES_ROUND_N.$verific$gen_output.out_buffer_v_reg$aes_enc.vhd:133$250 ($dff) from module aes_fsm_enc (D = { \AES_ROUND_N.sub_tmp_key_3 \AES_ROUND_N.sub_tmp_key_2 \AES_ROUND_N.sub_tmp_key_1 \AES_ROUND_N.sub_tmp_key_0 \AES_ROUND_N.gen_output.out_buffer_v [127:32] }, Q = \AES_ROUND_N.gen_output.out_buffer_v).

yosys> opt_clean

3.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 5 unused cells and 5 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~2 debug messages>

yosys> opt_muxtree

3.34. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~9 debug messages>

yosys> opt_reduce

3.35. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.36. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_share

3.37. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.38. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_muxtree

3.41. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~9 debug messages>

yosys> opt_reduce

3.42. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.43. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.44. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.45. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.46. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 3

yosys> wreduce -keepdc

3.48. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 4) from mux cell aes_fsm_enc.$verific$mux_301$aes_fsm_enc.vhd:140$63 ($mux).
Removed top 3 bits (of 4) from port A of cell aes_fsm_enc.$verific$equal_346$aes_fsm_enc.vhd:190$77 ($eq).
Removed top 3 bits (of 4) from port B of cell aes_fsm_enc.$verific$add_350$aes_fsm_enc.vhd:194$79 ($add).
Removed top 1 bits (of 2) from port A of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_101$aes_lib.vhd:32$216 ($and).
Removed top 1 bits (of 2) from port B of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_101$aes_lib.vhd:32$216 ($and).
Removed top 1 bits (of 2) from port Y of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_101$aes_lib.vhd:32$216 ($and).
Removed top 1 bits (of 2) from port A of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_102$aes_lib.vhd:32$218 ($and).
Removed top 1 bits (of 2) from port B of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_102$aes_lib.vhd:32$218 ($and).
Removed top 1 bits (of 2) from port Y of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_102$aes_lib.vhd:32$218 ($and).
Removed top 1 bits (of 2) from port A of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_97$aes_lib.vhd:32$198 ($and).
Removed top 1 bits (of 2) from port B of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_97$aes_lib.vhd:32$198 ($and).
Removed top 1 bits (of 2) from port Y of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_97$aes_lib.vhd:32$198 ($and).
Removed top 1 bits (of 2) from port A of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_99$aes_lib.vhd:32$207 ($and).
Removed top 1 bits (of 2) from port B of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_99$aes_lib.vhd:32$207 ($and).
Removed top 1 bits (of 2) from port Y of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_99$aes_lib.vhd:32$207 ($and).
Removed top 96 bits (of 128) from FF cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$key_reg_delayed_reg$aes_enc.vhd:122$246 ($dff).
Removed top 3 bits (of 8) from port B of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$xor_23$aes_lib.vhd:32$200 ($xor).
Removed top 3 bits (of 8) from port B of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$xor_36$aes_lib.vhd:32$209 ($xor).
Removed top 3 bits (of 8) from port B of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$xor_49$aes_lib.vhd:32$219 ($xor).
Removed top 3 bits (of 8) from port B of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$xor_56$aes_lib.vhd:32$224 ($xor).
Removed top 3 bits (of 8) from wire aes_fsm_enc.$flatten\AES_ROUND_N.$verific$n1923$119.
Removed top 3 bits (of 8) from wire aes_fsm_enc.$flatten\AES_ROUND_N.$verific$n2040$129.
Removed top 3 bits (of 8) from wire aes_fsm_enc.$flatten\AES_ROUND_N.$verific$n2157$139.
Removed top 3 bits (of 8) from wire aes_fsm_enc.$flatten\AES_ROUND_N.$verific$n2220$146.
Removed top 1 bits (of 4) from wire aes_fsm_enc.$verific$n1130$30.

yosys> peepopt

3.49. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.50. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 5 unused wires.
<suppressed ~1 debug messages>

yosys> demuxmap

3.51. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> stat

3.52. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                110
   Number of wire bits:           3417
   Number of public wires:          72
   Number of public wire bits:    2564
   Number of memories:               3
   Number of memory bits:         5376
   Number of processes:              0
   Number of cells:                 73
     $add                            1
     $adff                           1
     $and                            4
     $bmux                           9
     $dff                            6
     $dffe                           1
     $dlatch                         1
     $eq                             2
     $memrd_v2                       5
     $memwr_v2                       3
     $mux                           11
     $reduce_bool                    1
     $sdffe                          3
     $xor                           25


yosys> wreduce t:$mul

3.53. Executing WREDUCE pass (reducing word size of cells).

yosys> rs_dsp_macc -genesis2 -max_dsp 154

3.54. Executing RS_DSP_MACC pass.

yosys> techmap -map +/mul2dsp_check_maxwidth.v -D DSP_A_MAXWIDTH=20 -D DSP_B_MAXWIDTH=18 -D DSP_A_MINWIDTH=11 -D DSP_B_MINWIDTH=10 -D DSP_NAME=$__RS_MUL20X18 a:valid_map

3.55. Executing TECHMAP pass (map to technology primitives).

3.55.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

3.55.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> stat

3.56. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                110
   Number of wire bits:           3417
   Number of public wires:          72
   Number of public wire bits:    2564
   Number of memories:               3
   Number of memory bits:         5376
   Number of processes:              0
   Number of cells:                 73
     $add                            1
     $adff                           1
     $and                            4
     $bmux                           9
     $dff                            6
     $dffe                           1
     $dlatch                         1
     $eq                             2
     $memrd_v2                       5
     $memwr_v2                       3
     $mux                           11
     $reduce_bool                    1
     $sdffe                          3
     $xor                           25


yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/rapidsilicon/genesis2/dsp_map.v -D USE_DSP_CFG_PARAMS=0

3.57. Executing TECHMAP pass (map to technology primitives).

3.57.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_MUL20X18'.
Successfully finished Verilog frontend.

3.57.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/dsp_final_map.v

3.58. Executing TECHMAP pass (map to technology primitives).

3.58.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v' to AST representation.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Successfully finished Verilog frontend.

3.58.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> rs-pack-dsp-regs

3.59. Executing rs_pack_dsp_regs pass.

yosys> rs_dsp_io_regs

3.60. Executing RS_DSP_IO_REGS pass.

yosys> alumacc

3.61. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module aes_fsm_enc:
  creating $macc model for $verific$add_350$aes_fsm_enc.vhd:194$79 ($add).
  creating $alu model for $macc $verific$add_350$aes_fsm_enc.vhd:194$79.
  creating $alu cell for $verific$add_350$aes_fsm_enc.vhd:194$79: $auto$alumacc.cc:485:replace_alu$319
  created 1 $alu and 0 $macc cells.

yosys> opt_expr

3.62. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~4 debug messages>

yosys> opt_merge -nomux

3.63. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.64. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~9 debug messages>

yosys> opt_reduce

3.65. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.66. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.67. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.68. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.69. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.70. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 1

yosys> stat

3.71. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                108
   Number of wire bits:           3393
   Number of public wires:          72
   Number of public wire bits:    2564
   Number of memories:               3
   Number of memory bits:         5376
   Number of processes:              0
   Number of cells:                 69
     $adff                           1
     $alu                            1
     $bmux                           9
     $dff                            6
     $dffe                           1
     $dlatch                         1
     $eq                             2
     $memrd_v2                       5
     $memwr_v2                       3
     $mux                           11
     $reduce_bool                    1
     $sdffe                          3
     $xor                           25


yosys> memory -nomap

3.72. Executing MEMORY pass.

yosys> opt_mem

3.72.1. Executing OPT_MEM pass (optimize memories).
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 7
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 0
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 1
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 2
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 3
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 4
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 5
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 6
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 7
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 8
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 9
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 10
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 11
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 12
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 13
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 14
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 15
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 16
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 17
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 18
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 19
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 20
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 21
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 22
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 23
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 24
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 25
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 26
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 27
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 28
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 29
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 30
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 31
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 32
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 33
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 34
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 35
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 36
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 37
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 38
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 39
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 40
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 41
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 42
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 43
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 44
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 45
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 46
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 47
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 48
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 49
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 50
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 51
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 52
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 53
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 54
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 55
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 56
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 57
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 58
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 59
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 60
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 61
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 62
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 63
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 64
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 65
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 66
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 67
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 68
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 69
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 70
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 71
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 72
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 73
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 74
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 75
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 76
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 77
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 78
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 79
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 80
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 81
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 82
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 83
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 84
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 85
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 86
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 87
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 88
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 89
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 90
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 91
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 92
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 93
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 94
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 95
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 96
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 97
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 98
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 99
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 100
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 101
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 102
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 103
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 104
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 105
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 106
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 107
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 108
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 109
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 110
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 111
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 112
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 113
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 114
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 115
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 116
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 117
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 118
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 119
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 120
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 121
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 122
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 123
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 124
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 125
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 126
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 127
Performed a total of 6 transformations.

yosys> opt_mem_priority

3.72.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.72.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.72.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.72.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `$auto$memory_bmux2rom.cc:63:execute$337'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$334'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$331'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$328'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$325'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$322'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$337'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$334'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$331'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$328'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$325'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$322'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.

yosys> opt_clean

3.72.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 10 unused cells and 16 unused wires.
<suppressed ~24 debug messages>

yosys> memory_share

3.72.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.72.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.72.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> memory_collect

3.72.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.73. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                 92
   Number of wire bits:           2429
   Number of public wires:          59
   Number of public wire bits:    1984
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 51
     $adff                           1
     $alu                            1
     $bmux                           2
     $dff                            1
     $dffe                           1
     $dlatch                         1
     $eq                             2
     $mem_v2                         6
     $mux                            9
     $reduce_bool                    1
     $sdffe                          2
     $xor                           24


yosys> muxpack

3.74. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~9 debug messages>

yosys> opt_clean

3.75. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new_swap.txt -limit 150 a:read_swapped

3.76. Executing MEMORY_LIBMAP pass (mapping memories to cells).

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new.txt -limit 150

3.77. Executing MEMORY_LIBMAP pass (mapping memories to cells).
using FF mapping for memory aes_fsm_enc.$auto$memory_bmux2rom.cc:63:execute$322
using FF mapping for memory aes_fsm_enc.$auto$memory_bmux2rom.cc:63:execute$325
using FF mapping for memory aes_fsm_enc.$auto$memory_bmux2rom.cc:63:execute$328
using FF mapping for memory aes_fsm_enc.$auto$memory_bmux2rom.cc:63:execute$331
using FF mapping for memory aes_fsm_enc.$auto$memory_bmux2rom.cc:63:execute$334
using FF mapping for memory aes_fsm_enc.$auto$memory_bmux2rom.cc:63:execute$337
<suppressed ~36 debug messages>

yosys> rs_bram_split -new_mapping

3.78. Executing Rs_BRAM_Split pass.

yosys> techmap -autoproc -map +/rapidsilicon/genesis2/brams_map_new.v

3.79. Executing TECHMAP pass (map to technology primitives).

3.79.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v' to AST representation.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_SDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_SDP'.
Successfully finished Verilog frontend.

3.79.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~6 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/brams_final_map_new.v

3.80. Executing TECHMAP pass (map to technology primitives).

3.80.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v' to AST representation.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Successfully finished Verilog frontend.

3.80.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> pmuxtree

3.81. Executing PMUXTREE pass.

yosys> muxpack

3.82. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~9 debug messages>

yosys> memory_map

3.83. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory $auto$memory_bmux2rom.cc:63:execute$322 in module \aes_fsm_enc:
  created 16 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$325 in module \aes_fsm_enc:
  created 16 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$328 in module \aes_fsm_enc:
  created 16 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$331 in module \aes_fsm_enc:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$334 in module \aes_fsm_enc:
  created 16 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$337 in module \aes_fsm_enc:
  created 16 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.

yosys> stat

3.84. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                432
   Number of wire bits:           2769
   Number of public wires:          59
   Number of public wire bits:    1984
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                215
     $adff                           1
     $alu                            1
     $bmux                           2
     $dff                           89
     $dffe                           1
     $dlatch                         1
     $eq                             2
     $mux                           91
     $reduce_bool                    1
     $sdffe                          2
     $xor                           24


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/arith_map.v

3.85. Executing TECHMAP pass (map to technology primitives).

3.85.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.85.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.85.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $dlatch.
Using extmapper simplemap for cells of type $sdffe.
Using template $paramod$32a7b7b86c07519b7537abc18e96f0331f97914d\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $and.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~519 debug messages>

yosys> stat

3.86. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                481
   Number of wire bits:           5938
   Number of public wires:          59
   Number of public wire bits:    1984
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2987
     $_AND_                         10
     $_DFFE_PP_                    128
     $_DFF_PP0_                      4
     $_DFF_P_                      120
     $_DLATCH_P_                     1
     $_MUX_                       2365
     $_NOT_                          6
     $_OR_                          12
     $_SDFFE_PP0P_                 132
     $_XOR_                        209


yosys> opt_expr

3.87. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~1250 debug messages>

yosys> opt_merge -nomux

3.88. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~2820 debug messages>
Removed a total of 940 cells.

yosys> opt_muxtree

3.89. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.90. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.91. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.92. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.93. Executing OPT_DFF pass (perform DFF optimizations).
Handling const CLK on $auto$ff.cc:262:slice$3176 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3174 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3241 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3196 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3033 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3192 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3195 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3161 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3150 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3190 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3189 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3156 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3167 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3166 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3670 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3172 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3186 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3187 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3188 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3165 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3164 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3163 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3171 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3170 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3169 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3168 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3147 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3145 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3155 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3060 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3062 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3063 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3162 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3059 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1016 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1025 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3068 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3160 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3158 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3197 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3198 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3193 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3194 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3208 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3207 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3206 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3205 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3204 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3127 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3128 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3126 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3131 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3132 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3129 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3130 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3064 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3138 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3136 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3134 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3133 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1041 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3096 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3097 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3098 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3099 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3100 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3077 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3078 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3079 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3080 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3081 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3082 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3069 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3061 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3070 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3073 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3071 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3072 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3154 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3153 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3152 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3151 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3143 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3142 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3141 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3140 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3107 ($_DFF_P_) from module aes_fsm_enc (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3106 ($_DFF_P_) from module aes_fsm_enc (removing D path).

yosys> opt_clean

3.94. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 5 unused cells and 328 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.95. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~54 debug messages>

yosys> opt_muxtree

3.96. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.97. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.98. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~30 debug messages>
Removed a total of 10 cells.

yosys> opt_share

3.99. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.100. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.101. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 63 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.102. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_muxtree

3.103. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.104. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.105. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.106. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.107. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.108. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.109. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 3

yosys> opt_expr -full

3.110. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~223 debug messages>

yosys> techmap -map +/techmap.v

3.111. Executing TECHMAP pass (map to technology primitives).

3.111.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.111.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> stat

3.112. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                 94
   Number of wire bits:           4132
   Number of public wires:          59
   Number of public wire bits:    1984
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                481
     $_AND_                         14
     $_DFFE_PP_                    128
     $_DFF_PP0_                      4
     $_DFF_P_                       32
     $_DLATCH_P_                     1
     $_MUX_                        151
     $_NOT_                          6
     $_OR_                          10
     $_SDFFE_PP0N_                   4
     $_SDFFE_PP0P_                 128
     $_XOR_                          3


yosys> dfflegalize -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 t:$_SDFFCE_*

3.113. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.114. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                 94
   Number of wire bits:           4132
   Number of public wires:          59
   Number of public wire bits:    1984
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                481
     $_AND_                         14
     $_DFFE_PP_                    128
     $_DFF_PP0_                      4
     $_DFF_P_                       32
     $_DLATCH_P_                     1
     $_MUX_                        151
     $_NOT_                          6
     $_OR_                          10
     $_SDFFE_PP0N_                   4
     $_SDFFE_PP0P_                 128
     $_XOR_                          3


yosys> opt_expr

3.115. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.116. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.117. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.118. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.119. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -sat

3.120. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.121. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 2 unused cells and 12 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.122. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_muxtree

3.123. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.124. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.125. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -sat

3.126. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.127. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.128. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 2

yosys> abc -dff -keepff

3.129. Executing ABC pass (technology mapping using ABC).

3.129.1. Summary of detected clock domains:
  257 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$307, arst={ }, srst=\rst
  32 cells in clk=\clk, en={ }, arst={ }, srst={ }
  20 cells in clk=\clk, en=!$auto$simplemap.cc:257:simplemap_eqne$3041, arst={ }, srst=\rst_cnt
  40 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  129 cells in clk=\clk, en=\AES_ROUND_N.enc, arst={ }, srst={ }

3.129.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$307, synchronously reset by \rst
Extracted 257 gates and 260 wires to a netlist network with 2 inputs and 129 outputs.

3.129.2.1. Executing ABC.

3.129.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 32 gates and 33 wires to a netlist network with 0 inputs and 32 outputs.

3.129.3.1. Executing ABC.

3.129.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$auto$simplemap.cc:257:simplemap_eqne$3041, synchronously reset by \rst_cnt
Extracted 19 gates and 21 wires to a netlist network with 2 inputs and 6 outputs.

3.129.4.1. Executing ABC.

3.129.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 40 gates and 44 wires to a netlist network with 2 inputs and 12 outputs.

3.129.5.1. Executing ABC.

3.129.6. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \AES_ROUND_N.enc
Extracted 129 gates and 164 wires to a netlist network with 35 inputs and 129 outputs.

3.129.6.1. Executing ABC.

yosys> abc -dff -keepff

3.130. Executing ABC pass (technology mapping using ABC).

3.130.1. Summary of detected clock domains:
  18 cells in clk=\clk, en=!$abc$4191$auto$simplemap.cc:257:simplemap_eqne$3041, arst={ }, srst=\rst_cnt
  32 cells in clk=\clk, en={ }, arst={ }, srst={ }
  44 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  128 cells in clk=\clk, en=$abc$4252$AES_ROUND_N.enc, arst={ }, srst={ }

3.130.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$abc$4191$auto$simplemap.cc:257:simplemap_eqne$3041, synchronously reset by \rst_cnt
Extracted 17 gates and 19 wires to a netlist network with 2 inputs and 6 outputs.

3.130.2.1. Executing ABC.

3.130.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 32 gates and 33 wires to a netlist network with 0 inputs and 32 outputs.

3.130.3.1. Executing ABC.

3.130.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 44 gates and 46 wires to a netlist network with 2 inputs and 10 outputs.

3.130.4.1. Executing ABC.

3.130.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$4593$abc$4252$AES_ROUND_N.enc
Extracted 128 gates and 160 wires to a netlist network with 32 inputs and 128 outputs.

3.130.5.1. Executing ABC.

yosys> abc -dff -keepff

3.131. Executing ABC pass (technology mapping using ABC).

3.131.1. Summary of detected clock domains:
  40 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  18 cells in clk=\clk, en=!$abc$4510$abc$4191$auto$simplemap.cc:257:simplemap_eqne$3041, arst={ }, srst=\rst_cnt
  32 cells in clk=\clk, en={ }, arst={ }, srst={ }
  130 cells in clk=\clk, en=$abc$4593$abc$4252$AES_ROUND_N.enc, arst={ }, srst={ }

3.131.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 40 gates and 43 wires to a netlist network with 3 inputs and 12 outputs.

3.131.2.1. Executing ABC.

3.131.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$abc$4510$abc$4191$auto$simplemap.cc:257:simplemap_eqne$3041, synchronously reset by \rst_cnt
Extracted 17 gates and 19 wires to a netlist network with 2 inputs and 6 outputs.

3.131.3.1. Executing ABC.

3.131.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 32 gates and 33 wires to a netlist network with 0 inputs and 32 outputs.

3.131.4.1. Executing ABC.

3.131.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$4593$abc$4252$AES_ROUND_N.enc
Extracted 130 gates and 165 wires to a netlist network with 35 inputs and 130 outputs.

3.131.5.1. Executing ABC.

yosys> abc -dff -keepff

3.132. Executing ABC pass (technology mapping using ABC).

3.132.1. Summary of detected clock domains:
  40 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  32 cells in clk=\clk, en={ }, arst={ }, srst={ }
  18 cells in clk=\clk, en=!$abc$4934$abc$4510$abc$4191$auto$simplemap.cc:257:simplemap_eqne$3041, arst={ }, srst=\rst_cnt
  130 cells in clk=\clk, en=$abc$5017$abc$4593$abc$4252$AES_ROUND_N.enc, arst={ }, srst={ }

3.132.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 40 gates and 43 wires to a netlist network with 3 inputs and 12 outputs.

3.132.2.1. Executing ABC.

3.132.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 32 gates and 33 wires to a netlist network with 0 inputs and 32 outputs.

3.132.3.1. Executing ABC.

3.132.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$abc$4934$abc$4510$abc$4191$auto$simplemap.cc:257:simplemap_eqne$3041, synchronously reset by \rst_cnt
Extracted 17 gates and 19 wires to a netlist network with 2 inputs and 6 outputs.

3.132.4.1. Executing ABC.

3.132.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$5017$abc$4593$abc$4252$AES_ROUND_N.enc
Extracted 130 gates and 165 wires to a netlist network with 35 inputs and 130 outputs.

3.132.5.1. Executing ABC.

yosys> opt_ffinv

3.133. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.134. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.135. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~465 debug messages>
Removed a total of 155 cells.

yosys> opt_muxtree

3.136. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.137. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.138. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.139. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.140. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $abc$5317$auto$blifparse.cc:362:parse_blif$5344 ($_DFF_P_) from module aes_fsm_enc.

yosys> opt_clean

3.141. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 1282 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.142. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_muxtree

3.143. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.144. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.145. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.146. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.147. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $abc$5400$auto$blifparse.cc:362:parse_blif$5432 ($_DFFE_PP_) from module aes_fsm_enc.

yosys> opt_clean

3.148. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.149. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_muxtree

3.150. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.151. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.152. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.153. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.154. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $abc$5400$auto$blifparse.cc:362:parse_blif$5526 ($_DFFE_PP_) from module aes_fsm_enc.

yosys> opt_clean

3.155. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.156. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_muxtree

3.157. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.158. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.159. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.160. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.161. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $abc$5400$auto$blifparse.cc:362:parse_blif$5527 ($_DFFE_PP_) from module aes_fsm_enc.

yosys> opt_clean

3.162. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.163. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 4

yosys> bmuxmap

3.164. Executing BMUXMAP pass.

yosys> demuxmap

3.165. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_v7WEby/abc_tmp_1.scr

3.166. Executing ABC pass (technology mapping using ABC).

3.166.1. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Extracted 51 gates and 60 wires to a netlist network with 9 inputs and 13 outputs.

3.166.1.1. Executing ABC.
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.00  [   0.21 sec. at Pass 0]{firstMap}[1]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.00  [   0.60 sec. at Pass 1]{initMapFlow}[3]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.00  [   1.10 sec. at Pass 2]{map}[2]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.00  [   0.77 sec. at Pass 3]{postMap}[6]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.00  [   0.99 sec. at Pass 4]{map}[12]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.00  [   0.73 sec. at Pass 5]{postMap}[36]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.00  [   1.40 sec. at Pass 6]{pushMap}[100]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.00  [   1.20 sec. at Pass 7]{finalMap}[100]

yosys> opt_expr

3.167. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.168. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.169. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.170. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.171. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.172. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.173. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $abc$5400$auto$blifparse.cc:362:parse_blif$5525 ($_DFFE_PP_) from module aes_fsm_enc.

yosys> opt_clean

3.174. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 1 unused cells and 62 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.175. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_muxtree

3.176. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.177. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.178. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.179. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.180. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.181. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.182. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 2

yosys> opt_ffinv

3.183. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.184. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                568
   Number of wire bits:           2490
   Number of public wires:          52
   Number of public wire bits:    1974
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 22
     $_DFF_PP0_                      4
     $_DLATCH_P_                     1
     $_SDFFE_PP0N_                   4
     $lut                           13


yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFFE_??_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 -cell $_DLATCH_?_ 0 -cell $_DLATCH_???_ 0

3.185. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.186. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                568
   Number of wire bits:           2490
   Number of public wires:          52
   Number of public wire bits:    1974
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 22
     $_DFF_PP0_                      4
     $_DLATCH_P_                     1
     $_SDFFE_PP0N_                   4
     $lut                           13


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/ffs_map.v

3.187. Executing TECHMAP pass (map to technology primitives).

3.187.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.187.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Generating RTLIL representation for module `\$_SDFFE_PP0P_'.
Generating RTLIL representation for module `\$_SDFFE_PP0N_'.
Generating RTLIL representation for module `\$_SDFFE_PN0P_'.
Generating RTLIL representation for module `\$_SDFFE_PN0N_'.
Generating RTLIL representation for module `\$_SDFFE_PP1P_'.
Generating RTLIL representation for module `\$_SDFFE_PP1N_'.
Generating RTLIL representation for module `\$_SDFFE_PN1P_'.
Generating RTLIL representation for module `\$_SDFFE_PN1N_'.
Generating RTLIL representation for module `\$_SDFFE_NP0P_'.
Generating RTLIL representation for module `\$_SDFFE_NP0N_'.
Generating RTLIL representation for module `\$_SDFFE_NN0P_'.
Generating RTLIL representation for module `\$_SDFFE_NN0N_'.
Generating RTLIL representation for module `\$_SDFFE_NP1P_'.
Generating RTLIL representation for module `\$_SDFFE_NP1N_'.
Generating RTLIL representation for module `\$_SDFFE_NN1P_'.
Generating RTLIL representation for module `\$_SDFFE_NN1N_'.
Generating RTLIL representation for module `\$_DLATCH_P_'.
Generating RTLIL representation for module `\$_DLATCH_N_'.
Generating RTLIL representation for module `\$_DLATCH_PP0_'.
Generating RTLIL representation for module `\$_DLATCH_NP0_'.
Generating RTLIL representation for module `\$_DLATCH_PN0_'.
Generating RTLIL representation for module `\$_DLATCH_NN0_'.
Generating RTLIL representation for module `\$_DLATCH_PP1_'.
Generating RTLIL representation for module `\$_DLATCH_NP1_'.
Generating RTLIL representation for module `\$_DLATCH_PN1_'.
Generating RTLIL representation for module `\$_DLATCH_NN1_'.
Successfully finished Verilog frontend.

3.187.3. Continuing TECHMAP pass.
Using template \$_DLATCH_P_ for cells of type $_DLATCH_P_.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using extmapper simplemap for cells of type $lut.
Using template \$_SDFFE_PP0N_ for cells of type $_SDFFE_PP0N_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~161 debug messages>

yosys> opt_expr -mux_undef

3.188. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~231 debug messages>

yosys> simplemap

3.189. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.190. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge

3.191. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~39 debug messages>
Removed a total of 13 cells.

yosys> opt_dff -nodffe -nosdff

3.192. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.193. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 67 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.194. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.195. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.196. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.197. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.198. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.199. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.200. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.201. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.202. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_v7WEby/abc_tmp_2.scr

3.203. Executing ABC pass (technology mapping using ABC).

3.203.1. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Extracted 55 gates and 66 wires to a netlist network with 9 inputs and 12 outputs.

3.203.1.1. Executing ABC.
DE:   #PIs =   9  #Luts =    13  Max Lvl =   2  Avg Lvl =   1.00  [   1.11 sec. at Pass 0]{firstMap}[1]
DE:   #PIs =   9  #Luts =    13  Max Lvl =   2  Avg Lvl =   1.00  [   0.80 sec. at Pass 1]{initMapFlow}[3]
DE:   #PIs =   9  #Luts =    13  Max Lvl =   2  Avg Lvl =   1.00  [   0.81 sec. at Pass 2]{map}[2]
DE:   #PIs =   9  #Luts =    13  Max Lvl =   2  Avg Lvl =   1.00  [   0.73 sec. at Pass 3]{postMap}[6]
DE:   #PIs =   9  #Luts =    13  Max Lvl =   2  Avg Lvl =   1.00  [   0.55 sec. at Pass 4]{map}[12]
DE:   #PIs =   9  #Luts =    13  Max Lvl =   2  Avg Lvl =   1.00  [   0.54 sec. at Pass 5]{postMap}[36]
DE:   #PIs =   9  #Luts =    13  Max Lvl =   2  Avg Lvl =   1.00  [   0.97 sec. at Pass 6]{pushMap}[100]
DE:   #PIs =   9  #Luts =    13  Max Lvl =   2  Avg Lvl =   1.00  [   0.77 sec. at Pass 7]{finalMap}[100]

yosys> opt_expr

3.204. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.205. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.206. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.207. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.208. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.209. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.210. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.211. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 49 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.212. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.213. Executing HIERARCHY pass (managing design hierarchy).

3.213.1. Analyzing design hierarchy..
Top module:  \aes_fsm_enc

3.213.2. Analyzing design hierarchy..
Top module:  \aes_fsm_enc
Removed 0 unused modules.

yosys> stat

3.214. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                568
   Number of wire bits:           2490
   Number of public wires:          52
   Number of public wire bits:    1974
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 22
     $lut                           13
     dffr                            4
     latch                           1
     sdffre                          4


yosys> opt_clean -purge

3.215. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 38 unused wires.
<suppressed ~38 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.216. Executing Verilog backend.
Dumping module `\aes_fsm_enc'.

Warnings: 5 unique messages, 5 total
End of script. Logfile hash: d9bc856384, CPU: user 3.10s system 0.11s, MEM: 42.08 MB peak
Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)
Time spent: 96% 6x abc (84 sec), 1% 20x opt_dff (1 sec), ...
real 26.71
user 42.66
sys 44.52
