
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.140
 Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k sbox3.v sbox2.v sbox8.v des_top.v sbox1.v sbox5.v sbox4.v key_sel.v sbox6.v sbox7.v crp.v

yosys> verific -vlog2k sbox3.v sbox2.v sbox8.v des_top.v sbox1.v sbox5.v sbox4.v key_sel.v sbox6.v sbox7.v crp.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox2.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox8.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'des_top.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox1.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox5.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox4.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'key_sel.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox6.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox7.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'crp.v'

yosys> synth_rs -top des_top -tech genesis2 -goal area -de -verilog synthesized.v

3. Executing synth_rs pass: v0.4.116

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis2/cells_sim.v +/rapidsilicon/genesis2/dsp_sim.v +/rapidsilicon/genesis2/brams_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dff'.
Generating RTLIL representation for module `\dffn'.
Generating RTLIL representation for module `\sdff'.
Generating RTLIL representation for module `\sdffn'.
Generating RTLIL representation for module `\dffr'.
Generating RTLIL representation for module `\dffnr'.
Generating RTLIL representation for module `\dffe'.
Generating RTLIL representation for module `\dffne'.
Generating RTLIL representation for module `\sdffre'.
Generating RTLIL representation for module `\sdffnre'.
Generating RTLIL representation for module `\dffre'.
Generating RTLIL representation for module `\dffnre'.
Generating RTLIL representation for module `\latch'.
Generating RTLIL representation for module `\latchn'.
Generating RTLIL representation for module `\latchr'.
Generating RTLIL representation for module `\latchnr'.
Generating RTLIL representation for module `\fa_1bit'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP'.
Generating RTLIL representation for module `\RS_DSP_MULT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Successfully finished Verilog frontend.

3.4. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v' to AST representation.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\RS_TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top des_top

3.5. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] des_top.v:35: compiling module 'des_top'
VERIFIC-INFO [VERI-1018] crp.v:35: compiling module 'crp'
VERIFIC-INFO [VERI-1018] sbox1.v:35: compiling module 'sbox1'
VERIFIC-INFO [VERI-1018] sbox2.v:35: compiling module 'sbox2'
VERIFIC-INFO [VERI-1018] sbox3.v:35: compiling module 'sbox3'
VERIFIC-INFO [VERI-1018] sbox4.v:35: compiling module 'sbox4'
VERIFIC-INFO [VERI-1018] sbox5.v:35: compiling module 'sbox5'
VERIFIC-INFO [VERI-1018] sbox6.v:35: compiling module 'sbox6'
VERIFIC-INFO [VERI-1018] sbox7.v:35: compiling module 'sbox7'
VERIFIC-INFO [VERI-1018] sbox8.v:35: compiling module 'sbox8'
VERIFIC-WARNING [VERI-2371] des_top.v:58: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des_top.v:61: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] key_sel.v:43: compiling module 'key_selh'
Importing module des_top.
Importing module crp.
Importing module key_selh.
Importing module sbox1.
Importing module sbox2.
Importing module sbox3.
Importing module sbox4.
Importing module sbox5.
Importing module sbox6.
Importing module sbox7.
Importing module sbox8.

3.5.1. Analyzing design hierarchy..
Top module:  \des_top
Used module:     \key_selh
Used module:     \crp
Used module:         \sbox8
Used module:         \sbox7
Used module:         \sbox6
Used module:         \sbox5
Used module:         \sbox4
Used module:         \sbox3
Used module:         \sbox2
Used module:         \sbox1

3.5.2. Analyzing design hierarchy..
Top module:  \des_top
Used module:     \key_selh
Used module:     \crp
Used module:         \sbox8
Used module:         \sbox7
Used module:         \sbox6
Used module:         \sbox5
Used module:         \sbox4
Used module:         \sbox3
Used module:         \sbox2
Used module:         \sbox1
Removed 0 unused modules.

yosys> proc

3.6. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.6.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.6.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.6.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.6.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.6.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.6.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.6.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.6.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.6.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.6.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.6.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.6.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module sbox8.
Optimizing module sbox7.
Optimizing module sbox6.
Optimizing module sbox5.
Optimizing module sbox4.
Optimizing module sbox3.
Optimizing module sbox2.
Optimizing module sbox1.
Optimizing module key_selh.
Optimizing module crp.
Optimizing module des_top.
<suppressed ~1 debug messages>

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module crp.
Deleting now unused module key_selh.
Deleting now unused module sbox1.
Deleting now unused module sbox2.
Deleting now unused module sbox3.
Deleting now unused module sbox4.
Deleting now unused module sbox5.
Deleting now unused module sbox6.
Deleting now unused module sbox7.
Deleting now unused module sbox8.
<suppressed ~10 debug messages>

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 123 unused wires.
<suppressed ~23 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module des_top...
Found and reported 0 problems.

yosys> opt_expr

3.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.16. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~11 debug messages>

yosys> opt_reduce

3.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.20. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.21. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$R_reg$des_top.v:61$25 ($aldff) from module des_top.
Removing never-active async load on $verific$L_reg$des_top.v:58$23 ($aldff) from module des_top.

yosys> opt_clean

3.22. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.24. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.24.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.24.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.24.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> fsm_opt

3.24.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.24.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.24.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.24.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~11 debug messages>

yosys> opt_reduce

3.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.30. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.34. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

3.35. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.36. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> demuxmap

3.37. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> stat

3.38. Printing statistics.

=== des_top ===

   Number of wires:                 53
   Number of wire bits:           1379
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 27
     $bmux                           9
     $dff                            2
     $logic_not                      1
     $mux                           11
     $not                            1
     $xor                            3


yosys> wreduce t:$mul

3.39. Executing WREDUCE pass (reducing word size of cells).

yosys> rs_dsp_macc -genesis2 -max_dsp 154

3.40. Executing RS_DSP_MACC pass.

yosys> techmap -map +/mul2dsp_check_maxwidth.v -D DSP_A_MAXWIDTH=20 -D DSP_B_MAXWIDTH=18 -D DSP_A_MINWIDTH=11 -D DSP_B_MINWIDTH=10 -D DSP_NAME=$__RS_MUL20X18 a:valid_map

3.41. Executing TECHMAP pass (map to technology primitives).

3.41.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

3.41.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> stat

3.42. Printing statistics.

=== des_top ===

   Number of wires:                 53
   Number of wire bits:           1379
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 27
     $bmux                           9
     $dff                            2
     $logic_not                      1
     $mux                           11
     $not                            1
     $xor                            3


yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/rapidsilicon/genesis2/dsp_map.v -D USE_DSP_CFG_PARAMS=0

3.43. Executing TECHMAP pass (map to technology primitives).

3.43.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_MUL20X18'.
Successfully finished Verilog frontend.

3.43.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/dsp_final_map.v

3.44. Executing TECHMAP pass (map to technology primitives).

3.44.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v' to AST representation.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Successfully finished Verilog frontend.

3.44.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> rs-pack-dsp-regs

3.45. Executing rs_pack_dsp_regs pass.

yosys> rs_dsp_io_regs

3.46. Executing RS_DSP_IO_REGS pass.

yosys> alumacc

3.47. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module des_top:
  created 0 $alu and 0 $macc cells.

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.49. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.50. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~11 debug messages>

yosys> opt_reduce

3.51. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.52. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.53. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.54. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.56. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> stat

3.57. Printing statistics.

=== des_top ===

   Number of wires:                 53
   Number of wire bits:           1379
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 27
     $bmux                           9
     $dff                            2
     $logic_not                      1
     $mux                           11
     $not                            1
     $xor                            3


yosys> memory -nomap

3.58. Executing MEMORY pass.

yosys> opt_mem

3.58.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.58.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.58.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.58.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.58.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `$auto$memory_bmux2rom.cc:63:execute$214'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$211'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$208'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$205'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$202'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$199'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$196'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$193'[0] in module `\des_top': no output FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$214'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$211'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$208'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$205'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$202'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$199'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$196'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$193'[0] in module `\des_top': no address FF found.

yosys> opt_clean

3.58.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> memory_share

3.58.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.58.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.58.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> memory_collect

3.58.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.59. Printing statistics.

=== des_top ===

   Number of wires:                 53
   Number of wire bits:           1379
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 27
     $bmux                           1
     $dff                            2
     $logic_not                      1
     $mem_v2                         8
     $mux                           11
     $not                            1
     $xor                            3


yosys> muxpack

3.60. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~11 debug messages>

yosys> opt_clean

3.61. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new_swap.txt -limit 150 a:read_swapped

3.62. Executing MEMORY_LIBMAP pass (mapping memories to cells).

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new.txt -limit 150

3.63. Executing MEMORY_LIBMAP pass (mapping memories to cells).
using FF mapping for memory des_top.$auto$memory_bmux2rom.cc:63:execute$193
using FF mapping for memory des_top.$auto$memory_bmux2rom.cc:63:execute$196
using FF mapping for memory des_top.$auto$memory_bmux2rom.cc:63:execute$199
using FF mapping for memory des_top.$auto$memory_bmux2rom.cc:63:execute$202
using FF mapping for memory des_top.$auto$memory_bmux2rom.cc:63:execute$205
using FF mapping for memory des_top.$auto$memory_bmux2rom.cc:63:execute$208
using FF mapping for memory des_top.$auto$memory_bmux2rom.cc:63:execute$211
using FF mapping for memory des_top.$auto$memory_bmux2rom.cc:63:execute$214
<suppressed ~48 debug messages>

yosys> rs_bram_split -new_mapping

3.64. Executing Rs_BRAM_Split pass.

yosys> techmap -autoproc -map +/rapidsilicon/genesis2/brams_map_new.v

3.65. Executing TECHMAP pass (map to technology primitives).

3.65.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v' to AST representation.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_SDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_SDP'.
Successfully finished Verilog frontend.

3.65.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~6 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/brams_final_map_new.v

3.66. Executing TECHMAP pass (map to technology primitives).

3.66.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v' to AST representation.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Successfully finished Verilog frontend.

3.66.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> pmuxtree

3.67. Executing PMUXTREE pass.

yosys> muxpack

3.68. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~11 debug messages>

yosys> memory_map

3.69. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory $auto$memory_bmux2rom.cc:63:execute$193 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$196 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$199 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$202 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$205 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$208 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$211 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$214 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.

yosys> stat

3.70. Printing statistics.

=== des_top ===

   Number of wires:               2085
   Number of wire bits:           9507
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1035
     $bmux                           1
     $dff                          514
     $logic_not                      1
     $mux                          515
     $not                            1
     $xor                            3


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/arith_map.v

3.71. Executing TECHMAP pass (map to technology primitives).

3.71.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.71.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.71.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $bmux.
No more expansions possible.
<suppressed ~1106 debug messages>

yosys> stat

3.72. Printing statistics.

=== des_top ===

   Number of wires:               2090
   Number of wire bits:           9846
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               5003
     $_DFF_P_                     2112
     $_MUX_                       2803
     $_NOT_                          4
     $_OR_                           3
     $_XOR_                         81


yosys> opt_expr

3.73. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~64 debug messages>

yosys> opt_merge -nomux

3.74. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.75. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.76. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.77. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.78. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.79. Executing OPT_DFF pass (perform DFF optimizations).
Handling const CLK on $auto$ff.cc:262:slice$3070 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3062 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2872 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4128 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3350 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4152 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4144 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4140 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4136 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4132 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4212 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4112 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4116 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4120 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4124 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3354 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3358 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3366 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4148 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3066 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2990 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3362 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3342 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3074 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3078 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3082 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3086 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3090 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3094 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3098 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3102 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3106 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3110 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3114 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3118 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3122 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3126 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3130 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3134 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3138 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3142 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2918 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2914 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3026 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2986 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3378 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3374 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3370 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4160 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3294 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3154 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3290 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3182 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3286 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3282 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3278 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3166 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3274 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3270 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3266 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3146 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3222 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3226 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3230 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4324 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4328 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4332 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4336 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4340 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4344 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4348 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4352 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4356 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4360 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4364 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4368 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4372 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4376 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4380 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4384 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4388 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4392 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4396 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4400 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4404 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4408 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4412 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4416 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4420 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4424 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4428 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4432 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4436 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4440 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4444 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4448 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4452 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4456 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4460 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4464 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4468 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4472 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4476 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4480 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4484 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4488 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4492 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4496 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4500 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4504 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4508 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4512 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4516 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4520 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4524 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4528 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4532 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4536 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4540 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4544 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4548 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4552 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4556 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4560 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4564 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4568 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4572 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4576 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4832 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4836 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4840 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4844 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4848 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4852 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4856 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4860 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4864 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4868 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4872 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4876 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4880 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4884 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4888 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4892 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4896 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4900 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4904 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4908 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4912 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4916 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4920 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4924 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4928 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4932 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4936 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4940 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4944 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4948 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4952 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4956 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4960 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4964 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4968 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4972 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4976 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4980 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4984 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4988 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4992 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4996 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5000 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5004 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5008 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5012 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5016 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5020 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5024 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5028 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5032 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5036 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5040 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5044 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5048 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5052 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5056 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5060 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5064 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5068 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5072 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5076 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5080 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5084 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5340 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5344 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5348 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5352 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5356 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5360 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5364 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5368 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5372 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5376 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5380 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5384 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5388 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5392 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5396 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5400 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5404 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5408 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5412 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5416 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5420 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5424 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5428 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5432 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5436 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5440 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5444 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5448 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5452 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5456 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5460 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5464 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5468 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5472 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5476 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5480 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5484 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5488 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5492 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5496 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5500 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5504 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5508 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5512 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5516 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5520 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5524 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5528 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5532 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5536 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5540 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5544 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5548 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5552 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5556 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5560 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5564 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5568 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5572 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5576 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5580 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5584 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5588 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5592 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5848 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5852 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5856 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5860 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5864 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5868 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5872 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5876 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5880 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5884 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5888 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5892 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5896 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5900 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5904 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5908 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5912 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5916 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5920 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5924 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5928 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5932 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5936 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5940 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5944 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5948 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5952 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5956 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5960 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5964 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5968 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5972 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5976 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5980 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5984 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5988 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5992 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5996 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6000 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6004 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6008 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6012 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6016 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6020 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6024 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6028 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6032 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6036 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6040 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6044 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6048 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6052 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6056 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6060 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6064 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6068 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6072 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6076 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6080 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6084 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6088 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6092 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6096 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6100 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6356 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6360 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6364 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6368 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6372 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6376 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6380 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6384 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6388 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6392 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6396 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6400 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6404 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6408 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6412 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6416 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6420 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6424 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6428 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6432 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6436 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6440 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6444 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6448 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6452 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6456 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6460 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6464 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6468 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6472 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6476 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6480 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6484 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6488 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6492 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6496 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6500 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6504 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6508 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6512 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6516 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6520 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6524 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6528 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6532 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6536 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6540 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6544 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6548 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6552 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6556 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6560 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6564 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6568 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6572 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6576 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6580 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6584 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6588 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6592 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6596 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6600 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6604 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6608 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6864 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6868 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6872 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6876 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6880 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6884 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6888 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6892 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6896 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6900 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6904 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6908 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6912 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6916 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6920 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6924 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6928 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6932 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6936 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6940 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6944 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6948 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6952 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6956 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6960 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6964 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6968 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6972 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6976 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6980 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6984 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6988 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6992 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6996 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7000 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7004 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7008 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7012 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7016 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7020 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7024 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7028 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7032 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7036 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7040 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7044 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7048 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7052 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7056 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7060 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7064 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7068 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7072 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7076 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7080 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7084 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7088 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7092 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7096 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7100 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7104 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7108 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7112 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7116 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7372 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7376 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7380 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7384 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7388 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7392 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7396 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7400 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7404 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7408 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7412 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7416 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7420 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7424 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7428 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7432 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7436 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7440 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7444 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7448 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7452 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7456 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7460 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7464 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7468 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7472 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7476 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7480 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7484 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7488 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7492 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7496 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7500 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7504 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7508 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7512 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7516 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7520 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7524 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7528 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7532 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7536 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7540 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7544 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7548 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7552 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7556 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7560 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7564 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7568 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7572 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7576 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7580 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7584 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7588 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7592 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7596 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7600 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7604 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7608 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7612 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7616 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7620 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7624 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2869 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2870 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2871 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2911 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2912 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2913 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2915 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2916 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2917 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2983 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2984 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2985 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2987 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2988 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$2989 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3023 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3024 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3025 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3059 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3060 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3061 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3063 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3064 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3065 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3067 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3068 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3069 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3071 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3072 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3073 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3075 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3076 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3077 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3079 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3080 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3081 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3083 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3084 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3085 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3087 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3088 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3089 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3091 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3092 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3093 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3095 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3096 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3097 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3099 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3100 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3101 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3103 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3104 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3105 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3107 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3108 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3109 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3111 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3112 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3113 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3115 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3116 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3117 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3119 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3120 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3121 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3123 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3124 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3125 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3127 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3128 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3129 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3131 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3132 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3133 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3135 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3136 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3137 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3139 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3140 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3141 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3143 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3144 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3145 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3151 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3152 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3153 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3163 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3164 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3165 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3179 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3180 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3181 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3219 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3220 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3221 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3223 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3224 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3225 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3227 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3228 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3229 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3263 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3264 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3265 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3267 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3268 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3269 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3271 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3272 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3273 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3275 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3276 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3277 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3279 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3280 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3281 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3283 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3284 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3285 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3287 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3288 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3289 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3291 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3292 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3293 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3339 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3340 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3341 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3347 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3348 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3349 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3351 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3352 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3353 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3355 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3356 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3357 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3359 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3360 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3361 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3363 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3364 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3365 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3367 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3368 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3369 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3371 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3372 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3373 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3375 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3376 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$3377 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4109 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4110 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4111 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4113 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4114 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4115 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4117 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4118 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4119 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4121 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4122 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4123 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4125 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4126 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4127 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4129 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4130 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4131 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4133 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4134 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4135 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4137 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4138 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4139 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4141 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4142 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4143 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4145 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4146 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4147 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4149 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4150 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4151 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4157 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4158 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4159 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4209 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4210 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4211 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4321 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4322 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4323 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4325 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4326 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4327 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4329 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4330 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4331 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4333 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4334 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4335 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4337 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4338 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4339 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4341 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4342 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4343 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4345 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4346 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4347 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4349 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4350 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4351 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4353 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4354 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4355 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4357 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4358 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4359 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4361 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4362 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4363 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4365 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4366 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4367 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4369 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4370 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4371 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4373 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4374 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4375 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4377 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4378 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4379 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4381 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4382 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4383 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4385 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4386 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4387 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4389 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4390 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4391 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4393 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4394 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4395 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4397 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4398 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4399 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4401 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4402 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4403 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4405 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4406 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4407 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4409 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4410 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4411 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4413 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4414 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4415 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4417 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4418 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4419 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4421 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4422 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4423 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4425 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4426 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4427 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4429 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4430 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4431 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4433 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4434 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4435 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4437 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4438 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4439 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4441 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4442 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4443 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4445 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4446 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4447 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4449 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4450 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4451 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4453 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4454 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4455 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4457 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4458 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4459 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4461 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4462 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4463 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4465 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4466 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4467 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4469 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4470 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4471 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4473 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4474 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4475 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4477 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4478 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4479 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4481 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4482 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4483 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4485 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4486 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4487 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4489 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4490 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4491 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4493 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4494 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4495 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4497 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4498 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4499 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4501 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4502 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4503 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4505 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4506 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4507 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4509 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4510 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4511 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4513 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4514 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4515 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4517 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4518 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4519 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4521 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4522 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4523 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4525 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4526 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4527 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4529 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4530 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4531 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4533 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4534 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4535 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4537 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4538 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4539 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4541 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4542 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4543 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4545 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4546 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4547 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4549 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4550 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4551 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4553 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4554 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4555 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4557 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4558 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4559 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4561 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4562 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4563 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4565 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4566 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4567 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4569 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4570 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4571 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4573 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4574 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4575 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4829 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4830 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4831 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4833 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4834 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4835 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4837 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4838 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4839 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4841 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4842 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4843 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4845 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4846 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4847 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4849 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4850 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4851 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4853 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4854 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4855 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4857 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4858 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4859 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4861 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4862 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4863 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4865 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4866 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4867 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4869 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4870 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4871 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4873 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4874 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4875 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4877 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4878 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4879 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4881 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4882 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4883 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4885 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4886 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4887 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4889 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4890 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4891 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4893 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4894 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4895 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4897 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4898 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4899 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4901 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4902 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4903 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4905 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4906 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4907 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4909 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4910 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4911 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4913 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4914 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4915 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4917 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4918 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4919 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4921 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4922 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4923 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4925 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4926 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4927 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4929 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4930 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4931 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4933 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4934 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4935 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4937 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4938 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4939 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4941 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4942 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4943 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4945 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4946 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4947 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4949 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4950 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4951 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4953 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4954 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4955 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4957 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4958 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4959 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4961 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4962 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4963 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4965 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4966 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4967 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4969 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4970 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4971 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4973 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4974 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4975 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4977 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4978 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4979 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4981 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4982 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4983 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4985 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4986 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4987 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4989 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4990 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4991 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4993 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4994 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4995 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4997 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4998 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$4999 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5001 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5002 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5003 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5005 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5006 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5007 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5009 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5010 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5011 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5013 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5014 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5015 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5017 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5018 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5019 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5021 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5022 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5023 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5025 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5026 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5027 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5029 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5030 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5031 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5033 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5034 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5035 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5037 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5038 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5039 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5041 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5042 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5043 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5045 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5046 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5047 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5049 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5050 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5051 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5053 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5054 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5055 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5057 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5058 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5059 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5061 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5062 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5063 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5065 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5066 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5067 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5069 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5070 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5071 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5073 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5074 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5075 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5077 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5078 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5079 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5081 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5082 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5083 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5337 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5338 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5339 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5341 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5342 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5343 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5345 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5346 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5347 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5349 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5350 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5351 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5353 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5354 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5355 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5357 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5358 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5359 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5361 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5362 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5363 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5365 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5366 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5367 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5369 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5370 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5371 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5373 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5374 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5375 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5377 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5378 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5379 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5381 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5382 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5383 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5385 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5386 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5387 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5389 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5390 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5391 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5393 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5394 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5395 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5397 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5398 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5399 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5401 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5402 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5403 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5405 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5406 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5407 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5409 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5410 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5411 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5413 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5414 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5415 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5417 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5418 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5419 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5421 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5422 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5423 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5425 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5426 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5427 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5429 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5430 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5431 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5433 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5434 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5435 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5437 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5438 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5439 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5441 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5442 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5443 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5445 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5446 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5447 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5449 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5450 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5451 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5453 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5454 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5455 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5457 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5458 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5459 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5461 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5462 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5463 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5465 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5466 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5467 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5469 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5470 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5471 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5473 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5474 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5475 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5477 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5478 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5479 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5481 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5482 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5483 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5485 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5486 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5487 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5489 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5490 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5491 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5493 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5494 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5495 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5497 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5498 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5499 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5501 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5502 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5503 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5505 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5506 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5507 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5509 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5510 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5511 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5513 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5514 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5515 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5517 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5518 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5519 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5521 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5522 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5523 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5525 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5526 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5527 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5529 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5530 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5531 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5533 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5534 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5535 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5537 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5538 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5539 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5541 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5542 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5543 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5545 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5546 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5547 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5549 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5550 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5551 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5553 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5554 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5555 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5557 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5558 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5559 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5561 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5562 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5563 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5565 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5566 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5567 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5569 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5570 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5571 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5573 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5574 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5575 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5577 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5578 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5579 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5581 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5582 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5583 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5585 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5586 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5587 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5589 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5590 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5591 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5845 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5846 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5847 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5849 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5850 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5851 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5853 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5854 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5855 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5857 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5858 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5859 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5861 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5862 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5863 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5865 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5866 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5867 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5869 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5870 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5871 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5873 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5874 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5875 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5877 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5878 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5879 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5881 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5882 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5883 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5885 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5886 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5887 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5889 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5890 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5891 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5893 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5894 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5895 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5897 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5898 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5899 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5901 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5902 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5903 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5905 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5906 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5907 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5909 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5910 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5911 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5913 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5914 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5915 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5917 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5918 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5919 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5921 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5922 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5923 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5925 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5926 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5927 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5929 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5930 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5931 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5933 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5934 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5935 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5937 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5938 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5939 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5941 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5942 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5943 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5945 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5946 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5947 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5949 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5950 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5951 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5953 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5954 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5955 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5957 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5958 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5959 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5961 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5962 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5963 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5965 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5966 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5967 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5969 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5970 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5971 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5973 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5974 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5975 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5977 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5978 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5979 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5981 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5982 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5983 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5985 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5986 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5987 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5989 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5990 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5991 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5993 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5994 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5995 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5997 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5998 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$5999 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6001 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6002 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6003 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6005 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6006 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6007 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6009 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6010 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6011 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6013 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6014 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6015 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6017 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6018 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6019 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6021 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6022 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6023 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6025 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6026 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6027 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6029 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6030 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6031 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6033 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6034 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6035 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6037 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6038 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6039 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6041 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6042 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6043 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6045 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6046 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6047 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6049 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6050 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6051 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6053 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6054 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6055 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6057 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6058 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6059 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6061 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6062 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6063 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6065 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6066 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6067 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6069 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6070 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6071 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6073 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6074 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6075 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6077 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6078 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6079 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6081 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6082 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6083 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6085 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6086 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6087 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6089 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6090 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6091 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6093 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6094 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6095 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6097 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6098 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6099 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6353 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6354 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6355 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6357 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6358 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6359 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6361 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6362 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6363 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6365 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6366 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6367 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6369 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6370 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6371 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6373 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6374 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6375 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6377 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6378 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6379 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6381 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6382 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6383 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6385 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6386 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6387 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6389 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6390 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6391 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6393 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6394 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6395 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6397 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6398 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6399 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6401 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6402 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6403 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6405 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6406 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6407 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6409 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6410 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6411 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6413 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6414 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6415 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6417 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6418 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6419 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6421 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6422 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6423 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6425 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6426 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6427 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6429 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6430 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6431 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6433 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6434 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6435 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6437 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6438 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6439 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6441 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6442 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6443 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6445 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6446 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6447 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6449 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6450 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6451 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6453 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6454 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6455 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6457 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6458 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6459 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6461 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6462 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6463 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6465 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6466 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6467 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6469 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6470 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6471 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6473 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6474 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6475 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6477 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6478 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6479 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6481 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6482 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6483 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6485 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6486 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6487 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6489 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6490 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6491 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6493 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6494 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6495 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6497 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6498 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6499 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6501 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6502 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6503 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6505 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6506 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6507 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6509 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6510 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6511 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6513 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6514 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6515 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6517 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6518 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6519 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6521 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6522 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6523 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6525 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6526 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6527 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6529 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6530 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6531 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6533 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6534 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6535 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6537 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6538 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6539 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6541 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6542 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6543 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6545 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6546 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6547 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6549 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6550 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6551 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6553 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6554 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6555 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6557 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6558 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6559 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6561 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6562 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6563 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6565 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6566 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6567 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6569 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6570 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6571 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6573 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6574 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6575 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6577 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6578 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6579 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6581 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6582 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6583 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6585 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6586 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6587 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6589 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6590 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6591 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6593 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6594 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6595 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6597 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6598 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6599 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6601 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6602 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6603 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6605 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6606 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6607 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6861 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6862 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6863 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6865 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6866 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6867 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6869 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6870 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6871 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6873 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6874 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6875 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6877 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6878 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6879 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6881 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6882 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6883 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6885 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6886 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6887 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6889 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6890 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6891 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6893 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6894 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6895 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6897 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6898 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6899 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6901 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6902 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6903 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6905 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6906 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6907 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6909 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6910 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6911 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6913 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6914 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6915 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6917 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6918 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6919 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6921 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6922 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6923 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6925 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6926 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6927 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6929 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6930 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6931 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6933 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6934 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6935 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6937 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6938 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6939 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6941 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6942 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6943 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6945 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6946 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6947 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6949 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6950 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6951 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6953 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6954 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6955 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6957 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6958 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6959 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6961 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6962 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6963 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6965 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6966 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6967 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6969 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6970 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6971 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6973 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6974 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6975 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6977 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6978 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6979 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6981 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6982 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6983 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6985 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6986 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6987 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6989 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6990 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6991 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6993 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6994 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6995 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6997 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6998 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$6999 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7001 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7002 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7003 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7005 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7006 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7007 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7009 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7010 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7011 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7013 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7014 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7015 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7017 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7018 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7019 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7021 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7022 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7023 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7025 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7026 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7027 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7029 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7030 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7031 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7033 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7034 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7035 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7037 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7038 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7039 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7041 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7042 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7043 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7045 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7046 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7047 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7049 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7050 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7051 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7053 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7054 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7055 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7057 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7058 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7059 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7061 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7062 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7063 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7065 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7066 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7067 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7069 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7070 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7071 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7073 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7074 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7075 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7077 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7078 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7079 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7081 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7082 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7083 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7085 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7086 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7087 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7089 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7090 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7091 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7093 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7094 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7095 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7097 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7098 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7099 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7101 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7102 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7103 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7105 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7106 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7107 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7109 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7110 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7111 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7113 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7114 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7115 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7369 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7370 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7371 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7373 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7374 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7375 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7377 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7378 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7379 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7381 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7382 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7383 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7385 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7386 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7387 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7389 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7390 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7391 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7393 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7394 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7395 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7397 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7398 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7399 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7401 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7402 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7403 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7405 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7406 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7407 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7409 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7410 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7411 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7413 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7414 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7415 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7417 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7418 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7419 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7421 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7422 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7423 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7425 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7426 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7427 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7429 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7430 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7431 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7433 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7434 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7435 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7437 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7438 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7439 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7441 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7442 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7443 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7445 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7446 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7447 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7449 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7450 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7451 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7453 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7454 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7455 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7457 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7458 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7459 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7461 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7462 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7463 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7465 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7466 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7467 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7469 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7470 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7471 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7473 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7474 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7475 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7477 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7478 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7479 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7481 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7482 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7483 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7485 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7486 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7487 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7489 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7490 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7491 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7493 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7494 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7495 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7497 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7498 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7499 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7501 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7502 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7503 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7505 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7506 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7507 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7509 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7510 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7511 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7513 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7514 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7515 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7517 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7518 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7519 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7521 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7522 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7523 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7525 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7526 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7527 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7529 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7530 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7531 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7533 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7534 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7535 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7537 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7538 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7539 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7541 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7542 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7543 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7545 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7546 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7547 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7549 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7550 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7551 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7553 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7554 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7555 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7557 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7558 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7559 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7561 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7562 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7563 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7565 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7566 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7567 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7569 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7570 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7571 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7573 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7574 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7575 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7577 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7578 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7579 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7581 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7582 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7583 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7585 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7586 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7587 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7589 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7590 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7591 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7593 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7594 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7595 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7597 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7598 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7599 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7601 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7602 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7603 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7605 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7606 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7607 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7609 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7610 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7611 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7613 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7614 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7615 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7617 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7618 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7619 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7621 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7622 ($_DFF_P_) from module des_top (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$7623 ($_DFF_P_) from module des_top (removing D path).

yosys> opt_clean

3.80. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 1 unused cells and 1538 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.81. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~769 debug messages>

yosys> opt_muxtree

3.82. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.83. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.84. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~2136 debug messages>
Removed a total of 712 cells.

yosys> opt_share

3.85. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.86. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.87. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 326 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.88. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~16 debug messages>

yosys> opt_muxtree

3.89. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.90. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.91. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.92. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.93. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.94. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 8 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.95. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 3

yosys> opt_expr -full

3.96. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~33 debug messages>

yosys> techmap -map +/techmap.v

3.97. Executing TECHMAP pass (map to technology primitives).

3.97.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.97.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> stat

3.98. Printing statistics.

=== des_top ===

   Number of wires:                218
   Number of wire bits:           2317
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1457
     $_AND_                         16
     $_DFF_P_                       64
     $_MUX_                       1257
     $_NOT_                         19
     $_OR_                          20
     $_XOR_                         81


yosys> dfflegalize -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 t:$_SDFFCE_*

3.99. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.100. Printing statistics.

=== des_top ===

   Number of wires:                218
   Number of wire bits:           2317
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1457
     $_AND_                         16
     $_DFF_P_                       64
     $_MUX_                       1257
     $_NOT_                         19
     $_OR_                          20
     $_XOR_                         81


yosys> opt_expr

3.101. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.102. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.103. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.104. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.105. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -sat

3.106. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.107. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.108. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> abc -dff -keepff

3.109. Executing ABC pass (technology mapping using ABC).

3.109.1. Summary of detected clock domains:
  1457 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.109.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1457 gates and 1584 wires to a netlist network with 125 inputs and 128 outputs.

3.109.2.1. Executing ABC.

yosys> abc -dff -keepff

3.110. Executing ABC pass (technology mapping using ABC).

3.110.1. Summary of detected clock domains:
  1962 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.110.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1962 gates and 2087 wires to a netlist network with 125 inputs and 128 outputs.

3.110.2.1. Executing ABC.

yosys> abc -dff -keepff

3.111. Executing ABC pass (technology mapping using ABC).

3.111.1. Summary of detected clock domains:
  1948 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.111.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1948 gates and 2073 wires to a netlist network with 125 inputs and 128 outputs.

3.111.2.1. Executing ABC.

yosys> abc -dff -keepff

3.112. Executing ABC pass (technology mapping using ABC).

3.112.1. Summary of detected clock domains:
  1969 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.112.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1969 gates and 2094 wires to a netlist network with 125 inputs and 128 outputs.

3.112.2.1. Executing ABC.

yosys> opt_ffinv

3.113. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~3 debug messages>

yosys> opt_merge -nomux

3.115. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~192 debug messages>
Removed a total of 64 cells.

yosys> opt_muxtree

3.116. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.117. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.118. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.119. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.120. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.121. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 6566 unused wires.
<suppressed ~21 debug messages>

yosys> opt_expr

3.122. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.123. Executing BMUXMAP pass.

yosys> demuxmap

3.124. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_dfDxaq/abc_tmp_1.scr

3.125. Executing ABC pass (technology mapping using ABC).

3.125.1. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Extracted 1837 gates and 2026 wires to a netlist network with 189 inputs and 64 outputs.

3.125.1.1. Executing ABC.
DE:   #PIs = 189  #Luts =   626  Max Lvl =   5  Avg Lvl =   3.00  [   0.16 sec. at Pass 0]{firstMap}[1]
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   6.04 sec. at Pass 1]{initMapFlow}[2]
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   0.77 sec. at Pass 2]{map}[2]
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   1.52 sec. at Pass 3]{postMap}[6]
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   1.33 sec. at Pass 4]{map}[8]
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   1.95 sec. at Pass 5]{postMap}[16]
DE:   #PIs = 189  #Luts =   384  Max Lvl =   7  Avg Lvl =   4.25  [  10.39 sec. at Pass 6]{pushMap}[16]
DE:   #PIs = 189  #Luts =   384  Max Lvl =   7  Avg Lvl =   4.25  [   1.79 sec. at Pass 7]{map}[16]
DE:   #PIs = 189  #Luts =   384  Max Lvl =   7  Avg Lvl =   4.25  [   3.21 sec. at Pass 8]{postMap}[16]
DE:   #PIs = 189  #Luts =   384  Max Lvl =   7  Avg Lvl =   4.25  [   2.23 sec. at Pass 9]{map}[16]
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   4.00  [  13.76 sec. at Pass 10]{pushMap}[16]
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   4.00  [   2.31 sec. at Pass 11]{postMap}[16]
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   4.00  [   1.70 sec. at Pass 12]{map}[16]
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   4.00  [   2.06 sec. at Pass 13]{postMap}[16]
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   4.00  [  11.20 sec. at Pass 14]{pushMap}[16]
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   4.00  [   0.98 sec. at Pass 15]{finalMap}[16]

yosys> opt_expr

3.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.127. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.128. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.129. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.130. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.131. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.132. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.133. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 2026 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.134. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.135. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.136. Printing statistics.

=== des_top ===

   Number of wires:                541
   Number of wire bits:           1369
   Number of public wires:          31
   Number of public wire bits:     859
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                446
     $_DFF_P_                       64
     $lut                          382


yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFFE_??_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 -cell $_DLATCH_?_ 0 -cell $_DLATCH_???_ 0

3.137. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.138. Printing statistics.

=== des_top ===

   Number of wires:                541
   Number of wire bits:           1369
   Number of public wires:          31
   Number of public wire bits:     859
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                446
     $_DFF_P_                       64
     $lut                          382


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/ffs_map.v

3.139. Executing TECHMAP pass (map to technology primitives).

3.139.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.139.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Generating RTLIL representation for module `\$_SDFFE_PP0P_'.
Generating RTLIL representation for module `\$_SDFFE_PP0N_'.
Generating RTLIL representation for module `\$_SDFFE_PN0P_'.
Generating RTLIL representation for module `\$_SDFFE_PN0N_'.
Generating RTLIL representation for module `\$_SDFFE_PP1P_'.
Generating RTLIL representation for module `\$_SDFFE_PP1N_'.
Generating RTLIL representation for module `\$_SDFFE_PN1P_'.
Generating RTLIL representation for module `\$_SDFFE_PN1N_'.
Generating RTLIL representation for module `\$_SDFFE_NP0P_'.
Generating RTLIL representation for module `\$_SDFFE_NP0N_'.
Generating RTLIL representation for module `\$_SDFFE_NN0P_'.
Generating RTLIL representation for module `\$_SDFFE_NN0N_'.
Generating RTLIL representation for module `\$_SDFFE_NP1P_'.
Generating RTLIL representation for module `\$_SDFFE_NP1N_'.
Generating RTLIL representation for module `\$_SDFFE_NN1P_'.
Generating RTLIL representation for module `\$_SDFFE_NN1N_'.
Generating RTLIL representation for module `\$_DLATCH_P_'.
Generating RTLIL representation for module `\$_DLATCH_N_'.
Generating RTLIL representation for module `\$_DLATCH_PP0_'.
Generating RTLIL representation for module `\$_DLATCH_NP0_'.
Generating RTLIL representation for module `\$_DLATCH_PN0_'.
Generating RTLIL representation for module `\$_DLATCH_NN0_'.
Generating RTLIL representation for module `\$_DLATCH_PP1_'.
Generating RTLIL representation for module `\$_DLATCH_NP1_'.
Generating RTLIL representation for module `\$_DLATCH_PN1_'.
Generating RTLIL representation for module `\$_DLATCH_NN1_'.
Successfully finished Verilog frontend.

3.139.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
No more expansions possible.
<suppressed ~581 debug messages>

yosys> opt_expr -mux_undef

3.140. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~12950 debug messages>

yosys> simplemap

3.141. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.142. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge

3.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~7017 debug messages>
Removed a total of 2339 cells.

yosys> opt_dff -nodffe -nosdff

3.144. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.145. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 1221 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.146. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~594 debug messages>

yosys> opt_merge -nomux

3.147. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~18 debug messages>
Removed a total of 6 cells.

yosys> opt_muxtree

3.148. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.149. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.151. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.152. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.153. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 181 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.154. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_dfDxaq/abc_tmp_2.scr

3.155. Executing ABC pass (technology mapping using ABC).

3.155.1. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Extracted 1949 gates and 2140 wires to a netlist network with 189 inputs and 64 outputs.

3.155.1.1. Executing ABC.
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   3.50  [   0.20 sec. at Pass 0]{firstMap}[1]
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   3.50  [   9.83 sec. at Pass 1]{initMapFlow}[2]
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   3.50  [   1.76 sec. at Pass 2]{map}[2]
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   3.50  [   2.22 sec. at Pass 3]{postMap}[6]
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   3.50  [   1.77 sec. at Pass 4]{map}[8]
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   3.50  [   6.60 sec. at Pass 5]{postMap}[16]
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   3.50  [  16.94 sec. at Pass 6]{pushMap}[16]
DE:   #PIs = 189  #Luts =   382  Max Lvl =   6  Avg Lvl =   3.50  [   1.09 sec. at Pass 7]{finalMap}[16]

yosys> opt_expr

3.156. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.157. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.158. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.159. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.160. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.161. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.162. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.163. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 1326 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.164. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.165. Executing HIERARCHY pass (managing design hierarchy).

3.165.1. Analyzing design hierarchy..
Top module:  \des_top

3.165.2. Analyzing design hierarchy..
Top module:  \des_top
Removed 0 unused modules.

yosys> stat

3.166. Printing statistics.

=== des_top ===

   Number of wires:                541
   Number of wire bits:           1369
   Number of public wires:          31
   Number of public wire bits:     859
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                446
     $lut                          382
     dff                            64


yosys> opt_clean -purge

3.167. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 23 unused wires.
<suppressed ~23 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.168. Executing Verilog backend.
Dumping module `\des_top'.

Warnings: 2 unique messages, 2 total
End of script. Logfile hash: f81d8a123f, CPU: user 4.20s system 0.08s, MEM: 54.88 MB peak
Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)
Time spent: 99% 6x abc (549 sec), 0% 25x opt_expr (1 sec), ...
real 113.88
user 518.84
sys 35.08
