
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.14+36 (git sha1 15a4e900b, gcc 7.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k atahost.v atahost_controller.v atahost_pio_tctrl.v atahost_top.v atahost_wb_slave.v ro_cnt.v timescale.v ud_cnt.v

yosys> verific -vlog2k atahost.v atahost_controller.v atahost_pio_tctrl.v atahost_top.v atahost_wb_slave.v ro_cnt.v timescale.v ud_cnt.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost.v'
VERIFIC-INFO [VERI-2561] atahost.v:192: undeclared symbol 'PIOsel', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_controller.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_pio_tctrl.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_top.v'
VERIFIC-INFO [VERI-2561] atahost_top.v:191: undeclared symbol 'PIOsel', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_wb_slave.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'ro_cnt.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'timescale.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'ud_cnt.v'

yosys> synth_rs -top atahost_top -tech generic -goal area -no_dsp -no_bram -verilog atahost_top.verilog

3. Executing synth_rs pass.

yosys> hierarchy -check -top atahost_top

3.1. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] atahost_top.v:83: compiling module 'atahost_top'
VERIFIC-INFO [VERI-1018] atahost_wb_slave.v:52: compiling module 'atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0)'
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:241: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:265: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:266: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:270: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:271: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:274: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:297: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:298: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:302: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:303: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:307: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:308: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:330: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:331: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:332: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:333: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:337: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:338: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:339: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:340: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:344: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:345: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:346: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:347: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:354: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:355: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:356: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:357: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:361: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:362: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:363: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:364: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:368: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:369: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:370: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:371: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:378: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:379: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:380: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:381: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:385: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:386: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:387: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:388: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:392: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:393: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:394: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:395: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:402: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:403: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:404: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:408: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:409: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:410: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:414: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:415: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:416: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:423: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:424: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:425: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:429: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:430: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:431: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:435: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:436: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:437: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] atahost_controller.v:63: compiling module 'atahost_controller'
VERIFIC-WARNING [VERI-2371] atahost_controller.v:161: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:162: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:164: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:165: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:172: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:173: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:174: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:175: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:176: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:177: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:178: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:179: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:183: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:184: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:185: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:186: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:187: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:188: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:189: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:190: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:194: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:195: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:196: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:197: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:199: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:200: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:201: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:202: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:214: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:220: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:221: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:225: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:226: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:230: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:231: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] atahost_pio_tctrl.v:91: compiling module 'atahost_pio_tctrl'
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:156: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:157: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:161: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:162: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:166: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:167: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:57: compiling module 'ro_cnt(ID=6)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:89: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:55: compiling module 'ud_cnt(RESD=6)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:91: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:189: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:190: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:191: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:195: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:196: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:197: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:201: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:202: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:203: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:57: compiling module 'ro_cnt(ID=28)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:89: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:55: compiling module 'ud_cnt(RESD=28)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:91: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:223: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:225: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:227: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:233: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:57: compiling module 'ro_cnt(ID=2)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:89: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:55: compiling module 'ud_cnt(RESD=2)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:91: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:57: compiling module 'ro_cnt(ID=23)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:89: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:55: compiling module 'ud_cnt(RESD=23)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:91: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:263: delay control is not supported for synthesis
Importing module atahost_top.
Importing module atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0).
Importing module atahost_controller.
Importing module atahost_pio_tctrl.
Importing module ro_cnt(ID=2).
Importing module ro_cnt(ID=6).
Importing module ud_cnt(RESD=6).
Importing module ro_cnt(ID=28).
Importing module ud_cnt(RESD=28).
Importing module ud_cnt(RESD=2).
Importing module ro_cnt(ID=23).
Importing module ud_cnt(RESD=23).

3.1.1. Analyzing design hierarchy..
Top module:  \atahost_top
Used module:     \atahost_controller
Used module:         \atahost_pio_tctrl
Used module:             \ro_cnt(ID=23)
Used module:                 \ud_cnt(RESD=23)
Used module:             \ro_cnt(ID=2)
Used module:                 \ud_cnt(RESD=2)
Used module:             \ro_cnt(ID=28)
Used module:                 \ud_cnt(RESD=28)
Used module:             \ro_cnt(ID=6)
Used module:                 \ud_cnt(RESD=6)
Used module:     \atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0)

3.1.2. Analyzing design hierarchy..
Top module:  \atahost_top
Used module:     \atahost_controller
Used module:         \atahost_pio_tctrl
Used module:             \ro_cnt(ID=23)
Used module:                 \ud_cnt(RESD=23)
Used module:             \ro_cnt(ID=2)
Used module:                 \ud_cnt(RESD=2)
Used module:             \ro_cnt(ID=28)
Used module:                 \ud_cnt(RESD=28)
Used module:             \ro_cnt(ID=6)
Used module:                 \ud_cnt(RESD=6)
Used module:     \atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0)
Removed 0 unused modules.

yosys> proc

3.2. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.2.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.2.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.2.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.2.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.2.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.2.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.2.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.2.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.2.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.2.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.2.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module ud_cnt(RESD=23).
<suppressed ~2 debug messages>
Optimizing module ro_cnt(ID=23).
<suppressed ~1 debug messages>
Optimizing module ud_cnt(RESD=2).
<suppressed ~2 debug messages>
Optimizing module ud_cnt(RESD=28).
<suppressed ~2 debug messages>
Optimizing module ro_cnt(ID=28).
<suppressed ~1 debug messages>
Optimizing module ud_cnt(RESD=6).
<suppressed ~2 debug messages>
Optimizing module ro_cnt(ID=6).
<suppressed ~1 debug messages>
Optimizing module ro_cnt(ID=2).
<suppressed ~1 debug messages>
Optimizing module atahost_pio_tctrl.
<suppressed ~10 debug messages>
Optimizing module atahost_controller.
<suppressed ~12 debug messages>
Optimizing module atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0).
<suppressed ~28 debug messages>
Optimizing module atahost_top.

yosys> flatten

3.3. Executing FLATTEN pass (flatten design).
Deleting now unused module ud_cnt(RESD=23).
Deleting now unused module ro_cnt(ID=23).
Deleting now unused module ud_cnt(RESD=2).
Deleting now unused module ud_cnt(RESD=28).
Deleting now unused module ro_cnt(ID=28).
Deleting now unused module ud_cnt(RESD=6).
Deleting now unused module ro_cnt(ID=6).
Deleting now unused module ro_cnt(ID=2).
Deleting now unused module atahost_pio_tctrl.
Deleting now unused module atahost_controller.
Deleting now unused module atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0).
<suppressed ~11 debug messages>

yosys> tribuf -logic

3.4. Executing TRIBUF pass.

yosys> opt_expr

3.5. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~9 debug messages>

yosys> opt_clean

3.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 19 unused cells and 694 unused wires.
<suppressed ~136 debug messages>

yosys> check

3.7. Executing CHECK pass (checking for obvious problems).
Checking module atahost_top...
Found and reported 0 problems.

yosys> deminout

3.8. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt -nodffe -nosdff

3.9. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.9.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~4 debug messages>

yosys> opt_merge -nomux

3.9.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~18 debug messages>
Removed a total of 6 cells.

yosys> opt_muxtree

3.9.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~49 debug messages>

yosys> opt_reduce

3.9.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
    New ctrl vector for $pmux cell $flatten\u0.$verific$select_313$atahost_wb_slave.v:476$620: { $flatten\u0.$verific$n37$324 $flatten\u0.$verific$n41$326 $flatten\u0.$verific$n45$328 $flatten\u0.$verific$n49$330 $flatten\u0.$verific$n53$332 $flatten\u0.$verific$n57$334 $flatten\u0.$verific$n61$336 }
  Optimizing cells in module \atahost_top.
Performed a total of 1 changes.

yosys> opt_merge

3.9.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.9.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:91$1142 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\t2_cnt.$verific$rci_reg$ro_cnt.v:89$1088 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev1_Teoc_reg$atahost_wb_slave.v:438$609 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:91$1068 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\t1_cnt.$verific$rci_reg$ro_cnt.v:89$1014 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev1_Td_reg$atahost_wb_slave.v:438$608 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:91$1245 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\eoc_cnt.$verific$rci_reg$ro_cnt.v:89$1191 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev0_Tm_reg$atahost_wb_slave.v:417$598 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev0_Teoc_reg$atahost_wb_slave.v:417$600 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:91$1171 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\dhold_cnt.$verific$rci_reg$ro_cnt.v:89$969 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev0_Td_reg$atahost_wb_slave.v:417$599 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$CtrlReg_reg$atahost_wb_slave.v:274$519 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$oe_reg$atahost_pio_tctrl.v:204$897 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$hold_go_reg$atahost_pio_tctrl.v:168$858 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$hT2done_reg$atahost_pio_tctrl.v:227$916 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$busy_reg$atahost_pio_tctrl.v:168$857 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$DIOW_reg$atahost_pio_tctrl.v:204$896 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$DIOR_reg$atahost_pio_tctrl.v:204$895 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$dPIOreq_reg$atahost_controller.v:232$735 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$RESETn_reg$atahost_controller.v:203$715 ($aldff) from module atahost_top.
Removing never-active async load on $flatten\u1.$verific$PIOq_reg$atahost_controller.v:214$725 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$PIOgo_reg$atahost_controller.v:232$736 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DIOWn_reg$atahost_controller.v:203$717 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DIORn_reg$atahost_controller.v:203$716 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DDoe_reg$atahost_controller.v:203$722 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DDo_reg$atahost_controller.v:203$721 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DA_reg$atahost_controller.v:203$718 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$CS1n_reg$atahost_controller.v:203$720 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$CS0n_reg$atahost_controller.v:203$719 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$inti_reg$atahost_wb_slave.v:309$544 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$dirq_reg$atahost_wb_slave.v:309$545 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_Teoc_reg$atahost_wb_slave.v:396$590 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_T4_reg$atahost_wb_slave.v:396$589 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_T2_reg$atahost_wb_slave.v:396$588 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_T1_reg$atahost_wb_slave.v:396$587 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_Teoc_reg$atahost_wb_slave.v:372$578 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_T4_reg$atahost_wb_slave.v:372$577 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_T2_reg$atahost_wb_slave.v:372$576 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_T1_reg$atahost_wb_slave.v:372$575 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_Teoc_reg$atahost_wb_slave.v:348$566 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_T4_reg$atahost_wb_slave.v:348$565 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_T2_reg$atahost_wb_slave.v:348$564 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_T1_reg$atahost_wb_slave.v:348$563 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev1_Tm_reg$atahost_wb_slave.v:438$607 ($aldff) from module atahost_top.

yosys> opt_clean

3.9.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 3 unused cells and 8 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.9.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.9.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.9.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~49 debug messages>

yosys> opt_reduce

3.9.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.9.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.9.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.9.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.9.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.9.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

3.10. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.10.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.10.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.10.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.10.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> fsm_opt

3.10.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode

3.10.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.10.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.10.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~49 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\u1.$verific$PIOq_reg$atahost_controller.v:214$725 ($dff) from module atahost_top (D = \dd_pad_i, Q = \u1.PIOq).
Adding EN signal on $flatten\u0.$verific$store_pp_full_reg$atahost_wb_slave.v:241$487 ($dff) from module atahost_top (D = 1'0, Q = \u0.store_pp_full).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_Teoc_reg$atahost_wb_slave.v:396$590 ($adff) from module atahost_top (D = $flatten\u0.$verific$n946$439, Q = \u0.PIO_dport1_Teoc).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_T4_reg$atahost_wb_slave.v:396$589 ($adff) from module atahost_top (D = $flatten\u0.$verific$n937$438, Q = \u0.PIO_dport1_T4).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_T2_reg$atahost_wb_slave.v:396$588 ($adff) from module atahost_top (D = $flatten\u0.$verific$n928$437, Q = \u0.PIO_dport1_T2).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_T1_reg$atahost_wb_slave.v:396$587 ($adff) from module atahost_top (D = $flatten\u0.$verific$n919$436, Q = \u0.PIO_dport1_T1).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_Teoc_reg$atahost_wb_slave.v:372$578 ($adff) from module atahost_top (D = $flatten\u0.$verific$n727$431, Q = \u0.PIO_dport0_Teoc).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_T4_reg$atahost_wb_slave.v:372$577 ($adff) from module atahost_top (D = $flatten\u0.$verific$n718$430, Q = \u0.PIO_dport0_T4).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_T2_reg$atahost_wb_slave.v:372$576 ($adff) from module atahost_top (D = $flatten\u0.$verific$n709$429, Q = \u0.PIO_dport0_T2).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_T1_reg$atahost_wb_slave.v:372$575 ($adff) from module atahost_top (D = $flatten\u0.$verific$n700$428, Q = \u0.PIO_dport0_T1).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_Teoc_reg$atahost_wb_slave.v:348$566 ($adff) from module atahost_top (D = $flatten\u0.$verific$n508$423, Q = \u0.PIO_cmdport_Teoc).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_T4_reg$atahost_wb_slave.v:348$565 ($adff) from module atahost_top (D = $flatten\u0.$verific$n499$422, Q = \u0.PIO_cmdport_T4).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_T2_reg$atahost_wb_slave.v:348$564 ($adff) from module atahost_top (D = $flatten\u0.$verific$n490$421, Q = \u0.PIO_cmdport_T2).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_T1_reg$atahost_wb_slave.v:348$563 ($adff) from module atahost_top (D = $flatten\u0.$verific$n481$420, Q = \u0.PIO_cmdport_T1).
Adding EN signal on $flatten\u0.$verific$DMA_dev1_Tm_reg$atahost_wb_slave.v:438$607 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1267$450, Q = \u0.DMA_dev1_Tm).
Adding EN signal on $flatten\u0.$verific$DMA_dev1_Teoc_reg$atahost_wb_slave.v:438$609 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1285$452, Q = \u0.DMA_dev1_Teoc).
Adding EN signal on $flatten\u0.$verific$DMA_dev1_Td_reg$atahost_wb_slave.v:438$608 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1276$451, Q = \u0.DMA_dev1_Td).
Adding EN signal on $flatten\u0.$verific$DMA_dev0_Tm_reg$atahost_wb_slave.v:417$598 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1102$444, Q = \u0.DMA_dev0_Tm).
Adding EN signal on $flatten\u0.$verific$DMA_dev0_Teoc_reg$atahost_wb_slave.v:417$600 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1120$446, Q = \u0.DMA_dev0_Teoc).
Adding EN signal on $flatten\u0.$verific$DMA_dev0_Td_reg$atahost_wb_slave.v:417$599 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1111$445, Q = \u0.DMA_dev0_Td).
Adding EN signal on $flatten\u0.$verific$CtrlReg_reg$atahost_wb_slave.v:274$519 ($adff) from module atahost_top (D = $flatten\u0.$verific$n199$407, Q = \u0.CtrlReg).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$1249 ($dffe) from module atahost_top.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 2 unused cells and 2 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~21 debug messages>

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~47 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~39 debug messages>
Removed a total of 13 cells.

yosys> opt_dff -sat

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 15 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.11.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~47 debug messages>

yosys> opt_reduce

3.11.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.11.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.11.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.11.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.12. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_60$atahost_wb_slave.v:256$510 ($eq).
Removed top 1 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_56$atahost_wb_slave.v:255$507 ($eq).
Removed top 1 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_52$atahost_wb_slave.v:254$504 ($eq).
Removed top 2 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_48$atahost_wb_slave.v:253$501 ($eq).
Removed top 2 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_44$atahost_wb_slave.v:252$498 ($eq).
Removed top 3 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_40$atahost_wb_slave.v:251$495 ($eq).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1235 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1235 ($sub).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1161 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1161 ($sub).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1058 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1058 ($sub).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1132 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1132 ($sub).

yosys> peepopt

3.13. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.14. Executing PMUXTREE pass.

yosys> opt_clean

3.15. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 2 unused cells and 3 unused wires.
<suppressed ~3 debug messages>

yosys> techmap

3.16. Executing TECHMAP pass (map to technology primitives).

3.16.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.16.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $dff.
Running "alumacc" on wrapper $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=8:B_SIGNED=0:B_WIDTH=1:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $paramod$19189243523493d505a4933d1bad417c570ea8a6\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
Using extmapper simplemap for cells of type $xor.
No more expansions possible.
<suppressed ~655 debug messages>

yosys> alumacc

3.17. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module atahost_top:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.18. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.18.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~328 debug messages>

yosys> opt_merge -nomux

3.18.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~45 debug messages>
Removed a total of 15 cells.

yosys> opt_muxtree

3.18.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.18.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.18.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.18.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 1 unused cells and 185 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.18.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.18.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.18.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.18.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.18.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.18.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.18.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.18.16. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.19. Executing MEMORY pass.

yosys> opt_mem

3.19.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.19.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.19.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.19.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.19.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> memory_share

3.19.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.19.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.19.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> memory_collect

3.19.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.20. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr -mux_undef

3.21. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~176 debug messages>

yosys> simplemap

3.22. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge

3.24. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~447 debug messages>
Removed a total of 149 cells.

yosys> opt_dff -nodffe -nosdff

3.25. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 31 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.27.9. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~27 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.30.10. Finished OPT passes. (There is nothing left to do.)

yosys> techmap

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.32.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Extracted 672 gates and 959 wires to a netlist network with 286 inputs and 140 outputs.

3.33.1.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/yosys_verific_rs/result_09-03-2022T20-36-44/All_lut_synth_rs_area.json/ata_ocidec-1/abc_tmp.scr 
ABC: netlist  : i/o =    286/    140  and =     961  lev =   10 (5.79)  mem = 0.02 MB
ABC: Mapping (K=6)  :  lut =    240  edge =     965  lev =    6 (3.10)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =     981  lev =   11 (6.05)  mem = 0.02 MB
ABC: Mapping (K=6)  :  lut =    240  edge =     969  lev =    6 (3.24)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =     987  lev =   11 (6.16)  mem = 0.02 MB
ABC: Mapping (K=6)  :  lut =    239  edge =     972  lev =    6 (2.97)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =     995  lev =   11 (5.74)  mem = 0.02 MB
ABC: Mapping (K=6)  :  lut =    239  edge =     974  lev =    6 (2.94)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =    1039  lev =   11 (5.67)  mem = 0.02 MB
ABC: Mapping (K=6)  :  lut =    239  edge =     967  lev =    6 (2.90)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =    1043  lev =   11 (5.66)  mem = 0.03 MB
ABC: Mapping (K=6)  :  lut =    236  edge =     967  lev =    6 (2.86)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =    1043  lev =   11 (5.66)  mem = 0.03 MB
ABC: Mapping (K=6)  :  lut =    236  edge =     966  lev =    6 (2.86)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =    1043  lev =   11 (5.66)  mem = 0.03 MB
ABC: Mapping (K=6)  :  lut =    236  edge =     966  lev =    6 (2.86)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =    1060  lev =   11 (5.71)  mem = 0.03 MB
ABC: Mapping (K=6)  :  lut =    236  edge =     966  lev =    5 (2.65)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =    1043  lev =   11 (5.66)  mem = 0.03 MB
ABC: Mapping (K=6)  :  lut =    236  edge =     966  lev =    6 (2.86)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =    1043  lev =   11 (5.66)  mem = 0.03 MB
ABC: Mapping (K=6)  :  lut =    236  edge =     966  lev =    6 (2.86)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =    1053  lev =   10 (5.34)  mem = 0.03 MB
ABC: Mapping (K=6)  :  lut =    237  edge =     971  lev =    5 (2.54)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =    1055  lev =   10 (5.47)  mem = 0.03 MB
ABC: Mapping (K=6)  :  lut =    238  edge =     974  lev =    5 (2.54)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =    1060  lev =   11 (5.71)  mem = 0.02 MB
ABC: Mapping (K=6)  :  lut =    236  edge =     966  lev =    5 (2.65)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =    1060  lev =   11 (5.71)  mem = 0.03 MB
ABC: Mapping (K=6)  :  lut =    236  edge =     966  lev =    5 (2.65)  mem = 0.01 MB
ABC: netlist  : i/o =    286/    140  and =    1045  lev =   10 (5.46)  mem = 0.02 MB
ABC: Mapping (K=6)  :  lut =    236  edge =     966  lev =    5 (2.65)  mem = 0.01 MB
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      236
ABC RESULTS:        internal signals:      533
ABC RESULTS:           input signals:      286
ABC RESULTS:          output signals:      140
Removing temp directory.

yosys> opt

3.34. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.34.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.34.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.34.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.34.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.34.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.34.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.34.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 587 unused wires.
<suppressed ~41 debug messages>

yosys> opt_expr

3.34.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.34.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.34.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.34.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.34.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.34.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.34.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.34.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.34.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.35. Executing HIERARCHY pass (managing design hierarchy).

3.35.1. Analyzing design hierarchy..
Top module:  \atahost_top

3.35.2. Analyzing design hierarchy..
Top module:  \atahost_top
Removed 0 unused modules.

yosys> stat

3.36. Printing statistics.

=== atahost_top ===

   Number of wires:                429
   Number of wire bits:           1201
   Number of public wires:         228
   Number of public wire bits:    1000
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                505
     $_DFFE_PN0P_                  145
     $_DFFE_PN1P_                   31
     $_DFFE_PP_                     16
     $_DFF_PN0_                     57
     $_DFF_PN1_                     14
     $_DFF_P_                        6
     $lut                          236


yosys> opt_clean -purge

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 148 unused wires.
<suppressed ~148 debug messages>

yosys> write_verilog -noattr -nohex atahost_top.verilog

3.38. Executing Verilog backend.

yosys> bmuxmap

3.38.1. Executing BMUXMAP pass.

yosys> demuxmap

3.38.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\atahost_top'.

Warnings: 128 unique messages, 149 total
End of script. Logfile hash: 7e0a85fd16, CPU: user 1.89s system 0.02s, MEM: 21.49 MB peak
Yosys 0.14+36 (git sha1 15a4e900b, gcc 7.1.0 -fPIC -Os)
Time spent: 52% 1x abc (2 sec), 15% 26x opt_expr (0 sec), ...
