
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.8
 Yosys 0.16+6 (git sha1 7f5477eb1, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k rgb2ycrcb.v

yosys> verific -vlog2k rgb2ycrcb.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'rgb2ycrcb.v'

yosys> synth_rs -top top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.2.37

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top top

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] rgb2ycrcb.v:57: compiling module 'top'
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:100: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:101: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:102: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:104: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:113: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:114: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:115: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:117: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:126: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:127: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:128: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:130: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:140: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:143: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] rgb2ycrcb.v:146: delay control is not supported for synthesis
Importing module top.

3.3.1. Analyzing design hierarchy..
Top module:  \top

3.3.2. Analyzing design hierarchy..
Top module:  \top
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~2 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 18 unused wires.
<suppressed ~16 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module top...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~15 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$yr_reg$rgb2ycrcb.v:105$77 ($aldff) from module top.
Removing never-active async load on $verific$yg_reg$rgb2ycrcb.v:105$78 ($aldff) from module top.
Removing never-active async load on $verific$yb_reg$rgb2ycrcb.v:105$79 ($aldff) from module top.
Removing never-active async load on $verific$y_reg$rgb2ycrcb.v:147$127 ($aldff) from module top.
Removing never-active async load on $verific$y1_reg$rgb2ycrcb.v:105$80 ($aldff) from module top.
Removing never-active async load on $verific$crr_reg$rgb2ycrcb.v:118$93 ($aldff) from module top.
Removing never-active async load on $verific$crg_reg$rgb2ycrcb.v:118$94 ($aldff) from module top.
Removing never-active async load on $verific$crb_reg$rgb2ycrcb.v:118$95 ($aldff) from module top.
Removing never-active async load on $verific$cr_reg$rgb2ycrcb.v:147$128 ($aldff) from module top.
Removing never-active async load on $verific$cr1_reg$rgb2ycrcb.v:118$96 ($aldff) from module top.
Removing never-active async load on $verific$cbr_reg$rgb2ycrcb.v:131$109 ($aldff) from module top.
Removing never-active async load on $verific$cbg_reg$rgb2ycrcb.v:131$110 ($aldff) from module top.
Removing never-active async load on $verific$cbb_reg$rgb2ycrcb.v:131$111 ($aldff) from module top.
Removing never-active async load on $verific$cb_reg$rgb2ycrcb.v:147$129 ($aldff) from module top.
Removing never-active async load on $verific$cb1_reg$rgb2ycrcb.v:131$112 ($aldff) from module top.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~15 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~15 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$yr_reg$rgb2ycrcb.v:105$77 ($dff) from module top (D = { 1'0 $verific$n25$13 [18:1] 1'0 }, Q = \yr).
Adding EN signal on $verific$yg_reg$rgb2ycrcb.v:105$78 ($dff) from module top (D = $verific$n46$14, Q = \yg).
Adding EN signal on $verific$yb_reg$rgb2ycrcb.v:105$79 ($dff) from module top (D = { 3'000 $verific$n106$17 [16:2] 2'00 }, Q = \yb).
Adding EN signal on $verific$y_reg$rgb2ycrcb.v:147$127 ($dff) from module top (D = $verific$n1067$50, Q = \y).
Adding EN signal on $verific$y1_reg$rgb2ycrcb.v:105$80 ($dff) from module top (D = { $verific$n149$5 $verific$n150$19 }, Q = \y1).
Adding EN signal on $verific$crr_reg$rgb2ycrcb.v:118$93 ($dff) from module top (D = { 1'0 \r 9'000000000 }, Q = \crr).
Adding EN signal on $verific$crg_reg$rgb2ycrcb.v:118$94 ($dff) from module top (D = { 1'0 $verific$n389$26 }, Q = \crg).
Adding EN signal on $verific$crb_reg$rgb2ycrcb.v:118$95 ($dff) from module top (D = { 3'000 $verific$n430$28 }, Q = \crb).
Adding EN signal on $verific$cr_reg$rgb2ycrcb.v:147$128 ($dff) from module top (D = $verific$n1103$53, Q = \cr).
Adding EN signal on $verific$cr1_reg$rgb2ycrcb.v:118$96 ($dff) from module top (D = $verific$n491$31, Q = \cr1).
Adding EN signal on $verific$cbr_reg$rgb2ycrcb.v:131$109 ($dff) from module top (D = { 2'00 $verific$n710$37 }, Q = \cbr).
Adding EN signal on $verific$cbg_reg$rgb2ycrcb.v:131$110 ($dff) from module top (D = { 1'0 $verific$n750$39 }, Q = \cbg).
Adding EN signal on $verific$cbb_reg$rgb2ycrcb.v:131$111 ($dff) from module top (D = { 1'0 \b 9'000000000 }, Q = \cbb).
Adding EN signal on $verific$cb_reg$rgb2ycrcb.v:147$129 ($dff) from module top (D = $verific$n1139$56, Q = \cb).
Adding EN signal on $verific$cb1_reg$rgb2ycrcb.v:131$112 ($dff) from module top (D = $verific$n834$43, Q = \cb1).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$143 ($dffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$143 ($dffe) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$143 ($dffe) from module top.
Setting constant 0-bit at position 3 on $auto$ff.cc:262:slice$143 ($dffe) from module top.
Setting constant 0-bit at position 4 on $auto$ff.cc:262:slice$143 ($dffe) from module top.
Setting constant 0-bit at position 5 on $auto$ff.cc:262:slice$143 ($dffe) from module top.
Setting constant 0-bit at position 6 on $auto$ff.cc:262:slice$143 ($dffe) from module top.
Setting constant 0-bit at position 7 on $auto$ff.cc:262:slice$143 ($dffe) from module top.
Setting constant 0-bit at position 8 on $auto$ff.cc:262:slice$143 ($dffe) from module top.
Setting constant 0-bit at position 19 on $auto$ff.cc:262:slice$143 ($dffe) from module top.
Setting constant 0-bit at position 19 on $auto$ff.cc:262:slice$142 ($dffe) from module top.
Setting constant 0-bit at position 18 on $auto$ff.cc:262:slice$141 ($dffe) from module top.
Setting constant 0-bit at position 19 on $auto$ff.cc:262:slice$141 ($dffe) from module top.
Setting constant 0-bit at position 17 on $auto$ff.cc:262:slice$138 ($dffe) from module top.
Setting constant 0-bit at position 18 on $auto$ff.cc:262:slice$138 ($dffe) from module top.
Setting constant 0-bit at position 19 on $auto$ff.cc:262:slice$138 ($dffe) from module top.
Setting constant 0-bit at position 19 on $auto$ff.cc:262:slice$137 ($dffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$136 ($dffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$136 ($dffe) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$136 ($dffe) from module top.
Setting constant 0-bit at position 3 on $auto$ff.cc:262:slice$136 ($dffe) from module top.
Setting constant 0-bit at position 4 on $auto$ff.cc:262:slice$136 ($dffe) from module top.
Setting constant 0-bit at position 5 on $auto$ff.cc:262:slice$136 ($dffe) from module top.
Setting constant 0-bit at position 6 on $auto$ff.cc:262:slice$136 ($dffe) from module top.
Setting constant 0-bit at position 7 on $auto$ff.cc:262:slice$136 ($dffe) from module top.
Setting constant 0-bit at position 8 on $auto$ff.cc:262:slice$136 ($dffe) from module top.
Setting constant 0-bit at position 19 on $auto$ff.cc:262:slice$136 ($dffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$133 ($dffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$133 ($dffe) from module top.
Setting constant 0-bit at position 17 on $auto$ff.cc:262:slice$133 ($dffe) from module top.
Setting constant 0-bit at position 18 on $auto$ff.cc:262:slice$133 ($dffe) from module top.
Setting constant 0-bit at position 19 on $auto$ff.cc:262:slice$133 ($dffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$131 ($dffe) from module top.
Setting constant 0-bit at position 19 on $auto$ff.cc:262:slice$131 ($dffe) from module top.

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 15 unused cells and 15 unused wires.
<suppressed ~16 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 20) from port A of cell top.$verific$add_10$rgb2ycrcb.v:104$70 ($add).
Removed top 4 bits (of 21) from port B of cell top.$verific$add_11$rgb2ycrcb.v:104$71 ($add).
Removed top 2 bits (of 21) from port A of cell top.$verific$sub_27$rgb2ycrcb.v:117$86 ($sub).
Removed top 2 bits (of 21) from port B of cell top.$verific$sub_27$rgb2ycrcb.v:117$86 ($sub).
Removed top 1 bits (of 21) from port Y of cell top.$verific$sub_27$rgb2ycrcb.v:117$86 ($sub).
Removed top 5 bits (of 22) from port B of cell top.$verific$sub_28$rgb2ycrcb.v:117$87 ($sub).
Removed top 2 bits (of 21) from port A of cell top.$verific$sub_44$rgb2ycrcb.v:130$102 ($sub).
Removed top 3 bits (of 21) from port B of cell top.$verific$sub_44$rgb2ycrcb.v:130$102 ($sub).
Removed top 1 bits (of 21) from port Y of cell top.$verific$sub_44$rgb2ycrcb.v:130$102 ($sub).
Removed top 3 bits (of 22) from port B of cell top.$verific$sub_45$rgb2ycrcb.v:130$103 ($sub).
Removed top 3 bits (of 20) from wire top.$verific$n106$17.
Removed top 1 bits (of 20) from wire top.$verific$n25$13.
Removed top 1 bits (of 20) from wire top.cbb.
Removed top 1 bits (of 20) from wire top.cbg.
Removed top 2 bits (of 20) from wire top.cbr.
Removed top 3 bits (of 20) from wire top.crb.
Removed top 1 bits (of 20) from wire top.crg.
Removed top 1 bits (of 20) from wire top.crr.
Removed top 3 bits (of 20) from wire top.yb.
Removed top 1 bits (of 20) from wire top.yr.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 10 unused wires.
<suppressed ~1 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module top:
  creating $macc model for $verific$add_10$rgb2ycrcb.v:104$70 ($add).
  creating $macc model for $verific$add_11$rgb2ycrcb.v:104$71 ($add).
  creating $macc model for $verific$mult_23$rgb2ycrcb.v:114$82 ($mul).
  creating $macc model for $verific$mult_25$rgb2ycrcb.v:115$84 ($mul).
  creating $macc model for $verific$mult_39$rgb2ycrcb.v:126$97 ($mul).
  creating $macc model for $verific$mult_4$rgb2ycrcb.v:100$64 ($mul).
  creating $macc model for $verific$mult_41$rgb2ycrcb.v:127$99 ($mul).
  creating $macc model for $verific$mult_6$rgb2ycrcb.v:101$66 ($mul).
  creating $macc model for $verific$mult_8$rgb2ycrcb.v:102$68 ($mul).
  creating $macc model for $verific$sub_27$rgb2ycrcb.v:117$86 ($sub).
  creating $macc model for $verific$sub_28$rgb2ycrcb.v:117$87 ($sub).
  creating $macc model for $verific$sub_44$rgb2ycrcb.v:130$102 ($sub).
  creating $macc model for $verific$sub_45$rgb2ycrcb.v:130$103 ($sub).
  merging $macc model for $verific$add_10$rgb2ycrcb.v:104$70 into $verific$add_11$rgb2ycrcb.v:104$71.
  creating $alu model for $macc $verific$sub_44$rgb2ycrcb.v:130$102.
  creating $alu model for $macc $verific$sub_28$rgb2ycrcb.v:117$87.
  creating $alu model for $macc $verific$sub_27$rgb2ycrcb.v:117$86.
  creating $alu model for $macc $verific$sub_45$rgb2ycrcb.v:130$103.
  creating $macc cell for $verific$mult_6$rgb2ycrcb.v:101$66: $auto$alumacc.cc:365:replace_macc$164
  creating $macc cell for $verific$mult_41$rgb2ycrcb.v:127$99: $auto$alumacc.cc:365:replace_macc$165
  creating $macc cell for $verific$mult_4$rgb2ycrcb.v:100$64: $auto$alumacc.cc:365:replace_macc$166
  creating $macc cell for $verific$mult_39$rgb2ycrcb.v:126$97: $auto$alumacc.cc:365:replace_macc$167
  creating $macc cell for $verific$mult_25$rgb2ycrcb.v:115$84: $auto$alumacc.cc:365:replace_macc$168
  creating $macc cell for $verific$mult_23$rgb2ycrcb.v:114$82: $auto$alumacc.cc:365:replace_macc$169
  creating $macc cell for $verific$add_11$rgb2ycrcb.v:104$71: $auto$alumacc.cc:365:replace_macc$170
  creating $macc cell for $verific$mult_8$rgb2ycrcb.v:102$68: $auto$alumacc.cc:365:replace_macc$171
  creating $alu cell for $verific$sub_45$rgb2ycrcb.v:130$103: $auto$alumacc.cc:485:replace_alu$172
  creating $alu cell for $verific$sub_27$rgb2ycrcb.v:117$86: $auto$alumacc.cc:485:replace_alu$175
  creating $alu cell for $verific$sub_28$rgb2ycrcb.v:117$87: $auto$alumacc.cc:485:replace_alu$178
  creating $alu cell for $verific$sub_44$rgb2ycrcb.v:130$102: $auto$alumacc.cc:485:replace_alu$181
  created 4 $alu and 8 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 1 unused cells and 2 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> stat

3.22. Printing statistics.

=== top ===

   Number of wires:                 53
   Number of wire bits:            770
   Number of public wires:          20
   Number of public wire bits:     295
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 36
     $alu                            4
     $and                            3
     $dffe                          15
     $macc                           8
     $not                            3
     $or                             3


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.23. Executing TECHMAP pass (map to technology primitives).

3.23.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.23.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.23.3. Continuing TECHMAP pass.
Using extmapper maccmap for cells of type $macc.
  add 10'1001011001 * \g (10x10 bits, unsigned)
  add \r * 8'10101101 (10x8 bits, unsigned)
  add \g * 9'101010011 (10x9 bits, unsigned)
Using template $paramod$3f130b1307126b2ad59695abd14050e58a80d0ee\_90_alu for cells of type $alu.
Using template $paramod$654c17c720ba40d72484cc48023d39b49a94f78f\_80_rs_alu for cells of type $alu.
  add \b * 5'11101 (10x5 bits, unsigned)
Using extmapper simplemap for cells of type $dffe.
  add { \yr [18:1] 1'0 } (19 bits, unsigned)
  add { \yb [16:2] 2'00 } (17 bits, unsigned)
  add \yg (20 bits, unsigned)
  add \g * 9'110101101 (10x9 bits, unsigned)
Using template $paramod$aac77111ec976962096d49169906492758c7e4cd\_90_alu for cells of type $alu.
Using template $paramod$3ff358d115fdd9adcc51c74aa28caa356ff045b5\_80_rs_alu for cells of type $alu.
  add \b * 7'1010011 (10x7 bits, unsigned)
  add \r * 8'10011001 (10x8 bits, unsigned)
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using template $paramod\_90_fa\WIDTH=32'00000000000000000000000000010100 for cells of type $fa.
Using template $paramod$6fc37af1c109ae54e8aed83fcd995c12d378ce93\_90_alu for cells of type $alu.
Using template $paramod\_90_fa\WIDTH=32'00000000000000000000000000010010 for cells of type $fa.
Using template $paramod$12350b8c8422a70d10b7db4eaae1202a7148b784\_90_alu for cells of type $alu.
Using template $paramod\_90_fa\WIDTH=32'00000000000000000000000000010011 for cells of type $fa.
Using template $paramod$4e6ee5eb737cf7428f8e246e911ae1dac9ae2979\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010100 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using extmapper simplemap for cells of type $mux.
Using template $paramod\_90_fa\WIDTH=32'00000000000000000000000000001111 for cells of type $fa.
Using template $paramod$67e8f4b8dba01cd3d8fc718acd02276257d102de\_90_alu for cells of type $alu.
Using template $paramod$e161c1674351796cd6dd381e70ff05458bfe7755\_90_alu for cells of type $alu.
Using template $paramod\_90_fa\WIDTH=32'00000000000000000000000000010001 for cells of type $fa.
Using template $paramod$3bb72ad0665cdca279bbc49ed6a39f403f16497f\_90_alu for cells of type $alu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010011 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001111 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010001 for cells of type $lcu.
No more expansions possible.
<suppressed ~2924 debug messages>

yosys> stat

3.24. Printing statistics.

=== top ===

   Number of wires:               1632
   Number of wire bits:          29791
   Number of public wires:          20
   Number of public wire bits:     295
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               7174
     $_AND_                       3265
     $_DFFE_PP_                    242
     $_MUX_                        236
     $_NOT_                        235
     $_OR_                        1134
     $_XOR_                       2018
     adder_carry                    44


yosys> opt

3.25. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.25.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~4565 debug messages>

yosys> opt_merge -nomux

3.25.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~492 debug messages>
Removed a total of 164 cells.

yosys> opt_muxtree

3.25.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.25.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.6. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$831 ($_DFFE_PP_) from module top.

yosys> opt_clean

3.25.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 188 unused cells and 1082 unused wires.
<suppressed ~189 debug messages>

yosys> opt_expr

3.25.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~12 debug messages>

3.25.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.25.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.25.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.25.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.25.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.25.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.25.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.25.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.25.23. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~30 debug messages>

yosys> opt_merge

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.26.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

3.26.5. Finished fast OPT passes.

yosys> memory_map

3.27. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.28.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.28.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr -full

3.28.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.28.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.29. Executing ABC pass (technology mapping using ABC).

3.29.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 2013 gates and 2215 wires to a netlist network with 202 inputs and 235 outputs.

3.29.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/yosys_verific_rs/result_04-05-2022T15-08-45/Golden_synth_rs_ade.json/rgb2ycrcb/abc_tmp.scr 
ABC:   #Luts =   649  Max Lvl =  11  Avg Lvl =   4.30  [   0.80 sec. at Pass 0]
ABC:   #Luts =   520  Max Lvl =  14  Avg Lvl =   5.17  [  18.30 sec. at Pass 1]
ABC:   #Luts =   498  Max Lvl =  13  Avg Lvl =   4.59  [   1.74 sec. at Pass 2]
ABC:   #Luts =   497  Max Lvl =  14  Avg Lvl =   4.74  [  46.09 sec. at Pass 3]
ABC:   #Luts =   490  Max Lvl =  13  Avg Lvl =   4.65  [   3.66 sec. at Pass 4]
ABC:   #Luts =   486  Max Lvl =  14  Avg Lvl =   4.69  [  42.63 sec. at Pass 5]
ABC:   #Luts =   484  Max Lvl =  14  Avg Lvl =   4.54  [   3.32 sec. at Pass 6]
ABC:   #Luts =   483  Max Lvl =  14  Avg Lvl =   4.49  [  33.52 sec. at Pass 7]
ABC:   #Luts =   477  Max Lvl =  12  Avg Lvl =   4.50  [   3.99 sec. at Pass 8]
ABC:   #Luts =   477  Max Lvl =  12  Avg Lvl =   4.50  [  38.35 sec. at Pass 9]
ABC:   #Luts =   472  Max Lvl =  12  Avg Lvl =   4.63  [   2.65 sec. at Pass 10]
ABC:   #Luts =   472  Max Lvl =  12  Avg Lvl =   4.63  [  38.07 sec. at Pass 11]
ABC:   #Luts =   472  Max Lvl =  12  Avg Lvl =   4.63  [   4.84 sec. at Pass 12]
ABC:   #Luts =   471  Max Lvl =  12  Avg Lvl =   4.48  [  42.07 sec. at Pass 13]
ABC:   #Luts =   471  Max Lvl =  12  Avg Lvl =   4.48  [   3.42 sec. at Pass 14]
ABC:   #Luts =   471  Max Lvl =  12  Avg Lvl =   4.48  [  45.33 sec. at Pass 15]
ABC:   #Luts =   471  Max Lvl =  12  Avg Lvl =   4.48  [   5.27 sec. at Pass 16]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      471
ABC RESULTS:        internal signals:     1778
ABC RESULTS:           input signals:      202
ABC RESULTS:          output signals:      235
Removing temp directory.

yosys> opt

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.30.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 892 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.30.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.30.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.30.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.30.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.30.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.30.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.30.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.31. Printing statistics.

=== top ===

   Number of wires:                341
   Number of wire bits:           1563
   Number of public wires:          20
   Number of public wire bits:     295
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                715
     $_DFFE_PP_                    200
     $lut                          471
     adder_carry                    44


yosys> shregmap -minlen 8 -maxlen 20

3.32. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.33. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.34. Printing statistics.

=== top ===

   Number of wires:                341
   Number of wire bits:           1563
   Number of public wires:          20
   Number of public wire bits:     295
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                715
     $_DFFE_PP0P_                  200
     $lut                          471
     adder_carry                    44


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.35. Executing TECHMAP pass (map to technology primitives).

3.35.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.35.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.35.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~1007 debug messages>

yosys> opt_expr -mux_undef

3.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~8103 debug messages>

yosys> simplemap

3.37. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.38. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.39. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~9270 debug messages>
Removed a total of 3090 cells.

yosys> opt_dff -nodffe -nosdff

3.40. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.41. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1998 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.42. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.42.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~81 debug messages>

yosys> opt_merge -nomux

3.42.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.42.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.42.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.42.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 6 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.42.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.42.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.42.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.42.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.42.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.42.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.42.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.43. Executing ABC pass (technology mapping using ABC).

3.43.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 3530 gates and 3734 wires to a netlist network with 202 inputs and 235 outputs.

3.43.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/yosys_verific_rs/result_04-05-2022T15-08-45/Golden_synth_rs_ade.json/rgb2ycrcb/abc_tmp.scr 
ABC:   #Luts =   473  Max Lvl =  12  Avg Lvl =   4.50  [   0.87 sec. at Pass 0]
ABC:   #Luts =   472  Max Lvl =  11  Avg Lvl =   4.47  [  16.08 sec. at Pass 1]
ABC:   #Luts =   472  Max Lvl =  11  Avg Lvl =   4.47  [   2.70 sec. at Pass 2]
ABC:   #Luts =   472  Max Lvl =  11  Avg Lvl =   4.47  [  42.65 sec. at Pass 3]
ABC:   #Luts =   472  Max Lvl =  11  Avg Lvl =   4.47  [   4.22 sec. at Pass 4]
ABC:   #Luts =   472  Max Lvl =  11  Avg Lvl =   4.47  [  55.29 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.43.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      472
ABC RESULTS:        internal signals:     3297
ABC RESULTS:           input signals:      202
ABC RESULTS:          output signals:      235
Removing temp directory.

yosys> opt

3.44. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.44.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.44.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.44.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.44.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.44.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.44.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.44.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1888 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.44.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.44.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.44.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.44.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.44.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.44.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.44.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.44.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.44.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.45. Executing HIERARCHY pass (managing design hierarchy).

3.45.1. Analyzing design hierarchy..
Top module:  \top

3.45.2. Analyzing design hierarchy..
Top module:  \top
Removed 0 unused modules.

yosys> stat

3.46. Printing statistics.

=== top ===

   Number of wires:                342
   Number of wire bits:           1564
   Number of public wires:          20
   Number of public wire bits:     295
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                716
     $lut                          472
     adder_carry                    44
     dffsre                        200


yosys> opt_clean -purge

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> write_verilog -noattr -nohex synthesized.v

3.48. Executing Verilog backend.

yosys> bmuxmap

3.48.1. Executing BMUXMAP pass.

yosys> demuxmap

3.48.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\top'.

Warnings: 15 unique messages, 15 total
End of script. Logfile hash: 3a8712c0d6, CPU: user 8.72s system 0.12s, MEM: 44.47 MB peak
Yosys 0.16+6 (git sha1 7f5477eb1, gcc 9.1.0 -fPIC -Os)
Time spent: 99% 2x abc (1514 sec), 0% 41x opt_expr (3 sec), ...
real 485.12
user 1454.41
sys 68.40
