
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.32
 Yosys 0.16+65 (git sha1 7987105a9, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl b10.vhd

yosys> verific -vhdl b10.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'b10.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-INFO [VHDL-1012] b10.vhd:1: analyzing entity 'b10'
VERIFIC-INFO [VHDL-1010] b10.vhd:19: analyzing architecture 'behav'

yosys> synth_rs -top b10 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.50

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top b10

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] b10.vhd:1: processing 'b10(BEHAV)'
Importing module b10.

3.3.1. Analyzing design hierarchy..
Top module:  \b10

3.3.2. Analyzing design hierarchy..
Top module:  \b10
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.
<suppressed ~13 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..
Removed 3 unused cells and 21 unused wires.
<suppressed ~18 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module b10...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
      Replacing known input bits on port B of cell $verific$i37$b10.vhd:111$120: \key -> 1'1
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~28 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$voto3_reg$b10.vhd:165$179 ($aldff) from module b10.
Changing const-value async load to async reset on $verific$voto2_reg$b10.vhd:165$178 ($aldff) from module b10.
Changing const-value async load to async reset on $verific$voto1_reg$b10.vhd:165$177 ($aldff) from module b10.
Changing const-value async load to async reset on $verific$voto0_reg$b10.vhd:165$176 ($aldff) from module b10.
Changing const-value async load to async reset on $verific$v_out_reg$b10.vhd:165$185 ($aldff) from module b10.
Changing const-value async load to async reset on $verific$stato_reg$b10.vhd:165$175 ($aldff) from module b10.
Changing const-value async load to async reset on $verific$sign_reg$b10.vhd:165$180 ($aldff) from module b10.
Changing const-value async load to async reset on $verific$last_r_reg$b10.vhd:165$182 ($aldff) from module b10.
Changing const-value async load to async reset on $verific$last_g_reg$b10.vhd:165$181 ($aldff) from module b10.
Changing const-value async load to async reset on $verific$cts_reg$b10.vhd:165$183 ($aldff) from module b10.
Changing const-value async load to async reset on $verific$ctr_reg$b10.vhd:165$184 ($aldff) from module b10.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~28 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~28 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $verific$sign_reg$b10.vhd:165$180 ($adff) from module b10.
Setting constant 0-bit at position 1 on $verific$sign_reg$b10.vhd:165$180 ($adff) from module b10.
Setting constant 0-bit at position 2 on $verific$sign_reg$b10.vhd:165$180 ($adff) from module b10.

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~28 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.13.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 4) from wire b10.$verific$n82$77.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module b10:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~28 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== b10 ===

   Number of wires:                 88
   Number of wire bits:            142
   Number of public wires:          21
   Number of public wire bits:      33
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 77
     $adff                          11
     $and                            8
     $bmux                          11
     $mux                           36
     $not                            7
     $xor                            4


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.21.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> memory_share

3.21.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> memory_collect

3.21.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== b10 ===

   Number of wires:                 88
   Number of wire bits:            142
   Number of public wires:          21
   Number of public wire bits:      33
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 77
     $adff                          11
     $and                            8
     $bmux                          11
     $mux                           36
     $not                            7
     $xor                            4


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> stat

3.24. Printing statistics.

=== b10 ===

   Number of wires:                 88
   Number of wire bits:            142
   Number of public wires:          21
   Number of public wire bits:      33
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 77
     $adff                          11
     $and                            8
     $bmux                          11
     $mux                           36
     $not                            7
     $xor                            4


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $bmux.
No more expansions possible.
<suppressed ~148 debug messages>

yosys> stat

3.26. Printing statistics.

=== b10 ===

   Number of wires:                132
   Number of wire bits:            442
   Number of public wires:          21
   Number of public wire bits:      33
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                403
     $_AND_                          8
     $_DFF_PP0_                     17
     $_MUX_                        367
     $_NOT_                          7
     $_XOR_                          4


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.
<suppressed ~129 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
<suppressed ~39 debug messages>
Removed a total of 13 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..
Removed 3 unused cells and 12 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$719 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$699 [3], Q = \v_out [3]).
Adding EN signal on $auto$ff.cc:262:slice$718 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$699 [2], Q = \v_out [2]).
Adding EN signal on $auto$ff.cc:262:slice$717 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$699 [1], Q = \v_out [1]).
Adding EN signal on $auto$ff.cc:262:slice$716 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$699 [0], Q = \v_out [0]).
Adding EN signal on $auto$ff.cc:262:slice$715 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$472, Q = \ctr).
Adding EN signal on $auto$ff.cc:262:slice$714 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$453, Q = \cts).
Adding EN signal on $auto$ff.cc:262:slice$713 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$638, Q = \last_r).
Adding EN signal on $auto$ff.cc:262:slice$712 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$619, Q = \last_g).
Adding EN signal on $auto$ff.cc:262:slice$711 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$434, Q = \voto3).
Adding EN signal on $auto$ff.cc:262:slice$710 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$415, Q = \voto2).
Adding EN signal on $auto$ff.cc:262:slice$709 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$396, Q = \voto1).
Adding EN signal on $auto$ff.cc:262:slice$708 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$377, Q = \voto0).
Adding EN signal on $auto$ff.cc:262:slice$707 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$597 [3], Q = \stato [3]).
Adding EN signal on $auto$ff.cc:262:slice$706 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$597 [2], Q = \stato [2]).
Adding EN signal on $auto$ff.cc:262:slice$705 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$597 [1], Q = \stato [1]).
Adding EN signal on $auto$ff.cc:262:slice$704 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$597 [0], Q = \stato [0]).
Adding EN signal on $auto$ff.cc:262:slice$273 ($_DFF_PP0_) from module b10 (D = $auto$simplemap.cc:309:simplemap_bmux$533 [3], Q = \sign [3]).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..
Removed 0 unused cells and 134 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.
<suppressed ~521 debug messages>

3.27.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.27.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
<suppressed ~1689 debug messages>
Removed a total of 563 cells.

yosys> opt_dff

3.27.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..
Removed 0 unused cells and 538 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.27.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.27.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> opt_expr

3.27.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.27.30. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.
<suppressed ~120 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
<suppressed ~15 debug messages>
Removed a total of 5 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..
Removed 0 unused cells and 50 unused wires.
<suppressed ~1 debug messages>

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.
<suppressed ~13 debug messages>

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.30.10. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt -sat

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.32.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  9 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1066, arst=\reset, srst={ }
  7 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$2653, arst=\reset, srst={ }
  56 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$2298, arst=\reset, srst={ }
  69 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$2151, arst=\reset, srst={ }
  10 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$2038, arst=\reset, srst={ }
  12 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1932, arst=\reset, srst={ }
  9 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1777, arst=\reset, srst={ }
  13 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1624, arst=\reset, srst={ }
  14 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1379, arst=\reset, srst={ }
  10 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1272, arst=\reset, srst={ }
  11 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1191, arst=\reset, srst={ }

3.33.2. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1066, asynchronously reset by \reset
Extracted 9 gates and 19 wires to a netlist network with 10 inputs and 5 outputs.

3.33.2.1. Executing ABC.

3.33.3. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2653, asynchronously reset by \reset
Extracted 7 gates and 14 wires to a netlist network with 7 inputs and 2 outputs.

3.33.3.1. Executing ABC.

3.33.4. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2298, asynchronously reset by \reset
Extracted 56 gates and 97 wires to a netlist network with 39 inputs and 36 outputs.

3.33.4.1. Executing ABC.

3.33.5. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2151, asynchronously reset by \reset
Extracted 69 gates and 110 wires to a netlist network with 40 inputs and 39 outputs.

3.33.5.1. Executing ABC.

3.33.6. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2038, asynchronously reset by \reset
Extracted 10 gates and 20 wires to a netlist network with 10 inputs and 7 outputs.

3.33.6.1. Executing ABC.

3.33.7. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1932, asynchronously reset by \reset
Extracted 12 gates and 24 wires to a netlist network with 12 inputs and 6 outputs.

3.33.7.1. Executing ABC.

3.33.8. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1777, asynchronously reset by \reset
Extracted 9 gates and 18 wires to a netlist network with 9 inputs and 4 outputs.

3.33.8.1. Executing ABC.

3.33.9. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1624, asynchronously reset by \reset
Extracted 13 gates and 25 wires to a netlist network with 12 inputs and 7 outputs.

3.33.9.1. Executing ABC.

3.33.10. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1379, asynchronously reset by \reset
Extracted 14 gates and 26 wires to a netlist network with 12 inputs and 4 outputs.

3.33.10.1. Executing ABC.

3.33.11. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1272, asynchronously reset by \reset
Extracted 10 gates and 18 wires to a netlist network with 8 inputs and 5 outputs.

3.33.11.1. Executing ABC.

3.33.12. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1191, asynchronously reset by \reset
Extracted 11 gates and 23 wires to a netlist network with 12 inputs and 5 outputs.

3.33.12.1. Executing ABC.

yosys> abc -dff

3.34. Executing ABC pass (technology mapping using ABC).

3.34.1. Summary of detected clock domains:
  9 cells in clk=\clock, en=$abc$3140$auto$opt_dff.cc:219:make_patterns_logic$2653, arst=\reset, srst={ }
  46 cells in clk=\clock, en=$abc$3149$auto$opt_dff.cc:219:make_patterns_logic$2298, arst=\reset, srst={ }
  9 cells in clk=\clock, en=$abc$3344$auto$opt_dff.cc:219:make_patterns_logic$1272, arst=\reset, srst={ }
  14 cells in clk=\clock, en=$abc$3285$auto$opt_dff.cc:219:make_patterns_logic$1932, arst=\reset, srst={ }
  11 cells in clk=\clock, en=$abc$3312$auto$opt_dff.cc:219:make_patterns_logic$1624, arst=\reset, srst={ }
  13 cells in clk=\clock, en=$abc$3300$auto$opt_dff.cc:219:make_patterns_logic$1777, arst=\reset, srst={ }
  15 cells in clk=\clock, en=$abc$3272$auto$opt_dff.cc:219:make_patterns_logic$2038, arst=\reset, srst={ }
  10 cells in clk=\clock, en=$abc$3122$auto$opt_dff.cc:219:make_patterns_logic$1066, arst=\reset, srst={ }
  15 cells in clk=\clock, en=$abc$3327$auto$opt_dff.cc:219:make_patterns_logic$1379, arst=\reset, srst={ }
  59 cells in clk=\clock, en=$abc$3207$auto$opt_dff.cc:219:make_patterns_logic$2151, arst=\reset, srst={ }
  10 cells in clk=\clock, en=$abc$3357$auto$opt_dff.cc:219:make_patterns_logic$1191, arst=\reset, srst={ }

3.34.2. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3140$auto$opt_dff.cc:219:make_patterns_logic$2653, asynchronously reset by \reset
Extracted 9 gates and 17 wires to a netlist network with 8 inputs and 3 outputs.

3.34.2.1. Executing ABC.

3.34.3. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3149$auto$opt_dff.cc:219:make_patterns_logic$2298, asynchronously reset by \reset
Extracted 46 gates and 77 wires to a netlist network with 31 inputs and 31 outputs.

3.34.3.1. Executing ABC.

3.34.4. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3344$auto$opt_dff.cc:219:make_patterns_logic$1272, asynchronously reset by \reset
Extracted 9 gates and 17 wires to a netlist network with 8 inputs and 4 outputs.

3.34.4.1. Executing ABC.

3.34.5. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3285$auto$opt_dff.cc:219:make_patterns_logic$1932, asynchronously reset by \reset
Extracted 14 gates and 28 wires to a netlist network with 14 inputs and 6 outputs.

3.34.5.1. Executing ABC.

3.34.6. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3312$auto$opt_dff.cc:219:make_patterns_logic$1624, asynchronously reset by \reset
Extracted 11 gates and 20 wires to a netlist network with 9 inputs and 6 outputs.

3.34.6.1. Executing ABC.

3.34.7. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3300$auto$opt_dff.cc:219:make_patterns_logic$1777, asynchronously reset by \reset
Extracted 13 gates and 26 wires to a netlist network with 13 inputs and 6 outputs.

3.34.7.1. Executing ABC.

3.34.8. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3272$auto$opt_dff.cc:219:make_patterns_logic$2038, asynchronously reset by \reset
Extracted 15 gates and 28 wires to a netlist network with 13 inputs and 11 outputs.

3.34.8.1. Executing ABC.

3.34.9. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3122$auto$opt_dff.cc:219:make_patterns_logic$1066, asynchronously reset by \reset
Extracted 10 gates and 21 wires to a netlist network with 11 inputs and 5 outputs.

3.34.9.1. Executing ABC.

3.34.10. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3327$auto$opt_dff.cc:219:make_patterns_logic$1379, asynchronously reset by \reset
Extracted 15 gates and 27 wires to a netlist network with 12 inputs and 5 outputs.

3.34.10.1. Executing ABC.

3.34.11. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3207$auto$opt_dff.cc:219:make_patterns_logic$2151, asynchronously reset by \reset
Extracted 59 gates and 97 wires to a netlist network with 38 inputs and 30 outputs.

3.34.11.1. Executing ABC.

3.34.12. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3357$auto$opt_dff.cc:219:make_patterns_logic$1191, asynchronously reset by \reset
Extracted 10 gates and 21 wires to a netlist network with 11 inputs and 4 outputs.

3.34.12.1. Executing ABC.

yosys> abc -dff

3.35. Executing ABC pass (technology mapping using ABC).

3.35.1. Summary of detected clock domains:
  9 cells in clk=\clock, en=$abc$3371$abc$3140$auto$opt_dff.cc:219:make_patterns_logic$2653, arst=\reset, srst={ }
  13 cells in clk=\clock, en=$abc$3427$abc$3344$auto$opt_dff.cc:219:make_patterns_logic$1272, arst=\reset, srst={ }
  18 cells in clk=\clock, en=$abc$3439$abc$3285$auto$opt_dff.cc:219:make_patterns_logic$1932, arst=\reset, srst={ }
  12 cells in clk=\clock, en=$abc$3456$abc$3312$auto$opt_dff.cc:219:make_patterns_logic$1624, arst=\reset, srst={ }
  18 cells in clk=\clock, en=$abc$3470$abc$3300$auto$opt_dff.cc:219:make_patterns_logic$1777, arst=\reset, srst={ }
  18 cells in clk=\clock, en=$abc$3486$abc$3272$auto$opt_dff.cc:219:make_patterns_logic$2038, arst=\reset, srst={ }
  39 cells in clk=\clock, en=$abc$3382$abc$3149$auto$opt_dff.cc:219:make_patterns_logic$2298, arst=\reset, srst={ }
  50 cells in clk=\clock, en=$abc$3541$abc$3207$auto$opt_dff.cc:219:make_patterns_logic$2151, arst=\reset, srst={ }
  11 cells in clk=\clock, en=$abc$3504$abc$3122$auto$opt_dff.cc:219:make_patterns_logic$1066, arst=\reset, srst={ }
  13 cells in clk=\clock, en=$abc$3523$abc$3327$auto$opt_dff.cc:219:make_patterns_logic$1379, arst=\reset, srst={ }
  10 cells in clk=\clock, en=$abc$3606$abc$3357$auto$opt_dff.cc:219:make_patterns_logic$1191, arst=\reset, srst={ }

3.35.2. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3371$abc$3140$auto$opt_dff.cc:219:make_patterns_logic$2653, asynchronously reset by \reset
Extracted 9 gates and 17 wires to a netlist network with 8 inputs and 3 outputs.

3.35.2.1. Executing ABC.

3.35.3. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3427$abc$3344$auto$opt_dff.cc:219:make_patterns_logic$1272, asynchronously reset by \reset
Extracted 13 gates and 23 wires to a netlist network with 10 inputs and 4 outputs.

3.35.3.1. Executing ABC.

3.35.4. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3439$abc$3285$auto$opt_dff.cc:219:make_patterns_logic$1932, asynchronously reset by \reset
Extracted 18 gates and 36 wires to a netlist network with 18 inputs and 6 outputs.

3.35.4.1. Executing ABC.

3.35.5. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3456$abc$3312$auto$opt_dff.cc:219:make_patterns_logic$1624, asynchronously reset by \reset
Extracted 12 gates and 25 wires to a netlist network with 13 inputs and 6 outputs.

3.35.5.1. Executing ABC.

3.35.6. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3470$abc$3300$auto$opt_dff.cc:219:make_patterns_logic$1777, asynchronously reset by \reset
Extracted 18 gates and 35 wires to a netlist network with 17 inputs and 6 outputs.

3.35.6.1. Executing ABC.

3.35.7. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3486$abc$3272$auto$opt_dff.cc:219:make_patterns_logic$2038, asynchronously reset by \reset
Extracted 18 gates and 34 wires to a netlist network with 16 inputs and 9 outputs.

3.35.7.1. Executing ABC.

3.35.8. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3382$abc$3149$auto$opt_dff.cc:219:make_patterns_logic$2298, asynchronously reset by \reset
Extracted 39 gates and 68 wires to a netlist network with 29 inputs and 28 outputs.

3.35.8.1. Executing ABC.

3.35.9. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3541$abc$3207$auto$opt_dff.cc:219:make_patterns_logic$2151, asynchronously reset by \reset
Extracted 50 gates and 81 wires to a netlist network with 31 inputs and 31 outputs.

3.35.9.1. Executing ABC.

3.35.10. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3504$abc$3122$auto$opt_dff.cc:219:make_patterns_logic$1066, asynchronously reset by \reset
Extracted 11 gates and 23 wires to a netlist network with 12 inputs and 6 outputs.

3.35.10.1. Executing ABC.

3.35.11. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3523$abc$3327$auto$opt_dff.cc:219:make_patterns_logic$1379, asynchronously reset by \reset
Extracted 13 gates and 25 wires to a netlist network with 12 inputs and 3 outputs.

3.35.11.1. Executing ABC.

3.35.12. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3606$abc$3357$auto$opt_dff.cc:219:make_patterns_logic$1191, asynchronously reset by \reset
Extracted 10 gates and 21 wires to a netlist network with 11 inputs and 4 outputs.

3.35.12.1. Executing ABC.

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  9 cells in clk=\clock, en=$abc$3619$abc$3371$abc$3140$auto$opt_dff.cc:219:make_patterns_logic$2653, arst=\reset, srst={ }
  15 cells in clk=\clock, en=$abc$3630$abc$3427$abc$3344$auto$opt_dff.cc:219:make_patterns_logic$1272, arst=\reset, srst={ }
  16 cells in clk=\clock, en=$abc$3646$abc$3439$abc$3285$auto$opt_dff.cc:219:make_patterns_logic$1932, arst=\reset, srst={ }
  11 cells in clk=\clock, en=$abc$3665$abc$3456$abc$3312$auto$opt_dff.cc:219:make_patterns_logic$1624, arst=\reset, srst={ }
  14 cells in clk=\clock, en=$abc$3679$abc$3470$abc$3300$auto$opt_dff.cc:219:make_patterns_logic$1777, arst=\reset, srst={ }
  17 cells in clk=\clock, en=$abc$3697$abc$3486$abc$3272$auto$opt_dff.cc:219:make_patterns_logic$2038, arst=\reset, srst={ }
  52 cells in clk=\clock, en=$abc$3716$abc$3382$abc$3149$auto$opt_dff.cc:219:make_patterns_logic$2298, arst=\reset, srst={ }
  41 cells in clk=\clock, en=$abc$3758$abc$3541$abc$3207$auto$opt_dff.cc:219:make_patterns_logic$2151, arst=\reset, srst={ }
  11 cells in clk=\clock, en=$abc$3811$abc$3504$abc$3122$auto$opt_dff.cc:219:make_patterns_logic$1066, arst=\reset, srst={ }
  13 cells in clk=\clock, en=$abc$3831$abc$3523$abc$3327$auto$opt_dff.cc:219:make_patterns_logic$1379, arst=\reset, srst={ }
  10 cells in clk=\clock, en=$abc$3847$abc$3606$abc$3357$auto$opt_dff.cc:219:make_patterns_logic$1191, arst=\reset, srst={ }

3.36.2. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3619$abc$3371$abc$3140$auto$opt_dff.cc:219:make_patterns_logic$2653, asynchronously reset by \reset
Extracted 9 gates and 18 wires to a netlist network with 9 inputs and 3 outputs.

3.36.2.1. Executing ABC.

3.36.3. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3630$abc$3427$abc$3344$auto$opt_dff.cc:219:make_patterns_logic$1272, asynchronously reset by \reset
Extracted 15 gates and 25 wires to a netlist network with 10 inputs and 5 outputs.

3.36.3.1. Executing ABC.

3.36.4. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3646$abc$3439$abc$3285$auto$opt_dff.cc:219:make_patterns_logic$1932, asynchronously reset by \reset
Extracted 16 gates and 33 wires to a netlist network with 17 inputs and 6 outputs.

3.36.4.1. Executing ABC.

3.36.5. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3665$abc$3456$abc$3312$auto$opt_dff.cc:219:make_patterns_logic$1624, asynchronously reset by \reset
Extracted 11 gates and 23 wires to a netlist network with 12 inputs and 5 outputs.

3.36.5.1. Executing ABC.

3.36.6. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3679$abc$3470$abc$3300$auto$opt_dff.cc:219:make_patterns_logic$1777, asynchronously reset by \reset
Extracted 14 gates and 29 wires to a netlist network with 15 inputs and 5 outputs.

3.36.6.1. Executing ABC.

3.36.7. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3697$abc$3486$abc$3272$auto$opt_dff.cc:219:make_patterns_logic$2038, asynchronously reset by \reset
Extracted 17 gates and 32 wires to a netlist network with 15 inputs and 9 outputs.

3.36.7.1. Executing ABC.

3.36.8. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3716$abc$3382$abc$3149$auto$opt_dff.cc:219:make_patterns_logic$2298, asynchronously reset by \reset
Extracted 52 gates and 81 wires to a netlist network with 29 inputs and 29 outputs.

3.36.8.1. Executing ABC.

3.36.9. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3758$abc$3541$abc$3207$auto$opt_dff.cc:219:make_patterns_logic$2151, asynchronously reset by \reset
Extracted 41 gates and 67 wires to a netlist network with 26 inputs and 28 outputs.

3.36.9.1. Executing ABC.

3.36.10. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3811$abc$3504$abc$3122$auto$opt_dff.cc:219:make_patterns_logic$1066, asynchronously reset by \reset
Extracted 11 gates and 23 wires to a netlist network with 12 inputs and 6 outputs.

3.36.10.1. Executing ABC.

3.36.11. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3831$abc$3523$abc$3327$auto$opt_dff.cc:219:make_patterns_logic$1379, asynchronously reset by \reset
Extracted 13 gates and 25 wires to a netlist network with 12 inputs and 3 outputs.

3.36.11.1. Executing ABC.

3.36.12. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$3847$abc$3606$abc$3357$auto$opt_dff.cc:219:make_patterns_logic$1191, asynchronously reset by \reset
Extracted 10 gates and 21 wires to a netlist network with 11 inputs and 4 outputs.

3.36.12.1. Executing ABC.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

yosys> opt_merge -nomux

3.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_muxtree

3.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..
Removed 0 unused cells and 1579 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> opt_expr

3.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.38.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_eRp6QD/abc_tmp_1.scr

3.39. Executing ABC pass (technology mapping using ABC).

3.39.1. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Extracted 192 gates and 215 wires to a netlist network with 23 inputs and 21 outputs.

3.39.1.1. Executing ABC.
DE:   #PIs =  23  #Luts =    36  Max Lvl =   4  Avg Lvl =   1.67  [   0.20 sec. at Pass 0]
DE:   #PIs =  23  #Luts =    30  Max Lvl =   4  Avg Lvl =   1.67  [   1.85 sec. at Pass 1]
DE:   #PIs =  23  #Luts =    30  Max Lvl =   4  Avg Lvl =   1.67  [   0.46 sec. at Pass 2]
DE:   #PIs =  23  #Luts =    29  Max Lvl =   3  Avg Lvl =   1.57  [   0.61 sec. at Pass 3]
DE:   #PIs =  23  #Luts =    29  Max Lvl =   3  Avg Lvl =   1.57  [   0.36 sec. at Pass 4]
DE:   #PIs =  23  #Luts =    29  Max Lvl =   3  Avg Lvl =   1.57  [   0.79 sec. at Pass 5]
DE:   #PIs =  23  #Luts =    29  Max Lvl =   3  Avg Lvl =   1.57  [   0.79 sec. at Pass 6]
DE:   #PIs =  23  #Luts =    28  Max Lvl =   3  Avg Lvl =   1.52  [   1.66 sec. at Pass 7]
DE:   #PIs =  23  #Luts =    28  Max Lvl =   3  Avg Lvl =   1.52  [   1.38 sec. at Pass 8]
DE:   #PIs =  23  #Luts =    28  Max Lvl =   3  Avg Lvl =   1.52  [   1.13 sec. at Pass 9]
DE:   #PIs =  23  #Luts =    28  Max Lvl =   3  Avg Lvl =   1.52  [   1.22 sec. at Pass 10]
DE:   #PIs =  23  #Luts =    28  Max Lvl =   3  Avg Lvl =   1.52  [   1.80 sec. at Pass 11]
DE:   #PIs =  23  #Luts =    28  Max Lvl =   3  Avg Lvl =   1.52  [   1.03 sec. at Pass 12]

yosys> opt

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..
Removed 0 unused cells and 215 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.42. Printing statistics.

=== b10 ===

   Number of wires:                 53
   Number of wire bits:             65
   Number of public wires:          19
   Number of public wire bits:      31
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 45
     $_DFFE_PP0P_                   17
     $lut                           28


yosys> shregmap -minlen 8 -maxlen 20

3.43. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.45. Printing statistics.

=== b10 ===

   Number of wires:                 53
   Number of wire bits:             65
   Number of public wires:          19
   Number of public wire bits:      31
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 45
     $_DFFE_PP0P_                   17
     $lut                           28


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.46. Executing TECHMAP pass (map to technology primitives).

3.46.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.46.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.46.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~198 debug messages>

yosys> opt_expr -mux_undef

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.
<suppressed ~892 debug messages>

yosys> simplemap

3.48. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

yosys> opt_merge

3.50. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
<suppressed ~150 debug messages>
Removed a total of 50 cells.

yosys> opt_dff -nodffe -nosdff

3.51. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..
Removed 0 unused cells and 149 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.53. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.53.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.
<suppressed ~8 debug messages>

yosys> opt_merge -nomux

3.53.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.53.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.53.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..
Removed 0 unused cells and 5 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.53.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.53.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.53.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.53.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> opt_expr

3.53.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.53.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_eRp6QD/abc_tmp_2.scr

3.54. Executing ABC pass (technology mapping using ABC).

3.54.1. Extracting gate netlist of module `\b10' to `<abc-temp-dir>/input.blif'..
Extracted 163 gates and 189 wires to a netlist network with 24 inputs and 22 outputs.

3.54.1.1. Executing ABC.
DE:   #PIs =  24  #Luts =    29  Max Lvl =   3  Avg Lvl =   1.45  [   0.37 sec. at Pass 0]
DE:   #PIs =  24  #Luts =    29  Max Lvl =   3  Avg Lvl =   1.45  [   0.64 sec. at Pass 1]
DE:   #PIs =  24  #Luts =    29  Max Lvl =   3  Avg Lvl =   1.45  [   0.38 sec. at Pass 2]
DE:   #PIs =  24  #Luts =    29  Max Lvl =   3  Avg Lvl =   1.45  [   0.88 sec. at Pass 3]
DE:   #PIs =  24  #Luts =    29  Max Lvl =   3  Avg Lvl =   1.45  [   0.40 sec. at Pass 4]
DE:   #PIs =  24  #Luts =    29  Max Lvl =   3  Avg Lvl =   1.45  [   0.81 sec. at Pass 5]
DE:   #PIs =  24  #Luts =    29  Max Lvl =   3  Avg Lvl =   1.45  [   1.58 sec. at Pass 6]
DE:   #PIs =  24  #Luts =    29  Max Lvl =   3  Avg Lvl =   1.45  [   1.12 sec. at Pass 7]

yosys> opt

3.55. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.55.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

yosys> opt_merge -nomux

3.55.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.55.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.55.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..
Removed 0 unused cells and 140 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.55.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.55.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.55.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b10..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b10.
Performed a total of 0 changes.

yosys> opt_merge

3.55.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b10'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..

yosys> opt_expr

3.55.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b10.

3.55.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.56. Executing HIERARCHY pass (managing design hierarchy).

3.56.1. Analyzing design hierarchy..
Top module:  \b10

3.56.2. Analyzing design hierarchy..
Top module:  \b10
Removed 0 unused modules.

yosys> stat

3.57. Printing statistics.

=== b10 ===

   Number of wires:                 54
   Number of wire bits:             66
   Number of public wires:          19
   Number of public wire bits:      31
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 46
     $lut                           29
     dffsre                         17


yosys> opt_clean -purge

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b10..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.59. Executing Verilog backend.

yosys> bmuxmap

3.59.1. Executing BMUXMAP pass.

yosys> demuxmap

3.59.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\b10'.

End of script. Logfile hash: 1705febac1, CPU: user 1.74s system 0.15s, MEM: 21.79 MB peak
Yosys 0.16+65 (git sha1 7987105a9, gcc 9.1.0 -fPIC -Os)
Time spent: 99% 6x abc (184 sec), 0% 34x opt_expr (0 sec), ...
real 67.01
user 140.18
sys 45.87
