
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.16+6 (git sha1 0c82fb7e3, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k systemcdes.v GSCLib_3.0.v

yosys> verific -vlog2k systemcdes.v GSCLib_3.0.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'systemcdes.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'GSCLib_3.0.v'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:91: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:92: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:93: undeclared symbol 'I3_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:95: undeclared symbol 'I5_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:161: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:162: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:194: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:195: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:196: undeclared symbol 'I2_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:343: undeclared symbol 'I0_CLEAR', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:344: undeclared symbol 'I0_SET', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:345: undeclared symbol 'NET0131_', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:345: undeclared symbol 'D_', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:346: undeclared symbol 'P0001_', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:348: undeclared symbol 'NET0131', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:349: undeclared symbol 'P0001', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:352: undeclared symbol 'I12_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:353: undeclared symbol 'D_EQ_0_AN_RN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:354: undeclared symbol 'D_EQ_1_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:355: undeclared symbol 'RN_EQ_1_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:423: undeclared symbol 'P0001', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:424: undeclared symbol 'P0000', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:584: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:611: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:639: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:671: undeclared symbol 'I2_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:704: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:732: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:764: undeclared symbol 'I2_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:798: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:799: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:831: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:832: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:833: undeclared symbol 'I2_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:870: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:871: undeclared symbol 'I3_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:872: undeclared symbol 'I4_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:977: undeclared symbol 'I0_D', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:978: undeclared symbol 'I0_CLEAR', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:979: undeclared symbol 'I0_SET', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:980: undeclared symbol 'P0002', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:981: undeclared symbol 'P0000', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:984: undeclared symbol 'RN_EQ_1_AN_SE_EQ_1_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:985: undeclared symbol 'RN_EQ_1_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:986: undeclared symbol 'I12_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:987: undeclared symbol 'RN_EQ_1_AN_SE_EQ_0_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:1181: undeclared symbol 'I0_out', assumed default net type 'wire'

yosys> synth_rs -top systemcdes -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.2.36

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top systemcdes

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] systemcdes.v:43: compiling module 'systemcdes'
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:334: compiling module 'DFFSRX1'
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:58: compiling module 'mdff'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:409: specify block is ignored for synthesis
VERIFIC-WARNING [VDB-1002] GSCLib_3.0.v:341: net 'NOTIFIER' does not have a driver
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:606: compiling module 'NAND2X2'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:626: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:579: compiling module 'NAND2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:599: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:461: compiling module 'INVX1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:476: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:633: compiling module 'NAND3X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:657: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:699: compiling module 'NOR2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:719: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:664: compiling module 'NAND4X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:692: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:549: compiling module 'MX2X1'
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:73: compiling module 'mmux2'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:572: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:906: compiling module 'OR2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:925: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:483: compiling module 'INVX2'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:498: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:792: compiling module 'OAI21X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:817: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:155: compiling module 'AOI21X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:180: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:187: compiling module 'AOI22X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:217: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:129: compiling module 'AND2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:148: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:726: compiling module 'NOR3X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:750: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:505: compiling module 'INVX4'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:520: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:312: compiling module 'CLKBUFX3'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:327: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:268: compiling module 'CLKBUFX1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:283: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:290: compiling module 'CLKBUFX2'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:305: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:246: compiling module 'BUFX3'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:261: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:824: compiling module 'OAI22X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:854: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:224: compiling module 'BUFX1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:239: specify block is ignored for synthesis
Importing module systemcdes.
Importing module AND2X1.
Importing module AOI21X1.
Importing module AOI22X1.
Importing module BUFX1.
Importing module BUFX3.
Importing module CLKBUFX1.
Importing module CLKBUFX2.
Importing module CLKBUFX3.
Importing module DFFSRX1.
Importing module INVX1.
Importing module INVX2.
Importing module INVX4.
Importing module MX2X1.
Importing module NAND2X1.
Importing module NAND2X2.
Importing module NAND3X1.
Importing module NAND4X1.
Importing module NOR2X1.
Importing module NOR3X1.
Importing module OAI21X1.
Importing module OAI22X1.
Importing module OR2X1.
Importing module mdff.
Importing module mmux2.

3.3.1. Analyzing design hierarchy..
Top module:  \systemcdes
Used module:     \INVX2
Used module:     \CLKBUFX1
Used module:     \INVX1
Used module:     \CLKBUFX3
Used module:     \INVX4
Used module:     \NAND2X1
Used module:     \NAND2X2
Used module:     \NOR2X1
Used module:     \OAI21X1
Used module:     \MX2X1
Used module:         \mmux2
Used module:     \AND2X1
Used module:     \AOI21X1
Used module:     \NAND3X1
Used module:     \NAND4X1
Used module:     \OR2X1
Used module:     \BUFX1
Used module:     \CLKBUFX2
Used module:     \BUFX3
Used module:     \AOI22X1
Used module:     \OAI22X1
Used module:     \NOR3X1
Used module:     \DFFSRX1
Used module:         \mdff

3.3.2. Analyzing design hierarchy..
Top module:  \systemcdes
Used module:     \INVX2
Used module:     \CLKBUFX1
Used module:     \INVX1
Used module:     \CLKBUFX3
Used module:     \INVX4
Used module:     \NAND2X1
Used module:     \NAND2X2
Used module:     \NOR2X1
Used module:     \OAI21X1
Used module:     \MX2X1
Used module:         \mmux2
Used module:     \AND2X1
Used module:     \AOI21X1
Used module:     \NAND3X1
Used module:     \NAND4X1
Used module:     \OR2X1
Used module:     \BUFX1
Used module:     \CLKBUFX2
Used module:     \BUFX3
Used module:     \AOI22X1
Used module:     \OAI22X1
Used module:     \NOR3X1
Used module:     \DFFSRX1
Used module:         \mdff
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module mmux2.
Optimizing module mdff.
Optimizing module OR2X1.
Optimizing module OAI22X1.
Optimizing module OAI21X1.
Optimizing module NOR3X1.
Optimizing module NOR2X1.
Optimizing module NAND4X1.
Optimizing module NAND3X1.
Optimizing module NAND2X2.
Optimizing module NAND2X1.
Optimizing module MX2X1.
Optimizing module INVX4.
Optimizing module INVX2.
Optimizing module INVX1.
Optimizing module DFFSRX1.
Optimizing module CLKBUFX3.
Optimizing module CLKBUFX2.
Optimizing module CLKBUFX1.
Optimizing module BUFX3.
Optimizing module BUFX1.
Optimizing module AOI22X1.
Optimizing module AOI21X1.
Optimizing module AND2X1.
Optimizing module systemcdes.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module mmux2.
Deleting now unused module mdff.
Deleting now unused module OR2X1.
Deleting now unused module OAI22X1.
Deleting now unused module OAI21X1.
Deleting now unused module NOR3X1.
Deleting now unused module NOR2X1.
Deleting now unused module NAND4X1.
Deleting now unused module NAND3X1.
Deleting now unused module NAND2X2.
Deleting now unused module NAND2X1.
Deleting now unused module MX2X1.
Deleting now unused module INVX4.
Deleting now unused module INVX2.
Deleting now unused module INVX1.
Deleting now unused module DFFSRX1.
Deleting now unused module CLKBUFX3.
Deleting now unused module CLKBUFX2.
Deleting now unused module CLKBUFX1.
Deleting now unused module BUFX3.
Deleting now unused module BUFX1.
Deleting now unused module AOI22X1.
Deleting now unused module AOI21X1.
Deleting now unused module AND2X1.
<suppressed ~3325 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.
<suppressed ~2509 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..
Removed 1162 unused cells and 18379 unused wires.
<suppressed ~5486 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module systemcdes...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.
<suppressed ~148 debug messages>

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
<suppressed ~603 debug messages>
Removed a total of 201 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \systemcdes..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~178 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \systemcdes.
    New input vector for $reduce_and cell $flatten\g6980.$verific$i5$GSCLib_3.0.v:639$10246: { \g11417.A \g11417.B \g11417.C \g11417.D \g6980.A \g6980.C }
    New input vector for $reduce_and cell $flatten\g6945.$verific$i5$GSCLib_3.0.v:639$10246: { \g11252.B \g11252.C \g11251.A \g11249.A \g6945.A \g11252.D \g11249.B \g11248.B }
    New input vector for $reduce_and cell $flatten\g6915.$verific$i5$GSCLib_3.0.v:671$10248: { \g12786.Y \g12551.Y \g7182.B0 \g7226.B \g7226.C \g7226.D \g6915.A }
    New input vector for $reduce_and cell $flatten\g6911.$verific$i5$GSCLib_3.0.v:639$10246: { \g11838.A \g11838.B \g11838.C \g11838.D \g6911.A \g6911.C }
    New input vector for $reduce_and cell $flatten\g6886.$verific$i5$GSCLib_3.0.v:639$10246: { \g11823.A \g11823.B \g11823.D \g11822.I0_out \g11249.A \g6886.A }
    New input vector for $reduce_and cell $flatten\g12431.$verific$i5$GSCLib_3.0.v:639$10246: { \g12429.B \g6987.A \g6987.B \g6987.C \g6987.D \g12431.C }
    New input vector for $reduce_and cell $flatten\g12137.$verific$i5$GSCLib_3.0.v:671$10248: { \g12136.A \g7193.A \g7193.B \g12136.C \g12134.A \g7193.C }
    New input vector for $reduce_and cell $flatten\g12136.$verific$i5$GSCLib_3.0.v:639$10246: { \g12136.A \g7193.A \g7193.B \g12136.C \g7193.C }
    New input vector for $reduce_and cell $flatten\g6961.$verific$i5$GSCLib_3.0.v:639$10246: { \g12786.Y \g12551.Y \g7182.B0 \g7226.B \g7226.C \g7226.D }
    New input vector for $reduce_and cell $flatten\g6936.$verific$i5$GSCLib_3.0.v:671$10248: { \g12389.A \g12389.B \g12389.C \g12389.D \g6936.A \g6936.B \g6936.D }
    New input vector for $reduce_and cell $flatten\g6942.$verific$i5$GSCLib_3.0.v:671$10248: { \g7069.A \g7069.B \g7069.C \g6942.A \g6942.B \g6942.D \g7069.D }
  Optimizing cells in module \systemcdes.
Performed a total of 11 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
<suppressed ~129 debug messages>
Removed a total of 43 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\stage1_iter_reg[3].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\stage1_iter_reg[2].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\stage1_iter_reg[1].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\stage1_iter_reg[0].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\ready_o_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[9].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[8].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[7].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[6].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[5].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[4].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[3].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[31].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[30].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[2].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[29].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[28].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[27].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[26].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[25].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[24].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[23].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[22].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[21].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[20].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[1].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[19].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[18].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[17].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[16].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[15].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[14].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[13].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[12].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[11].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[10].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_R_o_reg[0].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[9].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[41].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[8].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[7].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[6].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[5].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[46].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[55].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[54].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[53].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[48].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[52].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[43].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[51].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[40].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[50].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[4].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[49].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[48].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[47].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[46].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[45].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[49].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[44].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[45].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[43].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[42].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[41].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[40].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[47].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[3].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[39].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[38].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[37].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[36].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[42].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[35].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[34].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[33].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[51].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[32].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[31].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[30].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[2].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[29].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[28].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[58].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[27].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[26].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[25].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[44].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[24].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[23].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[22].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[21].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[20].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[1].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[3].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[19].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[18].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[17].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[16].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[4].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[15].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[14].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[13].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[12].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[11].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[50].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[10].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\rd1_Key_o_reg[0].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[1].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[57].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[24].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[16].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[34].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[12].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[18].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[32].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[37].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[5].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[25].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[33].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[38].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[55].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[30].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[61].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[39].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[60].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[29].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[2].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[31].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[23].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[10].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[52].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[21].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[35].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[54].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[9].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[13].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[8].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[56].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[7].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[6].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[19].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[28].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[0].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[14].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[20].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[22].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[53].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[36].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[59].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[17].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[26].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[63].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[62].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[15].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[11].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.
Changing const-value async load to async reset on $flatten\data_o_reg[27].\df1.$verific$out_reg$GSCLib_3.0.v:67$10274 ($aldff) from module systemcdes.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..
Removed 26 unused cells and 631 unused wires.
<suppressed ~626 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \systemcdes..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~138 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \systemcdes.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \systemcdes..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~138 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \systemcdes.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

3.13.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module systemcdes:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \systemcdes..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~138 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \systemcdes.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

yosys> stat

3.22. Printing statistics.

=== systemcdes ===

   Number of wires:              17969
   Number of wire bits:          18158
   Number of public wires:       17968
   Number of public wire bits:   18157
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               4695
     $adff                         157
     $aldff                         33
     $and                         1470
     $mux                          146
     $not                         2055
     $or                           601
     $reduce_and                   226
     $reduce_or                      7


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.23. Executing TECHMAP pass (map to technology primitives).

3.23.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.23.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.23.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $aldff.
No more expansions possible.
<suppressed ~4766 debug messages>

yosys> stat

3.24. Printing statistics.

=== systemcdes ===

   Number of wires:              18446
   Number of wire bits:          18735
   Number of public wires:       17968
   Number of public wire bits:   18157
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               5039
     $_ALDFF_PN_                    33
     $_AND_                       2033
     $_DFF_PN1_                    157
     $_MUX_                        146
     $_NOT_                       2055
     $_OR_                         615


yosys> opt

3.25. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.25.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.25.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
<suppressed ~165 debug messages>
Removed a total of 55 cells.

yosys> opt_muxtree

3.25.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \systemcdes..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \systemcdes.
Performed a total of 0 changes.

yosys> opt_merge

3.25.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..
Removed 0 unused cells and 262 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.25.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

3.25.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.25.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \systemcdes..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \systemcdes.
Performed a total of 0 changes.

yosys> opt_merge

3.25.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

yosys> opt_expr

3.25.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

3.25.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

yosys> opt_merge

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_dff

3.26.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

3.26.5. Finished fast OPT passes.

yosys> memory_map

3.27. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \systemcdes..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \systemcdes.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_share

3.28.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.28.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

yosys> opt_expr -full

3.28.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

3.28.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.29. Executing ABC pass (technology mapping using ABC).

3.29.1. Summary of detected clock domains:
  4983 cells in clk=\clk, en={ }, arst=!\reset, srst={ }

3.29.2. Extracting gate netlist of module `\systemcdes' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by !\reset
Extracted 4950 gates and 5105 wires to a netlist network with 155 inputs and 98 outputs.

3.29.2.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/build/logic_synthesis-rs/bin/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.2.2. Re-integrating ABC results.
ABC RESULTS:               AND cells:      375
ABC RESULTS:            ANDNOT cells:       91
ABC RESULTS:               BUF cells:      129
ABC RESULTS:               DFF cells:      157
ABC RESULTS:               MUX cells:      361
ABC RESULTS:              NAND cells:      512
ABC RESULTS:               NOR cells:       43
ABC RESULTS:               NOT cells:       10
ABC RESULTS:                OR cells:      172
ABC RESULTS:             ORNOT cells:       96
ABC RESULTS:              XNOR cells:       49
ABC RESULTS:               XOR cells:       50
ABC RESULTS:        internal signals:     4852
ABC RESULTS:           input signals:      155
ABC RESULTS:          output signals:       98
Removing temp directory.

yosys> abc -script abc_tmp.scr

3.30. Executing ABC pass (technology mapping using ABC).

3.30.1. Extracting gate netlist of module `\systemcdes' to `<abc-temp-dir>/input.blif'..
Extracted 1759 gates and 2006 wires to a netlist network with 247 inputs and 126 outputs.

3.30.1.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/build/logic_synthesis-rs/bin/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/clean_repo/yosys_verific_rs/result_20-04-2022T11-33-54/All_lut_synth_rs_ade.json/systemcdes/abc_tmp.scr 
ABC:   #Luts =   333  Max Lvl =   8  Avg Lvl =   4.56  [   0.15 sec. at Pass 0]
ABC:   #Luts =   323  Max Lvl =   8  Avg Lvl =   4.51  [   4.03 sec. at Pass 1]
ABC:   #Luts =   323  Max Lvl =   8  Avg Lvl =   4.51  [   0.83 sec. at Pass 2]
ABC:   #Luts =   322  Max Lvl =   8  Avg Lvl =   4.60  [   1.05 sec. at Pass 3]
ABC:   #Luts =   322  Max Lvl =   8  Avg Lvl =   4.60  [   1.04 sec. at Pass 4]
ABC:   #Luts =   322  Max Lvl =   8  Avg Lvl =   4.60  [   1.38 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.30.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      322
ABC RESULTS:        internal signals:     1633
ABC RESULTS:           input signals:      247
ABC RESULTS:          output signals:      126
Removing temp directory.

yosys> opt

3.31. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.31.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

yosys> opt_merge -nomux

3.31.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.31.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \systemcdes..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.31.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \systemcdes.
Performed a total of 0 changes.

yosys> opt_merge

3.31.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_dff

3.31.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..
Removed 0 unused cells and 17876 unused wires.
<suppressed ~15273 debug messages>

yosys> opt_expr

3.31.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

3.31.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.31.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \systemcdes..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.31.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \systemcdes.
Performed a total of 0 changes.

yosys> opt_merge

3.31.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_dff

3.31.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

yosys> opt_expr

3.31.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

3.31.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.32. Printing statistics.

=== systemcdes ===

   Number of wires:               3077
   Number of wire bits:           3266
   Number of public wires:        2696
   Number of public wire bits:    2885
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                512
     $_ALDFF_PN_                    33
     $_DFF_PN0_                    157
     $lut                          322


yosys> shregmap -minlen 8 -maxlen 20

3.33. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.34. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.35. Printing statistics.

=== systemcdes ===

   Number of wires:               3143
   Number of wire bits:           3332
   Number of public wires:        2696
   Number of public wire bits:    2885
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                578
     $_DFFSR_PNN_                   33
     $_DFF_PN0_                    157
     $_ORNOT_                       33
     $_OR_                          33
     $lut                          322


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.36. Executing TECHMAP pass (map to technology primitives).

3.36.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.36.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.36.3. Continuing TECHMAP pass.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_DFFSR_PNN_ for cells of type $_DFFSR_PNN_.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~648 debug messages>

yosys> opt_expr -mux_undef

3.37. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.
<suppressed ~6564 debug messages>

yosys> simplemap

3.38. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.39. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

yosys> opt_merge

3.40. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
<suppressed ~4338 debug messages>
Removed a total of 1446 cells.

yosys> opt_dff -nodffe -nosdff

3.41. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..
Removed 0 unused cells and 1516 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.43. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.43.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.
<suppressed ~343 debug messages>

yosys> opt_merge -nomux

3.43.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.43.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \systemcdes..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.43.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \systemcdes.
Performed a total of 0 changes.

yosys> opt_merge

3.43.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.43.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.43.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..
Removed 0 unused cells and 36 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.43.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

3.43.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.43.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \systemcdes..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.43.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \systemcdes.
Performed a total of 0 changes.

yosys> opt_merge

3.43.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.43.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.43.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

yosys> opt_expr

3.43.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

3.43.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.44. Executing ABC pass (technology mapping using ABC).

3.44.1. Extracting gate netlist of module `\systemcdes' to `<abc-temp-dir>/input.blif'..
Extracted 1771 gates and 2021 wires to a netlist network with 248 inputs and 127 outputs.

3.44.1.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/build/logic_synthesis-rs/bin/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/clean_repo/yosys_verific_rs/result_20-04-2022T11-33-54/All_lut_synth_rs_ade.json/systemcdes/abc_tmp.scr 
ABC:   #Luts =   323  Max Lvl =   8  Avg Lvl =   4.56  [   0.19 sec. at Pass 0]
ABC:   #Luts =   323  Max Lvl =   6  Avg Lvl =   3.44  [   4.06 sec. at Pass 1]
ABC:   #Luts =   323  Max Lvl =   6  Avg Lvl =   3.44  [   0.88 sec. at Pass 2]
ABC:   #Luts =   323  Max Lvl =   6  Avg Lvl =   3.44  [   0.91 sec. at Pass 3]
ABC:   #Luts =   323  Max Lvl =   6  Avg Lvl =   3.44  [   0.80 sec. at Pass 4]
ABC:   #Luts =   323  Max Lvl =   6  Avg Lvl =   3.44  [   1.23 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.44.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      322
ABC RESULTS:        internal signals:     1646
ABC RESULTS:           input signals:      248
ABC RESULTS:          output signals:      127
Removing temp directory.

yosys> opt

3.45. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.45.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

yosys> opt_merge -nomux

3.45.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.45.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \systemcdes..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \systemcdes.
Performed a total of 0 changes.

yosys> opt_merge

3.45.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_dff

3.45.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..
Removed 0 unused cells and 1291 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.45.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

3.45.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.45.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \systemcdes..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \systemcdes.
Performed a total of 0 changes.

yosys> opt_merge

3.45.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\systemcdes'.
Removed a total of 0 cells.

yosys> opt_dff

3.45.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..

yosys> opt_expr

3.45.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module systemcdes.

3.45.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.46. Executing HIERARCHY pass (managing design hierarchy).

3.46.1. Analyzing design hierarchy..
Top module:  \systemcdes

3.46.2. Analyzing design hierarchy..
Top module:  \systemcdes
Removed 0 unused modules.

yosys> stat

3.47. Printing statistics.

=== systemcdes ===

   Number of wires:               3077
   Number of wire bits:           3266
   Number of public wires:        2696
   Number of public wire bits:    2885
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                512
     $lut                          322
     dffsre                        190


yosys> opt_clean -purge

3.48. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \systemcdes..
Removed 0 unused cells and 2558 unused wires.
<suppressed ~2558 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.49. Executing Verilog backend.

yosys> bmuxmap

3.49.1. Executing BMUXMAP pass.

yosys> demuxmap

3.49.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\systemcdes'.

Warnings: 23 unique messages, 23 total
End of script. Logfile hash: 4eba2c8803, CPU: user 15.17s system 0.12s, MEM: 64.35 MB peak
Yosys 0.16+6 (git sha1 0c82fb7e3, gcc 9.1.0 -fPIC -Os)
Time spent: 83% 3x abc (77 sec), 5% 22x opt_clean (5 sec), ...
real 33.11
user 83.71
sys 8.95
