
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.140
 Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl b08.vhd

yosys> verific -vhdl b08.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'b08.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-INFO [VHDL-1012] b08.vhd:1: analyzing entity 'b08'
VERIFIC-INFO [VHDL-1010] b08.vhd:12: analyzing architecture 'behav'

yosys> synth_rs -top b08 -tech genesis2 -goal area -de -verilog synthesized.v

3. Executing synth_rs pass: v0.4.116

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis2/cells_sim.v +/rapidsilicon/genesis2/dsp_sim.v +/rapidsilicon/genesis2/brams_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dff'.
Generating RTLIL representation for module `\dffn'.
Generating RTLIL representation for module `\sdff'.
Generating RTLIL representation for module `\sdffn'.
Generating RTLIL representation for module `\dffr'.
Generating RTLIL representation for module `\dffnr'.
Generating RTLIL representation for module `\dffe'.
Generating RTLIL representation for module `\dffne'.
Generating RTLIL representation for module `\sdffre'.
Generating RTLIL representation for module `\sdffnre'.
Generating RTLIL representation for module `\dffre'.
Generating RTLIL representation for module `\dffnre'.
Generating RTLIL representation for module `\latch'.
Generating RTLIL representation for module `\latchn'.
Generating RTLIL representation for module `\latchr'.
Generating RTLIL representation for module `\latchnr'.
Generating RTLIL representation for module `\fa_1bit'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP'.
Generating RTLIL representation for module `\RS_DSP_MULT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Successfully finished Verilog frontend.

3.4. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v' to AST representation.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\RS_TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top b08

3.5. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] b08.vhd:1: processing 'b08(BEHAV)'
Importing module b08.

3.5.1. Analyzing design hierarchy..
Top module:  \b08

3.5.2. Analyzing design hierarchy..
Top module:  \b08
Removed 0 unused modules.

yosys> proc

3.6. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.6.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.6.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.6.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.6.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.6.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.6.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.6.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.6.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.6.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.6.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.6.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.6.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
<suppressed ~5 debug messages>

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..
Removed 1 unused cells and 24 unused wires.
<suppressed ~18 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module b08...
Found and reported 0 problems.

yosys> opt_expr

3.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.

yosys> opt_merge -nomux

3.16. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b08..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce

3.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b08.
Performed a total of 0 changes.

yosys> opt_merge

3.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_share

3.20. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.21. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$STATO_reg$b08.vhd:86$119 ($aldff) from module b08.
Changing const-value async load to async reset on $verific$O_reg$b08.vhd:86$123 ($aldff) from module b08.
Changing const-value async load to async reset on $verific$OUT_R_reg$b08.vhd:86$122 ($aldff) from module b08.
Changing const-value async load to async reset on $verific$MAR_reg$b08.vhd:86$120 ($aldff) from module b08.
Changing const-value async load to async reset on $verific$IN_R_reg$b08.vhd:86$121 ($aldff) from module b08.

yosys> opt_clean

3.22. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.24. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.24.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.24.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.24.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..

yosys> fsm_opt

3.24.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.24.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.24.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.24.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.

yosys> opt_merge -nomux

3.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b08..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce

3.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b08.
Performed a total of 0 changes.

yosys> opt_merge

3.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_share

3.30. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.34. Executing WREDUCE pass (reducing word size of cells).
Removed top 2 bits (of 3) from port B of cell b08.$verific$add_92$b08.vhd:78$104 ($add).
Removed top 1 bits (of 4) from port Y of cell b08.$verific$add_92$b08.vhd:78$104 ($add).

yosys> peepopt

3.35. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.36. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> demuxmap

3.37. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> stat

3.38. Printing statistics.

=== b08 ===

   Number of wires:                 48
   Number of wire bits:            151
   Number of public wires:           9
   Number of public wire bits:      32
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 44
     $add                            1
     $adff                           5
     $and                            3
     $bmux                          22
     $eq                             1
     $mux                            7
     $ne                             1
     $not                            1
     $or                             3


yosys> wreduce t:$mul

3.39. Executing WREDUCE pass (reducing word size of cells).

yosys> rs_dsp_macc -genesis2 -max_dsp 154

3.40. Executing RS_DSP_MACC pass.

yosys> techmap -map +/mul2dsp_check_maxwidth.v -D DSP_A_MAXWIDTH=20 -D DSP_B_MAXWIDTH=18 -D DSP_A_MINWIDTH=11 -D DSP_B_MINWIDTH=10 -D DSP_NAME=$__RS_MUL20X18 a:valid_map

3.41. Executing TECHMAP pass (map to technology primitives).

3.41.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

3.41.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> stat

3.42. Printing statistics.

=== b08 ===

   Number of wires:                 48
   Number of wire bits:            151
   Number of public wires:           9
   Number of public wire bits:      32
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 44
     $add                            1
     $adff                           5
     $and                            3
     $bmux                          22
     $eq                             1
     $mux                            7
     $ne                             1
     $not                            1
     $or                             3


yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/rapidsilicon/genesis2/dsp_map.v -D USE_DSP_CFG_PARAMS=0

3.43. Executing TECHMAP pass (map to technology primitives).

3.43.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_MUL20X18'.
Successfully finished Verilog frontend.

3.43.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/dsp_final_map.v

3.44. Executing TECHMAP pass (map to technology primitives).

3.44.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v' to AST representation.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Successfully finished Verilog frontend.

3.44.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> rs-pack-dsp-regs

3.45. Executing rs_pack_dsp_regs pass.

yosys> rs_dsp_io_regs

3.46. Executing RS_DSP_IO_REGS pass.

yosys> alumacc

3.47. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module b08:
  creating $macc model for $verific$add_92$b08.vhd:78$104 ($add).
  creating $alu model for $macc $verific$add_92$b08.vhd:78$104.
  creating $alu cell for $verific$add_92$b08.vhd:78$104: $auto$alumacc.cc:485:replace_alu$125
  created 1 $alu and 0 $macc cells.

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.

yosys> opt_merge -nomux

3.49. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.50. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b08..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce

3.51. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b08.
Performed a total of 0 changes.

yosys> opt_merge

3.52. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_share

3.53. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.54. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..

yosys> opt_expr

3.56. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
MAX OPT ITERATION = 1

yosys> stat

3.57. Printing statistics.

=== b08 ===

   Number of wires:                 50
   Number of wire bits:            157
   Number of public wires:           9
   Number of public wire bits:      32
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 44
     $adff                           5
     $alu                            1
     $and                            3
     $bmux                          22
     $eq                             1
     $mux                            7
     $ne                             1
     $not                            1
     $or                             3


yosys> memory -nomap

3.58. Executing MEMORY pass.

yosys> opt_mem

3.58.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.58.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.58.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.58.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.58.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `$auto$memory_bmux2rom.cc:63:execute$164'[0] in module `\b08': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$161'[0] in module `\b08': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$158'[0] in module `\b08': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$155'[0] in module `\b08': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$152'[0] in module `\b08': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$149'[0] in module `\b08': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$146'[0] in module `\b08': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$143'[0] in module `\b08': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$140'[0] in module `\b08': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$137'[0] in module `\b08': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$134'[0] in module `\b08': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$131'[0] in module `\b08': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$128'[0] in module `\b08': no output FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$164'[0] in module `\b08': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$161'[0] in module `\b08': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$158'[0] in module `\b08': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$155'[0] in module `\b08': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$152'[0] in module `\b08': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$149'[0] in module `\b08': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$146'[0] in module `\b08': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$143'[0] in module `\b08': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$140'[0] in module `\b08': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$137'[0] in module `\b08': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$134'[0] in module `\b08': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$131'[0] in module `\b08': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$128'[0] in module `\b08': address FF has async set and/or reset, not supported.

yosys> opt_clean

3.58.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..

yosys> memory_share

3.58.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.58.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.58.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..

yosys> memory_collect

3.58.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.59. Printing statistics.

=== b08 ===

   Number of wires:                 50
   Number of wire bits:            157
   Number of public wires:           9
   Number of public wire bits:      32
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 44
     $adff                           5
     $alu                            1
     $and                            3
     $bmux                           9
     $eq                             1
     $mem_v2                        13
     $mux                            7
     $ne                             1
     $not                            1
     $or                             3


yosys> muxpack

3.60. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~6 debug messages>

yosys> opt_clean

3.61. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new_swap.txt -limit 150 a:read_swapped

3.62. Executing MEMORY_LIBMAP pass (mapping memories to cells).

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new.txt -limit 150

3.63. Executing MEMORY_LIBMAP pass (mapping memories to cells).
using FF mapping for memory b08.$auto$memory_bmux2rom.cc:63:execute$128
using FF mapping for memory b08.$auto$memory_bmux2rom.cc:63:execute$131
using FF mapping for memory b08.$auto$memory_bmux2rom.cc:63:execute$134
using FF mapping for memory b08.$auto$memory_bmux2rom.cc:63:execute$137
using FF mapping for memory b08.$auto$memory_bmux2rom.cc:63:execute$140
using FF mapping for memory b08.$auto$memory_bmux2rom.cc:63:execute$143
using FF mapping for memory b08.$auto$memory_bmux2rom.cc:63:execute$146
using FF mapping for memory b08.$auto$memory_bmux2rom.cc:63:execute$149
using FF mapping for memory b08.$auto$memory_bmux2rom.cc:63:execute$152
using FF mapping for memory b08.$auto$memory_bmux2rom.cc:63:execute$155
using FF mapping for memory b08.$auto$memory_bmux2rom.cc:63:execute$158
using FF mapping for memory b08.$auto$memory_bmux2rom.cc:63:execute$161
using FF mapping for memory b08.$auto$memory_bmux2rom.cc:63:execute$164
<suppressed ~78 debug messages>

yosys> rs_bram_split -new_mapping

3.64. Executing Rs_BRAM_Split pass.

yosys> techmap -autoproc -map +/rapidsilicon/genesis2/brams_map_new.v

3.65. Executing TECHMAP pass (map to technology primitives).

3.65.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v' to AST representation.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_SDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_SDP'.
Successfully finished Verilog frontend.

3.65.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~6 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/brams_final_map_new.v

3.66. Executing TECHMAP pass (map to technology primitives).

3.66.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v' to AST representation.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Successfully finished Verilog frontend.

3.66.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> pmuxtree

3.67. Executing PMUXTREE pass.

yosys> muxpack

3.68. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~6 debug messages>

yosys> memory_map

3.69. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory $auto$memory_bmux2rom.cc:63:execute$128 in module \b08:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$131 in module \b08:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$134 in module \b08:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$137 in module \b08:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$140 in module \b08:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$143 in module \b08:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$146 in module \b08:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$149 in module \b08:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$152 in module \b08:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$155 in module \b08:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$158 in module \b08:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$161 in module \b08:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$164 in module \b08:
  created 8 $dff cells and 0 static cells of width 2.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.

yosys> stat

3.70. Printing statistics.

=== b08 ===

   Number of wires:                440
   Number of wire bits:            577
   Number of public wires:           9
   Number of public wire bits:      32
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                226
     $adff                           5
     $alu                            1
     $and                            3
     $bmux                           9
     $dff                          104
     $eq                             1
     $mux                           98
     $ne                             1
     $not                            1
     $or                             3


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/arith_map.v

3.71. Executing TECHMAP pass (map to technology primitives).

3.71.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.71.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.71.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using template $paramod$3ef7d3dd227da7627a99c5e5a6a4deb817573e39\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000011 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
No more expansions possible.
<suppressed ~523 debug messages>

yosys> stat

3.72. Printing statistics.

=== b08 ===

   Number of wires:                494
   Number of wire bits:           1823
   Number of public wires:           9
   Number of public wire bits:      32
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                422
     $_AND_                         30
     $_DFF_PP0_                     21
     $_DFF_P_                      112
     $_MUX_                        197
     $_NOT_                         12
     $_OR_                          32
     $_XOR_                         18


yosys> opt_expr

3.73. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
<suppressed ~50 debug messages>

yosys> opt_merge -nomux

3.74. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
<suppressed ~18 debug messages>
Removed a total of 6 cells.

yosys> opt_muxtree

3.75. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b08..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.76. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b08.
Performed a total of 0 changes.

yosys> opt_merge

3.77. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_share

3.78. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.79. Executing OPT_DFF pass (perform DFF optimizations).
Handling const CLK on $auto$ff.cc:262:slice$1029 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1027 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1025 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$912 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$795 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$804 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$790 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$791 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$794 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1022 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1024 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$911 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1028 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1026 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1023 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$892 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1037 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1038 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1039 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1040 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1041 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1042 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1043 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1044 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1052 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1053 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1054 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1055 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1056 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1057 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1058 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1059 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1067 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1068 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1069 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1070 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1071 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1072 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1073 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1074 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1082 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1083 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1084 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1085 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1086 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1087 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1088 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1089 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1097 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1098 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1099 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1100 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1101 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1102 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1103 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1104 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1112 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1113 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1114 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1115 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1116 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1117 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1118 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1119 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1127 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1128 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1129 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1130 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1131 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1132 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1133 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1134 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1142 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1143 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1144 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1145 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1146 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1147 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1148 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1149 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1157 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1158 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1159 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1160 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1161 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1162 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1163 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1164 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1172 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1173 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1174 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1175 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1176 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1177 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1178 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1179 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1188 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1190 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1192 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1194 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1196 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1198 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1200 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1202 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1201 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1199 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1197 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1195 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1193 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1191 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1189 ($_DFF_P_) from module b08 (removing D path).
Handling const CLK on $auto$ff.cc:262:slice$1187 ($_DFF_P_) from module b08 (removing D path).

yosys> opt_clean

3.80. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..
Removed 2 unused cells and 360 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.81. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
<suppressed ~48 debug messages>

yosys> opt_muxtree

3.82. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b08..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.83. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b08.
Performed a total of 0 changes.

yosys> opt_merge

3.84. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
<suppressed ~96 debug messages>
Removed a total of 32 cells.

yosys> opt_share

3.85. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.86. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.87. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..
Removed 0 unused cells and 74 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.88. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.

yosys> opt_muxtree

3.89. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b08..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.90. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b08.
Performed a total of 0 changes.

yosys> opt_merge

3.91. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_share

3.92. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.93. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.94. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..

yosys> opt_expr

3.95. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
MAX OPT ITERATION = 3

yosys> opt_expr -full

3.96. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
<suppressed ~11 debug messages>

yosys> techmap -map +/techmap.v

3.97. Executing TECHMAP pass (map to technology primitives).

3.97.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.97.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> stat

3.98. Printing statistics.

=== b08 ===

   Number of wires:                 72
   Number of wire bits:            220
   Number of public wires:           9
   Number of public wire bits:      32
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                188
     $_AND_                         26
     $_DFF_PP0_                     21
     $_MUX_                         83
     $_NOT_                         19
     $_OR_                          37
     $_XOR_                          2


yosys> dfflegalize -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 t:$_SDFFCE_*

3.99. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.100. Printing statistics.

=== b08 ===

   Number of wires:                 72
   Number of wire bits:            220
   Number of public wires:           9
   Number of public wire bits:      32
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                188
     $_AND_                         26
     $_DFF_PP0_                     21
     $_MUX_                         83
     $_NOT_                         19
     $_OR_                          37
     $_XOR_                          2


yosys> opt_expr

3.101. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.

yosys> opt_merge -nomux

3.102. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.103. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b08..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.104. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b08.
Performed a total of 0 changes.

yosys> opt_merge

3.105. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -sat

3.106. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.107. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..

yosys> opt_expr

3.108. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
MAX OPT ITERATION = 1

yosys> abc -dff -keepff

3.109. Executing ABC pass (technology mapping using ABC).

3.109.1. Summary of detected clock domains:
  188 cells in clk=\CLOCK, en={ }, arst=\RESET, srst={ }

3.109.2. Extracting gate netlist of module `\b08' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, asynchronously reset by \RESET
Extracted 188 gates and 199 wires to a netlist network with 9 inputs and 21 outputs.

3.109.2.1. Executing ABC.

yosys> abc -dff -keepff

3.110. Executing ABC pass (technology mapping using ABC).

3.110.1. Summary of detected clock domains:
  126 cells in clk=\CLOCK, en={ }, arst=\RESET, srst={ }

3.110.2. Extracting gate netlist of module `\b08' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, asynchronously reset by \RESET
Extracted 126 gates and 135 wires to a netlist network with 9 inputs and 21 outputs.

3.110.2.1. Executing ABC.

yosys> abc -dff -keepff

3.111. Executing ABC pass (technology mapping using ABC).

3.111.1. Summary of detected clock domains:
  124 cells in clk=\CLOCK, en={ }, arst=\RESET, srst={ }

3.111.2. Extracting gate netlist of module `\b08' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, asynchronously reset by \RESET
Extracted 124 gates and 133 wires to a netlist network with 9 inputs and 21 outputs.

3.111.2.1. Executing ABC.

yosys> abc -dff -keepff

3.112. Executing ABC pass (technology mapping using ABC).

3.112.1. Summary of detected clock domains:
  124 cells in clk=\CLOCK, en={ }, arst=\RESET, srst={ }

3.112.2. Extracting gate netlist of module `\b08' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, asynchronously reset by \RESET
Extracted 124 gates and 133 wires to a netlist network with 9 inputs and 21 outputs.

3.112.2.1. Executing ABC.

yosys> opt_ffinv

3.113. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.115. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.116. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b08..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.117. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b08.
Performed a total of 0 changes.

yosys> opt_merge

3.118. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_share

3.119. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.120. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$1726$auto$blifparse.cc:362:parse_blif$1747 ($_DFF_PP0_) from module b08 (D = $abc$1726$abc$1601$abc$1476$abc$1349$OUT_R[3], Q = $abc$1726$abc$1601$abc$1476$abc$1349$O[3]).
Adding EN signal on $abc$1726$auto$blifparse.cc:362:parse_blif$1746 ($_DFF_PP0_) from module b08 (D = $abc$1726$abc$1601$abc$1476$abc$1349$OUT_R[2], Q = $abc$1726$abc$1601$abc$1476$abc$1349$O[2]).
Adding EN signal on $abc$1726$auto$blifparse.cc:362:parse_blif$1745 ($_DFF_PP0_) from module b08 (D = $abc$1726$abc$1601$abc$1476$abc$1349$OUT_R[1], Q = $abc$1726$abc$1601$abc$1476$abc$1349$O[1]).
Adding EN signal on $abc$1726$auto$blifparse.cc:362:parse_blif$1744 ($_DFF_PP0_) from module b08 (D = $abc$1726$abc$1601$abc$1476$abc$1349$OUT_R[0], Q = $abc$1726$abc$1601$abc$1476$abc$1349$O[0]).
Adding EN signal on $abc$1726$auto$blifparse.cc:362:parse_blif$1739 ($_DFF_PP0_) from module b08 (D = $abc$1726$I[7], Q = $abc$1726$abc$1601$abc$1476$abc$1349$IN_R[7]).
Adding EN signal on $abc$1726$auto$blifparse.cc:362:parse_blif$1738 ($_DFF_PP0_) from module b08 (D = $abc$1726$I[6], Q = $abc$1726$abc$1601$abc$1476$abc$1349$IN_R[6]).
Adding EN signal on $abc$1726$auto$blifparse.cc:362:parse_blif$1737 ($_DFF_PP0_) from module b08 (D = $abc$1726$I[5], Q = $abc$1726$abc$1601$abc$1476$abc$1349$IN_R[5]).
Adding EN signal on $abc$1726$auto$blifparse.cc:362:parse_blif$1736 ($_DFF_PP0_) from module b08 (D = $abc$1726$I[4], Q = $abc$1726$abc$1601$abc$1476$abc$1349$IN_R[4]).
Adding EN signal on $abc$1726$auto$blifparse.cc:362:parse_blif$1735 ($_DFF_PP0_) from module b08 (D = $abc$1726$I[3], Q = $abc$1726$abc$1601$abc$1476$abc$1349$IN_R[3]).
Adding EN signal on $abc$1726$auto$blifparse.cc:362:parse_blif$1734 ($_DFF_PP0_) from module b08 (D = $abc$1726$I[2], Q = $abc$1726$abc$1601$abc$1476$abc$1349$IN_R[2]).
Adding EN signal on $abc$1726$auto$blifparse.cc:362:parse_blif$1733 ($_DFF_PP0_) from module b08 (D = $abc$1726$I[1], Q = $abc$1726$abc$1601$abc$1476$abc$1349$IN_R[1]).
Adding EN signal on $abc$1726$auto$blifparse.cc:362:parse_blif$1732 ($_DFF_PP0_) from module b08 (D = $abc$1726$I[0], Q = $abc$1726$abc$1601$abc$1476$abc$1349$IN_R[0]).

yosys> opt_clean

3.121. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..
Removed 12 unused cells and 443 unused wires.
<suppressed ~13 debug messages>

yosys> opt_expr

3.122. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.

yosys> opt_muxtree

3.123. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b08..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.124. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b08.
Performed a total of 0 changes.

yosys> opt_merge

3.125. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_share

3.126. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.127. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.128. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..

yosys> opt_expr

3.129. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
MAX OPT ITERATION = 2

yosys> bmuxmap

3.130. Executing BMUXMAP pass.

yosys> demuxmap

3.131. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_2jYvVA/abc_tmp_1.scr

3.132. Executing ABC pass (technology mapping using ABC).

3.132.1. Extracting gate netlist of module `\b08' to `<abc-temp-dir>/input.blif'..
Extracted 88 gates and 106 wires to a netlist network with 18 inputs and 11 outputs.

3.132.1.1. Executing ABC.
DE:   #PIs =  18  #Luts =    18  Max Lvl =   3  Avg Lvl =   1.73  [   0.09 sec. at Pass 0]{firstMap}[1]
DE:   #PIs =  18  #Luts =    18  Max Lvl =   3  Avg Lvl =   1.73  [   0.23 sec. at Pass 1]{initMapFlow}[2]
DE:   #PIs =  18  #Luts =    18  Max Lvl =   3  Avg Lvl =   1.73  [   0.15 sec. at Pass 2]{map}[2]
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.82  [   0.34 sec. at Pass 3]{postMap}[6]
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.82  [   0.40 sec. at Pass 4]{map}[10]
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.82  [   0.60 sec. at Pass 5]{postMap}[30]
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.82  [   1.35 sec. at Pass 6]{map}[60]
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.82  [   1.60 sec. at Pass 7]{pushMap}[100]
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.82  [   1.18 sec. at Pass 8]{finalMap}[100]

yosys> opt_expr

3.133. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.

yosys> opt_merge -nomux

3.134. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.135. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b08..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.136. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b08.
Performed a total of 0 changes.

yosys> opt_merge

3.137. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_share

3.138. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.139. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.140. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..
Removed 0 unused cells and 106 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.141. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.142. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.143. Printing statistics.

=== b08 ===

   Number of wires:                 88
   Number of wire bits:            111
   Number of public wires:           9
   Number of public wire bits:      32
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 37
     $_DFFE_PP0N_                   12
     $_DFF_PP0_                      9
     $lut                           16


yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFFE_??_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 -cell $_DLATCH_?_ 0 -cell $_DLATCH_???_ 0

3.144. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.145. Printing statistics.

=== b08 ===

   Number of wires:                 88
   Number of wire bits:            111
   Number of public wires:           9
   Number of public wire bits:      32
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 37
     $_DFFE_PP0N_                   12
     $_DFF_PP0_                      9
     $lut                           16


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/ffs_map.v

3.146. Executing TECHMAP pass (map to technology primitives).

3.146.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.146.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Generating RTLIL representation for module `\$_SDFFE_PP0P_'.
Generating RTLIL representation for module `\$_SDFFE_PP0N_'.
Generating RTLIL representation for module `\$_SDFFE_PN0P_'.
Generating RTLIL representation for module `\$_SDFFE_PN0N_'.
Generating RTLIL representation for module `\$_SDFFE_PP1P_'.
Generating RTLIL representation for module `\$_SDFFE_PP1N_'.
Generating RTLIL representation for module `\$_SDFFE_PN1P_'.
Generating RTLIL representation for module `\$_SDFFE_PN1N_'.
Generating RTLIL representation for module `\$_SDFFE_NP0P_'.
Generating RTLIL representation for module `\$_SDFFE_NP0N_'.
Generating RTLIL representation for module `\$_SDFFE_NN0P_'.
Generating RTLIL representation for module `\$_SDFFE_NN0N_'.
Generating RTLIL representation for module `\$_SDFFE_NP1P_'.
Generating RTLIL representation for module `\$_SDFFE_NP1N_'.
Generating RTLIL representation for module `\$_SDFFE_NN1P_'.
Generating RTLIL representation for module `\$_SDFFE_NN1N_'.
Generating RTLIL representation for module `\$_DLATCH_P_'.
Generating RTLIL representation for module `\$_DLATCH_N_'.
Generating RTLIL representation for module `\$_DLATCH_PP0_'.
Generating RTLIL representation for module `\$_DLATCH_NP0_'.
Generating RTLIL representation for module `\$_DLATCH_PN0_'.
Generating RTLIL representation for module `\$_DLATCH_NN0_'.
Generating RTLIL representation for module `\$_DLATCH_PP1_'.
Generating RTLIL representation for module `\$_DLATCH_NP1_'.
Generating RTLIL representation for module `\$_DLATCH_PN1_'.
Generating RTLIL representation for module `\$_DLATCH_NN1_'.
Successfully finished Verilog frontend.

3.146.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using template \$_DFFE_PP0N_ for cells of type $_DFFE_PP0N_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~184 debug messages>

yosys> opt_expr -mux_undef

3.147. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
<suppressed ~531 debug messages>

yosys> simplemap

3.148. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.149. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.

yosys> opt_merge

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
<suppressed ~198 debug messages>
Removed a total of 66 cells.

yosys> opt_dff -nodffe -nosdff

3.151. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.152. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..
Removed 0 unused cells and 135 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.153. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
<suppressed ~11 debug messages>

yosys> opt_merge -nomux

3.154. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.155. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b08..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.156. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b08.
Performed a total of 0 changes.

yosys> opt_merge

3.157. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_share

3.158. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.159. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.160. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..

yosys> opt_expr

3.161. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_2jYvVA/abc_tmp_2.scr

3.162. Executing ABC pass (technology mapping using ABC).

3.162.1. Extracting gate netlist of module `\b08' to `<abc-temp-dir>/input.blif'..
Extracted 104 gates and 124 wires to a netlist network with 18 inputs and 11 outputs.

3.162.1.1. Executing ABC.
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.73  [   0.23 sec. at Pass 0]{firstMap}[1]
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.73  [   0.33 sec. at Pass 1]{initMapFlow}[2]
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.73  [   0.17 sec. at Pass 2]{map}[2]
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.73  [   0.70 sec. at Pass 3]{postMap}[6]
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.73  [   0.83 sec. at Pass 4]{map}[12]
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.73  [   1.21 sec. at Pass 5]{postMap}[36]
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.73  [   1.58 sec. at Pass 6]{pushMap}[100]
DE:   #PIs =  18  #Luts =    16  Max Lvl =   3  Avg Lvl =   1.73  [   0.91 sec. at Pass 7]{finalMap}[100]

yosys> opt_expr

3.163. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.

yosys> opt_merge -nomux

3.164. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.165. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b08..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.166. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b08.
Performed a total of 0 changes.

yosys> opt_merge

3.167. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b08'.
Removed a total of 0 cells.

yosys> opt_share

3.168. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.169. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.170. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..
Removed 0 unused cells and 90 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.171. Executing OPT_EXPR pass (perform const folding).
Optimizing module b08.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.172. Executing HIERARCHY pass (managing design hierarchy).

3.172.1. Analyzing design hierarchy..
Top module:  \b08

3.172.2. Analyzing design hierarchy..
Top module:  \b08
Removed 0 unused modules.

yosys> stat

3.173. Printing statistics.

=== b08 ===

   Number of wires:                 88
   Number of wire bits:            111
   Number of public wires:           9
   Number of public wire bits:      32
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 37
     $lut                           16
     dffr                            9
     dffre                          12


yosys> opt_clean -purge

3.174. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b08..

yosys> write_verilog -noattr -nohex synthesized.v

3.175. Executing Verilog backend.
Dumping module `\b08'.

End of script. Logfile hash: 8145ef8be1, CPU: user 0.75s system 0.05s, MEM: 26.27 MB peak
Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)
Time spent: 99% 6x abc (101 sec), 0% 15x read_verilog (0 sec), ...
real 20.19
user 53.54
sys 48.50
