
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.32
 Yosys 0.16+65 (git sha1 7987105a9, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k crp.v des.v des3.v key_sel.v key_sel3.v sbox1.v sbox2.v sbox3.v sbox4.v sbox5.v sbox6.v sbox7.v sbox8.v

yosys> verific -vlog2k crp.v des.v des3.v key_sel.v key_sel3.v sbox1.v sbox2.v sbox3.v sbox4.v sbox5.v sbox6.v sbox7.v sbox8.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'crp.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'des.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'des3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'key_sel.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'key_sel3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox1.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox2.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox4.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox5.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox6.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox7.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox8.v'

yosys> synth_rs -top des3 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.50

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top des3

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] des3.v:35: compiling module 'des3'
VERIFIC-WARNING [VERI-2371] des3.v:57: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des3.v:61: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des3.v:65: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des3.v:69: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] des.v:35: compiling module 'des'
VERIFIC-WARNING [VERI-2371] des.v:54: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:58: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] key_sel.v:36: compiling module 'key_sel'
VERIFIC-WARNING [VERI-2371] key_sel.v:51: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:52: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:53: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:54: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:55: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:56: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:57: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:58: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:59: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:60: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:61: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:62: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:63: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:64: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] key_sel.v:65: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] crp.v:35: compiling module 'crp'
VERIFIC-INFO [VERI-1018] sbox1.v:35: compiling module 'sbox1'
VERIFIC-INFO [VERI-1018] sbox2.v:35: compiling module 'sbox2'
VERIFIC-INFO [VERI-1018] sbox3.v:35: compiling module 'sbox3'
VERIFIC-INFO [VERI-1018] sbox4.v:35: compiling module 'sbox4'
VERIFIC-INFO [VERI-1018] sbox5.v:35: compiling module 'sbox5'
VERIFIC-INFO [VERI-1018] sbox6.v:35: compiling module 'sbox6'
VERIFIC-INFO [VERI-1018] sbox7.v:35: compiling module 'sbox7'
VERIFIC-INFO [VERI-1018] sbox8.v:35: compiling module 'sbox8'
VERIFIC-WARNING [VERI-2371] des.v:109: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:113: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:117: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:121: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:125: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:129: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:132: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:135: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:138: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:141: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:144: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:147: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:150: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:153: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:156: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:159: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:162: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:165: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:168: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:171: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:174: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:177: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:180: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:183: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:186: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:189: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:192: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:195: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:198: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:201: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:205: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:209: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des.v:233: delay control is not supported for synthesis
Importing module des3.
Importing module des.
Importing module crp.
Importing module key_sel.
Importing module sbox1.
Importing module sbox2.
Importing module sbox3.
Importing module sbox4.
Importing module sbox5.
Importing module sbox6.
Importing module sbox7.
Importing module sbox8.

3.3.1. Analyzing design hierarchy..
Top module:  \des3
Used module:     \des
Used module:         \crp
Used module:             \sbox8
Used module:             \sbox7
Used module:             \sbox6
Used module:             \sbox5
Used module:             \sbox4
Used module:             \sbox3
Used module:             \sbox2
Used module:             \sbox1
Used module:         \key_sel

3.3.2. Analyzing design hierarchy..
Top module:  \des3
Used module:     \des
Used module:         \crp
Used module:             \sbox8
Used module:             \sbox7
Used module:             \sbox6
Used module:             \sbox5
Used module:             \sbox4
Used module:             \sbox3
Used module:             \sbox2
Used module:             \sbox1
Used module:         \key_sel
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module sbox8.
Optimizing module sbox7.
Optimizing module sbox6.
Optimizing module sbox5.
Optimizing module sbox4.
Optimizing module sbox3.
Optimizing module sbox2.
Optimizing module sbox1.
Optimizing module key_sel.
Optimizing module crp.
Optimizing module des.
Optimizing module des3.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module sbox8.
Deleting now unused module sbox7.
Deleting now unused module sbox6.
Deleting now unused module sbox5.
Deleting now unused module sbox4.
Deleting now unused module sbox3.
Deleting now unused module sbox2.
Deleting now unused module sbox1.
Deleting now unused module key_sel.
Deleting now unused module crp.
Deleting now unused module des.
<suppressed ~28 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~16 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 7 unused cells and 2786 unused wires.
<suppressed ~419 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module des3...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~50 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$key_c_r[9]_reg$des3.v:69$155 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[8]_reg$des3.v:69$156 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[7]_reg$des3.v:69$157 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[6]_reg$des3.v:69$158 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[5]_reg$des3.v:69$159 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[4]_reg$des3.v:69$160 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[3]_reg$des3.v:69$161 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[33]_reg$des3.v:69$65 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[32]_reg$des3.v:69$132 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[31]_reg$des3.v:69$133 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[30]_reg$des3.v:69$134 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[2]_reg$des3.v:69$162 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[29]_reg$des3.v:69$135 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[28]_reg$des3.v:69$136 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[27]_reg$des3.v:69$137 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[26]_reg$des3.v:69$138 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[25]_reg$des3.v:69$139 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[24]_reg$des3.v:69$140 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[23]_reg$des3.v:69$141 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[22]_reg$des3.v:69$142 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[21]_reg$des3.v:69$143 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[20]_reg$des3.v:69$144 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[1]_reg$des3.v:69$163 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[19]_reg$des3.v:69$145 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[18]_reg$des3.v:69$146 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[17]_reg$des3.v:69$147 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[16]_reg$des3.v:69$148 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[15]_reg$des3.v:69$149 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[14]_reg$des3.v:69$150 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[13]_reg$des3.v:69$151 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[12]_reg$des3.v:69$152 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[11]_reg$des3.v:69$153 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[10]_reg$des3.v:69$154 ($aldff) from module des3.
Removing never-active async load on $verific$key_c_r[0]_reg$des3.v:65$164 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[9]_reg$des3.v:61$88 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[8]_reg$des3.v:61$89 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[7]_reg$des3.v:61$90 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[6]_reg$des3.v:61$91 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[5]_reg$des3.v:61$92 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[4]_reg$des3.v:61$93 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[3]_reg$des3.v:61$94 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[2]_reg$des3.v:61$95 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[1]_reg$des3.v:61$96 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[16]_reg$des3.v:61$724 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[15]_reg$des3.v:61$82 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[14]_reg$des3.v:61$83 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[13]_reg$des3.v:61$84 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[12]_reg$des3.v:61$85 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[11]_reg$des3.v:61$86 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[10]_reg$des3.v:61$87 ($aldff) from module des3.
Removing never-active async load on $verific$key_b_r[0]_reg$des3.v:57$97 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r9_reg$key_sel.v:66$1070 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r8_reg$key_sel.v:66$1069 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r7_reg$key_sel.v:66$1068 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r6_reg$key_sel.v:66$1067 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r5_reg$key_sel.v:66$1066 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r4_reg$key_sel.v:66$1065 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r3_reg$key_sel.v:66$1064 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r2_reg$key_sel.v:66$1063 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r1_reg$key_sel.v:66$1062 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r14_reg$key_sel.v:66$1075 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r13_reg$key_sel.v:66$1074 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r12_reg$key_sel.v:66$1073 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r11_reg$key_sel.v:66$1072 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r10_reg$key_sel.v:66$1071 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.\uk.$verific$K_r0_reg$key_sel.v:66$1061 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$key_r_reg$des.v:54$781 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$desOut_reg$des.v:233$989 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$desIn_r_reg$des.v:58$783 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R9_reg$des.v:171$957 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R8_reg$des.v:165$952 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R7_reg$des.v:159$947 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R6_reg$des.v:153$942 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R5_reg$des.v:147$937 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R4_reg$des.v:141$932 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R3_reg$des.v:135$927 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R2_reg$des.v:129$922 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R1_reg$des.v:121$917 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R14_reg$des.v:201$982 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R13_reg$des.v:195$977 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R12_reg$des.v:189$972 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R11_reg$des.v:183$967 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R10_reg$des.v:177$962 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$R0_reg$des.v:113$912 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L9_reg$des.v:168$954 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L8_reg$des.v:162$949 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L7_reg$des.v:156$944 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L6_reg$des.v:150$939 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L5_reg$des.v:144$934 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L4_reg$des.v:138$929 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L3_reg$des.v:132$924 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L2_reg$des.v:125$919 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L1_reg$des.v:117$914 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L14_reg$des.v:198$979 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L13_reg$des.v:192$974 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L12_reg$des.v:186$969 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L11_reg$des.v:180$964 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L10_reg$des.v:174$959 ($aldff) from module des3.
Removing never-active async load on $flatten\u2.$verific$L0_reg$des.v:109$909 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r9_reg$key_sel.v:66$1070 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r8_reg$key_sel.v:66$1069 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r7_reg$key_sel.v:66$1068 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r6_reg$key_sel.v:66$1067 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r5_reg$key_sel.v:66$1066 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r4_reg$key_sel.v:66$1065 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r3_reg$key_sel.v:66$1064 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r2_reg$key_sel.v:66$1063 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r1_reg$key_sel.v:66$1062 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r14_reg$key_sel.v:66$1075 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r13_reg$key_sel.v:66$1074 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r12_reg$key_sel.v:66$1073 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r11_reg$key_sel.v:66$1072 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r10_reg$key_sel.v:66$1071 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.\uk.$verific$K_r0_reg$key_sel.v:66$1061 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$key_r_reg$des.v:54$781 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$desOut_reg$des.v:233$989 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$desIn_r_reg$des.v:58$783 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R9_reg$des.v:171$957 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R8_reg$des.v:165$952 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R7_reg$des.v:159$947 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R6_reg$des.v:153$942 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R5_reg$des.v:147$937 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R4_reg$des.v:141$932 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R3_reg$des.v:135$927 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R2_reg$des.v:129$922 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R1_reg$des.v:121$917 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R14_reg$des.v:201$982 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R13_reg$des.v:195$977 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R12_reg$des.v:189$972 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R11_reg$des.v:183$967 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R10_reg$des.v:177$962 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$R0_reg$des.v:113$912 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L9_reg$des.v:168$954 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L8_reg$des.v:162$949 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L7_reg$des.v:156$944 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L6_reg$des.v:150$939 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L5_reg$des.v:144$934 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L4_reg$des.v:138$929 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L3_reg$des.v:132$924 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L2_reg$des.v:125$919 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L1_reg$des.v:117$914 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L14_reg$des.v:198$979 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L13_reg$des.v:192$974 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L12_reg$des.v:186$969 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L11_reg$des.v:180$964 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L10_reg$des.v:174$959 ($aldff) from module des3.
Removing never-active async load on $flatten\u1.$verific$L0_reg$des.v:109$909 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r9_reg$key_sel.v:66$1070 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r8_reg$key_sel.v:66$1069 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r7_reg$key_sel.v:66$1068 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r6_reg$key_sel.v:66$1067 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r5_reg$key_sel.v:66$1066 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r4_reg$key_sel.v:66$1065 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r3_reg$key_sel.v:66$1064 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r2_reg$key_sel.v:66$1063 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r1_reg$key_sel.v:66$1062 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r14_reg$key_sel.v:66$1075 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r13_reg$key_sel.v:66$1074 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r12_reg$key_sel.v:66$1073 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r11_reg$key_sel.v:66$1072 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r10_reg$key_sel.v:66$1071 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.\uk.$verific$K_r0_reg$key_sel.v:66$1061 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$key_r_reg$des.v:54$781 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$desOut_reg$des.v:233$989 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$desIn_r_reg$des.v:58$783 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R9_reg$des.v:171$957 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R8_reg$des.v:165$952 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R7_reg$des.v:159$947 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R6_reg$des.v:153$942 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R5_reg$des.v:147$937 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R4_reg$des.v:141$932 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R3_reg$des.v:135$927 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R2_reg$des.v:129$922 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R1_reg$des.v:121$917 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R14_reg$des.v:201$982 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R13_reg$des.v:195$977 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R12_reg$des.v:189$972 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R11_reg$des.v:183$967 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R10_reg$des.v:177$962 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$R0_reg$des.v:113$912 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L9_reg$des.v:168$954 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L8_reg$des.v:162$949 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L7_reg$des.v:156$944 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L6_reg$des.v:150$939 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L5_reg$des.v:144$934 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L4_reg$des.v:138$929 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L3_reg$des.v:132$924 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L2_reg$des.v:125$919 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L1_reg$des.v:117$914 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L14_reg$des.v:198$979 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L13_reg$des.v:192$974 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L12_reg$des.v:186$969 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L11_reg$des.v:180$964 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L10_reg$des.v:174$959 ($aldff) from module des3.
Removing never-active async load on $flatten\u0.$verific$L0_reg$des.v:109$909 ($aldff) from module des3.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~50 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~50 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.13.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module des3:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~50 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== des3 ===

   Number of wires:               1477
   Number of wire bits:          33268
   Number of public wires:        1432
   Number of public wire bits:   31828
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                725
     $bmux                         384
     $dff                          195
     $mux                           50
     $xor                           96


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.21.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> memory_share

3.21.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> memory_collect

3.21.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== des3 ===

   Number of wires:               1477
   Number of wire bits:          33268
   Number of public wires:        1432
   Number of public wire bits:   31828
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                725
     $bmux                         384
     $dff                          195
     $mux                           50
     $xor                           96


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> stat

3.24. Printing statistics.

=== des3 ===

   Number of wires:               1477
   Number of wire bits:          33268
   Number of public wires:        1432
   Number of public wire bits:   31828
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                725
     $bmux                         384
     $dff                          195
     $mux                           50
     $xor                           96


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $bmux.
No more expansions possible.
<suppressed ~796 debug messages>

yosys> stat

3.26. Printing statistics.

=== des3 ===

   Number of wires:               3781
   Number of wire bits:         130036
   Number of public wires:        1432
   Number of public wire bits:   31828
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:             111832
     $_DFF_P_                     8808
     $_MUX_                      99184
     $_XOR_                       3840


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~36912 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
<suppressed ~102528 debug messages>
Removed a total of 34176 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 384 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~768 debug messages>

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.27.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.27.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.27.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.27.23. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~1584 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.30.10. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt -sat

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.32.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  39976 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.33.2. Extracting gate netlist of module `\des3' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 39976 gates and 40211 wires to a netlist network with 233 inputs and 64 outputs.

3.33.2.1. Executing ABC.

yosys> abc -dff

3.34. Executing ABC pass (technology mapping using ABC).

3.34.1. Summary of detected clock domains:
  48797 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.34.2. Extracting gate netlist of module `\des3' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 48797 gates and 49030 wires to a netlist network with 233 inputs and 64 outputs.

3.34.2.1. Executing ABC.

yosys> abc -dff

3.35. Executing ABC pass (technology mapping using ABC).

3.35.1. Summary of detected clock domains:
  48975 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.35.2. Extracting gate netlist of module `\des3' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 48975 gates and 49208 wires to a netlist network with 233 inputs and 64 outputs.

3.35.2.1. Executing ABC.

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  49180 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.36.2. Extracting gate netlist of module `\des3' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 49180 gates and 49413 wires to a netlist network with 233 inputs and 64 outputs.

3.36.2.1. Executing ABC.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~63 debug messages>

yosys> opt_merge -nomux

3.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 1 unused cells and 180209 unused wires.
<suppressed ~1402 debug messages>

yosys> opt_expr

3.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.38.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_bMVMj0/abc_tmp_1.scr

3.39. Executing ABC pass (technology mapping using ABC).

3.39.1. Extracting gate netlist of module `\des3' to `<abc-temp-dir>/input.blif'..
Extracted 40538 gates and 46363 wires to a netlist network with 5825 inputs and 1648 outputs.

3.39.1.1. Executing ABC.
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [   1.89 sec. at Pass 0]
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 106.47 sec. at Pass 1]
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  17.12 sec. at Pass 2]
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  29.92 sec. at Pass 3]
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  21.60 sec. at Pass 4]
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  37.61 sec. at Pass 5]
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [   1.22 sec. at Pass 6]

yosys> opt

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 46363 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.42. Printing statistics.

=== des3 ===

   Number of wires:              14264
   Number of wire bits:          15444
   Number of public wires:          32
   Number of public wire bits:    1212
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              14296
     $_DFF_P_                     8808
     $lut                         5488


yosys> shregmap -minlen 8 -maxlen 20

3.43. Executing SHREGMAP pass (map shift registers).
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287273 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$290993 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287274 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$290995 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287275 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$290997 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287276 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$290999 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287277 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291001 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287278 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291003 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287279 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291005 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287280 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291007 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287281 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291009 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287282 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291011 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287283 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291013 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287284 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291015 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287285 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291017 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287286 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291019 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287287 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291021 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287288 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291023 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287289 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291025 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287290 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291027 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287291 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291029 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287292 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291031 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287293 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291033 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287294 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291035 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287295 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291037 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287296 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291039 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287297 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291041 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287298 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291043 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287299 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291045 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287300 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291047 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287301 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291049 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287302 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291051 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287303 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291053 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287304 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291055 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287305 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291057 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287306 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291059 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287307 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291061 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287308 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291063 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287309 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291065 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287310 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291067 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287311 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291069 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287312 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291071 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287313 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291073 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287314 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291075 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287315 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291077 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287316 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291079 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287317 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291081 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287318 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291083 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287319 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291085 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287320 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291087 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287321 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291089 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287322 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291091 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287323 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291093 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287324 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291095 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287325 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291097 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287326 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291099 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287327 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291101 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287328 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$291103 to a shift register with depth 18.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289601 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287833 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287777 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284076 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289612 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287834 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287778 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284081 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289623 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287835 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287779 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284086 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289634 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287836 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287780 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284091 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289645 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287837 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287781 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284096 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289656 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287838 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287782 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284101 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289667 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287839 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287783 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284106 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289678 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287840 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287784 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284111 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289689 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287841 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287785 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284116 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289700 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287842 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287786 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284121 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289711 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287843 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287787 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284126 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289722 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287844 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287788 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284131 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289733 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287845 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287789 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284136 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289744 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287846 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287790 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284141 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289755 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287847 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287791 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284146 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289766 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287848 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287792 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284151 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289777 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287849 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287793 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284156 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289788 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287850 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287794 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284161 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289799 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287851 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287795 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284166 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289810 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287852 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287796 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284171 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289813 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287853 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287797 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284176 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289814 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287854 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287798 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284181 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289815 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287855 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287799 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284186 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289816 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287856 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287800 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284191 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289817 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287857 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287801 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284196 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289818 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287858 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287802 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284201 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289819 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287859 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287803 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284206 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289820 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287860 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287804 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284211 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289821 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287861 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287805 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284216 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289822 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287862 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287806 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284221 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289823 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287863 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287807 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284226 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289824 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287864 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287808 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284231 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289825 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287865 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287809 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284236 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289826 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287866 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287810 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284241 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289827 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287867 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287811 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284246 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289828 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287868 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287812 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284251 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289829 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287869 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287813 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284256 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289830 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287870 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287814 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284261 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289831 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287871 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287815 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284266 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289832 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287872 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287816 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284271 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289833 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287873 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287817 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284276 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289834 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287874 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287818 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284281 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289835 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287875 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287819 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284286 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289836 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287876 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287820 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284291 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289837 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287877 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287821 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284296 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289838 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287878 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287822 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284301 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289839 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287879 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287823 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284306 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289840 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287880 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287824 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284311 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289841 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287881 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287825 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284316 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289842 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287882 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287826 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284321 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289843 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287883 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287827 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284326 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289844 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287884 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287828 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284331 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289845 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287885 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287829 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284336 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289846 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287886 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287830 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284341 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289847 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287887 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287831 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284346 to a shift register with depth 15.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$289848 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287888 to a shift register with depth 20.
Converting des3.$abc$284072$auto$blifparse.cc:362:parse_blif$287832 ... des3.$abc$284072$auto$blifparse.cc:362:parse_blif$284351 to a shift register with depth 15.
Converted 2968 dff cells into 168 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.45. Printing statistics.

=== des3 ===

   Number of wires:              14264
   Number of wire bits:          15444
   Number of public wires:          32
   Number of public wire bits:    1212
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              11496
     $_DFF_P_                     5840
     $__SHREG_DFF_P_               168
     $lut                         5488


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.46. Executing TECHMAP pass (map to technology primitives).

3.46.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.46.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.46.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000010010 for cells of type $__SHREG_DFF_P_.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000010100 for cells of type $__SHREG_DFF_P_.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000001111 for cells of type $__SHREG_DFF_P_.
No more expansions possible.
<suppressed ~11665 debug messages>

yosys> opt_expr -mux_undef

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~60842 debug messages>

yosys> simplemap

3.48. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge

3.50. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
<suppressed ~77802 debug messages>
Removed a total of 25934 cells.

yosys> opt_dff -nodffe -nosdff

3.51. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 28058 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.53. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.53.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.
<suppressed ~3629 debug messages>

yosys> opt_merge -nomux

3.53.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
<suppressed ~312 debug messages>
Removed a total of 104 cells.

yosys> opt_muxtree

3.53.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.53.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 982 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.53.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.53.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.53.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.53.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.53.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.53.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_bMVMj0/abc_tmp_2.scr

3.54. Executing ABC pass (technology mapping using ABC).

3.54.1. Extracting gate netlist of module `\des3' to `<abc-temp-dir>/input.blif'..
Extracted 46211 gates and 52038 wires to a netlist network with 5825 inputs and 1648 outputs.

3.54.1.1. Executing ABC.
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [   3.00 sec. at Pass 0]
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [ 125.65 sec. at Pass 1]
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  28.06 sec. at Pass 2]
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  68.62 sec. at Pass 3]
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  37.07 sec. at Pass 4]
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [  71.55 sec. at Pass 5]
DE:   #PIs = 5825  #Luts =  5488  Max Lvl =   3  Avg Lvl =   2.86  [   1.65 sec. at Pass 6]

yosys> opt

3.55. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.55.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

yosys> opt_merge -nomux

3.55.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.55.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.55.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 24937 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.55.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.55.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.55.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des3.
Performed a total of 0 changes.

yosys> opt_merge

3.55.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des3'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..

yosys> opt_expr

3.55.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des3.

3.55.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.56. Executing HIERARCHY pass (managing design hierarchy).

3.56.1. Analyzing design hierarchy..
Top module:  \des3

3.56.2. Analyzing design hierarchy..
Top module:  \des3
Removed 0 unused modules.

yosys> stat

3.57. Printing statistics.

=== des3 ===

   Number of wires:              11632
   Number of wire bits:          15444
   Number of public wires:          32
   Number of public wire bits:    1212
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              14296
     $lut                         5488
     dffsre                       5840
     sh_dff                       2968


yosys> opt_clean -purge

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des3..
Removed 0 unused cells and 25 unused wires.
<suppressed ~25 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.59. Executing Verilog backend.

yosys> bmuxmap

3.59.1. Executing BMUXMAP pass.

yosys> demuxmap

3.59.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\des3'.

Warnings: 54 unique messages, 54 total
End of script. Logfile hash: 12f138ede1, CPU: user 125.85s system 1.35s, MEM: 355.25 MB peak
Yosys 0.16+65 (git sha1 7987105a9, gcc 9.1.0 -fPIC -Os)
Time spent: 95% 6x abc (2453 sec), 1% 32x opt_expr (48 sec), ...
real 748.52
user 2401.49
sys 166.18
