
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.13
 Yosys 0.16+65 (git sha1 051517d61, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k AddRoundKey.v KeyExpantion.v MixColumns.v RoundKeyGen.v SBox.v ShiftRows.v SubBytes.v wrapper_KeyExpantion.v

yosys> verific -vlog2k AddRoundKey.v KeyExpantion.v MixColumns.v RoundKeyGen.v SBox.v ShiftRows.v SubBytes.v wrapper_KeyExpantion.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'AddRoundKey.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'KeyExpantion.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'MixColumns.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'RoundKeyGen.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'SBox.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'ShiftRows.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'SubBytes.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wrapper_KeyExpantion.v'

yosys> synth_rs -top wrapper_KeyExpantion -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.2.41

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top wrapper_KeyExpantion

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-WARNING [VERI-1229] wrapper_KeyExpantion.v:27: module instantiation should have an instance name
VERIFIC-WARNING [VERI-1229] wrapper_KeyExpantion.v:28: module instantiation should have an instance name
VERIFIC-INFO [VERI-1018] wrapper_KeyExpantion.v:5: compiling module 'wrapper_KeyExpantion'
VERIFIC-INFO [VERI-1018] KeyExpantion.v:16: compiling module 'KeyExpantion'
VERIFIC-INFO [VERI-1018] RoundKeyGen.v:16: compiling module 'RoundKeyGen'
VERIFIC-INFO [VERI-1018] SubBytes.v:14: compiling module 'SubBytes(DATA_W=32)'
VERIFIC-INFO [VERI-1018] SBox.v:15: compiling module 'SBox'
VERIFIC-INFO [VERI-1018] wrapper_KeyExpantion.v:32: compiling module 'mux_16x1'
VERIFIC-INFO [VERI-1018] wrapper_KeyExpantion.v:45: compiling module 'mux_8x1'
VERIFIC-INFO [VERI-1018] wrapper_KeyExpantion.v:63: compiling module 'mux_4x1'
VERIFIC-INFO [VERI-1018] wrapper_KeyExpantion.v:78: compiling module 'mux_2x1'
Importing module wrapper_KeyExpantion.
Importing module KeyExpantion.
Importing module RoundKeyGen.
Importing module SubBytes(DATA_W=32).
Importing module SBox.
Importing module mux_16x1.
Importing module mux_2x1.
Importing module mux_8x1.
Importing module mux_4x1.

3.3.1. Analyzing design hierarchy..
Top module:  \wrapper_KeyExpantion
Used module:     \mux_16x1
Used module:         \mux_2x1
Used module:         \mux_8x1
Used module:             \mux_4x1
Used module:     \KeyExpantion
Used module:         \RoundKeyGen
Used module:             \SubBytes(DATA_W=32)
Used module:                 \SBox

3.3.2. Analyzing design hierarchy..
Top module:  \wrapper_KeyExpantion
Used module:     \mux_16x1
Used module:         \mux_2x1
Used module:         \mux_8x1
Used module:             \mux_4x1
Used module:     \KeyExpantion
Used module:         \RoundKeyGen
Used module:             \SubBytes(DATA_W=32)
Used module:                 \SBox
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module mux_4x1.
Optimizing module mux_8x1.
Optimizing module mux_2x1.
Optimizing module mux_16x1.
Optimizing module SBox.
<suppressed ~3 debug messages>
Optimizing module SubBytes(DATA_W=32).
<suppressed ~1 debug messages>
Optimizing module RoundKeyGen.
<suppressed ~8 debug messages>
Optimizing module KeyExpantion.
<suppressed ~10 debug messages>
Optimizing module wrapper_KeyExpantion.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module mux_4x1.
Deleting now unused module mux_8x1.
Deleting now unused module mux_2x1.
Deleting now unused module mux_16x1.
Deleting now unused module SBox.
Deleting now unused module SubBytes(DATA_W=32).
Deleting now unused module RoundKeyGen.
Deleting now unused module KeyExpantion.
<suppressed ~26 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 60 unused cells and 24442 unused wires.
<suppressed ~219 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module wrapper_KeyExpantion...
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [99]
Found and reported 960 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~81 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
<suppressed ~21 debug messages>
Removed a total of 7 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~1 debug messages>

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~81 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~81 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[9].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[9].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[8].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[8].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[8].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[7].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[7].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[7].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[6].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[6].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[6].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[5].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[5].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[5].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[4].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[4].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[4].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[3].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[3].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[3].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[2].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[2].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[2].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[1].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[1].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[1].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.RKGEN_U0.round_key, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.RKGEN_U0.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.RKGEN_U0.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.RKGEN_U0.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.RKGEN_U0.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\RKGEN_U0.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.RKGEN_U0.round_key_delayed, Q = \i4.RKGEN_U0.round_key).
Adding EN signal on $flatten\i4.\RKGEN_U0.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.RKGEN_U0.temp_round_key, Q = \i4.RKGEN_U0.round_key_delayed).
Adding EN signal on $flatten\i4.\RKGEN_U0.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.RKGEN_U0.Key_FirstStage, Q = \i4.RKGEN_U0.Key_SecondStage).
Adding EN signal on $flatten\i4.\RKGEN_U0.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \cipher_key, Q = \i4.RKGEN_U0.Key_FirstStage).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 80 unused cells and 80 unused wires.
<suppressed ~81 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.13.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 6 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 7 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 5 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 4 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 3 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 2 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 1 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 3 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 2 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module wrapper_KeyExpantion:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> stat

3.22. Printing statistics.

=== wrapper_KeyExpantion ===

   Number of wires:                641
   Number of wire bits:          24479
   Number of public wires:         591
   Number of public wire bits:   23839
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                187
     $adff                          40
     $adffe                         80
     $bmux                          40
     $mux                            7
     $xor                           20


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.23. Executing TECHMAP pass (map to technology primitives).

3.23.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.23.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.23.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $mux.
No more expansions possible.
<suppressed ~258 debug messages>

yosys> stat

3.24. Printing statistics.

=== wrapper_KeyExpantion ===

   Number of wires:                961
   Number of wire bits:         106079
   Number of public wires:         591
   Number of public wire bits:   23839
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              89240
     $_DFFE_PN0P_                 5440
     $_DFF_PN0_                     40
     $_MUX_                      82160
     $_XOR_                       1600


yosys> opt

3.25. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.25.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~38160 debug messages>

yosys> opt_merge -nomux

3.25.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
<suppressed ~81720 debug messages>
Removed a total of 27240 cells.

yosys> opt_muxtree

3.25.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.25.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 0 unused cells and 56 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.25.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~200 debug messages>

3.25.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.25.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.25.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.25.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.25.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~1000 debug messages>

yosys> opt_merge

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.26.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

3.26.5. Finished fast OPT passes.

yosys> memory_map

3.27. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_share

3.28.6. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$12232 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$12039
        $auto$simplemap.cc:312:simplemap_bmux$12031

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14288 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$14095
        $auto$simplemap.cc:312:simplemap_bmux$14087

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$16344 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$16151
        $auto$simplemap.cc:312:simplemap_bmux$16143

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$18520 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$18327
        $auto$simplemap.cc:312:simplemap_bmux$18319

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$21124 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$20931
        $auto$simplemap.cc:312:simplemap_bmux$20923

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$23180 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$22987
        $auto$simplemap.cc:312:simplemap_bmux$22979

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$25236 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$25043
        $auto$simplemap.cc:312:simplemap_bmux$25035

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$27412 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$27219
        $auto$simplemap.cc:312:simplemap_bmux$27211

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$30024 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$29831
        $auto$simplemap.cc:312:simplemap_bmux$29823

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$32080 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$31887
        $auto$simplemap.cc:312:simplemap_bmux$31879

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$34136 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$33943
        $auto$simplemap.cc:312:simplemap_bmux$33935

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$36312 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$36119
        $auto$simplemap.cc:312:simplemap_bmux$36111

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$38924 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$38731
        $auto$simplemap.cc:312:simplemap_bmux$38723

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$40980 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$40787
        $auto$simplemap.cc:312:simplemap_bmux$40779

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$43036 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$42843
        $auto$simplemap.cc:312:simplemap_bmux$42835

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$45212 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$45019
        $auto$simplemap.cc:312:simplemap_bmux$45011

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$47824 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$47631
        $auto$simplemap.cc:312:simplemap_bmux$47623

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$49880 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$49687
        $auto$simplemap.cc:312:simplemap_bmux$49679

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$51936 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$51743
        $auto$simplemap.cc:312:simplemap_bmux$51735

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$54112 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$53919
        $auto$simplemap.cc:312:simplemap_bmux$53911

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$56724 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$56531
        $auto$simplemap.cc:312:simplemap_bmux$56523

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$58780 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$58587
        $auto$simplemap.cc:312:simplemap_bmux$58579

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$60836 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$60643
        $auto$simplemap.cc:312:simplemap_bmux$60635

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$63012 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$62819
        $auto$simplemap.cc:312:simplemap_bmux$62811

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$65624 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$65431
        $auto$simplemap.cc:312:simplemap_bmux$65423

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$67680 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$67487
        $auto$simplemap.cc:312:simplemap_bmux$67479

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$69736 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$69543
        $auto$simplemap.cc:312:simplemap_bmux$69535

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$71912 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$71719
        $auto$simplemap.cc:312:simplemap_bmux$71711

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$74524 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$74331
        $auto$simplemap.cc:312:simplemap_bmux$74323

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$76580 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$76387
        $auto$simplemap.cc:312:simplemap_bmux$76379

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$78636 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$78443
        $auto$simplemap.cc:312:simplemap_bmux$78435

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$80812 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$80619
        $auto$simplemap.cc:312:simplemap_bmux$80611

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$83424 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$83231
        $auto$simplemap.cc:312:simplemap_bmux$83223

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$85480 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$85287
        $auto$simplemap.cc:312:simplemap_bmux$85279

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$87536 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$87343
        $auto$simplemap.cc:312:simplemap_bmux$87335

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$89712 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$89519
        $auto$simplemap.cc:312:simplemap_bmux$89511

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$92324 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$92131
        $auto$simplemap.cc:312:simplemap_bmux$92123

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$94380 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$94187
        $auto$simplemap.cc:312:simplemap_bmux$94179

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$96436 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$96243
        $auto$simplemap.cc:312:simplemap_bmux$96235

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$98612 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$98419
        $auto$simplemap.cc:312:simplemap_bmux$98411


yosys> opt_dff

3.28.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr -full

3.28.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~40 debug messages>

3.28.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.28.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~40 debug messages>

yosys> opt_reduce -full

3.28.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.28.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_share

3.28.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.28.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr -full

3.28.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.28.18. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.29. Executing ABC pass (technology mapping using ABC).

3.29.1. Summary of detected clock domains:
  1756 cells in clk=\clk, en=\i4.RKGEN_U0.valid_out, arst=!\reset, srst={ }
  208 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[9].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  228 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[9].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[9].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[8].RKGEN_U.valid_out, arst=!\reset, srst={ }
  368 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[8].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  228 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[8].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[8].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[7].RKGEN_U.valid_out, arst=!\reset, srst={ }
  192 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[7].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[7].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[7].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[6].RKGEN_U.valid_out, arst=!\reset, srst={ }
  208 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[6].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[6].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[6].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[5].RKGEN_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[5].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[5].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[5].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[4].RKGEN_U.valid_out, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[4].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[4].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[4].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[3].RKGEN_U.valid_out, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[3].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[3].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[3].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[2].RKGEN_U.valid_out, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[2].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[2].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[2].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[1].RKGEN_U.valid_out, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=\i4.RKGEN_U0.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.RKGEN_U0.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.RKGEN_U0.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\valid_in, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[1].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[1].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  40 cells in clk=\clk, en={ }, arst=!\reset, srst={ }
  192 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[1].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }

3.29.2. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.RKGEN_U0.valid_out, asynchronously reset by !\reset
Extracted 1752 gates and 1886 wires to a netlist network with 132 inputs and 168 outputs.

3.29.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:        4
ABC RESULTS:               NOT cells:       21
ABC RESULTS:               NOR cells:       47
ABC RESULTS:             ORNOT cells:      187
ABC RESULTS:            ANDNOT cells:       77
ABC RESULTS:                OR cells:      269
ABC RESULTS:              NAND cells:     1000
ABC RESULTS:               AND cells:      562
ABC RESULTS:               MUX cells:      248
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:     1586
ABC RESULTS:           input signals:      132
ABC RESULTS:          output signals:      168
Removing temp directory.

3.29.3. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[9].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 208 gates and 369 wires to a netlist network with 161 inputs and 80 outputs.

3.29.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       80
ABC RESULTS:               BUF cells:      128
ABC RESULTS:        internal signals:      128
ABC RESULTS:           input signals:      161
ABC RESULTS:          output signals:       80
Removing temp directory.

3.29.4. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[9].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 228 gates and 356 wires to a netlist network with 128 inputs and 128 outputs.

3.29.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               NOT cells:        4
ABC RESULTS:              XNOR cells:        4
ABC RESULTS:               XOR cells:       92
ABC RESULTS:               BUF cells:      156
ABC RESULTS:        internal signals:      100
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.5. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[9].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.29.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       32
ABC RESULTS:               XOR cells:       32
ABC RESULTS:               BUF cells:      224
ABC RESULTS:        internal signals:       96
ABC RESULTS:           input signals:      192
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.6. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[8].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1720 gates and 1854 wires to a netlist network with 132 inputs and 200 outputs.

3.29.6.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.6.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOT cells:       17
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:            ANDNOT cells:      110
ABC RESULTS:               NOR cells:       79
ABC RESULTS:             ORNOT cells:      144
ABC RESULTS:                OR cells:      289
ABC RESULTS:              NAND cells:     1030
ABC RESULTS:               AND cells:      589
ABC RESULTS:               MUX cells:      169
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:     1522
ABC RESULTS:           input signals:      132
ABC RESULTS:          output signals:      200
Removing temp directory.

3.29.7. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[8].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 368 gates and 723 wires to a netlist network with 355 inputs and 208 outputs.

3.29.7.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.7.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       80
ABC RESULTS:            ANDNOT cells:       80
ABC RESULTS:               NOR cells:       80
ABC RESULTS:              NAND cells:      160
ABC RESULTS:             ORNOT cells:       80
ABC RESULTS:               AND cells:       80
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:      160
ABC RESULTS:           input signals:      355
ABC RESULTS:          output signals:      208
Removing temp directory.

3.29.8. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[8].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 228 gates and 356 wires to a netlist network with 128 inputs and 128 outputs.

3.29.8.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.8.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               NOT cells:        4
ABC RESULTS:              XNOR cells:        4
ABC RESULTS:               XOR cells:       92
ABC RESULTS:               BUF cells:      156
ABC RESULTS:        internal signals:      100
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.9. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[8].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.29.9.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.9.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       32
ABC RESULTS:               XOR cells:       32
ABC RESULTS:               BUF cells:      224
ABC RESULTS:        internal signals:       96
ABC RESULTS:           input signals:      192
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.10. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[7].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1720 gates and 1854 wires to a netlist network with 132 inputs and 200 outputs.

3.29.10.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.10.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOT cells:       17
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:            ANDNOT cells:      110
ABC RESULTS:               NOR cells:       79
ABC RESULTS:             ORNOT cells:      144
ABC RESULTS:                OR cells:      289
ABC RESULTS:              NAND cells:     1030
ABC RESULTS:               AND cells:      589
ABC RESULTS:               MUX cells:      169
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:     1522
ABC RESULTS:           input signals:      132
ABC RESULTS:          output signals:      200
Removing temp directory.

3.29.11. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[7].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 192 gates and 385 wires to a netlist network with 193 inputs and 192 outputs.

3.29.11.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.11.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       64
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:      193
ABC RESULTS:          output signals:      192
Removing temp directory.

3.29.12. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[7].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.29.12.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.12.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:       95
ABC RESULTS:               BUF cells:      159
ABC RESULTS:        internal signals:       97
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.13. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[7].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.29.13.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.13.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       32
ABC RESULTS:               XOR cells:       32
ABC RESULTS:               BUF cells:      224
ABC RESULTS:        internal signals:       96
ABC RESULTS:           input signals:      192
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.14. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[6].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1720 gates and 1854 wires to a netlist network with 132 inputs and 200 outputs.

3.29.14.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.14.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOT cells:       17
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:            ANDNOT cells:      110
ABC RESULTS:               NOR cells:       79
ABC RESULTS:             ORNOT cells:      144
ABC RESULTS:                OR cells:      289
ABC RESULTS:              NAND cells:     1030
ABC RESULTS:               AND cells:      589
ABC RESULTS:               MUX cells:      169
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:     1522
ABC RESULTS:           input signals:      132
ABC RESULTS:          output signals:      200
Removing temp directory.

3.29.15. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[6].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 208 gates and 402 wires to a netlist network with 194 inputs and 176 outputs.

3.29.15.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.15.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       80
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:       32
ABC RESULTS:           input signals:      194
ABC RESULTS:          output signals:      176
Removing temp directory.

3.29.16. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[6].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.29.16.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.16.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:       95
ABC RESULTS:               BUF cells:      159
ABC RESULTS:        internal signals:       97
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.17. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[6].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.29.17.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.17.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       32
ABC RESULTS:               XOR cells:       32
ABC RESULTS:               BUF cells:      224
ABC RESULTS:        internal signals:       96
ABC RESULTS:           input signals:      192
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.18. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[5].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1720 gates and 1854 wires to a netlist network with 132 inputs and 200 outputs.

3.29.18.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.18.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOT cells:       17
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:            ANDNOT cells:      110
ABC RESULTS:               NOR cells:       79
ABC RESULTS:             ORNOT cells:      144
ABC RESULTS:                OR cells:      289
ABC RESULTS:              NAND cells:     1030
ABC RESULTS:               AND cells:      589
ABC RESULTS:               MUX cells:      169
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:     1522
ABC RESULTS:           input signals:      132
ABC RESULTS:          output signals:      200
Removing temp directory.

3.29.19. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[5].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 224 gates and 402 wires to a netlist network with 178 inputs and 176 outputs.

3.29.19.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.19.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       96
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:       48
ABC RESULTS:           input signals:      178
ABC RESULTS:          output signals:      176
Removing temp directory.

3.29.20. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[5].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.29.20.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.20.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:       95
ABC RESULTS:               BUF cells:      159
ABC RESULTS:        internal signals:       97
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.21. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[5].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.29.21.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.21.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       32
ABC RESULTS:               XOR cells:       32
ABC RESULTS:               BUF cells:      224
ABC RESULTS:        internal signals:       96
ABC RESULTS:           input signals:      192
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.22. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[4].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1720 gates and 1854 wires to a netlist network with 132 inputs and 200 outputs.

3.29.22.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.22.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOT cells:       17
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:            ANDNOT cells:      110
ABC RESULTS:               NOR cells:       79
ABC RESULTS:             ORNOT cells:      144
ABC RESULTS:                OR cells:      289
ABC RESULTS:              NAND cells:     1030
ABC RESULTS:               AND cells:      589
ABC RESULTS:               MUX cells:      169
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:     1522
ABC RESULTS:           input signals:      132
ABC RESULTS:          output signals:      200
Removing temp directory.

3.29.23. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[4].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.29.23.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.23.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.24. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[4].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.29.24.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.24.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:       95
ABC RESULTS:               BUF cells:      159
ABC RESULTS:        internal signals:       97
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.25. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[4].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.29.25.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.25.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       32
ABC RESULTS:               XOR cells:       32
ABC RESULTS:               BUF cells:      224
ABC RESULTS:        internal signals:       96
ABC RESULTS:           input signals:      192
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.26. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[3].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1720 gates and 1854 wires to a netlist network with 132 inputs and 200 outputs.

3.29.26.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.26.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOT cells:       17
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:            ANDNOT cells:      110
ABC RESULTS:               NOR cells:       79
ABC RESULTS:             ORNOT cells:      144
ABC RESULTS:                OR cells:      289
ABC RESULTS:              NAND cells:     1030
ABC RESULTS:               AND cells:      589
ABC RESULTS:               MUX cells:      169
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:     1522
ABC RESULTS:           input signals:      132
ABC RESULTS:          output signals:      200
Removing temp directory.

3.29.27. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[3].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.29.27.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.27.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.28. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[3].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.29.28.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.28.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:       95
ABC RESULTS:               BUF cells:      159
ABC RESULTS:        internal signals:       97
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.29. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[3].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.29.29.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.29.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       32
ABC RESULTS:               XOR cells:       32
ABC RESULTS:               BUF cells:      224
ABC RESULTS:        internal signals:       96
ABC RESULTS:           input signals:      192
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.30. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[2].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1720 gates and 1854 wires to a netlist network with 132 inputs and 200 outputs.

3.29.30.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.30.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOT cells:       17
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:            ANDNOT cells:      110
ABC RESULTS:               NOR cells:       79
ABC RESULTS:             ORNOT cells:      144
ABC RESULTS:                OR cells:      289
ABC RESULTS:              NAND cells:     1030
ABC RESULTS:               AND cells:      589
ABC RESULTS:               MUX cells:      169
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:     1522
ABC RESULTS:           input signals:      132
ABC RESULTS:          output signals:      200
Removing temp directory.

3.29.31. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[2].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.29.31.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.31.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.32. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[2].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.29.32.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.32.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:       95
ABC RESULTS:               BUF cells:      159
ABC RESULTS:        internal signals:       97
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.33. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[2].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.29.33.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.33.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       32
ABC RESULTS:               XOR cells:       32
ABC RESULTS:               BUF cells:      224
ABC RESULTS:        internal signals:       96
ABC RESULTS:           input signals:      192
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.34. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[1].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1720 gates and 1854 wires to a netlist network with 132 inputs and 200 outputs.

3.29.34.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.34.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOT cells:       17
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:            ANDNOT cells:      110
ABC RESULTS:               NOR cells:       79
ABC RESULTS:             ORNOT cells:      144
ABC RESULTS:                OR cells:      289
ABC RESULTS:              NAND cells:     1030
ABC RESULTS:               AND cells:      589
ABC RESULTS:               MUX cells:      169
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:     1522
ABC RESULTS:           input signals:      132
ABC RESULTS:          output signals:      200
Removing temp directory.

3.29.35. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.RKGEN_U0.valid_round_key, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.29.35.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.35.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.36. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.RKGEN_U0.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.29.36.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.36.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:       95
ABC RESULTS:               BUF cells:      159
ABC RESULTS:        internal signals:       97
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.37. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.RKGEN_U0.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.29.37.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.37.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               MUX cells:       32
ABC RESULTS:               XOR cells:       32
ABC RESULTS:               BUF cells:      224
ABC RESULTS:        internal signals:       96
ABC RESULTS:           input signals:      192
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.38. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \valid_in, asynchronously reset by !\reset
Extracted 1720 gates and 1854 wires to a netlist network with 132 inputs and 200 outputs.

3.29.38.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.38.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOT cells:       17
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:            ANDNOT cells:      110
ABC RESULTS:               NOR cells:       79
ABC RESULTS:             ORNOT cells:      144
ABC RESULTS:                OR cells:      289
ABC RESULTS:              NAND cells:     1030
ABC RESULTS:               AND cells:      589
ABC RESULTS:               MUX cells:      169
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:     1522
ABC RESULTS:           input signals:      132
ABC RESULTS:          output signals:      200
Removing temp directory.

3.29.39. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[1].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.29.39.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.39.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               BUF cells:      256
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.40. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[1].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.29.40.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.40.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:       95
ABC RESULTS:               BUF cells:      159
ABC RESULTS:        internal signals:       97
ABC RESULTS:           input signals:      128
ABC RESULTS:          output signals:      128
Removing temp directory.

3.29.41. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by !\reset
Extracted 40 gates and 41 wires to a netlist network with 1 inputs and 40 outputs.

3.29.41.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.41.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       40
ABC RESULTS:               BUF cells:       80
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        1
ABC RESULTS:          output signals:       40
Removing temp directory.

3.29.42. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$139902$lo03, asynchronously reset by !\reset
Extracted 192 gates and 352 wires to a netlist network with 160 inputs and 128 outputs.

3.29.42.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.42.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      128
ABC RESULTS:               XOR cells:       32
ABC RESULTS:               BUF cells:      224
ABC RESULTS:        internal signals:       64
ABC RESULTS:           input signals:      160
ABC RESULTS:          output signals:      128
Removing temp directory.

yosys> abc -script abc_tmp.scr

3.30. Executing ABC pass (technology mapping using ABC).

3.30.1. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Extracted 26786 gates and 29389 wires to a netlist network with 2603 inputs and 1456 outputs.

3.30.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/yosys_verific_rs/result_10-05-2022T23-40-15/Golden_synth_rs_ade.json/wrapper_KeyExpantion/abc_tmp.scr 
ABC:   #Luts =  4242  Max Lvl =   5  Avg Lvl =   2.26  [   2.64 sec. at Pass 0]
ABC:   #Luts =  3287  Max Lvl =   4  Avg Lvl =   2.14  [ 108.96 sec. at Pass 1]
ABC:   #Luts =  3283  Max Lvl =   4  Avg Lvl =   2.14  [  29.18 sec. at Pass 2]
ABC:   #Luts =  3248  Max Lvl =   4  Avg Lvl =   2.16  [  77.39 sec. at Pass 3]
ABC:   #Luts =  3248  Max Lvl =   4  Avg Lvl =   2.16  [  46.47 sec. at Pass 4]
ABC:   #Luts =  3247  Max Lvl =   4  Avg Lvl =   2.16  [  77.64 sec. at Pass 5]
ABC:   #Luts =  3247  Max Lvl =   4  Avg Lvl =   2.16  [  31.48 sec. at Pass 6]
ABC:   #Luts =  3245  Max Lvl =   4  Avg Lvl =   2.16  [  87.94 sec. at Pass 7]
ABC:   #Luts =  3245  Max Lvl =   4  Avg Lvl =   2.16  [  34.17 sec. at Pass 8]
ABC:   #Luts =  3243  Max Lvl =   4  Avg Lvl =   2.16  [  66.78 sec. at Pass 9]
ABC:   #Luts =  3243  Max Lvl =   4  Avg Lvl =   2.16  [  36.09 sec. at Pass 10]
ABC:   #Luts =  3243  Max Lvl =   4  Avg Lvl =   2.16  [  66.71 sec. at Pass 11]
ABC:   #Luts =  3243  Max Lvl =   4  Avg Lvl =   2.16  [  35.06 sec. at Pass 12]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.30.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     3243
ABC RESULTS:        internal signals:    25330
ABC RESULTS:           input signals:     2603
ABC RESULTS:          output signals:     1456
Removing temp directory.

yosys> opt

3.31. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.31.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge -nomux

3.31.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.31.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~40 debug messages>

yosys> opt_reduce

3.31.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.31.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.31.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 0 unused cells and 50070 unused wires.
<suppressed ~110 debug messages>

yosys> opt_expr

3.31.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.31.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.31.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~40 debug messages>

yosys> opt_reduce

3.31.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.31.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.31.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.31.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.31.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.32. Printing statistics.

=== wrapper_KeyExpantion ===

   Number of wires:               3829
   Number of wire bits:          22210
   Number of public wires:         482
   Number of public wire bits:   18863
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               8443
     $_DFFE_PN0P_                 5120
     $_DFF_PN0_                     40
     $lut                         3243
     $mux                           40


yosys> shregmap -minlen 8 -maxlen 20

3.33. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.34. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.35. Printing statistics.

=== wrapper_KeyExpantion ===

   Number of wires:               3829
   Number of wire bits:          22210
   Number of public wires:         482
   Number of public wire bits:   18863
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               8443
     $_DFFE_PN0P_                 5120
     $_DFF_PN0_                     40
     $lut                         3243
     $mux                           40


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.36. Executing TECHMAP pass (map to technology primitives).

3.36.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.36.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.36.3. Continuing TECHMAP pass.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using extmapper simplemap for cells of type $lut.
Using extmapper simplemap for cells of type $mux.
No more expansions possible.
<suppressed ~8579 debug messages>

yosys> opt_expr -mux_undef

3.37. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~62494 debug messages>

yosys> simplemap

3.38. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.39. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge

3.40. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
<suppressed ~67785 debug messages>
Removed a total of 22595 cells.

yosys> opt_dff -nodffe -nosdff

3.41. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 0 unused cells and 30511 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.43. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.43.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~3392 debug messages>

yosys> opt_merge -nomux

3.43.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
<suppressed ~279 debug messages>
Removed a total of 93 cells.

yosys> opt_muxtree

3.43.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.43.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.43.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.43.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.43.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 0 unused cells and 280 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.43.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.43.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.43.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.43.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.43.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.43.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.43.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.43.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.43.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.44. Executing ABC pass (technology mapping using ABC).

3.44.1. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Extracted 30223 gates and 32788 wires to a netlist network with 2563 inputs and 1376 outputs.

3.44.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/yosys_verific_rs/result_10-05-2022T23-40-15/Golden_synth_rs_ade.json/wrapper_KeyExpantion/abc_tmp.scr 
ABC:   #Luts =  3145  Max Lvl =   4  Avg Lvl =   2.21  [   2.73 sec. at Pass 0]
ABC:   #Luts =  3145  Max Lvl =   3  Avg Lvl =   2.21  [ 115.06 sec. at Pass 1]
ABC:   #Luts =  3145  Max Lvl =   3  Avg Lvl =   2.21  [  26.79 sec. at Pass 2]
ABC:   #Luts =  3144  Max Lvl =   3  Avg Lvl =   2.21  [  69.67 sec. at Pass 3]
ABC:   #Luts =  3142  Max Lvl =   3  Avg Lvl =   2.21  [  23.61 sec. at Pass 4]
ABC:   #Luts =  3142  Max Lvl =   3  Avg Lvl =   2.21  [  59.59 sec. at Pass 5]
ABC:   #Luts =  3142  Max Lvl =   3  Avg Lvl =   2.21  [  27.16 sec. at Pass 6]
ABC:   #Luts =  3142  Max Lvl =   3  Avg Lvl =   2.21  [  53.94 sec. at Pass 7]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.44.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     3142
ABC RESULTS:        internal signals:    28849
ABC RESULTS:           input signals:     2563
ABC RESULTS:          output signals:     1376
Removing temp directory.

yosys> opt

3.45. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.45.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge -nomux

3.45.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.45.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.45.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.45.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 0 unused cells and 14719 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.45.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.45.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.45.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.45.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.45.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.45.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.45.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.46. Executing HIERARCHY pass (managing design hierarchy).

3.46.1. Analyzing design hierarchy..
Top module:  \wrapper_KeyExpantion

3.46.2. Analyzing design hierarchy..
Top module:  \wrapper_KeyExpantion
Removed 0 unused modules.

yosys> stat

3.47. Printing statistics.

=== wrapper_KeyExpantion ===

   Number of wires:               3688
   Number of wire bits:          22069
   Number of public wires:         482
   Number of public wire bits:   18863
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               8302
     $lut                         3142
     dffsre                       5160


yosys> opt_clean -purge

3.48. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 0 unused cells and 386 unused wires.
<suppressed ~386 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.49. Executing Verilog backend.

yosys> bmuxmap

3.49.1. Executing BMUXMAP pass.

yosys> demuxmap

3.49.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\wrapper_KeyExpantion'.

Warnings: 962 unique messages, 962 total
End of script. Logfile hash: 537aaf635f, CPU: user 111.36s system 1.63s, MEM: 291.68 MB peak
Yosys 0.16+65 (git sha1 051517d61, gcc 9.1.0 -fPIC -Os)
Time spent: 97% 3x abc (5012 sec), 0% 28x opt_expr (37 sec), ...
real 1302.84
user 4740.82
sys 375.35
