
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.24
 Yosys 0.16+65 (git sha1 03bd62bb8, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k s38584.v GSCLib_3.0.v

yosys> verific -vlog2k s38584.v GSCLib_3.0.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's38584.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'GSCLib_3.0.v'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:91: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:92: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:93: undeclared symbol 'I3_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:95: undeclared symbol 'I5_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:161: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:162: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:194: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:195: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:196: undeclared symbol 'I2_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:343: undeclared symbol 'I0_CLEAR', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:344: undeclared symbol 'I0_SET', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:345: undeclared symbol 'NET0131_', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:345: undeclared symbol 'D_', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:346: undeclared symbol 'P0001_', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:348: undeclared symbol 'NET0131', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:349: undeclared symbol 'P0001', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:352: undeclared symbol 'I12_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:353: undeclared symbol 'D_EQ_0_AN_RN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:354: undeclared symbol 'D_EQ_1_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:355: undeclared symbol 'RN_EQ_1_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:423: undeclared symbol 'P0001', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:424: undeclared symbol 'P0000', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:584: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:611: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:639: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:671: undeclared symbol 'I2_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:704: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:732: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:764: undeclared symbol 'I2_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:798: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:799: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:831: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:832: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:833: undeclared symbol 'I2_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:870: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:871: undeclared symbol 'I3_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:872: undeclared symbol 'I4_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:977: undeclared symbol 'I0_D', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:978: undeclared symbol 'I0_CLEAR', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:979: undeclared symbol 'I0_SET', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:980: undeclared symbol 'P0002', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:981: undeclared symbol 'P0000', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:984: undeclared symbol 'RN_EQ_1_AN_SE_EQ_1_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:985: undeclared symbol 'RN_EQ_1_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:986: undeclared symbol 'I12_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:987: undeclared symbol 'RN_EQ_1_AN_SE_EQ_0_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:1179: undeclared symbol 'I0_out', assumed default net type 'wire'

yosys> synth_rs -top s38584 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.47

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top s38584

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] s38584.v:43: compiling module 's38584'
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:334: compiling module 'DFFSRX1'
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:58: compiling module 'mdff'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:409: specify block is ignored for synthesis
VERIFIC-WARNING [VDB-1002] GSCLib_3.0.v:341: net 'NOTIFIER' does not have a driver
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:549: compiling module 'MX2X1'
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:73: compiling module 'mmux2'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:572: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:633: compiling module 'NAND3X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:657: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:699: compiling module 'NOR2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:719: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:664: compiling module 'NAND4X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:692: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:155: compiling module 'AOI21X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:180: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:906: compiling module 'OR2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:925: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:861: compiling module 'OAI33X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:899: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:932: compiling module 'OR4X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:959: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:792: compiling module 'OAI21X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:817: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:129: compiling module 'AND2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:148: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:461: compiling module 'INVX1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:476: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:1203: compiling module 'XOR2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:1222: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:579: compiling module 'NAND2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:599: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:824: compiling module 'OAI22X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:854: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:187: compiling module 'AOI22X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:217: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:606: compiling module 'NAND2X2'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:626: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:726: compiling module 'NOR3X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:750: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:505: compiling module 'INVX4'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:520: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:483: compiling module 'INVX2'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:498: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:268: compiling module 'CLKBUFX1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:283: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:290: compiling module 'CLKBUFX2'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:305: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:246: compiling module 'BUFX3'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:261: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:24: compiling module 'ADDHX1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:51: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:312: compiling module 'CLKBUFX3'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:327: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:527: compiling module 'INVX8'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:542: specify block is ignored for synthesis
Importing module s38584.
Importing module ADDHX1.
Importing module AND2X1.
Importing module AOI21X1.
Importing module AOI22X1.
Importing module BUFX3.
Importing module CLKBUFX1.
Importing module CLKBUFX2.
Importing module CLKBUFX3.
Importing module DFFSRX1.
Importing module INVX1.
Importing module INVX2.
Importing module INVX4.
Importing module INVX8.
Importing module MX2X1.
Importing module NAND2X1.
Importing module NAND2X2.
Importing module NAND3X1.
Importing module NAND4X1.
Importing module NOR2X1.
Importing module NOR3X1.
Importing module OAI21X1.
Importing module OAI22X1.
Importing module OAI33X1.
Importing module OR2X1.
Importing module OR4X1.
Importing module XOR2X1.
Importing module mdff.
Importing module mmux2.

3.3.1. Analyzing design hierarchy..
Top module:  \s38584
Used module:     \AND2X1
Used module:     \NOR2X1
Used module:     \AOI21X1
Used module:     \CLKBUFX1
Used module:     \NAND3X1
Used module:     \INVX1
Used module:     \CLKBUFX3
Used module:     \INVX2
Used module:     \BUFX3
Used module:     \INVX4
Used module:     \CLKBUFX2
Used module:     \NAND2X1
Used module:     \OAI21X1
Used module:     \OR2X1
Used module:     \NAND2X2
Used module:     \NAND4X1
Used module:     \AOI22X1
Used module:     \OR4X1
Used module:     \XOR2X1
Used module:     \MX2X1
Used module:         \mmux2
Used module:     \INVX8
Used module:     \OAI22X1
Used module:     \NOR3X1
Used module:     \DFFSRX1
Used module:         \mdff
Used module:     \ADDHX1
Used module:     \OAI33X1

3.3.2. Analyzing design hierarchy..
Top module:  \s38584
Used module:     \AND2X1
Used module:     \NOR2X1
Used module:     \AOI21X1
Used module:     \CLKBUFX1
Used module:     \NAND3X1
Used module:     \INVX1
Used module:     \CLKBUFX3
Used module:     \INVX2
Used module:     \BUFX3
Used module:     \INVX4
Used module:     \CLKBUFX2
Used module:     \NAND2X1
Used module:     \OAI21X1
Used module:     \OR2X1
Used module:     \NAND2X2
Used module:     \NAND4X1
Used module:     \AOI22X1
Used module:     \OR4X1
Used module:     \XOR2X1
Used module:     \MX2X1
Used module:         \mmux2
Used module:     \INVX8
Used module:     \OAI22X1
Used module:     \NOR3X1
Used module:     \DFFSRX1
Used module:         \mdff
Used module:     \ADDHX1
Used module:     \OAI33X1
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module mmux2.
Optimizing module mdff.
Optimizing module XOR2X1.
Optimizing module OR4X1.
Optimizing module OR2X1.
Optimizing module OAI33X1.
Optimizing module OAI22X1.
Optimizing module OAI21X1.
Optimizing module NOR3X1.
Optimizing module NOR2X1.
Optimizing module NAND4X1.
Optimizing module NAND3X1.
Optimizing module NAND2X2.
Optimizing module NAND2X1.
Optimizing module MX2X1.
Optimizing module INVX8.
Optimizing module INVX4.
Optimizing module INVX2.
Optimizing module INVX1.
Optimizing module DFFSRX1.
Optimizing module CLKBUFX3.
Optimizing module CLKBUFX2.
Optimizing module CLKBUFX1.
Optimizing module BUFX3.
Optimizing module AOI22X1.
Optimizing module AOI21X1.
Optimizing module AND2X1.
Optimizing module ADDHX1.
Optimizing module s38584.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module mmux2.
Deleting now unused module mdff.
Deleting now unused module XOR2X1.
Deleting now unused module OR4X1.
Deleting now unused module OR2X1.
Deleting now unused module OAI33X1.
Deleting now unused module OAI22X1.
Deleting now unused module OAI21X1.
Deleting now unused module NOR3X1.
Deleting now unused module NOR2X1.
Deleting now unused module NAND4X1.
Deleting now unused module NAND3X1.
Deleting now unused module NAND2X2.
Deleting now unused module NAND2X1.
Deleting now unused module MX2X1.
Deleting now unused module INVX8.
Deleting now unused module INVX4.
Deleting now unused module INVX2.
Deleting now unused module INVX1.
Deleting now unused module DFFSRX1.
Deleting now unused module CLKBUFX3.
Deleting now unused module CLKBUFX2.
Deleting now unused module CLKBUFX1.
Deleting now unused module BUFX3.
Deleting now unused module AOI22X1.
Deleting now unused module AOI21X1.
Deleting now unused module AND2X1.
Deleting now unused module ADDHX1.
<suppressed ~6727 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~9815 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 5819 unused cells and 69242 unused wires.
<suppressed ~26547 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module s38584...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~698 debug messages>

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~429 debug messages>
Removed a total of 143 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~789 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
    New input vector for $reduce_and cell $flatten\g72601.$verific$i5$GSCLib_3.0.v:671$24544: { \g64846.A \g65390.A \g385_reg.NET0131 \g504_reg.df1.out \g370_reg.NET0131 \g499_reg.NET0131 }
    New input vector for $reduce_and cell $flatten\g72593.$verific$i5$GSCLib_3.0.v:671$24544: { \g72599.A \g72593.A \g72593.B \g67_dup.C \g64382.Y \g51.Y }
    New input vector for $reduce_and cell $flatten\g72484.$verific$i5$GSCLib_3.0.v:671$24544: { \g72484.B \g72484.C \g72484.D \g69702.A \g4340_reg.NET0131 \g4322_reg.NET0131 \g4332_reg.NET0131 }
    New input vector for $reduce_and cell $flatten\g72423.$verific$i5$GSCLib_3.0.v:671$24544: { \g61034.B \g61062.B0 \g1345_reg.NET0131 \g1500_reg.NET0131 \g1367_reg.NET0131 \g1379_reg.NET0131 }
    New input vector for $reduce_and cell $flatten\g72413.$verific$i5$GSCLib_3.0.v:639$24542: { \g71375.D \g71271.Y \g71267.Y \g71270.I0_out \g69733.Y \g69734.Y }
    New input vector for $reduce_and cell $flatten\g70341.$verific$i5$GSCLib_3.0.v:671$24544: { \g70346.B \g70341.A \g70341.C \g65473.Y \g64275.Y \g63192.Y }
    New input vector for $reduce_and cell $flatten\g70161.$verific$i5$GSCLib_3.0.v:639$24542: { \g70161.B \g62809.Y \g70161.C \g65450.Y \g64738.Y \g64725.Y }
    New input vector for $reduce_and cell $flatten\g65038.$verific$i5$GSCLib_3.0.v:671$24544: { \g4843_reg.NET0131 \g4849_reg.NET0131 \g4933_reg.NET0131 \g4983_reg.df1.out \g4859_reg.NET0131 \g61737.B \g4991_reg.df1.out \g4966_reg.NET0131 }
    New input vector for $reduce_and cell $flatten\g65033.$verific$i5$GSCLib_3.0.v:671$24544: { \g4944_reg.NET0131 \g4843_reg.NET0131 \g4849_reg.NET0131 \g4983_reg.df1.out \g4859_reg.NET0131 \g4991_reg.df1.out \g4966_reg.NET0131 \g61640.D }
    New input vector for $reduce_and cell $flatten\g64959.$verific$i5$GSCLib_3.0.v:639$24542: { \g65343.A \g64681.A1 \g4076_reg.df1.out \g4057_reg.df1.out \g4064_reg.NET0131 }
    New input vector for $reduce_and cell $flatten\g64957.$verific$i5$GSCLib_3.0.v:639$24542: { \g65343.A \g64681.A1 \g4076_reg.df1.out \g4057_reg.NET0131 \g4064_reg.NET0131 }
    New input vector for $reduce_and cell $flatten\g64956.$verific$i5$GSCLib_3.0.v:639$24542: { \g65343.A \g64681.A1 \g4076_reg.df1.out \g4057_reg.NET0131 \g4064_reg.df1.out }
    New input vector for $reduce_and cell $flatten\g63958.$verific$i5$GSCLib_3.0.v:639$24542: { \g70020_dup.A \g72977.B \g64342.A0 \g2509_reg.df2.out \g35 }
    New input vector for $reduce_and cell $flatten\g63952.$verific$i5$GSCLib_3.0.v:639$24542: { \g70021.A \g70021.B \g2375_reg.df2.out \g33.Y \g35 }
    New input vector for $reduce_and cell $flatten\g63932.$verific$i5$GSCLib_3.0.v:639$24542: { \g70143.A \g65945.Y \g64324.A0 \g2084_reg.NET0131 \g35 }
    New input vector for $reduce_and cell $flatten\g63928.$verific$i5$GSCLib_3.0.v:639$24542: { \g26_dup72995.A \g26_dup72995.B \g69893.B \g1950_reg.NET0131 \g35 }
    New input vector for $reduce_and cell $flatten\g63911.$verific$i5$GSCLib_3.0.v:639$24542: { \g2735_reg.NET0131 \g2724_reg.NET0131 \g2741_reg.NET0131 \g2729_reg.NET0131 \g2748_reg.NET0131 \g2756_reg.NET0131 }
    New input vector for $reduce_and cell $flatten\g63910.$verific$i5$GSCLib_3.0.v:639$24542: { \g2735_reg.NET0131 \g2724_reg.df1.out \g2741_reg.NET0131 \g2729_reg.NET0131 \g2748_reg.NET0131 \g2756_reg.NET0131 }
    New input vector for $reduce_and cell $flatten\g63488.$verific$i5$GSCLib_3.0.v:639$24542: { \g63951.A \g63358.mx.in0 \g645_reg.df1.out \g62272.A1 \g691_reg.df1.out }
    New input vector for $reduce_and cell $flatten\g63481.$verific$i5$GSCLib_3.0.v:639$24542: { \g70130.A \g4688_reg.df2.out \g65022.Y \g63481.A \g35 }
    New input vector for $reduce_and cell $flatten\g63478.$verific$i5$GSCLib_3.0.v:639$24542: { \g72560.A \g4681_reg.NET0131 \g65425.B \g64756.B \g63478.A \g35 }
    New input vector for $reduce_and cell $flatten\g63314.$verific$i5$GSCLib_3.0.v:671$24544: { \g64662.D \g63540.A1 \g63314.B \g969_reg.df1.out \g1018_reg.df1.out \g35 }
    New input vector for $reduce_and cell $flatten\g62670.$verific$i5$GSCLib_3.0.v:671$24544: { \g64662.D \g63540.A1 \g969_reg.df1.out \g62670.A \g1030_reg.df1.out \g35 }
    New input vector for $reduce_and cell $flatten\g62268.$verific$i5$GSCLib_3.0.v:671$24544: { \g64662.D \g63540.A1 \g969_reg.df1.out \g62268.A \g1036_reg.df1.out \g35 }
    New input vector for $reduce_and cell $flatten\g60988.$verific$i5$GSCLib_3.0.v:671$24544: { \g61162.A \g60988.A \g1361_reg.df1.out \g1312_reg.df1.out \g61164.B \g35 }
    New input vector for $reduce_and cell $flatten\g60945.$verific$i5$GSCLib_3.0.v:671$24544: { \g61162.A \g60945.A \g1312_reg.df1.out \g1373_reg.df1.out \g61164.B \g35 }
    New input vector for $reduce_and cell $flatten\g60930.$verific$i5$GSCLib_3.0.v:671$24544: { \g61162.A \g1312_reg.df1.out \g60930.A \g1379_reg.df1.out \g61164.B \g35 }
  Optimizing cells in module \s38584.
Performed a total of 27 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~738 debug messages>
Removed a total of 246 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\g996_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g990_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g979_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g976_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g969_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g962_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g956_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g94_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g947_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g896_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g890_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g887_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1696_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g884_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g881_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2815_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g878_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g875_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g872_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g86_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g869_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1926_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g862_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g859_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g847_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g843_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g837_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g832_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g827_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g822_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g817_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g812_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g807_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g802_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1030_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g79_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g799_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2811_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2807_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g781_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g776_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g772_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g767_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g763_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g758_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g753_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g74_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g749_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g744_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g739_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g736_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g732_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2389_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2403_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1592_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2803_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1052_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1536_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2370_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2361_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2357_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2351_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2342_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2338_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2331_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g232_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1246_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1291_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1710_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g728_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2799_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g102_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2319_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2795_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1152_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1664_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2791_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1036_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g278_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2787_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2287_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2283_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g723_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1657_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2783_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2269_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g225_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g718_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2779_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2255_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2250_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2775_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2236_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g222_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g150_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g239_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2227_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2223_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1087_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2771_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1239_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1189_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g703_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2217_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1008_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2208_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1056_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g699_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2204_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1075_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2197_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g691_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g686_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2767_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1079_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1495_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1728_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1233_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1367_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g168_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2763_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2084_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g174_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1792_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1478_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1312_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1548_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2759_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1589_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1913_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1083_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1422_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1964_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1459_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1582_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1500_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1932_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2756_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1798_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g681_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1917_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1178_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1760_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1906_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1668_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1105_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1135_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1099_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1046_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1211_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1811_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1018_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1644_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2748_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1521_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1395_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1227_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1559_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1772_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1300_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1783_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g121_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1116_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1526_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g128_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1858_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2741_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1489_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1205_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g146_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1333_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1724_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1306_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1542_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2735_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1389_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1146_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2112_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1570_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1041_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1221_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1430_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1945_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1636_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2729_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1448_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2724_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1779_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g164_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1472_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g106_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1992_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6741_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6736_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2719_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6727_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6723_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1236_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1802_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1844_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1514_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g671_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6719_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1351_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1677_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2704_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1404_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1193_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6715_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g194_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1319_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1691_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1345_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6711_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2098_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1199_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1426_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g269_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1373_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1624_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g136_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1379_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6704_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1157_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1129_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1002_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2697_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1996_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g66_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1322_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1361_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2689_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1950_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6697_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1399_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1442_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1418_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1384_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1830_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1183_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1862_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6692_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1061_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1648_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6682_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g667_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6675_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6668_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2051_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6661_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2685_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6657_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6653_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6649_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6645_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6641_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6637_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6633_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6629_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6625_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6621_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1936_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g661_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6617_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6613_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6609_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6605_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6601_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6597_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6593_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6589_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6585_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6581_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6573_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6565_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6561_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g655_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1816_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6555_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6549_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6537_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6523_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2671_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6513_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g191_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g650_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6509_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6505_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6500_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6486_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1564_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1978_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g645_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g218_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g182_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6444_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6395_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6390_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6381_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6377_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6373_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6369_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2040_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6365_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6358_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g215_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6351_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2185_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6346_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2130_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1554_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6336_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6329_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6322_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2060_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6315_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6311_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6307_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6303_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6299_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6295_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6291_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6287_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6283_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6279_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1532_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6275_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6271_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6267_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6263_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6259_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6255_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6251_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6247_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6243_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6239_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6235_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6227_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6219_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6215_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6209_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6203_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2657_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6191_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6177_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2652_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6167_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6163_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6159_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6154_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6140_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6098_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1171_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6049_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6044_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6035_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6031_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6027_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6023_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6019_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6012_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6005_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6000_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g59_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5990_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5983_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5976_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2070_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5969_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5965_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5961_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5957_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5953_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5949_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5945_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5941_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5937_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5933_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5929_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5925_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5921_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5917_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5913_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5909_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5905_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5901_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5897_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5893_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5889_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5881_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5873_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5869_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5863_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5857_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5845_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2638_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5831_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5821_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5817_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5813_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5808_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g262_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5794_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5752_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5703_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5698_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5689_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5685_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5681_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5677_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5673_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2126_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5666_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5659_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5654_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5644_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5637_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2629_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5630_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5623_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5619_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5615_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5611_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5607_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5603_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5599_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5595_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5591_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5587_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5583_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5579_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5575_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5571_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5567_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5563_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5559_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5555_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5551_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g554_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5547_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5543_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5535_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5527_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5523_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5517_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5511_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g550_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5499_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2625_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5485_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5475_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5471_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g546_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5467_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5462_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2619_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5448_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g542_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5406_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g538_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5357_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5352_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g534_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5348_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5343_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5339_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5335_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5331_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5327_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g209_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5320_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2138_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5313_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5308_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5297_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5290_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2047_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g528_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5283_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5276_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5272_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5268_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5264_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5260_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5256_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5252_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5248_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5244_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5240_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5236_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5232_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5228_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5224_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5220_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5216_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5212_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5208_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5204_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5200_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5196_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g518_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5188_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5180_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5176_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5170_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5164_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5156_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5152_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2610_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g513_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5138_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5128_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5124_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5120_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5115_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2606_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5105_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5097_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5092_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5084_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5080_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2599_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5069_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5062_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5057_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5052_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g504_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5046_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5041_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5037_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5033_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5029_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5022_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5016_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g499_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4991_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4983_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4975_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g496_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4966_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4961_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4955_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4950_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4944_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4939_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4933_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4927_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4922_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4917_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4912_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g490_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4907_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4899_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4894_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4888_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4871_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4864_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4859_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4854_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4849_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4843_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4836_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g482_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2587_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4801_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g479_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4793_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4785_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4776_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4771_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4765_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4760_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g475_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4754_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4749_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4743_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4737_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4732_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4727_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4722_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4717_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4709_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4704_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1024_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4698_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4681_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2066_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4674_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4669_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4664_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4659_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4653_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4646_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4643_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4639_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4633_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4628_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4621_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4616_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g460_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4608_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4601_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4593_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4584_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4578_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4575_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4572_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4571_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4570_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4564_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4561_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4558_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4555_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4537_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4534_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g452_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4527_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4520_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4519_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4515_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4492_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4489_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4486_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4483_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1216_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4477_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4474_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2093_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4473_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g446_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4467_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4462_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4459_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4456_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4452_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4449_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4446_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4443_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4438_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4430_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4427_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4423_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4420_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g441_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4417_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4414_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4411_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g255_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4408_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4405_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2079_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4401_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4392_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4388_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4382_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g437_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4375_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4372_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4358_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4349_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4340_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g433_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4332_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4322_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4311_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4308_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4304_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4300_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g429_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4297_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4294_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4291_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4287_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2555_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4281_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4277_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4273_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4269_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4264_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4258_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4253_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g424_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4249_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4245_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4242_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4239_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4232_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4229_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4226_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4222_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4219_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1576_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4216_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4213_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4210_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4207_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2551_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4204_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4200_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4197_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4194_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2153_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4191_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4188_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2145_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4185_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4180_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g417_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4176_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4172_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4157_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4153_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4146_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4145_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4141_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g411_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4108_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4104_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4098_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4093_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4087_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4082_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4076_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4064_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g405_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4057_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4054_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4049_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2537_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4040_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4031_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4027_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4023_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g401_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4019_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4012_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4005_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4000_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3990_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3983_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3976_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3969_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3965_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3961_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3957_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3953_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3949_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3945_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3941_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3937_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3933_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g392_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3929_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3925_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3921_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3917_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3913_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3909_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3905_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3901_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3897_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3893_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3889_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3881_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3873_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3869_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3863_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g385_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3857_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3845_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3831_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3821_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3817_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3813_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2523_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3794_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g376_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3752_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g370_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3703_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3698_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3689_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3680_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3676_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3672_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1894_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3668_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3661_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g365_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3654_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3649_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3639_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3632_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3625_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3618_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2028_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3614_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3610_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3606_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3602_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3598_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3594_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3590_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g358_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3586_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3582_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3578_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3574_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3570_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3566_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3562_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g355_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3558_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3554_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3550_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3546_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3542_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3538_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3530_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3522_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3518_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3512_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3506_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g34_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3494_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2421_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3480_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g347_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g117_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3470_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3466_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3462_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g344_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2504_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3443_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g341_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3401_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g336_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3352_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3347_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3338_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3329_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3325_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3321_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3317_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2495_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3310_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3303_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3298_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3288_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3281_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3274_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3267_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3263_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3259_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3255_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3251_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g324_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3247_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3243_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3239_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3235_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3231_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3227_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3223_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3219_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3215_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3211_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3207_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3203_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3199_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3195_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3191_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3187_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3179_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3171_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g316_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3167_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3161_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3155_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2491_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3143_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3129_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2485_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3119_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3115_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3111_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2476_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3092_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g305_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3050_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2472_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2999_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2994_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2988_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2984_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2980_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2975_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2970_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2960_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2955_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2950_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g294_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2946_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2941_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2936_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g246_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2922_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g291_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2912_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2907_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2902_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2465_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2894_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2890_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2886_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g287_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2873_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2868_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2860_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2417_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2852_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2848_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2844_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g283_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2453_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2827_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2823_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2819_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 83 unused cells and 5266 unused wires.
<suppressed ~5104 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~543 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~543 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\g6533_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g64441.Y, Q = \g6533_reg.df2.out).
Adding EN signal on $flatten\g6519_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g63046.Y, Q = \g6519_reg.df2.out).
Adding EN signal on $flatten\g6187_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g6187_reg.D, Q = \g6187_reg.df2.out).
Adding EN signal on $flatten\g6173_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g6173_reg.D, Q = \g6173_reg.df2.out).
Adding EN signal on $flatten\g5841_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g5841_reg.D, Q = \g5841_reg.df2.out).
Adding EN signal on $flatten\g5827_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g5827_reg.D, Q = \g5827_reg.df2.out).
Adding EN signal on $flatten\g5495_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g5495_reg.D, Q = \g5495_reg.df2.out).
Adding EN signal on $flatten\g5481_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g5481_reg.D, Q = \g5481_reg.df2.out).
Adding EN signal on $flatten\g5148_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g5148_reg.D, Q = \g5148_reg.df2.out).
Adding EN signal on $flatten\g5134_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g5134_reg.D, Q = \g5134_reg.df2.out).
Adding EN signal on $flatten\g5011_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g5011_reg.D, Q = \g5011_reg.df2.out).
Adding EN signal on $flatten\g4831_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g4831_reg.D, Q = \g4831_reg.df2.out).
Adding EN signal on $flatten\g4826_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g4826_reg.D, Q = \g4826_reg.df2.out).
Adding EN signal on $flatten\g3841_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g3841_reg.D, Q = \g3841_reg.df2.out).
Adding EN signal on $flatten\g3827_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g3827_reg.D, Q = \g3827_reg.df2.out).
Adding EN signal on $flatten\g37_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g2894_reg.NET0131, Q = \g37_reg.df2.out).
Adding EN signal on $flatten\g3490_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g3490_reg.D, Q = \g3490_reg.df2.out).
Adding EN signal on $flatten\g3476_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g3476_reg.D, Q = \g3476_reg.df2.out).
Adding EN signal on $flatten\g3139_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g3139_reg.D, Q = \g3139_reg.df2.out).
Adding EN signal on $flatten\g3125_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g3125_reg.D, Q = \g3125_reg.df2.out).
Adding EN signal on $flatten\g2681_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g2681_reg.D, Q = \g2681_reg.df2.out).
Adding EN signal on $flatten\g2667_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g2667_reg.D, Q = \g2667_reg.df2.out).
Adding EN signal on $flatten\g2547_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g2547_reg.D, Q = \g2547_reg.df2.out).
Adding EN signal on $flatten\g2533_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g2533_reg.D, Q = \g2533_reg.df2.out).
Adding EN signal on $flatten\g2413_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g2413_reg.D, Q = \g2413_reg.df2.out).
Adding EN signal on $flatten\g2399_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g2399_reg.D, Q = \g2399_reg.df2.out).
Adding EN signal on $flatten\g2279_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g2279_reg.D, Q = \g2279_reg.df2.out).
Adding EN signal on $flatten\g2265_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g2265_reg.D, Q = \g2265_reg.df2.out).
Adding EN signal on $flatten\g2122_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g2122_reg.D, Q = \g2122_reg.df2.out).
Adding EN signal on $flatten\g2108_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g2108_reg.D, Q = \g2108_reg.df2.out).
Adding EN signal on $flatten\g1988_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g1988_reg.D, Q = \g1988_reg.df2.out).
Adding EN signal on $flatten\g1974_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g1974_reg.D, Q = \g1974_reg.df2.out).
Adding EN signal on $flatten\g1854_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g1854_reg.D, Q = \g1854_reg.df2.out).
Adding EN signal on $flatten\g1840_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g1840_reg.D, Q = \g1840_reg.df2.out).
Adding EN signal on $flatten\g1720_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g1720_reg.D, Q = \g1720_reg.df2.out).
Adding EN signal on $flatten\g1706_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g1706_reg.D, Q = \g1706_reg.df2.out).
Adding EN signal on $flatten\g1687_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24576 ($aldff) from module s38584 (D = \g1687_reg.D, Q = \g1687_reg.df2.out).
Setting constant 1-bit at position 0 on $flatten\g1291_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g2130_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g2689_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g4727_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g4917_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g947_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 11 unused cells and 42 unused wires.
<suppressed ~53 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~50 debug messages>

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~542 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
    New input vector for $reduce_and cell $flatten\g72977.$verific$i5$GSCLib_3.0.v:639$24542: { \g72977.B \g64342.A0 }
    New input vector for $reduce_and cell $flatten\g72959.$verific$i5$GSCLib_3.0.v:639$24542: { \g64340.A0 \g33.Y }
    New input vector for $reduce_and cell $flatten\g70143.$verific$i5$GSCLib_3.0.v:639$24542: { \g70143.A \g64324.A0 }
    New input vector for $reduce_and cell $flatten\g69893.$verific$i5$GSCLib_3.0.v:639$24542: { \g26_dup72995.B \g69893.B }
    New input vector for $reduce_and cell $flatten\g63958.$verific$i5$GSCLib_3.0.v:639$24542: { \g72977.B \g64342.A0 \g2509_reg.df2.out \g35 }
    New input vector for $reduce_and cell $flatten\g63952.$verific$i5$GSCLib_3.0.v:639$24542: { \g64340.A0 \g2375_reg.df2.out \g33.Y \g35 }
    New input vector for $reduce_and cell $flatten\g63932.$verific$i5$GSCLib_3.0.v:639$24542: { \g70143.A \g64324.A0 \g2084_reg.NET0131 \g35 }
    New input vector for $reduce_and cell $flatten\g63928.$verific$i5$GSCLib_3.0.v:639$24542: { \g26_dup72995.B \g69893.B \g1950_reg.NET0131 \g35 }
  Optimizing cells in module \s38584.
Performed a total of 8 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~21 debug messages>
Removed a total of 7 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 1-bit at position 0 on $flatten\g2138_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g2697_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g4732_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g4922_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 26 unused cells and 69 unused wires.
<suppressed ~95 debug messages>

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~6 debug messages>

3.13.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~538 debug messages>

yosys> opt_reduce

3.13.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.13.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.20. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 1-bit at position 0 on $flatten\g4717_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g4907_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.

yosys> opt_clean

3.13.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 4 unused cells and 16 unused wires.
<suppressed ~20 debug messages>

yosys> opt_expr

3.13.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~10 debug messages>

3.13.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~536 debug messages>

yosys> opt_reduce

3.13.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.13.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.27. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 1-bit at position 0 on $flatten\g4722_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g4912_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.

yosys> opt_clean

3.13.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 6 unused cells and 24 unused wires.
<suppressed ~30 debug messages>

yosys> opt_expr

3.13.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~6 debug messages>

3.13.30. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.31. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~534 debug messages>

yosys> opt_reduce

3.13.32. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.13.33. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.34. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 1-bit at position 0 on $flatten\g4737_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g4927_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24576 ($adff) from module s38584.

yosys> opt_clean

3.13.35. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 4 unused cells and 16 unused wires.
<suppressed ~20 debug messages>

yosys> opt_expr

3.13.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~5 debug messages>

3.13.37. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.38. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~532 debug messages>

yosys> opt_reduce

3.13.39. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.13.40. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_dff -sat

3.13.41. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.42. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 1 unused cells and 5 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.13.43. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.13.44. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.45. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~532 debug messages>

yosys> opt_reduce

3.13.46. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.13.47. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.48. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.49. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> opt_expr

3.13.50. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.13.51. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24602 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24599 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24611 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24608 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24636 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24633 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24687 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24657 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24614 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24684 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24681 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24587 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24584 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24675 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24590 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24645 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24596 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24593 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24630 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24626 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24651 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24669 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24642 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24639 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24660 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24605 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24620 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24617 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24623 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24663 ($ne).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module s38584:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~532 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== s38584 ===

   Number of wires:              52648
   Number of wire bits:          52648
   Number of public wires:       52612
   Number of public wire bits:   52612
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              10437
     $adff                         912
     $aldff                        210
     $aldffe                        37
     $and                         1921
     $mux                          838
     $ne                            35
     $not                         3867
     $or                          1706
     $reduce_and                   693
     $reduce_or                     41
     $xor                          177


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.21.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> memory_share

3.21.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> memory_collect

3.21.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== s38584 ===

   Number of wires:              52648
   Number of wire bits:          52648
   Number of public wires:       52612
   Number of public wire bits:   52612
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              10437
     $adff                         912
     $aldff                        210
     $aldffe                        37
     $and                         1921
     $mux                          838
     $ne                            35
     $not                         3867
     $or                          1706
     $reduce_and                   693
     $reduce_or                     41
     $xor                          177


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> stat

3.24. Printing statistics.

=== s38584 ===

   Number of wires:              52648
   Number of wire bits:          52648
   Number of public wires:       52612
   Number of public wire bits:   52612
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              10437
     $adff                         912
     $aldff                        210
     $aldffe                        37
     $and                         1921
     $mux                          838
     $ne                            35
     $not                         3867
     $or                          1706
     $reduce_and                   693
     $reduce_or                     41
     $xor                          177


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $aldff.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $aldffe.
Using extmapper simplemap for cells of type $ne.
No more expansions possible.
<suppressed ~10508 debug messages>

yosys> stat

3.26. Printing statistics.

=== s38584 ===

   Number of wires:              54205
   Number of wire bits:          54599
   Number of public wires:       52612
   Number of public wire bits:   52612
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              11619
     $_ALDFFE_PPN_                   1
     $_ALDFFE_PPP_                  36
     $_ALDFF_PP_                   210
     $_AND_                       3667
     $_DFF_PP1_                    912
     $_MUX_                        838
     $_NOT_                       3867
     $_OR_                        1841
     $_XOR_                        247


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~70 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~309 debug messages>
Removed a total of 103 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 868 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.27.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~142 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.30.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.31. Executing ABC pass (technology mapping using ABC).

3.31.1. Summary of detected clock domains:
  11417 cells in clk=\blif_clk_net, en={ }, arst=\blif_reset_net, srst={ }

3.31.2. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, asynchronously reset by \blif_reset_net
Extracted 11170 gates and 11424 wires to a netlist network with 254 inputs and 417 outputs.

3.31.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      654
ABC RESULTS:               NOT cells:       88
ABC RESULTS:               NOR cells:      154
ABC RESULTS:            ANDNOT cells:      346
ABC RESULTS:             ORNOT cells:      364
ABC RESULTS:              NAND cells:     1112
ABC RESULTS:               XOR cells:       31
ABC RESULTS:               MUX cells:      483
ABC RESULTS:              XNOR cells:      156
ABC RESULTS:                OR cells:      450
ABC RESULTS:               AND cells:      857
ABC RESULTS:               BUF cells:      233
ABC RESULTS:        internal signals:    10753
ABC RESULTS:           input signals:      254
ABC RESULTS:          output signals:      417
Removing temp directory.

yosys> abc -dff

3.32. Executing ABC pass (technology mapping using ABC).

3.32.1. Summary of detected clock domains:
  4942 cells in clk=\blif_clk_net, en={ }, arst=\blif_reset_net, srst={ }

3.32.2. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, asynchronously reset by \blif_reset_net
Extracted 4695 gates and 4949 wires to a netlist network with 254 inputs and 348 outputs.

3.32.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      654
ABC RESULTS:               NOT cells:       86
ABC RESULTS:               NOR cells:      151
ABC RESULTS:            ANDNOT cells:      347
ABC RESULTS:             ORNOT cells:      340
ABC RESULTS:               XOR cells:       24
ABC RESULTS:               MUX cells:      493
ABC RESULTS:              XNOR cells:      157
ABC RESULTS:                OR cells:      462
ABC RESULTS:              NAND cells:     1098
ABC RESULTS:               AND cells:      841
ABC RESULTS:               BUF cells:      164
ABC RESULTS:        internal signals:     4347
ABC RESULTS:           input signals:      254
ABC RESULTS:          output signals:      348
Removing temp directory.

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  4900 cells in clk=\blif_clk_net, en={ }, arst=\blif_reset_net, srst={ }

3.33.2. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, asynchronously reset by \blif_reset_net
Extracted 4653 gates and 4907 wires to a netlist network with 254 inputs and 348 outputs.

3.33.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      654
ABC RESULTS:               NOT cells:       77
ABC RESULTS:               NOR cells:      152
ABC RESULTS:            ANDNOT cells:      352
ABC RESULTS:             ORNOT cells:      363
ABC RESULTS:               XOR cells:       24
ABC RESULTS:               MUX cells:      468
ABC RESULTS:              XNOR cells:      155
ABC RESULTS:                OR cells:      475
ABC RESULTS:              NAND cells:     1110
ABC RESULTS:               AND cells:      860
ABC RESULTS:               BUF cells:      164
ABC RESULTS:        internal signals:     4305
ABC RESULTS:           input signals:      254
ABC RESULTS:          output signals:      348
Removing temp directory.

yosys> opt_ffinv

3.34. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.35. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.35.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~7 debug messages>

yosys> opt_merge -nomux

3.35.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~60 debug messages>
Removed a total of 20 cells.

yosys> opt_muxtree

3.35.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.35.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.35.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.35.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47865 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li016_li016, Q = $abc$47848$lo016).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48449 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6579_, Q = $abc$47848$lo600).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48445 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo589, Q = $abc$47848$lo596).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48444 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo596, Q = $abc$47848$lo595).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48443 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo011, Q = $abc$47848$lo594).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48442 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo525, Q = $abc$47848$lo593).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48441 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo522, Q = $abc$47848$lo592).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48440 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo536, Q = $abc$47848$lo591).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48439 ($_DFF_PP0_) from module s38584 (D = $abc$47848$g37_reg.df2.out, Q = $abc$47848$lo590).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48438 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo513, Q = $abc$47848$lo589).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48437 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo562, Q = $abc$47848$lo588).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48436 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo586, Q = $abc$47848$lo587).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48435 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo606, Q = $abc$47848$lo586).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48434 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li585_li585, Q = $abc$47848$lo585).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48433 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li584_li584, Q = $abc$47848$lo584).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48430 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo453, Q = $abc$47848$lo581).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48428 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li579_li579, Q = $abc$47848$lo579).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48427 ($_DFF_PP0_) from module s38584 (D = $abc$47848$g3849_reg.df2.out, Q = $abc$47848$lo578).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48426 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6550_, Q = $abc$47848$lo577).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48425 ($_DFF_PP0_) from module s38584 (D = $abc$47848$g5849_reg.df2.out, Q = $abc$47848$lo576).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48423 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6544_, Q = $abc$47848$lo574).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48422 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo188, Q = $abc$47848$lo573).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48418 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6535_, Q = $abc$47848$lo569).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48417 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li568_li568, Q = $abc$47848$lo568).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48415 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo512, Q = $abc$47848$lo566).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48413 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo500, Q = $abc$47848$lo564).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48411 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo587, Q = $abc$47848$lo562).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48408 ($_DFF_PP0_) from module s38584 (D = $abc$47848$g6541_reg.df2.out, Q = $abc$47848$lo559).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48405 ($_DFF_PP0_) from module s38584 (D = $abc$47848$g3498_reg.df2.out, Q = $abc$47848$lo556).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48404 ($_DFF_PP0_) from module s38584 (D = $abc$47848$g5503_reg.df2.out, Q = $abc$47848$lo555).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48403 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo581, Q = $abc$47848$lo554).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48402 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo489, Q = $abc$47848$lo553).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48401 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li552_li552, Q = $abc$47848$lo552).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48393 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6479_, Q = $abc$47848$lo544).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48392 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6477_, Q = $abc$47848$lo543).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48387 ($_DFF_PP0_) from module s38584 (D = $abc$47848$g6195_reg.df2.out, Q = $abc$47848$lo538).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48385 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo381, Q = $abc$47848$lo536).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48384 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo079, Q = $abc$47848$lo535).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48383 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo217, Q = $abc$47848$lo534).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48382 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo164, Q = $abc$47848$lo533).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48381 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo062, Q = $abc$47848$lo532).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48380 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo175, Q = $abc$47848$lo531).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48379 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo077, Q = $abc$47848$lo530).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48377 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo061, Q = $abc$47848$lo528).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48376 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo186, Q = $abc$47848$lo527).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48375 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo511, Q = $abc$47848$lo526).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48374 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo594, Q = $abc$47848$lo525).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48373 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo068, Q = $abc$47848$lo524).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48372 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo165, Q = $abc$47848$lo523).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48371 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo360, Q = $abc$47848$lo522).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48370 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo067, Q = $abc$47848$lo521).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48369 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo172, Q = $abc$47848$lo520).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48367 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo481, Q = $abc$47848$lo518).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48366 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo060, Q = $abc$47848$lo517).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48365 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo198, Q = $abc$47848$lo516).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48364 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo057, Q = $abc$47848$lo515).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48363 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo199, Q = $abc$47848$lo514).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48362 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo526, Q = $abc$47848$lo513).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48361 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo591, Q = $abc$47848$lo512).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48360 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo564, Q = $abc$47848$lo511).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48354 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo493, Q = $abc$47848$lo505).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48347 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo505, Q = $abc$47848$lo498).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48343 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo491, Q = $abc$47848$lo494).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48342 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li493_li493, Q = $abc$47848$lo493).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48338 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo468, Q = $abc$47848$lo489).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48326 ($_DFF_PP0_) from module s38584 (D = $abc$47848$g3147_reg.df2.out, Q = $abc$47848$lo477).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48324 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6355_, Q = $abc$47848$lo475).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48300 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6293_, Q = $abc$47848$lo451).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48297 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6287_, Q = $abc$47848$lo448).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48296 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6284_, Q = $abc$47848$lo447).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48295 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6282_, Q = $abc$47848$lo446).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48294 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6280_, Q = $abc$47848$lo445).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48293 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6278_, Q = $abc$47848$lo444).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48292 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo195, Q = $abc$47848$lo443).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48290 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo274, Q = $abc$47848$lo441).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48289 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo125, Q = $abc$47848$lo440).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48288 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo136, Q = $abc$47848$lo439).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48286 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo158, Q = $abc$47848$lo437).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48285 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo137, Q = $abc$47848$lo436).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48284 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo134, Q = $abc$47848$lo435).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48272 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6214_, Q = $abc$47848$lo423).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48271 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo275, Q = $abc$47848$lo422).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48257 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo135, Q = $abc$47848$lo408).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48256 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6155_, Q = $abc$47848$lo407).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48252 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo401, Q = $abc$47848$lo403).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48251 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo431, Q = $abc$47848$lo402).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48250 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo400, Q = $abc$47848$lo401).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48247 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n6127_, Q = $abc$47848$lo398).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48244 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo403, Q = $abc$47848$lo395).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48243 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li394_li394, Q = $abc$47848$lo394).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48242 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo026, Q = $abc$47848$lo393).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48237 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo395, Q = $abc$47848$lo388).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48218 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo370, Q = $abc$47848$lo369).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48217 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo369, Q = $abc$47848$lo368).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48215 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo367, Q = $abc$47848$lo366).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48214 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo255, Q = $abc$47848$lo365).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48213 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo342, Q = $abc$47848$lo364).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48201 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li352_li352, Q = $abc$47848$lo352).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48197 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li348_li348, Q = $abc$47848$lo348).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48195 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo366, Q = $abc$47848$lo346).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48190 ($_DFF_PP0_) from module s38584 (D = $abc$47848$g854_reg.df2.out, Q = $abc$47848$lo341).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48164 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5803_, Q = $abc$47848$lo315).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48151 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5750_, Q = $abc$47848$lo302).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48140 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li291_li291, Q = $abc$47848$lo291).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48133 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5687_, Q = $abc$47848$lo284).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48130 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5678_, Q = $abc$47848$lo281).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48129 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5675_, Q = $abc$47848$lo280).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48110 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo260, Q = $abc$47848$lo261).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48108 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li259_li259, Q = $abc$47848$lo259).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48107 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo251, Q = $abc$47848$lo258).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48106 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li257_li257, Q = $abc$47848$lo257).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48105 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5581_, Q = $abc$47848$lo256).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48099 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li250_li250, Q = $abc$47848$lo250).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48098 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5545_, Q = $abc$47848$lo249).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48097 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5542_, Q = $abc$47848$lo248).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48096 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo232, Q = $abc$47848$lo247).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48095 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo245, Q = $abc$47848$lo246).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48070 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo219, Q = $abc$47848$lo221).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48069 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo218, Q = $abc$47848$lo220).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48065 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo215, Q = $abc$47848$lo216).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48063 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5370_, Q = $abc$47848$lo214).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48061 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5360_, Q = $abc$47848$lo212).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48054 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li205_li205, Q = $abc$47848$lo205).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48053 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5306_, Q = $abc$47848$lo204).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48050 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li201_li201, Q = $abc$47848$lo201).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48049 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li200_li200, Q = $abc$47848$lo200).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48044 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5253_, Q = $abc$47848$lo195).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48041 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li192_li192, Q = $abc$47848$lo192).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48040 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5233_, Q = $abc$47848$lo191).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48039 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo189, Q = $abc$47848$lo190).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48023 ($_DFF_PP0_) from module s38584 (D = $abc$47848$new_n5136_, Q = $abc$47848$lo174).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48015 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li166_li166, Q = $abc$47848$lo166).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$48002 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li153_li153, Q = $abc$47848$lo153).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47993 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li144_li144, Q = $abc$47848$lo144).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47992 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li143_li143, Q = $abc$47848$lo143).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47988 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li139_li139, Q = $abc$47848$lo139).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47987 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li138_li138, Q = $abc$47848$lo138).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47965 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li116_li116, Q = $abc$47848$lo116).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47957 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li108_li108, Q = $abc$47848$lo108).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47956 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li107_li107, Q = $abc$47848$lo107).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47955 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li106_li106, Q = $abc$47848$lo106).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47954 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li105_li105, Q = $abc$47848$lo105).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47953 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li104_li104, Q = $abc$47848$lo104).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47952 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li103_li103, Q = $abc$47848$lo103).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47951 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li102_li102, Q = $abc$47848$lo102).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47950 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li101_li101, Q = $abc$47848$lo101).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47938 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li089_li089, Q = $abc$47848$lo089).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47928 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo056, Q = $abc$47848$lo079).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47926 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo055, Q = $abc$47848$lo077).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47917 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo049, Q = $abc$47848$lo068).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47916 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo046, Q = $abc$47848$lo067).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47911 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo053, Q = $abc$47848$lo062).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47910 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo051, Q = $abc$47848$lo061).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47909 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo045, Q = $abc$47848$lo060).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47906 ($_DFF_PP0_) from module s38584 (D = $abc$47848$lo043, Q = $abc$47848$lo057).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47903 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li054_li054, Q = $abc$47848$lo054).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47901 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li052_li052, Q = $abc$47848$lo052).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47897 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li048_li048, Q = $abc$47848$lo048).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47893 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li044_li044, Q = $abc$47848$lo044).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47886 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li037_li037, Q = $abc$47848$lo037).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47885 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li036_li036, Q = $abc$47848$lo036).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47882 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li033_li033, Q = $abc$47848$lo033).
Adding EN signal on $abc$47848$auto$blifparse.cc:362:parse_blif$47881 ($_DFF_PP0_) from module s38584 (D = $abc$47848$li032_li032, Q = $abc$47848$lo032).

yosys> opt_clean

3.35.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 121 unused cells and 41059 unused wires.
<suppressed ~29255 debug messages>

yosys> opt_expr

3.35.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~84 debug messages>

3.35.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.35.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.35.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.35.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~174 debug messages>
Removed a total of 58 cells.

yosys> opt_dff -sat

3.35.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$28856 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$new_n3742_, Q = \g5142_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$28602 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$new_n3739_, Q = \g5489_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$28586 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$new_n3745_, Q = \g6527_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$28167 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$lo551, Q = \g4112_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$27574 ($_ALDFF_PP_) from module s38584 (D = \g2509_reg.df2.out, Q = \g2514_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$27573 ($_ALDFF_PP_) from module s38584 (D = \g2375_reg.df2.out, Q = \g2380_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$27286 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$new_n3722_, Q = \g3484_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$27265 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$new_n3719_, Q = \g3133_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$27228 ($_ALDFF_PP_) from module s38584 (D = \g2643_reg.df2.out, Q = \g2648_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$27215 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$lo157, Q = \g1955_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$27188 ($_ALDFF_PP_) from module s38584 (D = \g1604_reg.D, Q = \g1604_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$27166 ($_ALDFF_PP_) from module s38584 (D = \g2433_reg.D, Q = \g2433_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$27084 ($_ALDFF_PP_) from module s38584 (D = \g2567_reg.D, Q = \g2567_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$27064 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$lo162, Q = \g1821_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$27049 ($_ALDFF_PP_) from module s38584 (D = \g2008_reg.D, Q = \g2008_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$26985 ($_ALDFF_PP_) from module s38584 (D = \g2241_reg.df2.out, Q = \g2246_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$26984 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$lo163, Q = \g2089_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$25542 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$new_n3614_, Q = \g2518_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$25540 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$new_n3608_, Q = \g2384_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$25534 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$new_n3602_, Q = \g1959_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$25413 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$new_n3596_, Q = \g1825_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$25387 ($_ALDFF_PP_) from module s38584 (D = $abc$47848$new_n3634_, Q = \g1632_reg.df2.out).

yosys> opt_clean

3.35.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 18 unused cells and 202 unused wires.
<suppressed ~117 debug messages>

yosys> opt_expr

3.35.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~8 debug messages>

3.35.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.35.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.35.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.35.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~21 debug messages>
Removed a total of 7 cells.

yosys> opt_dff -sat

3.35.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.35.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 11 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.35.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.35.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.35.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.35.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.35.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.35.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.35.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> opt_expr

3.35.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.35.30. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  10 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53235, arst=\blif_reset_net, srst={ }
  10 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53225, arst=\blif_reset_net, srst={ }
  9 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53215, arst=\blif_reset_net, srst={ }
  12 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53205, arst=\blif_reset_net, srst={ }
  13 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53195, arst=\blif_reset_net, srst={ }
  12 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53185, arst=\blif_reset_net, srst={ }
  13 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53175, arst=\blif_reset_net, srst={ }
  9 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53165, arst=\blif_reset_net, srst={ }
  38 cells in clk=\blif_clk_net, en=$abc$47848$new_n3592_, arst=\blif_reset_net, srst={ }
  38 cells in clk=\blif_clk_net, en=$abc$47848$new_n3598_, arst=\blif_reset_net, srst={ }
  38 cells in clk=\blif_clk_net, en=$abc$47848$new_n3604_, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=$abc$47848$new_n3610_, arst=\blif_reset_net, srst={ }
  38 cells in clk=\blif_clk_net, en=!$abc$47848$new_n4536_, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=!$abc$47848$new_n4539_, arst=\blif_reset_net, srst={ }
  39 cells in clk=\blif_clk_net, en=!$abc$47848$new_n3631_, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=!$abc$47848$new_n4631_, arst=\blif_reset_net, srst={ }
  14 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53147, arst=\blif_reset_net, srst={ }
  16 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53097, arst=\blif_reset_net, srst={ }
  19 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53087, arst=\blif_reset_net, srst={ }
  14 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53077, arst=\blif_reset_net, srst={ }
  13 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53067, arst=\blif_reset_net, srst={ }
  9 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53027, arst=\blif_reset_net, srst={ }
  9 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$53017, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=!$abc$47848$new_n2976_, arst=\blif_reset_net, srst={ }
  21 cells in clk=\blif_clk_net, en=$abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24625, arst=\blif_reset_net, srst={ }
  13 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52973, arst=\blif_reset_net, srst={ }
  13 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52963, arst=\blif_reset_net, srst={ }
  10 cells in clk=\blif_clk_net, en=$abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24668, arst=\blif_reset_net, srst={ }
  12 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52952, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=!$abc$47848$new_n5064_, arst=\blif_reset_net, srst={ }
  9 cells in clk=\blif_clk_net, en=!$abc$47848$new_n3666_, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=!$abc$47848$new_n3806_, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=!$abc$47848$new_n2879_, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=!$abc$47848$new_n4066_, arst=\blif_reset_net, srst={ }
  23 cells in clk=\blif_clk_net, en=$abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24638, arst=\blif_reset_net, srst={ }
  21 cells in clk=\blif_clk_net, en=$abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24632, arst=\blif_reset_net, srst={ }
  10 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52922, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=!$abc$47848$new_n2932_, arst=\blif_reset_net, srst={ }
  12 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52911, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=!$abc$47848$new_n2919_, arst=\blif_reset_net, srst={ }
  13 cells in clk=\blif_clk_net, en=$abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24604, arst=\blif_reset_net, srst={ }
  36 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52897, arst=\blif_reset_net, srst={ }
  13 cells in clk=\blif_clk_net, en=$abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24586, arst=\blif_reset_net, srst={ }
  11 cells in clk=\blif_clk_net, en=$abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24610, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52883, arst=\blif_reset_net, srst={ }
  4 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52873, arst=\blif_reset_net, srst={ }
  26 cells in clk=\blif_clk_net, en=$abc$47848$new_n5576_, arst=\blif_reset_net, srst={ }
  4 cells in clk=\blif_clk_net, en=!$abc$47848$new_n6107_, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52856, arst=\blif_reset_net, srst={ }
  6 cells in clk=\blif_clk_net, en=$abc$47848$new_n6125_, arst=\blif_reset_net, srst={ }
  11 cells in clk=\blif_clk_net, en=$abc$47848$new_n5910_, arst=\blif_reset_net, srst={ }
  6 cells in clk=\blif_clk_net, en=!$abc$47848$new_n5909_, arst=\blif_reset_net, srst={ }
  4 cells in clk=\blif_clk_net, en=$abc$47848$new_n6154_, arst=\blif_reset_net, srst={ }
  4 cells in clk=\blif_clk_net, en=!$abc$47848$new_n6157_, arst=\blif_reset_net, srst={ }
  4 cells in clk=\blif_clk_net, en=!$abc$47848$new_n6212_, arst=\blif_reset_net, srst={ }
  4 cells in clk=\blif_clk_net, en=!$abc$47848$new_n6259_, arst=\blif_reset_net, srst={ }
  4 cells in clk=\blif_clk_net, en=!$abc$47848$new_n6261_, arst=\blif_reset_net, srst={ }
  4 cells in clk=\blif_clk_net, en=!$abc$47848$new_n6263_, arst=\blif_reset_net, srst={ }
  4 cells in clk=\blif_clk_net, en=!$abc$47848$new_n6267_, arst=\blif_reset_net, srst={ }
  4 cells in clk=\blif_clk_net, en=!$abc$47848$new_n6269_, arst=\blif_reset_net, srst={ }
  4 cells in clk=\blif_clk_net, en=!$abc$47848$new_n6271_, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=$abc$47848$new_n5251_, arst=\blif_reset_net, srst={ }
  6 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52821, arst=\blif_reset_net, srst={ }
  3 cells in clk=\blif_clk_net, en=$abc$47848$new_n6386_, arst=\blif_reset_net, srst={ }
  6 cells in clk=\blif_clk_net, en=!$abc$47848$new_n6385_, arst=\blif_reset_net, srst={ }
  12 cells in clk=\blif_clk_net, en=!$abc$47848$new_n3771_, arst=\blif_reset_net, srst={ }
  10 cells in clk=\blif_clk_net, en=$abc$47848$new_n3760_, arst=\blif_reset_net, srst={ }
  8 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52747, arst=\blif_reset_net, srst={ }
  3 cells in clk=\blif_clk_net, en=!$abc$47848$new_n3759_, arst=\blif_reset_net, srst={ }
  10 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52736, arst=\blif_reset_net, srst={ }
  10 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52726, arst=\blif_reset_net, srst={ }
  116 cells in clk=\blif_clk_net, en=!\g35, arst=\blif_reset_net, srst={ }
  121 cells in clk=\blif_clk_net, en=\g65294.I0_out, arst=\blif_reset_net, srst={ }
  7 cells in clk=\blif_clk_net, en=$auto$opt_dff.cc:194:make_patterns_logic$52704, arst=\blif_reset_net, srst={ }
  3738 cells in clk=\blif_clk_net, en={ }, arst=\blif_reset_net, srst={ }

3.36.2. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53235, asynchronously reset by \blif_reset_net
Extracted 8 gates and 15 wires to a netlist network with 6 inputs and 3 outputs.

3.36.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:        internal signals:        6
ABC RESULTS:           input signals:        6
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.3. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53225, asynchronously reset by \blif_reset_net
Extracted 8 gates and 15 wires to a netlist network with 6 inputs and 3 outputs.

3.36.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:        internal signals:        6
ABC RESULTS:           input signals:        6
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.4. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53215, asynchronously reset by \blif_reset_net
Extracted 7 gates and 13 wires to a netlist network with 5 inputs and 3 outputs.

3.36.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        5
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.5. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53205, asynchronously reset by \blif_reset_net
Extracted 10 gates and 19 wires to a netlist network with 8 inputs and 4 outputs.

3.36.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        7
ABC RESULTS:           input signals:        8
ABC RESULTS:          output signals:        4
Removing temp directory.

3.36.6. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53195, asynchronously reset by \blif_reset_net
Extracted 11 gates and 21 wires to a netlist network with 9 inputs and 4 outputs.

3.36.6.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.6.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:        internal signals:        8
ABC RESULTS:           input signals:        9
ABC RESULTS:          output signals:        4
Removing temp directory.

3.36.7. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53185, asynchronously reset by \blif_reset_net
Extracted 10 gates and 19 wires to a netlist network with 8 inputs and 4 outputs.

3.36.7.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.7.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        7
ABC RESULTS:           input signals:        8
ABC RESULTS:          output signals:        4
Removing temp directory.

3.36.8. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53175, asynchronously reset by \blif_reset_net
Extracted 11 gates and 21 wires to a netlist network with 9 inputs and 4 outputs.

3.36.8.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.8.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:        internal signals:        8
ABC RESULTS:           input signals:        9
ABC RESULTS:          output signals:        4
Removing temp directory.

3.36.9. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53165, asynchronously reset by \blif_reset_net
Extracted 7 gates and 13 wires to a netlist network with 5 inputs and 3 outputs.

3.36.9.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.9.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        5
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.10. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$47848$new_n3592_, asynchronously reset by \blif_reset_net
Extracted 34 gates and 51 wires to a netlist network with 17 inputs and 11 outputs.

3.36.10.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.10.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               MUX cells:        2
ABC RESULTS:             ORNOT cells:        6
ABC RESULTS:                OR cells:        4
ABC RESULTS:               AND cells:        6
ABC RESULTS:              NAND cells:        9
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       23
ABC RESULTS:           input signals:       17
ABC RESULTS:          output signals:       11
Removing temp directory.

3.36.11. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$47848$new_n3598_, asynchronously reset by \blif_reset_net
Extracted 34 gates and 51 wires to a netlist network with 17 inputs and 11 outputs.

3.36.11.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.11.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:             ORNOT cells:        6
ABC RESULTS:                OR cells:        4
ABC RESULTS:               AND cells:        6
ABC RESULTS:              NAND cells:        9
ABC RESULTS:               MUX cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       23
ABC RESULTS:           input signals:       17
ABC RESULTS:          output signals:       11
Removing temp directory.

3.36.12. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$47848$new_n3604_, asynchronously reset by \blif_reset_net
Extracted 34 gates and 51 wires to a netlist network with 17 inputs and 11 outputs.

3.36.12.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.12.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               MUX cells:        2
ABC RESULTS:             ORNOT cells:        6
ABC RESULTS:                OR cells:        4
ABC RESULTS:               AND cells:        6
ABC RESULTS:              NAND cells:        9
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       23
ABC RESULTS:           input signals:       17
ABC RESULTS:          output signals:       11
Removing temp directory.

3.36.13. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$47848$new_n3610_, asynchronously reset by \blif_reset_net
Extracted 7 gates and 13 wires to a netlist network with 6 inputs and 6 outputs.

3.36.13.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.13.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:                OR cells:        2
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        6
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.14. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n4536_, asynchronously reset by \blif_reset_net
Extracted 34 gates and 50 wires to a netlist network with 16 inputs and 11 outputs.

3.36.14.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.14.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:               MUX cells:        2
ABC RESULTS:             ORNOT cells:        5
ABC RESULTS:                OR cells:        3
ABC RESULTS:               AND cells:        6
ABC RESULTS:              NAND cells:        9
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       23
ABC RESULTS:           input signals:       16
ABC RESULTS:          output signals:       11
Removing temp directory.

3.36.15. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n4539_, asynchronously reset by \blif_reset_net
Extracted 7 gates and 13 wires to a netlist network with 6 inputs and 6 outputs.

3.36.15.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.15.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        6
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.16. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n3631_, asynchronously reset by \blif_reset_net
Extracted 35 gates and 50 wires to a netlist network with 15 inputs and 12 outputs.

3.36.16.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.16.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:            ANDNOT cells:        5
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:                OR cells:        4
ABC RESULTS:               AND cells:        5
ABC RESULTS:              NAND cells:       10
ABC RESULTS:               MUX cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       23
ABC RESULTS:           input signals:       15
ABC RESULTS:          output signals:       12
Removing temp directory.

3.36.17. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n4631_, asynchronously reset by \blif_reset_net
Extracted 7 gates and 13 wires to a netlist network with 6 inputs and 6 outputs.

3.36.17.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.17.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        6
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.18. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53147, asynchronously reset by \blif_reset_net
Extracted 12 gates and 26 wires to a netlist network with 13 inputs and 5 outputs.

3.36.18.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.18.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:                OR cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        3
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               MUX cells:        2
ABC RESULTS:        internal signals:        8
ABC RESULTS:           input signals:       13
ABC RESULTS:          output signals:        5
Removing temp directory.

3.36.19. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53097, asynchronously reset by \blif_reset_net
Extracted 16 gates and 27 wires to a netlist network with 10 inputs and 9 outputs.

3.36.19.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.19.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:                OR cells:        3
ABC RESULTS:               AND cells:        3
ABC RESULTS:             ORNOT cells:        6
ABC RESULTS:              NAND cells:        6
ABC RESULTS:        internal signals:        8
ABC RESULTS:           input signals:       10
ABC RESULTS:          output signals:        9
Removing temp directory.

3.36.20. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53087, asynchronously reset by \blif_reset_net
Extracted 19 gates and 33 wires to a netlist network with 13 inputs and 9 outputs.

3.36.20.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.20.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:                OR cells:        3
ABC RESULTS:               AND cells:        4
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              NAND cells:        8
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       11
ABC RESULTS:           input signals:       13
ABC RESULTS:          output signals:        9
Removing temp directory.

3.36.21. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53077, asynchronously reset by \blif_reset_net
Extracted 14 gates and 24 wires to a netlist network with 9 inputs and 9 outputs.

3.36.21.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.21.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:             ORNOT cells:        5
ABC RESULTS:              NAND cells:        6
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        6
ABC RESULTS:           input signals:        9
ABC RESULTS:          output signals:        9
Removing temp directory.

3.36.22. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53067, asynchronously reset by \blif_reset_net
Extracted 13 gates and 24 wires to a netlist network with 10 inputs and 9 outputs.

3.36.22.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.22.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:                OR cells:        3
ABC RESULTS:               AND cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              NAND cells:        8
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        5
ABC RESULTS:           input signals:       10
ABC RESULTS:          output signals:        9
Removing temp directory.

3.36.23. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53027, asynchronously reset by \blif_reset_net
Extracted 9 gates and 17 wires to a netlist network with 8 inputs and 4 outputs.

3.36.23.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.23.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:        internal signals:        5
ABC RESULTS:           input signals:        8
ABC RESULTS:          output signals:        4
Removing temp directory.

3.36.24. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$53017, asynchronously reset by \blif_reset_net
Extracted 9 gates and 17 wires to a netlist network with 8 inputs and 4 outputs.

3.36.24.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.24.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:        internal signals:        5
ABC RESULTS:           input signals:        8
ABC RESULTS:          output signals:        4
Removing temp directory.

3.36.25. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n2976_, asynchronously reset by \blif_reset_net
Extracted 7 gates and 12 wires to a netlist network with 5 inputs and 6 outputs.

3.36.25.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.25.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.26. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24625, asynchronously reset by \blif_reset_net
Extracted 20 gates and 38 wires to a netlist network with 18 inputs and 8 outputs.

3.36.26.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.26.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:                OR cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               NOR cells:        2
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               AND cells:        4
ABC RESULTS:              NAND cells:        5
ABC RESULTS:              XNOR cells:        3
ABC RESULTS:        internal signals:       12
ABC RESULTS:           input signals:       18
ABC RESULTS:          output signals:        8
Removing temp directory.

3.36.27. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52973, asynchronously reset by \blif_reset_net
Extracted 11 gates and 20 wires to a netlist network with 8 inputs and 5 outputs.

3.36.27.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.27.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:        internal signals:        7
ABC RESULTS:           input signals:        8
ABC RESULTS:          output signals:        5
Removing temp directory.

3.36.28. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52963, asynchronously reset by \blif_reset_net
Extracted 11 gates and 20 wires to a netlist network with 8 inputs and 5 outputs.

3.36.28.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.28.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:        internal signals:        7
ABC RESULTS:           input signals:        8
ABC RESULTS:          output signals:        5
Removing temp directory.

3.36.29. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24668, asynchronously reset by \blif_reset_net
Extracted 8 gates and 15 wires to a netlist network with 7 inputs and 4 outputs.

3.36.29.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.29.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:        internal signals:        4
ABC RESULTS:           input signals:        7
ABC RESULTS:          output signals:        4
Removing temp directory.

3.36.30. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52952, asynchronously reset by \blif_reset_net
Extracted 10 gates and 18 wires to a netlist network with 7 inputs and 5 outputs.

3.36.30.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.30.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        6
ABC RESULTS:           input signals:        7
ABC RESULTS:          output signals:        5
Removing temp directory.

3.36.31. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n5064_, asynchronously reset by \blif_reset_net
Extracted 7 gates and 12 wires to a netlist network with 5 inputs and 6 outputs.

3.36.31.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.31.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.32. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n3666_, asynchronously reset by \blif_reset_net
Extracted 9 gates and 14 wires to a netlist network with 5 inputs and 8 outputs.

3.36.32.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.32.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        8
Removing temp directory.

3.36.33. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n3806_, asynchronously reset by \blif_reset_net
Extracted 7 gates and 12 wires to a netlist network with 5 inputs and 6 outputs.

3.36.33.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.33.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.34. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n2879_, asynchronously reset by \blif_reset_net
Extracted 7 gates and 12 wires to a netlist network with 5 inputs and 6 outputs.

3.36.34.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.34.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.35. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n4066_, asynchronously reset by \blif_reset_net
Extracted 7 gates and 12 wires to a netlist network with 5 inputs and 6 outputs.

3.36.35.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.35.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.36. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24638, asynchronously reset by \blif_reset_net
Extracted 21 gates and 40 wires to a netlist network with 19 inputs and 7 outputs.

3.36.36.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.36.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               MUX cells:        2
ABC RESULTS:                OR cells:        2
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:              NAND cells:        4
ABC RESULTS:               AND cells:        5
ABC RESULTS:              XNOR cells:        3
ABC RESULTS:        internal signals:       14
ABC RESULTS:           input signals:       19
ABC RESULTS:          output signals:        7
Removing temp directory.

3.36.37. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24632, asynchronously reset by \blif_reset_net
Extracted 19 gates and 36 wires to a netlist network with 17 inputs and 7 outputs.

3.36.37.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.37.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               MUX cells:        2
ABC RESULTS:                OR cells:        2
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               AND cells:        3
ABC RESULTS:              NAND cells:        4
ABC RESULTS:              XNOR cells:        3
ABC RESULTS:        internal signals:       12
ABC RESULTS:           input signals:       17
ABC RESULTS:          output signals:        7
Removing temp directory.

3.36.38. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52922, asynchronously reset by \blif_reset_net
Extracted 9 gates and 18 wires to a netlist network with 8 inputs and 5 outputs.

3.36.38.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.38.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:               MUX cells:        2
ABC RESULTS:        internal signals:        5
ABC RESULTS:           input signals:        8
ABC RESULTS:          output signals:        5
Removing temp directory.

3.36.39. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n2932_, asynchronously reset by \blif_reset_net
Extracted 7 gates and 12 wires to a netlist network with 5 inputs and 6 outputs.

3.36.39.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.39.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.40. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52911, asynchronously reset by \blif_reset_net
Extracted 11 gates and 22 wires to a netlist network with 10 inputs and 6 outputs.

3.36.40.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.40.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:               AND cells:        3
ABC RESULTS:               MUX cells:        2
ABC RESULTS:        internal signals:        6
ABC RESULTS:           input signals:       10
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.41. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n2919_, asynchronously reset by \blif_reset_net
Extracted 7 gates and 12 wires to a netlist network with 5 inputs and 6 outputs.

3.36.41.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.41.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.42. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24604, asynchronously reset by \blif_reset_net
Extracted 12 gates and 24 wires to a netlist network with 12 inputs and 6 outputs.

3.36.42.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.42.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               MUX cells:        2
ABC RESULTS:              NAND cells:        1
ABC RESULTS:                OR cells:        2
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:        internal signals:        6
ABC RESULTS:           input signals:       12
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.43. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52897, asynchronously reset by \blif_reset_net
Extracted 36 gates and 53 wires to a netlist network with 16 inputs and 18 outputs.

3.36.43.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.43.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        8
ABC RESULTS:               NOT cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               AND cells:        3
ABC RESULTS:            ANDNOT cells:        9
ABC RESULTS:               MUX cells:       10
ABC RESULTS:        internal signals:       19
ABC RESULTS:           input signals:       16
ABC RESULTS:          output signals:       18
Removing temp directory.

3.36.44. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24586, asynchronously reset by \blif_reset_net
Extracted 12 gates and 24 wires to a netlist network with 12 inputs and 6 outputs.

3.36.44.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.44.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               MUX cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:                OR cells:        2
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:        internal signals:        6
ABC RESULTS:           input signals:       12
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.45. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$38101$auto$opt_dff.cc:194:make_patterns_logic$24610, asynchronously reset by \blif_reset_net
Extracted 10 gates and 21 wires to a netlist network with 11 inputs and 5 outputs.

3.36.45.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.45.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               MUX cells:        2
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        5
ABC RESULTS:           input signals:       11
ABC RESULTS:          output signals:        5
Removing temp directory.

3.36.46. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52883, asynchronously reset by \blif_reset_net
Extracted 7 gates and 15 wires to a netlist network with 7 inputs and 4 outputs.

3.36.46.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.46.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               AND cells:        2
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:        internal signals:        4
ABC RESULTS:           input signals:        7
ABC RESULTS:          output signals:        4
Removing temp directory.

3.36.47. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52873, asynchronously reset by \blif_reset_net
Extracted 3 gates and 8 wires to a netlist network with 5 inputs and 2 outputs.

3.36.47.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.47.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        2
Removing temp directory.

3.36.48. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$47848$new_n5576_, asynchronously reset by \blif_reset_net
Extracted 25 gates and 36 wires to a netlist network with 11 inputs and 16 outputs.

3.36.48.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.48.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        7
ABC RESULTS:               NOT cells:        2
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:                OR cells:        4
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               AND cells:        4
ABC RESULTS:               BUF cells:        7
ABC RESULTS:        internal signals:        9
ABC RESULTS:           input signals:       11
ABC RESULTS:          output signals:       16
Removing temp directory.

3.36.49. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n6107_, asynchronously reset by \blif_reset_net
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 3 outputs.

3.36.49.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.49.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.50. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52856, asynchronously reset by \blif_reset_net
Extracted 7 gates and 13 wires to a netlist network with 6 inputs and 5 outputs.

3.36.50.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.50.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               AND cells:        2
ABC RESULTS:               MUX cells:        1
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        6
ABC RESULTS:          output signals:        5
Removing temp directory.

3.36.51. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$47848$new_n6125_, asynchronously reset by \blif_reset_net
Extracted 6 gates and 11 wires to a netlist network with 5 inputs and 3 outputs.

3.36.51.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.51.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:               AND cells:        3
ABC RESULTS:        internal signals:        3
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.52. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$47848$new_n5910_, asynchronously reset by \blif_reset_net
Extracted 11 gates and 16 wires to a netlist network with 5 inputs and 8 outputs.

3.36.52.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.52.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        3
ABC RESULTS:              NAND cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:                OR cells:        5
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               BUF cells:        3
ABC RESULTS:        internal signals:        3
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        8
Removing temp directory.

3.36.53. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n5909_, asynchronously reset by \blif_reset_net
Extracted 6 gates and 10 wires to a netlist network with 4 inputs and 5 outputs.

3.36.53.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.53.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:               BUF cells:        3
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        5
Removing temp directory.

3.36.54. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$47848$new_n6154_, asynchronously reset by \blif_reset_net
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 2 outputs.

3.36.54.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.54.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        2
Removing temp directory.

3.36.55. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n6157_, asynchronously reset by \blif_reset_net
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 3 outputs.

3.36.55.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.55.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.56. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n6212_, asynchronously reset by \blif_reset_net
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 3 outputs.

3.36.56.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.56.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.57. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n6259_, asynchronously reset by \blif_reset_net
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 3 outputs.

3.36.57.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.57.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.58. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n6261_, asynchronously reset by \blif_reset_net
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 3 outputs.

3.36.58.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.58.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.59. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n6263_, asynchronously reset by \blif_reset_net
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 3 outputs.

3.36.59.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.59.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.60. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n6267_, asynchronously reset by \blif_reset_net
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 3 outputs.

3.36.60.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.60.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.61. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n6269_, asynchronously reset by \blif_reset_net
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 3 outputs.

3.36.61.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.61.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.62. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n6271_, asynchronously reset by \blif_reset_net
Extracted 4 gates and 9 wires to a netlist network with 5 inputs and 3 outputs.

3.36.62.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.62.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.63. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$47848$new_n5251_, asynchronously reset by \blif_reset_net
Extracted 7 gates and 12 wires to a netlist network with 5 inputs and 3 outputs.

3.36.63.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.63.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:                OR cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        4
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.64. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52821, asynchronously reset by \blif_reset_net
Extracted 6 gates and 11 wires to a netlist network with 5 inputs and 5 outputs.

3.36.64.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.64.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        5
Removing temp directory.

3.36.65. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$47848$new_n6386_, asynchronously reset by \blif_reset_net
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 3 outputs.

3.36.65.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.65.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.66. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n6385_, asynchronously reset by \blif_reset_net
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 5 outputs.

3.36.66.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.66.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:                OR cells:        2
ABC RESULTS:               BUF cells:        3
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        7
ABC RESULTS:          output signals:        5
Removing temp directory.

3.36.67. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n3771_, asynchronously reset by \blif_reset_net
Extracted 12 gates and 18 wires to a netlist network with 6 inputs and 6 outputs.

3.36.67.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.67.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:                OR cells:        2
ABC RESULTS:               AND cells:        3
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              NAND cells:        3
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        6
ABC RESULTS:           input signals:        6
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.68. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $abc$47848$new_n3760_, asynchronously reset by \blif_reset_net
Extracted 10 gates and 17 wires to a netlist network with 7 inputs and 5 outputs.

3.36.68.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.68.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:                OR cells:        2
ABC RESULTS:               AND cells:        2
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              NAND cells:        4
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        5
ABC RESULTS:           input signals:        7
ABC RESULTS:          output signals:        5
Removing temp directory.

3.36.69. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52747, asynchronously reset by \blif_reset_net
Extracted 8 gates and 16 wires to a netlist network with 8 inputs and 4 outputs.

3.36.69.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.69.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:                OR cells:        2
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               MUX cells:        2
ABC RESULTS:        internal signals:        4
ABC RESULTS:           input signals:        8
ABC RESULTS:          output signals:        4
Removing temp directory.

3.36.70. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !$abc$47848$new_n3759_, asynchronously reset by \blif_reset_net
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 3 outputs.

3.36.70.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.70.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.71. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52736, asynchronously reset by \blif_reset_net
Extracted 10 gates and 18 wires to a netlist network with 7 inputs and 4 outputs.

3.36.71.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.71.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:                OR cells:        2
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:               MUX cells:        2
ABC RESULTS:        internal signals:        7
ABC RESULTS:           input signals:        7
ABC RESULTS:          output signals:        4
Removing temp directory.

3.36.72. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52726, asynchronously reset by \blif_reset_net
Extracted 10 gates and 18 wires to a netlist network with 7 inputs and 4 outputs.

3.36.72.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.72.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:                OR cells:        2
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               AND cells:        2
ABC RESULTS:               MUX cells:        2
ABC RESULTS:        internal signals:        7
ABC RESULTS:           input signals:        7
ABC RESULTS:          output signals:        4
Removing temp directory.

3.36.73. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by !\g35, asynchronously reset by \blif_reset_net
Extracted 108 gates and 163 wires to a netlist network with 55 inputs and 47 outputs.

3.36.73.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.73.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       38
ABC RESULTS:               NOT cells:        6
ABC RESULTS:               NOR cells:        8
ABC RESULTS:                OR cells:        6
ABC RESULTS:             ORNOT cells:       12
ABC RESULTS:               MUX cells:       11
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:              NAND cells:        9
ABC RESULTS:               AND cells:       11
ABC RESULTS:               BUF cells:       41
ABC RESULTS:        internal signals:       61
ABC RESULTS:           input signals:       55
ABC RESULTS:          output signals:       47
Removing temp directory.

3.36.74. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by \g65294.I0_out, asynchronously reset by \blif_reset_net
Extracted 99 gates and 138 wires to a netlist network with 38 inputs and 53 outputs.

3.36.74.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.74.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       22
ABC RESULTS:               NOT cells:        7
ABC RESULTS:              NAND cells:       31
ABC RESULTS:               AND cells:        8
ABC RESULTS:            ANDNOT cells:        6
ABC RESULTS:               MUX cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:             ORNOT cells:       16
ABC RESULTS:              XNOR cells:        7
ABC RESULTS:               BUF cells:       28
ABC RESULTS:        internal signals:       47
ABC RESULTS:           input signals:       38
ABC RESULTS:          output signals:       53
Removing temp directory.

3.36.75. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, enabled by $auto$opt_dff.cc:194:make_patterns_logic$52704, asynchronously reset by \blif_reset_net
Extracted 7 gates and 12 wires to a netlist network with 4 inputs and 6 outputs.

3.36.75.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.75.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:              NAND cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.76. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, asynchronously reset by \blif_reset_net
Extracted 3585 gates and 4061 wires to a netlist network with 475 inputs and 524 outputs.

3.36.76.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.76.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      491
ABC RESULTS:               NOT cells:       54
ABC RESULTS:               NOR cells:      117
ABC RESULTS:            ANDNOT cells:      272
ABC RESULTS:             ORNOT cells:      257
ABC RESULTS:              NAND cells:      943
ABC RESULTS:               XOR cells:       25
ABC RESULTS:               MUX cells:      198
ABC RESULTS:              XNOR cells:      104
ABC RESULTS:                OR cells:      393
ABC RESULTS:               AND cells:      742
ABC RESULTS:               BUF cells:      253
ABC RESULTS:        internal signals:     3062
ABC RESULTS:           input signals:      475
ABC RESULTS:          output signals:      524
Removing temp directory.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> abc -script /tmp/yosys_jgds8f/abc_tmp_1.scr

3.38. Executing ABC pass (technology mapping using ABC).

3.38.1. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Extracted 3925 gates and 4809 wires to a netlist network with 884 inputs and 800 outputs.

3.38.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /tmp/yosys_jgds8f/abc_tmp_1.scr 
ABC:   #PIs = 884  #Luts =  1178  Max Lvl =  10  Avg Lvl =   2.72  [   0.17 sec. at Pass 0]
ABC:   #PIs = 884  #Luts =  1169  Max Lvl =   7  Avg Lvl =   2.69  [   5.48 sec. at Pass 1]
ABC:   #PIs = 884  #Luts =  1161  Max Lvl =   7  Avg Lvl =   2.57  [   1.05 sec. at Pass 2]
ABC:   #PIs = 884  #Luts =  1147  Max Lvl =  10  Avg Lvl =   2.66  [   1.31 sec. at Pass 3]
ABC:   #PIs = 884  #Luts =  1147  Max Lvl =  10  Avg Lvl =   2.66  [   0.98 sec. at Pass 4]
ABC:   #PIs = 884  #Luts =  1139  Max Lvl =   9  Avg Lvl =   2.64  [   2.35 sec. at Pass 5]
ABC:   #PIs = 884  #Luts =  1139  Max Lvl =   9  Avg Lvl =   2.64  [   1.39 sec. at Pass 6]
ABC:   #PIs = 884  #Luts =  1135  Max Lvl =   7  Avg Lvl =   2.63  [   1.45 sec. at Pass 7]
ABC:   #PIs = 884  #Luts =  1135  Max Lvl =   7  Avg Lvl =   2.63  [   1.11 sec. at Pass 8]
ABC:   #PIs = 884  #Luts =  1131  Max Lvl =   8  Avg Lvl =   2.62  [   2.40 sec. at Pass 9]
ABC:   #PIs = 884  #Luts =  1131  Max Lvl =   8  Avg Lvl =   2.62  [   1.27 sec. at Pass 10]
ABC:   #PIs = 884  #Luts =  1129  Max Lvl =   8  Avg Lvl =   2.56  [   1.19 sec. at Pass 11]
ABC:   #PIs = 884  #Luts =  1129  Max Lvl =   8  Avg Lvl =   2.56  [   1.22 sec. at Pass 12]
ABC:   #PIs = 884  #Luts =  1129  Max Lvl =   8  Avg Lvl =   2.56  [   1.36 sec. at Pass 13]
ABC:   #PIs = 884  #Luts =  1129  Max Lvl =   8  Avg Lvl =   2.56  [   1.26 sec. at Pass 14]
ABC:   #PIs = 884  #Luts =  1129  Max Lvl =   8  Avg Lvl =   2.56  [   0.31 sec. at Pass 15]
ABC:   [DE total time =   25.13 sec. ]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.38.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     1129
ABC RESULTS:        internal signals:     3125
ABC RESULTS:           input signals:      884
ABC RESULTS:          output signals:      800
Removing temp directory.

yosys> opt

3.39. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.39.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_merge -nomux

3.39.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.39.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.39.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.39.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff

3.39.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 10949 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.39.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.39.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.39.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.39.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.39.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff

3.39.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> opt_expr

3.39.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.39.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.40. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 1 inverters.

yosys> stat

3.41. Printing statistics.

=== s38584 ===

   Number of wires:              24850
   Number of wire bits:          24850
   Number of public wires:       23381
   Number of public wire bits:   23381
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2004
     $_ALDFFE_PPN_                   1
     $_ALDFFE_PPP_                  58
     $_ALDFF_PP_                   182
     $_DFFE_PP0N_                   66
     $_DFFE_PP0P_                   97
     $_DFF_PP0_                    490
     $_DFF_PP1_                      1
     $lut                         1109


yosys> shregmap -minlen 8 -maxlen 20

3.42. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.43. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.44. Printing statistics.

=== s38584 ===

   Number of wires:              25332
   Number of wire bits:          25332
   Number of public wires:       23381
   Number of public wire bits:   23381
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2486
     $_ANDNOT_                     241
     $_AND_                        241
     $_DFFE_PP0N_                   66
     $_DFFE_PP0P_                   97
     $_DFFSRE_PPPN_                  1
     $_DFFSRE_PPPP_                 58
     $_DFFSR_PPP_                  182
     $_DFF_PP0_                    490
     $_DFF_PP1_                      1
     $lut                         1109


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.45. Executing TECHMAP pass (map to technology primitives).

3.45.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.45.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.45.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using template \$_DFFSR_PPP_ for cells of type $_DFFSR_PPP_.
Using template \$_DFFE_PP0N_ for cells of type $_DFFE_PP0N_.
Using template \$_DFFSRE_PPPP_ for cells of type $_DFFSRE_PPPP_.
Using template \$_DFFSRE_PPPN_ for cells of type $_DFFSRE_PPPN_.
Using template \$_DFF_PP1_ for cells of type $_DFF_PP1_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~3343 debug messages>

yosys> opt_expr -mux_undef

3.46. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~25455 debug messages>

yosys> simplemap

3.47. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_merge

3.49. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~10284 debug messages>
Removed a total of 3428 cells.

yosys> opt_dff -nodffe -nosdff

3.50. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.51. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 7886 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.52. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.52.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~483 debug messages>

yosys> opt_merge -nomux

3.52.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~18 debug messages>
Removed a total of 6 cells.

yosys> opt_muxtree

3.52.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.52.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.52.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.52.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 219 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.52.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.52.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.52.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.52.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.52.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.52.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> opt_expr

3.52.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.52.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_jgds8f/abc_tmp_2.scr

3.53. Executing ABC pass (technology mapping using ABC).

3.53.1. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Extracted 4396 gates and 5282 wires to a netlist network with 884 inputs and 779 outputs.

3.53.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /tmp/yosys_jgds8f/abc_tmp_2.scr 
ABC:   #PIs = 884  #Luts =  1113  Max Lvl =   8  Avg Lvl =   2.55  [   0.15 sec. at Pass 0]
ABC:   #PIs = 884  #Luts =  1111  Max Lvl =   8  Avg Lvl =   2.55  [   4.61 sec. at Pass 1]
ABC:   #PIs = 884  #Luts =  1111  Max Lvl =   8  Avg Lvl =   2.55  [   0.87 sec. at Pass 2]
ABC:   #PIs = 884  #Luts =  1109  Max Lvl =   7  Avg Lvl =   2.53  [   1.34 sec. at Pass 3]
ABC:   #PIs = 884  #Luts =  1109  Max Lvl =   7  Avg Lvl =   2.53  [   1.28 sec. at Pass 4]
ABC:   #PIs = 884  #Luts =  1109  Max Lvl =   7  Avg Lvl =   2.53  [   1.38 sec. at Pass 5]
ABC:   #PIs = 884  #Luts =  1109  Max Lvl =   7  Avg Lvl =   2.53  [   1.24 sec. at Pass 6]
ABC:   #PIs = 884  #Luts =  1109  Max Lvl =   7  Avg Lvl =   2.53  [   0.26 sec. at Pass 7]
ABC:   [DE total time =   11.36 sec. ]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.53.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     1109
ABC RESULTS:        internal signals:     3619
ABC RESULTS:           input signals:      884
ABC RESULTS:          output signals:      779
Removing temp directory.

yosys> opt

3.54. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.54.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_merge -nomux

3.54.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.54.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.54.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff

3.54.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 4448 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.54.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.54.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.54.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.54.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff

3.54.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> opt_expr

3.54.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

3.54.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.55. Executing HIERARCHY pass (managing design hierarchy).

3.55.1. Analyzing design hierarchy..
Top module:  \s38584

3.55.2. Analyzing design hierarchy..
Top module:  \s38584
Removed 0 unused modules.

yosys> stat

3.56. Printing statistics.

=== s38584 ===

   Number of wires:              24848
   Number of wire bits:          24848
   Number of public wires:       23381
   Number of public wire bits:   23381
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2003
     $lut                         1108
     dffsre                        895


yosys> opt_clean -purge

3.57. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 22667 unused wires.
<suppressed ~22667 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.58. Executing Verilog backend.

yosys> bmuxmap

3.58.1. Executing BMUXMAP pass.

yosys> demuxmap

3.58.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\s38584'.

Warnings: 27 unique messages, 27 total
End of script. Logfile hash: 330e5bef97, CPU: user 131.95s system 1.31s, MEM: 177.80 MB peak
Yosys 0.16+65 (git sha1 03bd62bb8, gcc 9.1.0 -fPIC -Os)
Time spent: 70% 6x abc (299 sec), 10% 32x opt_clean (43 sec), ...
real 186.04
user 387.36
sys 39.24
