
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.16+6 (git sha1 0c82fb7e3, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k decoder.v encoder.v multi_enc_decx2x4.v topenc_decx2.v

yosys> verific -vlog2k decoder.v encoder.v multi_enc_decx2x4.v topenc_decx2.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'decoder.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'encoder.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'multi_enc_decx2x4.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'topenc_decx2.v'

yosys> synth_rs -top top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.2.36

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top top

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] topenc_decx2.v:2: compiling module 'top'
VERIFIC-INFO [VERI-1018] encoder.v:1: compiling module 'encoder128'
VERIFIC-INFO [VERI-1018] decoder.v:1: compiling module 'decoder128'
Importing module top.
Importing module decoder128.
Importing module encoder128.

3.3.1. Analyzing design hierarchy..
Top module:  \top
Used module:     \decoder128
Used module:     \encoder128

3.3.2. Analyzing design hierarchy..
Top module:  \top
Used module:     \decoder128
Used module:     \encoder128
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module encoder128.
<suppressed ~1 debug messages>
Optimizing module decoder128.
<suppressed ~1 debug messages>
Optimizing module top.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module encoder128.
Deleting now unused module decoder128.
<suppressed ~4 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1072 unused wires.
<suppressed ~5 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module top...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~4 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
    New ctrl vector for $pmux cell $flatten\U01.$verific$select_261$encoder.v:147$1096: { $flatten\U01.$verific$n1037$706 $flatten\U01.$verific$n1038$707 $flatten\U01.$verific$n1039$708 $flatten\U01.$verific$n1040$709 $flatten\U01.$verific$n1041$710 $flatten\U01.$verific$n1042$711 $flatten\U01.$verific$n1043$712 $flatten\U01.$verific$n1045$714 $flatten\U01.$verific$n1046$715 $flatten\U01.$verific$n1047$716 $auto$opt_reduce.cc:134:opt_pmux$1113 $flatten\U01.$verific$n1049$718 $flatten\U01.$verific$n1050$719 $flatten\U01.$verific$n1051$720 $flatten\U01.$verific$n1052$721 $flatten\U01.$verific$n1053$722 $flatten\U01.$verific$n1054$723 $flatten\U01.$verific$n1055$724 $flatten\U01.$verific$n1056$725 $flatten\U01.$verific$n1057$726 $flatten\U01.$verific$n1058$727 $flatten\U01.$verific$n1059$728 $flatten\U01.$verific$n1061$730 $flatten\U01.$verific$n1062$731 $flatten\U01.$verific$n1063$732 $auto$opt_reduce.cc:134:opt_pmux$1111 $flatten\U01.$verific$n1065$734 $flatten\U01.$verific$n1066$735 $flatten\U01.$verific$n1067$736 $flatten\U01.$verific$n1068$737 $flatten\U01.$verific$n1069$738 $flatten\U01.$verific$n1070$739 $flatten\U01.$verific$n1071$740 $flatten\U01.$verific$n1072$741 $flatten\U01.$verific$n1073$742 $flatten\U01.$verific$n1074$743 $flatten\U01.$verific$n1075$744 $flatten\U01.$verific$n1077$746 $flatten\U01.$verific$n1078$747 $flatten\U01.$verific$n1079$748 $auto$opt_reduce.cc:134:opt_pmux$1109 $flatten\U01.$verific$n1081$750 $flatten\U01.$verific$n1082$751 $flatten\U01.$verific$n1083$752 $flatten\U01.$verific$n1084$753 $flatten\U01.$verific$n1085$754 $flatten\U01.$verific$n1086$755 $flatten\U01.$verific$n1087$756 $flatten\U01.$verific$n1088$757 $flatten\U01.$verific$n1089$758 $flatten\U01.$verific$n1090$759 $flatten\U01.$verific$n1091$760 $flatten\U01.$verific$n1093$762 $flatten\U01.$verific$n1094$763 $flatten\U01.$verific$n1095$764 $auto$opt_reduce.cc:134:opt_pmux$1107 $flatten\U01.$verific$n1097$766 $flatten\U01.$verific$n1098$767 $flatten\U01.$verific$n1099$768 $flatten\U01.$verific$n1100$769 $flatten\U01.$verific$n1101$770 $flatten\U01.$verific$n1102$771 $flatten\U01.$verific$n1103$772 $flatten\U01.$verific$n1104$773 $flatten\U01.$verific$n1105$774 $flatten\U01.$verific$n1106$775 $flatten\U01.$verific$n1107$776 $flatten\U01.$verific$n1109$778 $flatten\U01.$verific$n1110$779 $flatten\U01.$verific$n1111$780 $auto$opt_reduce.cc:134:opt_pmux$1105 $flatten\U01.$verific$n1113$782 $flatten\U01.$verific$n1114$783 $flatten\U01.$verific$n1115$784 $flatten\U01.$verific$n1116$785 $flatten\U01.$verific$n1117$786 $flatten\U01.$verific$n1118$787 $flatten\U01.$verific$n1119$788 $flatten\U01.$verific$n1120$789 $flatten\U01.$verific$n1121$790 $flatten\U01.$verific$n1122$791 $flatten\U01.$verific$n1123$792 $flatten\U01.$verific$n1125$794 $flatten\U01.$verific$n1126$795 $flatten\U01.$verific$n1127$796 $auto$opt_reduce.cc:134:opt_pmux$1103 $flatten\U01.$verific$n1129$798 $flatten\U01.$verific$n1130$799 $flatten\U01.$verific$n1131$800 $flatten\U01.$verific$n1132$801 $flatten\U01.$verific$n1133$802 $flatten\U01.$verific$n1134$803 $flatten\U01.$verific$n1135$804 $flatten\U01.$verific$n1136$805 $flatten\U01.$verific$n1137$806 $flatten\U01.$verific$n1138$807 $flatten\U01.$verific$n1139$808 $flatten\U01.$verific$n1141$810 $flatten\U01.$verific$n1142$811 $flatten\U01.$verific$n1143$812 $auto$opt_reduce.cc:134:opt_pmux$1101 $flatten\U01.$verific$n1145$814 $flatten\U01.$verific$n1146$815 $flatten\U01.$verific$n1147$816 $flatten\U01.$verific$n1148$817 $flatten\U01.$verific$n1149$818 $flatten\U01.$verific$n1150$819 $flatten\U01.$verific$n1151$820 $flatten\U01.$verific$n1152$821 $flatten\U01.$verific$n1153$822 $flatten\U01.$verific$n1154$823 $flatten\U01.$verific$n1155$824 $flatten\U01.$verific$n1157$826 $flatten\U01.$verific$n1158$827 $flatten\U01.$verific$n1159$828 $auto$opt_reduce.cc:134:opt_pmux$1099 $flatten\U01.$verific$n1161$830 $flatten\U01.$verific$n1162$831 $flatten\U01.$verific$n1163$832 }
    New ctrl vector for $pmux cell $flatten\U011.$verific$select_261$encoder.v:147$1096: { $flatten\U011.$verific$n1037$706 $flatten\U011.$verific$n1038$707 $flatten\U011.$verific$n1039$708 $flatten\U011.$verific$n1040$709 $flatten\U011.$verific$n1041$710 $flatten\U011.$verific$n1042$711 $flatten\U011.$verific$n1043$712 $flatten\U011.$verific$n1045$714 $flatten\U011.$verific$n1046$715 $flatten\U011.$verific$n1047$716 $auto$opt_reduce.cc:134:opt_pmux$1129 $flatten\U011.$verific$n1049$718 $flatten\U011.$verific$n1050$719 $flatten\U011.$verific$n1051$720 $flatten\U011.$verific$n1052$721 $flatten\U011.$verific$n1053$722 $flatten\U011.$verific$n1054$723 $flatten\U011.$verific$n1055$724 $flatten\U011.$verific$n1056$725 $flatten\U011.$verific$n1057$726 $flatten\U011.$verific$n1058$727 $flatten\U011.$verific$n1059$728 $flatten\U011.$verific$n1061$730 $flatten\U011.$verific$n1062$731 $flatten\U011.$verific$n1063$732 $auto$opt_reduce.cc:134:opt_pmux$1127 $flatten\U011.$verific$n1065$734 $flatten\U011.$verific$n1066$735 $flatten\U011.$verific$n1067$736 $flatten\U011.$verific$n1068$737 $flatten\U011.$verific$n1069$738 $flatten\U011.$verific$n1070$739 $flatten\U011.$verific$n1071$740 $flatten\U011.$verific$n1072$741 $flatten\U011.$verific$n1073$742 $flatten\U011.$verific$n1074$743 $flatten\U011.$verific$n1075$744 $flatten\U011.$verific$n1077$746 $flatten\U011.$verific$n1078$747 $flatten\U011.$verific$n1079$748 $auto$opt_reduce.cc:134:opt_pmux$1125 $flatten\U011.$verific$n1081$750 $flatten\U011.$verific$n1082$751 $flatten\U011.$verific$n1083$752 $flatten\U011.$verific$n1084$753 $flatten\U011.$verific$n1085$754 $flatten\U011.$verific$n1086$755 $flatten\U011.$verific$n1087$756 $flatten\U011.$verific$n1088$757 $flatten\U011.$verific$n1089$758 $flatten\U011.$verific$n1090$759 $flatten\U011.$verific$n1091$760 $flatten\U011.$verific$n1093$762 $flatten\U011.$verific$n1094$763 $flatten\U011.$verific$n1095$764 $auto$opt_reduce.cc:134:opt_pmux$1123 $flatten\U011.$verific$n1097$766 $flatten\U011.$verific$n1098$767 $flatten\U011.$verific$n1099$768 $flatten\U011.$verific$n1100$769 $flatten\U011.$verific$n1101$770 $flatten\U011.$verific$n1102$771 $flatten\U011.$verific$n1103$772 $flatten\U011.$verific$n1104$773 $flatten\U011.$verific$n1105$774 $flatten\U011.$verific$n1106$775 $flatten\U011.$verific$n1107$776 $flatten\U011.$verific$n1109$778 $flatten\U011.$verific$n1110$779 $flatten\U011.$verific$n1111$780 $auto$opt_reduce.cc:134:opt_pmux$1121 $flatten\U011.$verific$n1113$782 $flatten\U011.$verific$n1114$783 $flatten\U011.$verific$n1115$784 $flatten\U011.$verific$n1116$785 $flatten\U011.$verific$n1117$786 $flatten\U011.$verific$n1118$787 $flatten\U011.$verific$n1119$788 $flatten\U011.$verific$n1120$789 $flatten\U011.$verific$n1121$790 $flatten\U011.$verific$n1122$791 $flatten\U011.$verific$n1123$792 $flatten\U011.$verific$n1125$794 $flatten\U011.$verific$n1126$795 $flatten\U011.$verific$n1127$796 $auto$opt_reduce.cc:134:opt_pmux$1119 $flatten\U011.$verific$n1129$798 $flatten\U011.$verific$n1130$799 $flatten\U011.$verific$n1131$800 $flatten\U011.$verific$n1132$801 $flatten\U011.$verific$n1133$802 $flatten\U011.$verific$n1134$803 $flatten\U011.$verific$n1135$804 $flatten\U011.$verific$n1136$805 $flatten\U011.$verific$n1137$806 $flatten\U011.$verific$n1138$807 $flatten\U011.$verific$n1139$808 $flatten\U011.$verific$n1141$810 $flatten\U011.$verific$n1142$811 $flatten\U011.$verific$n1143$812 $auto$opt_reduce.cc:134:opt_pmux$1117 $flatten\U011.$verific$n1145$814 $flatten\U011.$verific$n1146$815 $flatten\U011.$verific$n1147$816 $flatten\U011.$verific$n1148$817 $flatten\U011.$verific$n1149$818 $flatten\U011.$verific$n1150$819 $flatten\U011.$verific$n1151$820 $flatten\U011.$verific$n1152$821 $flatten\U011.$verific$n1153$822 $flatten\U011.$verific$n1154$823 $flatten\U011.$verific$n1155$824 $flatten\U011.$verific$n1157$826 $flatten\U011.$verific$n1158$827 $flatten\U011.$verific$n1159$828 $auto$opt_reduce.cc:134:opt_pmux$1115 $flatten\U011.$verific$n1161$830 $flatten\U011.$verific$n1162$831 $flatten\U011.$verific$n1163$832 }
  Optimizing cells in module \top.
Performed a total of 2 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$data_encout_reg$topenc_decx2.v:62$562 ($aldff) from module top.
Removing never-active async load on $verific$data_encout1_reg$topenc_decx2.v:95$567 ($aldff) from module top.
Removing never-active async load on $verific$data_encin_reg$topenc_decx2.v:46$559 ($aldff) from module top.
Removing never-active async load on $verific$data_encin1_reg$topenc_decx2.v:79$565 ($aldff) from module top.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 6 unused cells and 6 unused wires.
<suppressed ~7 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~4 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).
Not marking top.data_encout as FSM state register:
    Users of register don't seem to benefit from recoding.
Not marking top.data_encout1 as FSM state register:
    Users of register don't seem to benefit from recoding.

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~4 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $verific$data_encout_reg$topenc_decx2.v:62$562 ($dff) from module top (D = \U01.dataout, Q = \data_encout, rval = 7'0000000).
Adding SRST signal on $verific$data_encout1_reg$topenc_decx2.v:95$567 ($dff) from module top (D = \U011.dataout, Q = \data_encout1, rval = 7'0000000).
Adding SRST signal on $verific$data_encin_reg$topenc_decx2.v:46$559 ($dff) from module top (D = \datain, Q = \data_encin, rval = 128'00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000).
Adding SRST signal on $verific$data_encin1_reg$topenc_decx2.v:79$565 ($dff) from module top (D = \datain1, Q = \data_encin1, rval = 128'00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 4 unused cells and 4 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_258$encoder.v:142$1091 ($eq).
Removed top 2 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_257$encoder.v:141$1090 ($eq).
Removed top 3 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_256$encoder.v:140$1089 ($eq).
Removed top 4 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_255$encoder.v:139$1088 ($eq).
Removed top 5 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_254$encoder.v:138$1087 ($eq).
Removed top 6 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_253$encoder.v:137$1086 ($eq).
Removed top 7 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_252$encoder.v:136$1085 ($eq).
Removed top 8 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_251$encoder.v:135$1084 ($eq).
Removed top 9 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_250$encoder.v:134$1083 ($eq).
Removed top 10 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_249$encoder.v:133$1082 ($eq).
Removed top 11 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_248$encoder.v:132$1081 ($eq).
Removed top 12 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_247$encoder.v:131$1080 ($eq).
Removed top 13 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_246$encoder.v:130$1079 ($eq).
Removed top 14 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_245$encoder.v:129$1078 ($eq).
Removed top 15 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_244$encoder.v:128$1077 ($eq).
Removed top 16 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_243$encoder.v:127$1076 ($eq).
Removed top 17 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_242$encoder.v:126$1075 ($eq).
Removed top 18 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_241$encoder.v:125$1074 ($eq).
Removed top 19 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_240$encoder.v:124$1073 ($eq).
Removed top 20 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_239$encoder.v:123$1072 ($eq).
Removed top 21 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_238$encoder.v:122$1071 ($eq).
Removed top 22 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_237$encoder.v:121$1070 ($eq).
Removed top 23 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_236$encoder.v:120$1069 ($eq).
Removed top 24 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_235$encoder.v:119$1068 ($eq).
Removed top 25 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_234$encoder.v:118$1067 ($eq).
Removed top 26 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_233$encoder.v:117$1066 ($eq).
Removed top 27 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_232$encoder.v:116$1065 ($eq).
Removed top 28 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_231$encoder.v:115$1064 ($eq).
Removed top 29 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_230$encoder.v:114$1063 ($eq).
Removed top 30 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_229$encoder.v:113$1062 ($eq).
Removed top 31 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_228$encoder.v:112$1061 ($eq).
Removed top 32 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_227$encoder.v:110$1060 ($eq).
Removed top 33 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_226$encoder.v:109$1059 ($eq).
Removed top 34 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_225$encoder.v:108$1058 ($eq).
Removed top 35 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_224$encoder.v:107$1057 ($eq).
Removed top 36 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_223$encoder.v:106$1056 ($eq).
Removed top 37 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_222$encoder.v:105$1055 ($eq).
Removed top 38 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_221$encoder.v:104$1054 ($eq).
Removed top 39 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_220$encoder.v:103$1053 ($eq).
Removed top 40 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_219$encoder.v:102$1052 ($eq).
Removed top 41 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_218$encoder.v:101$1051 ($eq).
Removed top 42 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_217$encoder.v:100$1050 ($eq).
Removed top 43 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_216$encoder.v:99$1049 ($eq).
Removed top 44 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_215$encoder.v:98$1048 ($eq).
Removed top 45 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_214$encoder.v:97$1047 ($eq).
Removed top 46 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_213$encoder.v:96$1046 ($eq).
Removed top 47 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_212$encoder.v:95$1045 ($eq).
Removed top 48 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_211$encoder.v:94$1044 ($eq).
Removed top 49 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_210$encoder.v:93$1043 ($eq).
Removed top 50 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_209$encoder.v:92$1042 ($eq).
Removed top 51 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_208$encoder.v:91$1041 ($eq).
Removed top 52 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_207$encoder.v:90$1040 ($eq).
Removed top 53 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_206$encoder.v:89$1039 ($eq).
Removed top 54 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_205$encoder.v:88$1038 ($eq).
Removed top 55 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_204$encoder.v:87$1037 ($eq).
Removed top 56 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_203$encoder.v:86$1036 ($eq).
Removed top 57 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_202$encoder.v:85$1035 ($eq).
Removed top 58 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_201$encoder.v:84$1034 ($eq).
Removed top 59 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_200$encoder.v:83$1033 ($eq).
Removed top 60 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_199$encoder.v:82$1032 ($eq).
Removed top 61 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_198$encoder.v:81$1031 ($eq).
Removed top 62 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_197$encoder.v:80$1030 ($eq).
Removed top 63 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_196$encoder.v:79$1029 ($eq).
Removed top 64 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_195$encoder.v:77$1028 ($eq).
Removed top 65 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_194$encoder.v:76$1027 ($eq).
Removed top 66 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_193$encoder.v:75$1026 ($eq).
Removed top 67 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_192$encoder.v:74$1025 ($eq).
Removed top 68 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_191$encoder.v:73$1024 ($eq).
Removed top 69 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_190$encoder.v:72$1023 ($eq).
Removed top 70 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_189$encoder.v:71$1022 ($eq).
Removed top 71 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_188$encoder.v:70$1021 ($eq).
Removed top 72 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_187$encoder.v:69$1020 ($eq).
Removed top 73 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_186$encoder.v:68$1019 ($eq).
Removed top 74 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_185$encoder.v:67$1018 ($eq).
Removed top 75 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_184$encoder.v:66$1017 ($eq).
Removed top 76 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_183$encoder.v:65$1016 ($eq).
Removed top 77 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_182$encoder.v:64$1015 ($eq).
Removed top 78 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_181$encoder.v:63$1014 ($eq).
Removed top 79 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_180$encoder.v:62$1013 ($eq).
Removed top 80 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_179$encoder.v:61$1012 ($eq).
Removed top 81 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_178$encoder.v:60$1011 ($eq).
Removed top 82 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_177$encoder.v:59$1010 ($eq).
Removed top 83 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_176$encoder.v:58$1009 ($eq).
Removed top 84 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_175$encoder.v:57$1008 ($eq).
Removed top 85 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_174$encoder.v:56$1007 ($eq).
Removed top 86 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_173$encoder.v:55$1006 ($eq).
Removed top 87 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_172$encoder.v:54$1005 ($eq).
Removed top 88 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_171$encoder.v:53$1004 ($eq).
Removed top 89 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_170$encoder.v:52$1003 ($eq).
Removed top 90 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_169$encoder.v:51$1002 ($eq).
Removed top 91 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_168$encoder.v:50$1001 ($eq).
Removed top 92 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_167$encoder.v:49$1000 ($eq).
Removed top 93 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_166$encoder.v:48$999 ($eq).
Removed top 94 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_165$encoder.v:47$998 ($eq).
Removed top 95 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_164$encoder.v:46$997 ($eq).
Removed top 96 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_163$encoder.v:44$996 ($eq).
Removed top 97 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_162$encoder.v:43$995 ($eq).
Removed top 98 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_161$encoder.v:42$994 ($eq).
Removed top 99 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_160$encoder.v:41$993 ($eq).
Removed top 100 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_159$encoder.v:40$992 ($eq).
Removed top 101 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_158$encoder.v:39$991 ($eq).
Removed top 102 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_157$encoder.v:38$990 ($eq).
Removed top 103 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_156$encoder.v:37$989 ($eq).
Removed top 104 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_155$encoder.v:36$988 ($eq).
Removed top 105 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_154$encoder.v:35$987 ($eq).
Removed top 106 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_153$encoder.v:34$986 ($eq).
Removed top 107 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_152$encoder.v:33$985 ($eq).
Removed top 108 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_151$encoder.v:32$984 ($eq).
Removed top 109 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_150$encoder.v:31$983 ($eq).
Removed top 110 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_149$encoder.v:30$982 ($eq).
Removed top 111 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_148$encoder.v:29$981 ($eq).
Removed top 112 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_147$encoder.v:28$980 ($eq).
Removed top 113 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_146$encoder.v:27$979 ($eq).
Removed top 114 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_145$encoder.v:26$978 ($eq).
Removed top 115 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_144$encoder.v:25$977 ($eq).
Removed top 116 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_143$encoder.v:24$976 ($eq).
Removed top 117 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_142$encoder.v:23$975 ($eq).
Removed top 118 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_141$encoder.v:22$974 ($eq).
Removed top 119 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_140$encoder.v:21$973 ($eq).
Removed top 120 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_139$encoder.v:20$972 ($eq).
Removed top 121 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_138$encoder.v:19$971 ($eq).
Removed top 122 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_137$encoder.v:18$970 ($eq).
Removed top 123 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_136$encoder.v:17$969 ($eq).
Removed top 124 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_135$encoder.v:16$968 ($eq).
Removed top 125 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_134$encoder.v:15$967 ($eq).
Removed top 126 bits (of 128) from port B of cell top.$flatten\U01.$verific$equal_133$encoder.v:14$966 ($eq).
Removed top 1 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_258$encoder.v:142$1091 ($eq).
Removed top 2 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_257$encoder.v:141$1090 ($eq).
Removed top 3 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_256$encoder.v:140$1089 ($eq).
Removed top 4 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_255$encoder.v:139$1088 ($eq).
Removed top 5 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_254$encoder.v:138$1087 ($eq).
Removed top 6 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_253$encoder.v:137$1086 ($eq).
Removed top 7 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_252$encoder.v:136$1085 ($eq).
Removed top 8 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_251$encoder.v:135$1084 ($eq).
Removed top 9 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_250$encoder.v:134$1083 ($eq).
Removed top 10 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_249$encoder.v:133$1082 ($eq).
Removed top 11 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_248$encoder.v:132$1081 ($eq).
Removed top 12 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_247$encoder.v:131$1080 ($eq).
Removed top 13 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_246$encoder.v:130$1079 ($eq).
Removed top 14 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_245$encoder.v:129$1078 ($eq).
Removed top 15 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_244$encoder.v:128$1077 ($eq).
Removed top 16 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_243$encoder.v:127$1076 ($eq).
Removed top 17 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_242$encoder.v:126$1075 ($eq).
Removed top 18 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_241$encoder.v:125$1074 ($eq).
Removed top 19 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_240$encoder.v:124$1073 ($eq).
Removed top 20 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_239$encoder.v:123$1072 ($eq).
Removed top 21 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_238$encoder.v:122$1071 ($eq).
Removed top 22 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_237$encoder.v:121$1070 ($eq).
Removed top 23 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_236$encoder.v:120$1069 ($eq).
Removed top 24 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_235$encoder.v:119$1068 ($eq).
Removed top 25 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_234$encoder.v:118$1067 ($eq).
Removed top 26 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_233$encoder.v:117$1066 ($eq).
Removed top 27 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_232$encoder.v:116$1065 ($eq).
Removed top 28 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_231$encoder.v:115$1064 ($eq).
Removed top 29 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_230$encoder.v:114$1063 ($eq).
Removed top 30 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_229$encoder.v:113$1062 ($eq).
Removed top 31 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_228$encoder.v:112$1061 ($eq).
Removed top 32 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_227$encoder.v:110$1060 ($eq).
Removed top 33 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_226$encoder.v:109$1059 ($eq).
Removed top 34 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_225$encoder.v:108$1058 ($eq).
Removed top 35 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_224$encoder.v:107$1057 ($eq).
Removed top 36 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_223$encoder.v:106$1056 ($eq).
Removed top 37 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_222$encoder.v:105$1055 ($eq).
Removed top 38 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_221$encoder.v:104$1054 ($eq).
Removed top 39 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_220$encoder.v:103$1053 ($eq).
Removed top 40 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_219$encoder.v:102$1052 ($eq).
Removed top 41 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_218$encoder.v:101$1051 ($eq).
Removed top 42 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_217$encoder.v:100$1050 ($eq).
Removed top 43 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_216$encoder.v:99$1049 ($eq).
Removed top 44 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_215$encoder.v:98$1048 ($eq).
Removed top 45 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_214$encoder.v:97$1047 ($eq).
Removed top 46 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_213$encoder.v:96$1046 ($eq).
Removed top 47 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_212$encoder.v:95$1045 ($eq).
Removed top 48 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_211$encoder.v:94$1044 ($eq).
Removed top 49 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_210$encoder.v:93$1043 ($eq).
Removed top 50 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_209$encoder.v:92$1042 ($eq).
Removed top 51 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_208$encoder.v:91$1041 ($eq).
Removed top 52 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_207$encoder.v:90$1040 ($eq).
Removed top 53 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_206$encoder.v:89$1039 ($eq).
Removed top 54 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_205$encoder.v:88$1038 ($eq).
Removed top 55 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_204$encoder.v:87$1037 ($eq).
Removed top 56 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_203$encoder.v:86$1036 ($eq).
Removed top 57 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_202$encoder.v:85$1035 ($eq).
Removed top 58 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_201$encoder.v:84$1034 ($eq).
Removed top 59 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_200$encoder.v:83$1033 ($eq).
Removed top 60 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_199$encoder.v:82$1032 ($eq).
Removed top 61 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_198$encoder.v:81$1031 ($eq).
Removed top 62 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_197$encoder.v:80$1030 ($eq).
Removed top 63 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_196$encoder.v:79$1029 ($eq).
Removed top 64 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_195$encoder.v:77$1028 ($eq).
Removed top 65 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_194$encoder.v:76$1027 ($eq).
Removed top 66 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_193$encoder.v:75$1026 ($eq).
Removed top 67 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_192$encoder.v:74$1025 ($eq).
Removed top 68 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_191$encoder.v:73$1024 ($eq).
Removed top 69 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_190$encoder.v:72$1023 ($eq).
Removed top 70 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_189$encoder.v:71$1022 ($eq).
Removed top 71 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_188$encoder.v:70$1021 ($eq).
Removed top 72 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_187$encoder.v:69$1020 ($eq).
Removed top 73 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_186$encoder.v:68$1019 ($eq).
Removed top 74 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_185$encoder.v:67$1018 ($eq).
Removed top 75 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_184$encoder.v:66$1017 ($eq).
Removed top 76 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_183$encoder.v:65$1016 ($eq).
Removed top 77 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_182$encoder.v:64$1015 ($eq).
Removed top 78 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_181$encoder.v:63$1014 ($eq).
Removed top 79 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_180$encoder.v:62$1013 ($eq).
Removed top 80 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_179$encoder.v:61$1012 ($eq).
Removed top 81 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_178$encoder.v:60$1011 ($eq).
Removed top 82 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_177$encoder.v:59$1010 ($eq).
Removed top 83 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_176$encoder.v:58$1009 ($eq).
Removed top 84 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_175$encoder.v:57$1008 ($eq).
Removed top 85 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_174$encoder.v:56$1007 ($eq).
Removed top 86 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_173$encoder.v:55$1006 ($eq).
Removed top 87 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_172$encoder.v:54$1005 ($eq).
Removed top 88 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_171$encoder.v:53$1004 ($eq).
Removed top 89 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_170$encoder.v:52$1003 ($eq).
Removed top 90 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_169$encoder.v:51$1002 ($eq).
Removed top 91 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_168$encoder.v:50$1001 ($eq).
Removed top 92 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_167$encoder.v:49$1000 ($eq).
Removed top 93 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_166$encoder.v:48$999 ($eq).
Removed top 94 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_165$encoder.v:47$998 ($eq).
Removed top 95 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_164$encoder.v:46$997 ($eq).
Removed top 96 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_163$encoder.v:44$996 ($eq).
Removed top 97 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_162$encoder.v:43$995 ($eq).
Removed top 98 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_161$encoder.v:42$994 ($eq).
Removed top 99 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_160$encoder.v:41$993 ($eq).
Removed top 100 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_159$encoder.v:40$992 ($eq).
Removed top 101 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_158$encoder.v:39$991 ($eq).
Removed top 102 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_157$encoder.v:38$990 ($eq).
Removed top 103 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_156$encoder.v:37$989 ($eq).
Removed top 104 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_155$encoder.v:36$988 ($eq).
Removed top 105 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_154$encoder.v:35$987 ($eq).
Removed top 106 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_153$encoder.v:34$986 ($eq).
Removed top 107 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_152$encoder.v:33$985 ($eq).
Removed top 108 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_151$encoder.v:32$984 ($eq).
Removed top 109 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_150$encoder.v:31$983 ($eq).
Removed top 110 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_149$encoder.v:30$982 ($eq).
Removed top 111 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_148$encoder.v:29$981 ($eq).
Removed top 112 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_147$encoder.v:28$980 ($eq).
Removed top 113 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_146$encoder.v:27$979 ($eq).
Removed top 114 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_145$encoder.v:26$978 ($eq).
Removed top 115 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_144$encoder.v:25$977 ($eq).
Removed top 116 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_143$encoder.v:24$976 ($eq).
Removed top 117 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_142$encoder.v:23$975 ($eq).
Removed top 118 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_141$encoder.v:22$974 ($eq).
Removed top 119 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_140$encoder.v:21$973 ($eq).
Removed top 120 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_139$encoder.v:20$972 ($eq).
Removed top 121 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_138$encoder.v:19$971 ($eq).
Removed top 122 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_137$encoder.v:18$970 ($eq).
Removed top 123 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_136$encoder.v:17$969 ($eq).
Removed top 124 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_135$encoder.v:16$968 ($eq).
Removed top 125 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_134$encoder.v:15$967 ($eq).
Removed top 126 bits (of 128) from port B of cell top.$flatten\U011.$verific$equal_133$encoder.v:14$966 ($eq).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 4 unused cells and 6 unused wires.
<suppressed ~5 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module top:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1526: { $flatten\U011.$verific$n1157$826 $flatten\U011.$verific$n1158$827 $flatten\U011.$verific$n1161$830 $flatten\U011.$verific$n1162$831 $flatten\U011.$verific$n1163$832 $auto$rtlil.cc:2398:Or$1499 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1570: { $flatten\U011.$verific$n1148$817 $flatten\U011.$verific$n1149$818 $flatten\U011.$verific$n1152$821 $flatten\U011.$verific$n1153$822 $flatten\U011.$verific$n1157$826 $flatten\U011.$verific$n1158$827 $flatten\U011.$verific$n1161$830 $flatten\U011.$verific$n1162$831 $flatten\U011.$verific$n1163$832 $auto$rtlil.cc:2398:Or$1499 $auto$rtlil.cc:2398:Or$1519 $auto$rtlil.cc:2398:Or$1511 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1566: { $flatten\U011.$verific$n1141$810 $flatten\U011.$verific$n1142$811 $flatten\U011.$verific$n1145$814 $flatten\U011.$verific$n1146$815 $flatten\U011.$verific$n1147$816 $auto$rtlil.cc:2398:Or$1539 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1658: { $flatten\U011.$verific$n1132$801 $flatten\U011.$verific$n1133$802 $flatten\U011.$verific$n1136$805 $flatten\U011.$verific$n1137$806 $flatten\U011.$verific$n1141$810 $flatten\U011.$verific$n1142$811 $flatten\U011.$verific$n1145$814 $flatten\U011.$verific$n1146$815 $flatten\U011.$verific$n1147$816 $flatten\U011.$verific$n1148$817 $flatten\U011.$verific$n1149$818 $flatten\U011.$verific$n1152$821 $flatten\U011.$verific$n1153$822 $flatten\U011.$verific$n1157$826 $flatten\U011.$verific$n1158$827 $flatten\U011.$verific$n1161$830 $flatten\U011.$verific$n1162$831 $flatten\U011.$verific$n1163$832 $auto$rtlil.cc:2398:Or$1499 $auto$rtlil.cc:2398:Or$1519 $auto$rtlil.cc:2398:Or$1539 $auto$rtlil.cc:2398:Or$1551 $auto$rtlil.cc:2398:Or$1559 $auto$rtlil.cc:2398:Or$1511 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1610: { $flatten\U011.$verific$n1125$794 $flatten\U011.$verific$n1126$795 $flatten\U011.$verific$n1129$798 $flatten\U011.$verific$n1130$799 $flatten\U011.$verific$n1131$800 $auto$rtlil.cc:2398:Or$1583 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1654: { $flatten\U011.$verific$n1116$785 $flatten\U011.$verific$n1117$786 $flatten\U011.$verific$n1120$789 $flatten\U011.$verific$n1121$790 $flatten\U011.$verific$n1125$794 $flatten\U011.$verific$n1126$795 $flatten\U011.$verific$n1129$798 $flatten\U011.$verific$n1130$799 $flatten\U011.$verific$n1131$800 $auto$rtlil.cc:2398:Or$1583 $auto$rtlil.cc:2398:Or$1595 $auto$rtlil.cc:2398:Or$1603 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1650: { $flatten\U011.$verific$n1109$778 $flatten\U011.$verific$n1110$779 $flatten\U011.$verific$n1113$782 $flatten\U011.$verific$n1114$783 $flatten\U011.$verific$n1115$784 $auto$rtlil.cc:2398:Or$1623 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1834: { $flatten\U011.$verific$n1100$769 $flatten\U011.$verific$n1101$770 $flatten\U011.$verific$n1104$773 $flatten\U011.$verific$n1105$774 $flatten\U011.$verific$n1109$778 $flatten\U011.$verific$n1110$779 $flatten\U011.$verific$n1113$782 $flatten\U011.$verific$n1114$783 $flatten\U011.$verific$n1115$784 $flatten\U011.$verific$n1116$785 $flatten\U011.$verific$n1117$786 $flatten\U011.$verific$n1120$789 $flatten\U011.$verific$n1121$790 $flatten\U011.$verific$n1125$794 $flatten\U011.$verific$n1126$795 $flatten\U011.$verific$n1129$798 $flatten\U011.$verific$n1130$799 $flatten\U011.$verific$n1131$800 $flatten\U011.$verific$n1132$801 $flatten\U011.$verific$n1133$802 $flatten\U011.$verific$n1136$805 $flatten\U011.$verific$n1137$806 $flatten\U011.$verific$n1141$810 $flatten\U011.$verific$n1142$811 $flatten\U011.$verific$n1145$814 $flatten\U011.$verific$n1146$815 $flatten\U011.$verific$n1147$816 $flatten\U011.$verific$n1148$817 $flatten\U011.$verific$n1149$818 $flatten\U011.$verific$n1152$821 $flatten\U011.$verific$n1153$822 $flatten\U011.$verific$n1157$826 $flatten\U011.$verific$n1158$827 $flatten\U011.$verific$n1161$830 $flatten\U011.$verific$n1162$831 $flatten\U011.$verific$n1163$832 $auto$rtlil.cc:2398:Or$1499 $auto$rtlil.cc:2398:Or$1519 $auto$rtlil.cc:2398:Or$1539 $auto$rtlil.cc:2398:Or$1551 $auto$rtlil.cc:2398:Or$1559 $auto$rtlil.cc:2398:Or$1583 $auto$rtlil.cc:2398:Or$1595 $auto$rtlil.cc:2398:Or$1603 $auto$rtlil.cc:2398:Or$1623 $auto$rtlil.cc:2398:Or$1635 $auto$rtlil.cc:2398:Or$1643 $auto$rtlil.cc:2398:Or$1511 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1698: { $flatten\U011.$verific$n1093$762 $flatten\U011.$verific$n1094$763 $flatten\U011.$verific$n1097$766 $flatten\U011.$verific$n1098$767 $flatten\U011.$verific$n1099$768 $auto$rtlil.cc:2398:Or$1671 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1742: { $flatten\U011.$verific$n1084$753 $flatten\U011.$verific$n1085$754 $flatten\U011.$verific$n1088$757 $flatten\U011.$verific$n1089$758 $flatten\U011.$verific$n1093$762 $flatten\U011.$verific$n1094$763 $flatten\U011.$verific$n1097$766 $flatten\U011.$verific$n1098$767 $flatten\U011.$verific$n1099$768 $auto$rtlil.cc:2398:Or$1671 $auto$rtlil.cc:2398:Or$1683 $auto$rtlil.cc:2398:Or$1691 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1738: { $flatten\U011.$verific$n1077$746 $flatten\U011.$verific$n1078$747 $flatten\U011.$verific$n1081$750 $flatten\U011.$verific$n1082$751 $flatten\U011.$verific$n1083$752 $auto$rtlil.cc:2398:Or$1711 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1830: { $flatten\U011.$verific$n1068$737 $flatten\U011.$verific$n1069$738 $flatten\U011.$verific$n1072$741 $flatten\U011.$verific$n1073$742 $flatten\U011.$verific$n1077$746 $flatten\U011.$verific$n1078$747 $flatten\U011.$verific$n1081$750 $flatten\U011.$verific$n1082$751 $flatten\U011.$verific$n1083$752 $flatten\U011.$verific$n1084$753 $flatten\U011.$verific$n1085$754 $flatten\U011.$verific$n1088$757 $flatten\U011.$verific$n1089$758 $flatten\U011.$verific$n1093$762 $flatten\U011.$verific$n1094$763 $flatten\U011.$verific$n1097$766 $flatten\U011.$verific$n1098$767 $flatten\U011.$verific$n1099$768 $auto$rtlil.cc:2398:Or$1671 $auto$rtlil.cc:2398:Or$1683 $auto$rtlil.cc:2398:Or$1691 $auto$rtlil.cc:2398:Or$1711 $auto$rtlil.cc:2398:Or$1723 $auto$rtlil.cc:2398:Or$1731 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1782: { $flatten\U011.$verific$n1061$730 $flatten\U011.$verific$n1062$731 $flatten\U011.$verific$n1065$734 $flatten\U011.$verific$n1066$735 $flatten\U011.$verific$n1067$736 $auto$rtlil.cc:2398:Or$1755 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1826: { $flatten\U011.$verific$n1052$721 $flatten\U011.$verific$n1053$722 $flatten\U011.$verific$n1056$725 $flatten\U011.$verific$n1057$726 $flatten\U011.$verific$n1061$730 $flatten\U011.$verific$n1062$731 $flatten\U011.$verific$n1065$734 $flatten\U011.$verific$n1066$735 $flatten\U011.$verific$n1067$736 $auto$rtlil.cc:2398:Or$1755 $auto$rtlil.cc:2398:Or$1767 $auto$rtlil.cc:2398:Or$1775 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1822: { $flatten\U011.$verific$n1045$714 $flatten\U011.$verific$n1046$715 $flatten\U011.$verific$n1049$718 $flatten\U011.$verific$n1050$719 $flatten\U011.$verific$n1051$720 $auto$rtlil.cc:2398:Or$1795 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1174: { $auto$rtlil.cc:2398:Or$1147 $flatten\U01.$verific$n1157$826 $flatten\U01.$verific$n1158$827 $flatten\U01.$verific$n1161$830 $flatten\U01.$verific$n1162$831 $flatten\U01.$verific$n1163$832 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1218: { $auto$rtlil.cc:2398:Or$1159 $auto$rtlil.cc:2398:Or$1167 $auto$rtlil.cc:2398:Or$1147 $flatten\U01.$verific$n1148$817 $flatten\U01.$verific$n1149$818 $flatten\U01.$verific$n1152$821 $flatten\U01.$verific$n1153$822 $flatten\U01.$verific$n1157$826 $flatten\U01.$verific$n1158$827 $flatten\U01.$verific$n1161$830 $flatten\U01.$verific$n1162$831 $flatten\U01.$verific$n1163$832 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1214: { $auto$rtlil.cc:2398:Or$1187 $flatten\U01.$verific$n1141$810 $flatten\U01.$verific$n1142$811 $flatten\U01.$verific$n1145$814 $flatten\U01.$verific$n1146$815 $flatten\U01.$verific$n1147$816 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1306: { $auto$rtlil.cc:2398:Or$1159 $auto$rtlil.cc:2398:Or$1167 $auto$rtlil.cc:2398:Or$1187 $auto$rtlil.cc:2398:Or$1199 $auto$rtlil.cc:2398:Or$1207 $auto$rtlil.cc:2398:Or$1147 $flatten\U01.$verific$n1132$801 $flatten\U01.$verific$n1133$802 $flatten\U01.$verific$n1136$805 $flatten\U01.$verific$n1137$806 $flatten\U01.$verific$n1141$810 $flatten\U01.$verific$n1142$811 $flatten\U01.$verific$n1145$814 $flatten\U01.$verific$n1146$815 $flatten\U01.$verific$n1147$816 $flatten\U01.$verific$n1148$817 $flatten\U01.$verific$n1149$818 $flatten\U01.$verific$n1152$821 $flatten\U01.$verific$n1153$822 $flatten\U01.$verific$n1157$826 $flatten\U01.$verific$n1158$827 $flatten\U01.$verific$n1161$830 $flatten\U01.$verific$n1162$831 $flatten\U01.$verific$n1163$832 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1258: { $auto$rtlil.cc:2398:Or$1231 $flatten\U01.$verific$n1125$794 $flatten\U01.$verific$n1126$795 $flatten\U01.$verific$n1129$798 $flatten\U01.$verific$n1130$799 $flatten\U01.$verific$n1131$800 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1302: { $auto$rtlil.cc:2398:Or$1231 $auto$rtlil.cc:2398:Or$1243 $auto$rtlil.cc:2398:Or$1251 $flatten\U01.$verific$n1116$785 $flatten\U01.$verific$n1117$786 $flatten\U01.$verific$n1120$789 $flatten\U01.$verific$n1121$790 $flatten\U01.$verific$n1125$794 $flatten\U01.$verific$n1126$795 $flatten\U01.$verific$n1129$798 $flatten\U01.$verific$n1130$799 $flatten\U01.$verific$n1131$800 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1298: { $auto$rtlil.cc:2398:Or$1271 $flatten\U01.$verific$n1109$778 $flatten\U01.$verific$n1110$779 $flatten\U01.$verific$n1113$782 $flatten\U01.$verific$n1114$783 $flatten\U01.$verific$n1115$784 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1482: { $auto$rtlil.cc:2398:Or$1159 $auto$rtlil.cc:2398:Or$1167 $auto$rtlil.cc:2398:Or$1187 $auto$rtlil.cc:2398:Or$1199 $auto$rtlil.cc:2398:Or$1207 $auto$rtlil.cc:2398:Or$1231 $auto$rtlil.cc:2398:Or$1243 $auto$rtlil.cc:2398:Or$1251 $auto$rtlil.cc:2398:Or$1147 $auto$rtlil.cc:2398:Or$1271 $auto$rtlil.cc:2398:Or$1283 $auto$rtlil.cc:2398:Or$1291 $flatten\U01.$verific$n1100$769 $flatten\U01.$verific$n1101$770 $flatten\U01.$verific$n1104$773 $flatten\U01.$verific$n1105$774 $flatten\U01.$verific$n1109$778 $flatten\U01.$verific$n1110$779 $flatten\U01.$verific$n1113$782 $flatten\U01.$verific$n1114$783 $flatten\U01.$verific$n1115$784 $flatten\U01.$verific$n1116$785 $flatten\U01.$verific$n1117$786 $flatten\U01.$verific$n1120$789 $flatten\U01.$verific$n1121$790 $flatten\U01.$verific$n1125$794 $flatten\U01.$verific$n1126$795 $flatten\U01.$verific$n1129$798 $flatten\U01.$verific$n1130$799 $flatten\U01.$verific$n1131$800 $flatten\U01.$verific$n1132$801 $flatten\U01.$verific$n1133$802 $flatten\U01.$verific$n1136$805 $flatten\U01.$verific$n1137$806 $flatten\U01.$verific$n1141$810 $flatten\U01.$verific$n1142$811 $flatten\U01.$verific$n1145$814 $flatten\U01.$verific$n1146$815 $flatten\U01.$verific$n1147$816 $flatten\U01.$verific$n1148$817 $flatten\U01.$verific$n1149$818 $flatten\U01.$verific$n1152$821 $flatten\U01.$verific$n1153$822 $flatten\U01.$verific$n1157$826 $flatten\U01.$verific$n1158$827 $flatten\U01.$verific$n1161$830 $flatten\U01.$verific$n1162$831 $flatten\U01.$verific$n1163$832 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1346: { $auto$rtlil.cc:2398:Or$1319 $flatten\U01.$verific$n1093$762 $flatten\U01.$verific$n1094$763 $flatten\U01.$verific$n1097$766 $flatten\U01.$verific$n1098$767 $flatten\U01.$verific$n1099$768 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1390: { $auto$rtlil.cc:2398:Or$1319 $auto$rtlil.cc:2398:Or$1331 $auto$rtlil.cc:2398:Or$1339 $flatten\U01.$verific$n1084$753 $flatten\U01.$verific$n1085$754 $flatten\U01.$verific$n1088$757 $flatten\U01.$verific$n1089$758 $flatten\U01.$verific$n1093$762 $flatten\U01.$verific$n1094$763 $flatten\U01.$verific$n1097$766 $flatten\U01.$verific$n1098$767 $flatten\U01.$verific$n1099$768 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1386: { $auto$rtlil.cc:2398:Or$1359 $flatten\U01.$verific$n1077$746 $flatten\U01.$verific$n1078$747 $flatten\U01.$verific$n1081$750 $flatten\U01.$verific$n1082$751 $flatten\U01.$verific$n1083$752 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1478: { $auto$rtlil.cc:2398:Or$1319 $auto$rtlil.cc:2398:Or$1331 $auto$rtlil.cc:2398:Or$1339 $auto$rtlil.cc:2398:Or$1359 $auto$rtlil.cc:2398:Or$1371 $auto$rtlil.cc:2398:Or$1379 $flatten\U01.$verific$n1068$737 $flatten\U01.$verific$n1069$738 $flatten\U01.$verific$n1072$741 $flatten\U01.$verific$n1073$742 $flatten\U01.$verific$n1077$746 $flatten\U01.$verific$n1078$747 $flatten\U01.$verific$n1081$750 $flatten\U01.$verific$n1082$751 $flatten\U01.$verific$n1083$752 $flatten\U01.$verific$n1084$753 $flatten\U01.$verific$n1085$754 $flatten\U01.$verific$n1088$757 $flatten\U01.$verific$n1089$758 $flatten\U01.$verific$n1093$762 $flatten\U01.$verific$n1094$763 $flatten\U01.$verific$n1097$766 $flatten\U01.$verific$n1098$767 $flatten\U01.$verific$n1099$768 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1430: { $auto$rtlil.cc:2398:Or$1403 $flatten\U01.$verific$n1061$730 $flatten\U01.$verific$n1062$731 $flatten\U01.$verific$n1065$734 $flatten\U01.$verific$n1066$735 $flatten\U01.$verific$n1067$736 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1474: { $auto$rtlil.cc:2398:Or$1403 $auto$rtlil.cc:2398:Or$1415 $auto$rtlil.cc:2398:Or$1423 $flatten\U01.$verific$n1052$721 $flatten\U01.$verific$n1053$722 $flatten\U01.$verific$n1056$725 $flatten\U01.$verific$n1057$726 $flatten\U01.$verific$n1061$730 $flatten\U01.$verific$n1062$731 $flatten\U01.$verific$n1065$734 $flatten\U01.$verific$n1066$735 $flatten\U01.$verific$n1067$736 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1470: { $auto$rtlil.cc:2398:Or$1443 $flatten\U01.$verific$n1045$714 $flatten\U01.$verific$n1046$715 $flatten\U01.$verific$n1049$718 $flatten\U01.$verific$n1050$719 $flatten\U01.$verific$n1051$720 }
  Optimizing cells in module \top.
Performed a total of 30 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> stat

3.22. Printing statistics.

=== top ===

   Number of wires:                636
   Number of wire bits:           3370
   Number of public wires:          20
   Number of public wire bits:    1338
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                624
     $bmux                           2
     $eq                           254
     $mux                          238
     $or                            48
     $reduce_or                     78
     $sdff                           4


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.23. Executing TECHMAP pass (map to technology primitives).

3.23.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.23.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.23.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $sdff.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $bmux.
No more expansions possible.
<suppressed ~695 debug messages>

yosys> stat

3.24. Printing statistics.

=== top ===

   Number of wires:               3128
   Number of wire bits:         101340
   Number of public wires:          20
   Number of public wire bits:    1338
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              99954
     $_MUX_                      34178
     $_NOT_                        254
     $_OR_                       32740
     $_SDFF_PP0_                   270
     $_XOR_                      32512


yosys> opt

3.25. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.25.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~65410 debug messages>

yosys> opt_merge -nomux

3.25.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~94779 debug messages>
Removed a total of 31593 cells.

yosys> opt_muxtree

3.25.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.25.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 743 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.25.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.25.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.25.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.25.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.25.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.25.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~252 debug messages>

yosys> opt_merge

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.26.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

3.26.5. Finished fast OPT passes.

yosys> memory_map

3.27. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.28.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.28.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr -full

3.28.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.28.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.29. Executing ABC pass (technology mapping using ABC).

3.29.1. Summary of detected clock domains:
  3989 cells in clk=\clock, en={ }, arst={ }, srst=\reset

3.29.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, synchronously reset by \reset
Extracted 3989 gates and 4247 wires to a netlist network with 256 inputs and 256 outputs.

3.29.2.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/build/logic_synthesis-rs/bin/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.2.2. Re-integrating ABC results.
ABC RESULTS:               AND cells:     1041
ABC RESULTS:            ANDNOT cells:      464
ABC RESULTS:               BUF cells:       14
ABC RESULTS:               DFF cells:       28
ABC RESULTS:               MUX cells:        5
ABC RESULTS:              NAND cells:      408
ABC RESULTS:               NOR cells:      131
ABC RESULTS:                OR cells:       36
ABC RESULTS:             ORNOT cells:        7
ABC RESULTS:               XOR cells:       49
ABC RESULTS:              ZERO cells:       16
ABC RESULTS:        internal signals:     3735
ABC RESULTS:           input signals:      256
ABC RESULTS:          output signals:      256
Removing temp directory.

yosys> abc -script abc_tmp.scr

3.30. Executing ABC pass (technology mapping using ABC).

3.30.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 2141 gates and 2411 wires to a netlist network with 270 inputs and 254 outputs.

3.30.1.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/build/logic_synthesis-rs/bin/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/clean_repo/yosys_verific_rs/result_20-04-2022T11-33-54/All_lut_synth_rs_ade.json/multi_enc_decx2x4/abc_tmp.scr 
ABC:   #Luts =   889  Max Lvl =  14  Avg Lvl =   2.54  [   0.09 sec. at Pass 0]
ABC:   #Luts =   698  Max Lvl =  13  Avg Lvl =   2.55  [   4.58 sec. at Pass 1]
ABC:   #Luts =   681  Max Lvl =  12  Avg Lvl =   2.57  [   0.82 sec. at Pass 2]
ABC:   #Luts =   662  Max Lvl =  13  Avg Lvl =   2.53  [   1.48 sec. at Pass 3]
ABC:   #Luts =   656  Max Lvl =  14  Avg Lvl =   2.53  [   1.14 sec. at Pass 4]
ABC:   #Luts =   651  Max Lvl =  13  Avg Lvl =   2.52  [   2.32 sec. at Pass 5]
ABC:   #Luts =   645  Max Lvl =  13  Avg Lvl =   2.51  [   1.67 sec. at Pass 6]
ABC:   #Luts =   635  Max Lvl =  14  Avg Lvl =   2.49  [   2.30 sec. at Pass 7]
ABC:   #Luts =   633  Max Lvl =  14  Avg Lvl =   2.54  [   1.22 sec. at Pass 8]
ABC:   #Luts =   624  Max Lvl =  16  Avg Lvl =   2.57  [   2.06 sec. at Pass 9]
ABC:   #Luts =   624  Max Lvl =  16  Avg Lvl =   2.57  [   1.04 sec. at Pass 10]
ABC:   #Luts =   617  Max Lvl =  15  Avg Lvl =   2.58  [   1.68 sec. at Pass 11]
ABC:   #Luts =   617  Max Lvl =  15  Avg Lvl =   2.58  [   1.11 sec. at Pass 12]
ABC:   #Luts =   612  Max Lvl =  15  Avg Lvl =   2.47  [   1.68 sec. at Pass 13]
ABC:   #Luts =   606  Max Lvl =  14  Avg Lvl =   2.56  [   1.03 sec. at Pass 14]
ABC:   #Luts =   606  Max Lvl =  14  Avg Lvl =   2.56  [   1.53 sec. at Pass 15]
ABC:   #Luts =   606  Max Lvl =  12  Avg Lvl =   2.49  [   1.06 sec. at Pass 16]
ABC:   #Luts =   597  Max Lvl =  14  Avg Lvl =   2.48  [   1.57 sec. at Pass 17]
ABC:   #Luts =   597  Max Lvl =  14  Avg Lvl =   2.48  [   1.02 sec. at Pass 18]
ABC:   #Luts =   597  Max Lvl =  14  Avg Lvl =   2.48  [   1.59 sec. at Pass 19]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.30.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      597
ABC RESULTS:        internal signals:     1887
ABC RESULTS:           input signals:      270
ABC RESULTS:          output signals:      254
Removing temp directory.

yosys> opt

3.31. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.31.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.31.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.31.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.31.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.31.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.31.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 5569 unused wires.
<suppressed ~13 debug messages>

yosys> opt_expr

3.31.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.31.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.31.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.31.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.31.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.31.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.31.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.31.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.32. Printing statistics.

=== top ===

   Number of wires:                392
   Number of wire bits:           1154
   Number of public wires:           8
   Number of public wire bits:     770
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                624
     $_SDFF_PP0_                    28
     $lut                          596


yosys> shregmap -minlen 8 -maxlen 20

3.33. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.34. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.35. Printing statistics.

=== top ===

   Number of wires:                420
   Number of wire bits:           1182
   Number of public wires:           8
   Number of public wire bits:     770
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                652
     $_DFF_P_                       28
     $_MUX_                         28
     $lut                          596


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.36. Executing TECHMAP pass (map to technology primitives).

3.36.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.36.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.36.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
No more expansions possible.
<suppressed ~760 debug messages>

yosys> opt_expr -mux_undef

3.37. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~22282 debug messages>

yosys> simplemap

3.38. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.39. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.40. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~5652 debug messages>
Removed a total of 1884 cells.

yosys> opt_dff -nodffe -nosdff

3.41. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1566 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.43. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.43.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~81 debug messages>

yosys> opt_merge -nomux

3.43.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.43.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.43.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.43.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.43.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.43.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 10 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.43.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.43.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.43.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.43.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.43.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.43.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.43.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.43.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.43.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.44. Executing ABC pass (technology mapping using ABC).

3.44.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 2509 gates and 2796 wires to a netlist network with 285 inputs and 268 outputs.

3.44.1.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/build/logic_synthesis-rs/bin/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/clean_repo/yosys_verific_rs/result_20-04-2022T11-33-54/All_lut_synth_rs_ade.json/multi_enc_decx2x4/abc_tmp.scr 
ABC:   #Luts =   624  Max Lvl =  15  Avg Lvl =   2.43  [   0.11 sec. at Pass 0]
ABC:   #Luts =   624  Max Lvl =  15  Avg Lvl =   2.43  [   3.99 sec. at Pass 1]
ABC:   #Luts =   624  Max Lvl =  15  Avg Lvl =   2.43  [   0.98 sec. at Pass 2]
ABC:   #Luts =   615  Max Lvl =  13  Avg Lvl =   2.37  [   1.38 sec. at Pass 3]
ABC:   #Luts =   615  Max Lvl =  13  Avg Lvl =   2.37  [   1.00 sec. at Pass 4]
ABC:   #Luts =   615  Max Lvl =  13  Avg Lvl =   2.37  [   1.48 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.44.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      615
ABC RESULTS:        internal signals:     2243
ABC RESULTS:           input signals:      285
ABC RESULTS:          output signals:      268
Removing temp directory.

yosys> opt

3.45. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.45.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.45.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.45.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.45.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.45.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 2545 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.45.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.45.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.45.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.45.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.45.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.45.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.45.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.46. Executing HIERARCHY pass (managing design hierarchy).

3.46.1. Analyzing design hierarchy..
Top module:  \top

3.46.2. Analyzing design hierarchy..
Top module:  \top
Removed 0 unused modules.

yosys> stat

3.47. Printing statistics.

=== top ===

   Number of wires:                411
   Number of wire bits:           1173
   Number of public wires:           8
   Number of public wire bits:     770
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                643
     $lut                          615
     dffsre                         28


yosys> opt_clean -purge

3.48. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 2 unused wires.
<suppressed ~2 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.49. Executing Verilog backend.

yosys> bmuxmap

3.49.1. Executing BMUXMAP pass.

yosys> demuxmap

3.49.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\top'.

End of script. Logfile hash: 0dc91a6cdc, CPU: user 15.10s system 0.27s, MEM: 200.24 MB peak
Yosys 0.16+6 (git sha1 0c82fb7e3, gcc 9.1.0 -fPIC -Os)
Time spent: 97% 3x abc (496 sec), 1% 28x opt_expr (6 sec), ...
real 58.52
user 471.57
sys 39.83
