
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.8
 Yosys 0.16+6 (git sha1 7f5477eb1, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k cf_rca_16.v

yosys> verific -vlog2k cf_rca_16.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'cf_rca_16.v'

yosys> synth_rs -top top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.2.37

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top top

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] cf_rca_16.v:75: compiling module 'top'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:100: compiling module 'cf_rca_16_1'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5965: compiling module 'cf_rca_16_38'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5646: compiling module 'cf_rca_16_32'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5701: compiling module 'cf_rca_16_33'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5756: compiling module 'cf_rca_16_34'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5811: compiling module 'cf_rca_16_35'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5866: compiling module 'cf_rca_16_36'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5916: compiling module 'cf_rca_16_37'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:165: compiling module 'cf_rca_16_2'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3129: compiling module 'cf_rca_16_22'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3273: compiling module 'cf_rca_16_23'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3405: compiling module 'cf_rca_16_24'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3525: compiling module 'cf_rca_16_25'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3633: compiling module 'cf_rca_16_26'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3729: compiling module 'cf_rca_16_27'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3813: compiling module 'cf_rca_16_28'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:4745: compiling module 'cf_rca_16_30'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5599: compiling module 'cf_rca_16_31'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3891: compiling module 'cf_rca_16_29'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:342: compiling module 'cf_rca_16_3'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:516: compiling module 'cf_rca_16_4'
VERIFIC-WARNING [VDB-1002] cf_rca_16.v:576: net 's23_1[15]' does not have a driver
VERIFIC-WARNING [VDB-1002] cf_rca_16.v:577: net 's23_2[15]' does not have a driver
VERIFIC-WARNING [VDB-1002] cf_rca_16.v:578: net 's23_3[12]' does not have a driver
VERIFIC-WARNING [VDB-1002] cf_rca_16.v:579: net 's23_4[12]' does not have a driver
Importing module top.
Importing module cf_rca_16_1.
Importing module cf_rca_16_2.
Importing module cf_rca_16_22.
Importing module cf_rca_16_23.
Importing module cf_rca_16_24.
Importing module cf_rca_16_25.
Importing module cf_rca_16_26.
Importing module cf_rca_16_27.
Importing module cf_rca_16_28.
Importing module cf_rca_16_29.
Importing module cf_rca_16_3.
Importing module cf_rca_16_30.
Importing module cf_rca_16_31.
Importing module cf_rca_16_32.
Importing module cf_rca_16_33.
Importing module cf_rca_16_34.
Importing module cf_rca_16_35.
Importing module cf_rca_16_36.
Importing module cf_rca_16_37.
Importing module cf_rca_16_38.
Importing module cf_rca_16_4.

3.3.1. Analyzing design hierarchy..
Top module:  \top
Used module:     \cf_rca_16_1
Used module:         \cf_rca_16_2
Used module:             \cf_rca_16_3
Used module:                 \cf_rca_16_4
Used module:                     \cf_rca_16_29
Used module:                         \cf_rca_16_31
Used module:                     \cf_rca_16_22
Used module:                         \cf_rca_16_23
Used module:                             \cf_rca_16_24
Used module:                                 \cf_rca_16_25
Used module:                                     \cf_rca_16_26
Used module:                                         \cf_rca_16_27
Used module:                                             \cf_rca_16_28
Used module:                                                 \cf_rca_16_30
Used module:                     \cf_rca_16_32
Used module:                         \cf_rca_16_33
Used module:                             \cf_rca_16_34
Used module:                                 \cf_rca_16_35
Used module:                                     \cf_rca_16_36
Used module:                                         \cf_rca_16_37
Used module:                     \cf_rca_16_38

3.3.2. Analyzing design hierarchy..
Top module:  \top
Used module:     \cf_rca_16_1
Used module:         \cf_rca_16_2
Used module:             \cf_rca_16_3
Used module:                 \cf_rca_16_4
Used module:                     \cf_rca_16_29
Used module:                         \cf_rca_16_31
Used module:                     \cf_rca_16_22
Used module:                         \cf_rca_16_23
Used module:                             \cf_rca_16_24
Used module:                                 \cf_rca_16_25
Used module:                                     \cf_rca_16_26
Used module:                                         \cf_rca_16_27
Used module:                                             \cf_rca_16_28
Used module:                                                 \cf_rca_16_30
Used module:                     \cf_rca_16_32
Used module:                         \cf_rca_16_33
Used module:                             \cf_rca_16_34
Used module:                                 \cf_rca_16_35
Used module:                                     \cf_rca_16_36
Used module:                                         \cf_rca_16_37
Used module:                     \cf_rca_16_38
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_rca_16_4.
<suppressed ~1 debug messages>
Optimizing module cf_rca_16_38.
<suppressed ~32 debug messages>
Optimizing module cf_rca_16_37.
<suppressed ~6 debug messages>
Optimizing module cf_rca_16_36.
<suppressed ~5 debug messages>
Optimizing module cf_rca_16_35.
<suppressed ~5 debug messages>
Optimizing module cf_rca_16_34.
<suppressed ~5 debug messages>
Optimizing module cf_rca_16_33.
<suppressed ~5 debug messages>
Optimizing module cf_rca_16_32.
<suppressed ~6 debug messages>
Optimizing module cf_rca_16_31.
<suppressed ~6 debug messages>
Optimizing module cf_rca_16_30.
<suppressed ~8 debug messages>
Optimizing module cf_rca_16_3.
<suppressed ~1 debug messages>
Optimizing module cf_rca_16_29.
<suppressed ~8 debug messages>
Optimizing module cf_rca_16_28.
Optimizing module cf_rca_16_27.
Optimizing module cf_rca_16_26.
Optimizing module cf_rca_16_25.
Optimizing module cf_rca_16_24.
Optimizing module cf_rca_16_23.
Optimizing module cf_rca_16_22.
Optimizing module cf_rca_16_2.
<suppressed ~1 debug messages>
Optimizing module cf_rca_16_1.
<suppressed ~1 debug messages>
Optimizing module top.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module cf_rca_16_4.
Deleting now unused module cf_rca_16_38.
Deleting now unused module cf_rca_16_37.
Deleting now unused module cf_rca_16_36.
Deleting now unused module cf_rca_16_35.
Deleting now unused module cf_rca_16_34.
Deleting now unused module cf_rca_16_33.
Deleting now unused module cf_rca_16_32.
Deleting now unused module cf_rca_16_31.
Deleting now unused module cf_rca_16_30.
Deleting now unused module cf_rca_16_3.
Deleting now unused module cf_rca_16_29.
Deleting now unused module cf_rca_16_28.
Deleting now unused module cf_rca_16_27.
Deleting now unused module cf_rca_16_26.
Deleting now unused module cf_rca_16_25.
Deleting now unused module cf_rca_16_24.
Deleting now unused module cf_rca_16_23.
Deleting now unused module cf_rca_16_22.
Deleting now unused module cf_rca_16_2.
Deleting now unused module cf_rca_16_1.
<suppressed ~46 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 16 unused cells and 19486 unused wires.
<suppressed ~16059 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module top...
Warning: Wire top.\west_o [15] is used but has no driver.
Warning: Wire top.\west_o [14] is used but has no driver.
Warning: Wire top.\west_o [13] is used but has no driver.
Warning: Wire top.\west_o [12] is used but has no driver.
Warning: Wire top.\west_o [11] is used but has no driver.
Warning: Wire top.\west_o [10] is used but has no driver.
Warning: Wire top.\west_o [9] is used but has no driver.
Warning: Wire top.\west_o [8] is used but has no driver.
Warning: Wire top.\west_o [7] is used but has no driver.
Warning: Wire top.\west_o [6] is used but has no driver.
Warning: Wire top.\west_o [5] is used but has no driver.
Warning: Wire top.\west_o [4] is used but has no driver.
Warning: Wire top.\west_o [3] is used but has no driver.
Warning: Wire top.\south_o [15] is used but has no driver.
Warning: Wire top.\south_o [14] is used but has no driver.
Warning: Wire top.\south_o [13] is used but has no driver.
Warning: Wire top.\south_o [12] is used but has no driver.
Warning: Wire top.\south_o [11] is used but has no driver.
Warning: Wire top.\south_o [10] is used but has no driver.
Warning: Wire top.\south_o [9] is used but has no driver.
Warning: Wire top.\south_o [8] is used but has no driver.
Warning: Wire top.\south_o [7] is used but has no driver.
Warning: Wire top.\south_o [6] is used but has no driver.
Warning: Wire top.\south_o [5] is used but has no driver.
Warning: Wire top.\south_o [4] is used but has no driver.
Warning: Wire top.\south_o [3] is used but has no driver.
Warning: Wire top.\south_o [2] is used but has no driver.
Warning: Wire top.\south_o [1] is used but has no driver.
Warning: Wire top.\south_o [0] is used but has no driver.
Warning: Wire top.\east_o [15] is used but has no driver.
Warning: Wire top.\east_o [14] is used but has no driver.
Warning: Wire top.\east_o [13] is used but has no driver.
Warning: Wire top.\east_o [12] is used but has no driver.
Warning: Wire top.\east_o [11] is used but has no driver.
Warning: Wire top.\east_o [10] is used but has no driver.
Warning: Wire top.\east_o [9] is used but has no driver.
Warning: Wire top.\east_o [8] is used but has no driver.
Warning: Wire top.\east_o [7] is used but has no driver.
Warning: Wire top.\east_o [6] is used but has no driver.
Warning: Wire top.\east_o [5] is used but has no driver.
Warning: Wire top.\east_o [4] is used but has no driver.
Warning: Wire top.\east_o [3] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n15 is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [0] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [1] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [2] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [3] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [4] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [5] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [6] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [7] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [8] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [9] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [10] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [11] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [12] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [13] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [14] is used but has no driver.
Found and reported 58 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~960 debug messages>

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1188 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n32_reg$cf_rca_16.v:5161$4547 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n25_reg$cf_rca_16.v:5136$4538 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n18_reg$cf_rca_16.v:5111$4529 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n11_reg$cf_rca_16.v:5086$4520 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s22.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s22.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s22.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s22.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n32_reg$cf_rca_16.v:5161$4547 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n11_reg$cf_rca_16.v:5086$4520 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n25_reg$cf_rca_16.v:5136$4538 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n18_reg$cf_rca_16.v:5111$4529 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n32_reg$cf_rca_16.v:5161$4547 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n25_reg$cf_rca_16.v:5136$4538 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n18_reg$cf_rca_16.v:5111$4529 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n11_reg$cf_rca_16.v:5086$4520 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s22.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s22.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s22.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s22.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($aldff) from module top.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1037 unused wires.
<suppressed ~78 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1188 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1188 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s22.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s22.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s22.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s22.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s22.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s22.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s22.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s22.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s21.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s21.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s21.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s21.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n32_reg$cf_rca_16.v:5161$4547 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s20.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n25_reg$cf_rca_16.v:5136$4538 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s20.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n18_reg$cf_rca_16.v:5111$4529 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s20.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n11_reg$cf_rca_16.v:5086$4520 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s20.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s22.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s22.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s22.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s22.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s22.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s22.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s22.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s22.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s22.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s22.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s22.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s22.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s21.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s21.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s21.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s21.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n32_reg$cf_rca_16.v:5161$4547 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s20.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n25_reg$cf_rca_16.v:5136$4538 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s20.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n18_reg$cf_rca_16.v:5111$4529 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s20.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n11_reg$cf_rca_16.v:5086$4520 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s20.n11).
Adding EN signal on $flatten\s1.\s10.\s22.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s22.n32).
Adding EN signal on $flatten\s1.\s10.\s22.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s22.n25).
Adding EN signal on $flatten\s1.\s10.\s22.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s22.n18).
Adding EN signal on $flatten\s1.\s10.\s22.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s22.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s22.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s22.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s22.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s22.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n32_reg$cf_rca_16.v:4307$3024 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s21.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n25_reg$cf_rca_16.v:4282$3015 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s21.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n18_reg$cf_rca_16.v:4257$3006 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s21.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n11_reg$cf_rca_16.v:4232$2997 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s21.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n32_reg$cf_rca_16.v:5161$4547 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s20.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n25_reg$cf_rca_16.v:5136$4538 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s20.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n18_reg$cf_rca_16.v:5111$4529 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s20.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n11_reg$cf_rca_16.v:5086$4520 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s20.n11).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 192 unused cells and 192 unused wires.
<suppressed ~193 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~996 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.$verific$equal_4$cf_rca_16.v:5738$5392 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.$verific$equal_7$cf_rca_16.v:5740$5395 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.$verific$equal_10$cf_rca_16.v:5742$5398 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.$verific$equal_13$cf_rca_16.v:5744$5401 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.$verific$equal_16$cf_rca_16.v:5746$5404 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.\s16.\s16.$verific$equal_4$cf_rca_16.v:5848$6058 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.\s16.$verific$equal_16$cf_rca_16.v:5801$5737 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.\s16.$verific$equal_13$cf_rca_16.v:5799$5734 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.\s16.$verific$equal_10$cf_rca_16.v:5797$5731 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.\s16.$verific$equal_7$cf_rca_16.v:5795$5728 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.\s16.$verific$equal_4$cf_rca_16.v:5793$5725 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.$verific$equal_16$cf_rca_16.v:5691$5071 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.$verific$equal_13$cf_rca_16.v:5689$5068 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.$verific$equal_10$cf_rca_16.v:5687$5065 ($eq).
Removed top 4 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.$verific$equal_7$cf_rca_16.v:5685$5062 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s22.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s22.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s22.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.$verific$equal_4$cf_rca_16.v:5738$5392 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.$verific$equal_7$cf_rca_16.v:5740$5395 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.$verific$equal_10$cf_rca_16.v:5742$5398 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.$verific$equal_13$cf_rca_16.v:5744$5401 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.$verific$equal_16$cf_rca_16.v:5746$5404 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.\s16.\s16.$verific$equal_4$cf_rca_16.v:5848$6058 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.\s16.$verific$equal_16$cf_rca_16.v:5801$5737 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.\s16.$verific$equal_13$cf_rca_16.v:5799$5734 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.\s16.$verific$equal_10$cf_rca_16.v:5797$5731 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.\s16.$verific$equal_7$cf_rca_16.v:5795$5728 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.\s16.$verific$equal_4$cf_rca_16.v:5793$5725 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.$verific$equal_16$cf_rca_16.v:5691$5071 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.$verific$equal_13$cf_rca_16.v:5689$5068 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.$verific$equal_10$cf_rca_16.v:5687$5065 ($eq).
Removed top 4 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.$verific$equal_7$cf_rca_16.v:5685$5062 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7267 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7271 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7283 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7287 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7299 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7303 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7315 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7319 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7323 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7311 ($dffe).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7307 ($dffe).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7295 ($dffe).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7291 ($dffe).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7279 ($dffe).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7275 ($dffe).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s22.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s22.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s22.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7263 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s22.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s22.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s22.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$5014 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$5017 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$5020 ($eq).
Removed top 4 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.$verific$equal_7$cf_rca_16.v:5685$5062 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.$verific$equal_10$cf_rca_16.v:5687$5065 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.$verific$equal_13$cf_rca_16.v:5689$5068 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.$verific$equal_16$cf_rca_16.v:5691$5071 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.\s16.$verific$equal_4$cf_rca_16.v:5793$5725 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.\s16.$verific$equal_7$cf_rca_16.v:5795$5728 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.\s16.$verific$equal_10$cf_rca_16.v:5797$5731 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.\s16.$verific$equal_13$cf_rca_16.v:5799$5734 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.\s16.$verific$equal_16$cf_rca_16.v:5801$5737 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.\s16.\s16.$verific$equal_4$cf_rca_16.v:5848$6058 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.$verific$equal_16$cf_rca_16.v:5746$5404 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.$verific$equal_13$cf_rca_16.v:5744$5401 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.$verific$equal_10$cf_rca_16.v:5742$5398 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.$verific$equal_7$cf_rca_16.v:5740$5395 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.$verific$equal_4$cf_rca_16.v:5738$5392 ($eq).
Removed top 4 bits (of 5) from port B of cell top.$flatten\s1.\s9.$verific$equal_7$cf_rca_16.v:5685$5062 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s9.$verific$equal_10$cf_rca_16.v:5687$5065 ($eq).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.$verific$mux_26$cf_rca_16.v:5696$5081 ($mux).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s9.$verific$equal_13$cf_rca_16.v:5689$5068 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s9.$verific$equal_16$cf_rca_16.v:5691$5071 ($eq).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.$verific$mux_24$cf_rca_16.v:5695$5079 ($mux).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.\s16.$verific$equal_4$cf_rca_16.v:5793$5725 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.\s16.$verific$equal_7$cf_rca_16.v:5795$5728 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.\s16.$verific$equal_10$cf_rca_16.v:5797$5731 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.\s16.$verific$equal_13$cf_rca_16.v:5799$5734 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.\s16.$verific$equal_16$cf_rca_16.v:5801$5737 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.\s16.\s16.$verific$equal_4$cf_rca_16.v:5848$6058 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.$verific$equal_16$cf_rca_16.v:5746$5404 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.$verific$equal_13$cf_rca_16.v:5744$5401 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.$verific$equal_10$cf_rca_16.v:5742$5398 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.$verific$equal_7$cf_rca_16.v:5740$5395 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.$verific$equal_4$cf_rca_16.v:5738$5392 ($eq).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.$verific$mux_22$cf_rca_16.v:5694$5077 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.$verific$mux_20$cf_rca_16.v:5693$5075 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.$verific$mux_18$cf_rca_16.v:5692$5073 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.$verific$mux_26$cf_rca_16.v:5751$5414 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.$verific$mux_24$cf_rca_16.v:5750$5412 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.$verific$mux_22$cf_rca_16.v:5749$5410 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.$verific$mux_20$cf_rca_16.v:5748$5408 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.$verific$mux_18$cf_rca_16.v:5747$5406 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.$verific$mux_26$cf_rca_16.v:5806$5747 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.$verific$mux_24$cf_rca_16.v:5805$5745 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.$verific$mux_22$cf_rca_16.v:5804$5743 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.$verific$mux_20$cf_rca_16.v:5803$5741 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.$verific$mux_18$cf_rca_16.v:5802$5739 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.$verific$mux_26$cf_rca_16.v:5861$6080 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.$verific$mux_24$cf_rca_16.v:5860$6078 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.$verific$mux_22$cf_rca_16.v:5859$6076 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.$verific$mux_20$cf_rca_16.v:5858$6074 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.$verific$mux_18$cf_rca_16.v:5857$6072 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.$verific$mux_26$cf_rca_16.v:5911$6333 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.$verific$mux_24$cf_rca_16.v:5910$6331 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.$verific$mux_22$cf_rca_16.v:5909$6329 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.$verific$mux_20$cf_rca_16.v:5908$6327 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.$verific$mux_18$cf_rca_16.v:5907$6325 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.\s16.$verific$mux_31$cf_rca_16.v:5961$6513 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.\s16.$verific$mux_29$cf_rca_16.v:5960$6511 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.\s16.$verific$mux_27$cf_rca_16.v:5959$6509 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.\s16.$verific$mux_25$cf_rca_16.v:5958$6507 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.\s16.$verific$mux_23$cf_rca_16.v:5957$6505 ($mux).
Removed cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.\s16.$verific$mux_21$cf_rca_16.v:5956$6503 ($mux).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 1 unused cells and 1 unused wires.
<suppressed ~2 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module top:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~11 debug messages>

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~996 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 11 unused cells and 11 unused wires.
<suppressed ~22 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~996 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> stat

3.22. Printing statistics.

=== top ===

   Number of wires:              18786
   Number of wire bits:          49962
   Number of public wires:       18786
   Number of public wire bits:   49962
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               7024
     $dff                          384
     $dffe                         192
     $eq                           396
     $logic_not                     52
     $mux                         6000


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.23. Executing TECHMAP pass (map to technology primitives).

3.23.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.23.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.23.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $dff.
No more expansions possible.
<suppressed ~7095 debug messages>

yosys> stat

3.24. Printing statistics.

=== top ===

   Number of wires:              20586
   Number of wire bits:          52882
   Number of public wires:       18786
   Number of public wire bits:   49962
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              15237
     $_DFFE_PP_                   3440
     $_DFF_P_                      384
     $_MUX_                       8441
     $_NOT_                        448
     $_OR_                        1120
     $_XOR_                       1404


yosys> opt

3.25. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.25.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~4806 debug messages>

yosys> opt_merge -nomux

3.25.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~4332 debug messages>
Removed a total of 1444 cells.

yosys> opt_muxtree

3.25.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.25.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 256 unused cells and 2243 unused wires.
<suppressed ~513 debug messages>

yosys> opt_expr

3.25.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.25.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.25.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.25.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.25.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.25.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~2256 debug messages>

yosys> opt_merge

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~45 debug messages>
Removed a total of 15 cells.

yosys> opt_dff

3.26.3. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$14537 ($_DFF_P_) from module top.

yosys> opt_clean

3.26.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

3.26.5. Rerunning OPT passes. (Removed registers in this run.)

yosys> opt_expr -full

3.26.6. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.26.7. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.26.8. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

3.26.10. Finished fast OPT passes.

yosys> memory_map

3.27. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.28.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.28.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr -full

3.28.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.28.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.29. Executing ABC pass (technology mapping using ABC).

3.29.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 8490 gates and 12310 wires to a netlist network with 3819 inputs and 560 outputs.

3.29.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/yosys_verific_rs/result_04-05-2022T15-08-45/Golden_synth_rs_ade.json/cf_rca_16/abc_tmp.scr 
ABC:   #Luts =  2531  Max Lvl =   5  Avg Lvl =   3.97  [   2.22 sec. at Pass 0]
ABC:   #Luts =  2487  Max Lvl =   5  Avg Lvl =   3.63  [  58.84 sec. at Pass 1]
ABC:   #Luts =  2487  Max Lvl =   5  Avg Lvl =   3.63  [  12.95 sec. at Pass 2]
ABC:   #Luts =  2487  Max Lvl =   5  Avg Lvl =   3.63  [  15.81 sec. at Pass 3]
ABC:   #Luts =  2487  Max Lvl =   5  Avg Lvl =   3.63  [  14.41 sec. at Pass 4]
ABC:   #Luts =  2487  Max Lvl =   5  Avg Lvl =   3.63  [  16.38 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     2487
ABC RESULTS:        internal signals:     7931
ABC RESULTS:           input signals:     3819
ABC RESULTS:          output signals:      560
Removing temp directory.

yosys> opt

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.30.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 12098 unused wires.
<suppressed ~7213 debug messages>

yosys> opt_expr

3.30.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.30.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.30.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.30.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.30.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.30.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.30.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.31. Printing statistics.

=== top ===

   Number of wires:              13245
   Number of wire bits:          41181
   Number of public wires:       11318
   Number of public wire bits:   39254
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               6295
     $_DFFE_PP_                   3440
     $_DFF_P_                      368
     $lut                         2487


yosys> shregmap -minlen 8 -maxlen 20

3.32. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.33. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.34. Printing statistics.

=== top ===

   Number of wires:              13245
   Number of wire bits:          41181
   Number of public wires:       11318
   Number of public wire bits:   39254
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               6295
     $_DFFE_PP0P_                 3440
     $_DFF_P_                      368
     $lut                         2487


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.35. Executing TECHMAP pass (map to technology primitives).

3.35.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.35.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.35.3. Continuing TECHMAP pass.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~9871 debug messages>

yosys> opt_expr -mux_undef

3.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~104431 debug messages>

yosys> simplemap

3.37. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.38. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.39. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~10038 debug messages>
Removed a total of 3346 cells.

yosys> opt_dff -nodffe -nosdff

3.40. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.41. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 31519 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.42. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.42.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~715 debug messages>

yosys> opt_merge -nomux

3.42.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.42.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.42.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.42.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 18 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.42.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.42.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.42.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.42.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.42.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.42.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.42.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.43. Executing ABC pass (technology mapping using ABC).

3.43.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 7645 gates and 11466 wires to a netlist network with 3819 inputs and 560 outputs.

3.43.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/yosys_verific_rs/result_04-05-2022T15-08-45/Golden_synth_rs_ade.json/cf_rca_16/abc_tmp.scr 
ABC:   #Luts =  2487  Max Lvl =   5  Avg Lvl =   3.63  [   1.33 sec. at Pass 0]
ABC:   #Luts =  2487  Max Lvl =   5  Avg Lvl =   3.63  [  33.63 sec. at Pass 1]
ABC:   #Luts =  2487  Max Lvl =   5  Avg Lvl =   3.63  [   9.11 sec. at Pass 2]
ABC:   #Luts =  2487  Max Lvl =   5  Avg Lvl =   3.63  [  14.26 sec. at Pass 3]
ABC:   #Luts =  2487  Max Lvl =   5  Avg Lvl =   3.63  [  12.28 sec. at Pass 4]
ABC:   #Luts =  2487  Max Lvl =   5  Avg Lvl =   3.63  [  16.58 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.43.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     2487
ABC RESULTS:        internal signals:     7087
ABC RESULTS:           input signals:     3819
ABC RESULTS:          output signals:      560
Removing temp directory.

yosys> opt

3.44. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.44.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.44.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.44.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.44.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.44.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.44.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.44.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 9352 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.44.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.44.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.44.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.44.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.44.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.44.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.44.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.44.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.44.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.45. Executing HIERARCHY pass (managing design hierarchy).

3.45.1. Analyzing design hierarchy..
Top module:  \top

3.45.2. Analyzing design hierarchy..
Top module:  \top
Removed 0 unused modules.

yosys> stat

3.46. Printing statistics.

=== top ===

   Number of wires:              13245
   Number of wire bits:          41181
   Number of public wires:       11318
   Number of public wire bits:   39254
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               6295
     $lut                         2487
     dffsre                       3808


yosys> opt_clean -purge

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 6937 unused wires.
<suppressed ~6937 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.48. Executing Verilog backend.

yosys> bmuxmap

3.48.1. Executing BMUXMAP pass.

yosys> demuxmap

3.48.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\top'.

Warnings: 62 unique messages, 62 total
End of script. Logfile hash: 6fd987e960, CPU: user 82.09s system 0.83s, MEM: 302.83 MB peak
Yosys 0.16+6 (git sha1 7f5477eb1, gcc 9.1.0 -fPIC -Os)
Time spent: 85% 2x abc (502 sec), 3% 29x opt_expr (22 sec), ...
real 435.51
user 542.10
sys 42.44
