
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.47
 Yosys 0.18+10 (git sha1 8217e4c48, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl b15.vhd

yosys> verific -vhdl b15.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'b15.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-INFO [VHDL-1012] b15.vhd:1: analyzing entity 'b15'
VERIFIC-INFO [VHDL-1010] b15.vhd:17: analyzing architecture 'behav'

yosys> synth_rs -top b15 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.57

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top b15

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] b15.vhd:1: processing 'b15(BEHAV)'
Importing module b15.

3.3.1. Analyzing design hierarchy..
Top module:  \b15

3.3.2. Analyzing design hierarchy..
Top module:  \b15
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~17 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~4 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 7 unused cells and 141 unused wires.
<suppressed ~63 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module b15...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~89 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
    New ctrl vector for $pmux cell $verific$Select_710$b15.vhd:564$890: { $verific$n7780$86 $verific$n7781$87 $auto$opt_reduce.cc:134:opt_pmux$1061 $auto$opt_reduce.cc:134:opt_pmux$1059 }
    New ctrl vector for $pmux cell $verific$Select_712$b15.vhd:564$892: { $verific$n7780$86 $auto$opt_reduce.cc:134:opt_pmux$1067 $auto$opt_reduce.cc:134:opt_pmux$1065 $auto$opt_reduce.cc:134:opt_pmux$1063 }
    New ctrl vector for $pmux cell $verific$Select_718$b15.vhd:564$898: { $verific$n7970$107 $verific$n7787$93 $auto$opt_reduce.cc:134:opt_pmux$1069 $verific$n7789$95 }
    New ctrl vector for $pmux cell $verific$Select_720$b15.vhd:564$899: { $verific$n7970$107 $auto$opt_reduce.cc:134:opt_pmux$1073 $auto$opt_reduce.cc:134:opt_pmux$1071 }
    New ctrl vector for $pmux cell $verific$Select_722$b15.vhd:564$900: { $verific$n7970$107 $auto$opt_reduce.cc:134:opt_pmux$1077 $auto$opt_reduce.cc:134:opt_pmux$1075 }
    New ctrl vector for $pmux cell $verific$Select_724$b15.vhd:564$901: { $verific$n7970$107 $auto$opt_reduce.cc:134:opt_pmux$1079 }
    New ctrl vector for $pmux cell $verific$select_707$b15.vhd:564$887: { $verific$n7780$86 $verific$n7781$87 $auto$opt_reduce.cc:134:opt_pmux$1089 $auto$opt_reduce.cc:134:opt_pmux$1087 $auto$opt_reduce.cc:134:opt_pmux$1085 $auto$opt_reduce.cc:134:opt_pmux$1083 $auto$opt_reduce.cc:134:opt_pmux$1081 }
    New ctrl vector for $pmux cell $verific$select_708$b15.vhd:564$888: { $auto$opt_reduce.cc:134:opt_pmux$1099 $auto$opt_reduce.cc:134:opt_pmux$1097 $verific$n7786$92 $verific$n7788$94 $auto$opt_reduce.cc:134:opt_pmux$1095 $auto$opt_reduce.cc:134:opt_pmux$1093 $auto$opt_reduce.cc:134:opt_pmux$1091 }
    New ctrl vector for $pmux cell $verific$select_713$b15.vhd:564$893: { $verific$n7780$86 $verific$n7781$87 $auto$opt_reduce.cc:134:opt_pmux$1101 }
    New ctrl vector for $pmux cell $verific$select_714$b15.vhd:564$894: { $verific$n7784$90 $verific$n7786$92 $verific$n7788$94 $verific$n7794$100 $auto$opt_reduce.cc:134:opt_pmux$1103 }
    New ctrl vector for $pmux cell $verific$select_715$b15.vhd:564$895: { $verific$n7785$91 $verific$n7795$101 $auto$opt_reduce.cc:134:opt_pmux$1105 }
    New ctrl vector for $pmux cell $verific$select_716$b15.vhd:564$896: { $verific$n7786$92 $verific$n7787$93 $auto$opt_reduce.cc:134:opt_pmux$1109 $auto$opt_reduce.cc:134:opt_pmux$1107 }
    New ctrl vector for $pmux cell $verific$select_725$b15.vhd:564$902: { $verific$n7786$92 $verific$n7787$93 $auto$opt_reduce.cc:134:opt_pmux$1111 }
    New ctrl vector for $pmux cell $verific$select_726$b15.vhd:564$903: { $verific$n7786$92 $verific$n7787$93 $auto$opt_reduce.cc:134:opt_pmux$1113 }
    New ctrl vector for $pmux cell $verific$select_727$b15.vhd:564$904: { $verific$n7787$93 $verific$n7789$95 $auto$opt_reduce.cc:134:opt_pmux$1115 }
    New ctrl vector for $pmux cell $verific$select_728$b15.vhd:564$905: { $verific$n7787$93 $auto$opt_reduce.cc:134:opt_pmux$1117 }
  Optimizing cells in module \b15.
Performed a total of 16 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
<suppressed ~45 debug messages>
Removed a total of 15 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$rEIP_reg$b15.vhd:614$1033 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$ADS_n_reg$b15.vhd:233$624 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$W_R_n_reg$b15.vhd:233$621 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$State_reg$b15.vhd:233$625 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$StateBS16_reg$b15.vhd:233$627 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$RequestPending_reg$b15.vhd:614$1037 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$ReadRequest_reg$b15.vhd:614$1035 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.uWord_reg$b15.vhd:614$1027 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.lWord_reg$b15.vhd:614$1026 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.State2_reg$b15.vhd:614$1003 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.PhyAddrPointer_reg$b15.vhd:614$1023 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.More_reg$b15.vhd:614$1024 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_9$b15.vhd:614$1011 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_8$b15.vhd:614$1010 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_7$b15.vhd:614$1009 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_6$b15.vhd:614$1008 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_5$b15.vhd:614$1007 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_4$b15.vhd:614$1006 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_3$b15.vhd:614$1005 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_2$b15.vhd:614$1004 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_16$b15.vhd:614$1018 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_15$b15.vhd:614$1017 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_14$b15.vhd:614$1016 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_13$b15.vhd:614$1015 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_12$b15.vhd:614$1014 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_11$b15.vhd:614$1013 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg_10$b15.vhd:614$1012 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueue_reg$b15.vhd:614$1019 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueueWr_Addr_reg$b15.vhd:614$1021 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstQueueRd_Addr_reg$b15.vhd:614$1020 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.InstAddrPointer_reg$b15.vhd:614$1022 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$P1.Flush_reg$b15.vhd:614$1025 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$MemoryFetch_reg$b15.vhd:614$1036 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$M_IO_n_reg$b15.vhd:233$623 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$EBX_reg$b15.vhd:614$1032 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$EAX_reg$b15.vhd:614$1031 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$Datao_reg$b15.vhd:614$1029 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$DataWidth_reg$b15.vhd:233$628 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$D_C_n_reg$b15.vhd:233$622 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$CodeFetch_reg$b15.vhd:614$1028 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$ByteEnable_reg$b15.vhd:670$1055 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$BE_n_reg$b15.vhd:233$619 ($aldff) from module b15.
Changing const-value async load to async reset on $verific$Address_reg$b15.vhd:233$620 ($aldff) from module b15.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 2 unused cells and 18 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~90 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~90 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$ByteEnable_reg$b15.vhd:670$1055 ($adff) from module b15 (D = $verific$n9573$528, Q = \ByteEnable).
Setting constant 0-bit at position 2 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 3 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 4 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 5 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 6 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 7 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 8 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 9 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 10 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 11 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 12 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 13 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 14 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 15 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 16 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 17 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 18 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 19 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 20 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 21 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 22 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 23 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 24 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 25 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 26 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 27 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 28 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 29 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 30 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 31 on $verific$DataWidth_reg$b15.vhd:233$628 ($adff) from module b15.
Setting constant 0-bit at position 31 on $verific$Datao_reg$b15.vhd:614$1029 ($adff) from module b15.
Setting constant 0-bit at position 4 on $verific$P1.InstQueueWr_Addr_reg$b15.vhd:614$1021 ($adff) from module b15.

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~4 debug messages>

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~90 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$1121 ($adff) from module b15.
Setting constant 0-bit at position 31 on $auto$ff.cc:262:slice$1122 ($adff) from module b15.
Setting constant 0-bit at position 4 on $verific$P1.InstQueueRd_Addr_reg$b15.vhd:614$1020 ($adff) from module b15.

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.13.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~90 debug messages>

yosys> opt_reduce

3.13.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.13.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> opt_expr

3.13.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.13.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 30 bits (of 32) from mux cell b15.$verific$mux_98$b15.vhd:183$588 ($mux).
Removed top 1 bits (of 31) from port Y of cell b15.$verific$add_113$b15.vhd:199$592 ($add).
Removed top 1 bits (of 31) from port A of cell b15.$verific$add_113$b15.vhd:199$592 ($add).
Removed top 1 bits (of 3) from mux cell b15.$verific$mux_127$b15.vhd:217$598 ($mux).
Removed top 15 bits (of 16) from port A of cell b15.$verific$Decoder_193$b15.vhd:307$633 ($shl).
Removed top 1 bits (of 5) from port A of cell b15.$verific$add_210$b15.vhd:308$650 ($add).
Removed top 4 bits (of 5) from port B of cell b15.$verific$add_210$b15.vhd:308$650 ($add).
Removed top 1 bits (of 5) from port Y of cell b15.$verific$add_210$b15.vhd:308$650 ($add).
Removed top 15 bits (of 16) from port A of cell b15.$verific$Decoder_213$b15.vhd:310$653 ($shl).
Removed top 3 bits (of 4) from port B of cell b15.$verific$add_230$b15.vhd:311$670 ($add).
Removed top 8 bits (of 16) from port Y of cell b15.$verific$add_235$b15.vhd:313$674 ($add).
Removed top 8 bits (of 16) from port A of cell b15.$verific$add_235$b15.vhd:313$674 ($add).
Removed top 15 bits (of 16) from port A of cell b15.$verific$Decoder_237$b15.vhd:313$679 ($shl).
Removed top 3 bits (of 4) from port B of cell b15.$verific$add_254$b15.vhd:314$696 ($add).
Removed top 15 bits (of 16) from port A of cell b15.$verific$Decoder_261$b15.vhd:315$704 ($shl).
Removed top 3 bits (of 4) from port B of cell b15.$verific$add_278$b15.vhd:316$721 ($add).
Removed top 29 bits (of 30) from port B of cell b15.$verific$add_281$b15.vhd:317$722 ($add).
Removed top 30 bits (of 31) from port B of cell b15.$verific$add_284$b15.vhd:320$724 ($add).
Removed top 1 bits (of 32) from port A of cell b15.$verific$LessThan_286$b15.vhd:321$726 ($lt).
Removed top 1 bits (of 33) from port Y of cell b15.$verific$unary_minus_287$b15.vhd:322$727 ($neg).
Removed top 1 bits (of 33) from port A of cell b15.$verific$unary_minus_287$b15.vhd:322$727 ($neg).
Removed top 31 bits (of 32) from port B of cell b15.$verific$add_360$b15.vhd:346$752 ($add).
Removed top 1 bits (of 5) from port A of cell b15.$verific$add_362$b15.vhd:347$754 ($add).
Removed top 4 bits (of 5) from port B of cell b15.$verific$add_362$b15.vhd:347$754 ($add).
Removed top 1 bits (of 6) from port Y of cell b15.$verific$add_362$b15.vhd:347$754 ($add).
Removed top 2 bits (of 6) from port A of cell b15.$verific$sub_369$b15.vhd:357$756 ($sub).
Removed top 2 bits (of 6) from port B of cell b15.$verific$sub_369$b15.vhd:357$756 ($sub).
Removed top 1 bits (of 6) from port Y of cell b15.$verific$sub_369$b15.vhd:357$756 ($sub).
Removed top 1 bits (of 6) from port B of cell b15.$verific$LessThan_370$b15.vhd:357$757 ($le).
Removed top 1 bits (of 8) from port A of cell b15.$verific$LessThan_373$b15.vhd:358$759 ($lt).
Removed top 1 bits (of 9) from port A of cell b15.$verific$sub_378$b15.vhd:359$760 ($sub).
Removed top 1 bits (of 9) from port B of cell b15.$verific$sub_378$b15.vhd:359$760 ($sub).
Removed top 1 bits (of 33) from port Y of cell b15.$verific$sub_379$b15.vhd:359$761 ($sub).
Removed top 1 bits (of 33) from port A of cell b15.$verific$sub_379$b15.vhd:359$761 ($sub).
Removed top 1 bits (of 33) from port B of cell b15.$verific$sub_379$b15.vhd:359$761 ($sub).
Removed top 30 bits (of 31) from port B of cell b15.$verific$add_383$b15.vhd:362$763 ($add).
Removed top 24 bits (of 32) from port B of cell b15.$verific$add_387$b15.vhd:362$764 ($add).
Removed top 1 bits (of 6) from port B of cell b15.$verific$LessThan_397$b15.vhd:372$771 ($le).
Removed top 29 bits (of 32) from port B of cell b15.$verific$add_399$b15.vhd:373$772 ($add).
Removed top 24 bits (of 32) from port B of cell b15.$verific$add_403$b15.vhd:373$773 ($add).
Removed top 1 bits (of 3) from port A of cell b15.$verific$add_422$b15.vhd:393$778 ($add).
Removed top 2 bits (of 3) from port B of cell b15.$verific$add_422$b15.vhd:393$778 ($add).
Removed top 1 bits (of 3) from port Y of cell b15.$verific$add_422$b15.vhd:393$778 ($add).
Removed top 1 bits (of 5) from port A of cell b15.$verific$add_424$b15.vhd:393$781 ($add).
Removed top 3 bits (of 5) from port B of cell b15.$verific$add_424$b15.vhd:393$781 ($add).
Removed top 1 bits (of 5) from port Y of cell b15.$verific$add_424$b15.vhd:393$781 ($add).
Removed top 7 bits (of 8) from port B of cell b15.$verific$add_426$b15.vhd:393$784 ($add).
Removed top 1 bits (of 9) from port Y of cell b15.$verific$add_426$b15.vhd:393$784 ($add).
Removed top 1 bits (of 4) from port A of cell b15.$verific$add_427$b15.vhd:393$785 ($add).
Removed top 3 bits (of 4) from port B of cell b15.$verific$add_427$b15.vhd:393$785 ($add).
Removed top 1 bits (of 5) from port A of cell b15.$verific$add_435$b15.vhd:397$789 ($add).
Removed top 2 bits (of 5) from port B of cell b15.$verific$add_435$b15.vhd:397$789 ($add).
Removed top 1 bits (of 5) from port Y of cell b15.$verific$add_435$b15.vhd:397$789 ($add).
Removed top 1 bits (of 5) from mux cell b15.$verific$mux_440$b15.vhd:401$794 ($mux).
Removed top 1 bits (of 6) from port B of cell b15.$verific$LessThan_462$b15.vhd:414$798 ($le).
Removed top 30 bits (of 31) from port B of cell b15.$verific$add_473$b15.vhd:432$801 ($add).
Removed top 1 bits (of 10) from mux cell b15.$verific$mux_943$b15.vhd:446$829 ($mux).
Removed top 1 bits (of 3) from port A of cell b15.$verific$equal_517$b15.vhd:464$831 ($eq).
Removed top 1 bits (of 5) from mux cell b15.$verific$mux_562$b15.vhd:481$848 ($mux).
Removed top 1 bits (of 64) from mux cell b15.$verific$mux_935$b15.vhd:481$851 ($mux).
Removed top 1 bits (of 64) from mux cell b15.$verific$mux_934$b15.vhd:485$859 ($mux).
Removed top 30 bits (of 31) from port B of cell b15.$verific$add_669$b15.vhd:548$860 ($add).
Removed top 1 bits (of 32) from port Y of cell b15.$verific$add_669$b15.vhd:548$860 ($add).
Removed top 30 bits (of 31) from port B of cell b15.$verific$add_676$b15.vhd:554$863 ($add).
Removed top 1 bits (of 32) from port Y of cell b15.$verific$add_676$b15.vhd:554$863 ($add).
Removed top 1 bits (of 8) from port A of cell b15.$verific$equal_689$b15.vhd:350$867 ($eq).
Removed top 5 bits (of 8) from port A of cell b15.$verific$equal_700$b15.vhd:527$878 ($eq).
Removed top 5 bits (of 8) from port A of cell b15.$verific$equal_701$b15.vhd:532$879 ($eq).
Removed top 1 bits (of 8) from port A of cell b15.$verific$equal_704$b15.vhd:547$882 ($eq).
Removed top 1 bits (of 8) from port A of cell b15.$verific$equal_705$b15.vhd:553$883 ($eq).
Removed top 1 bits (of 5) from port B of cell b15.$verific$LessThan_729$b15.vhd:565$906 ($lt).
Removed top 2 bits (of 6) from port A of cell b15.$verific$sub_731$b15.vhd:565$908 ($sub).
Removed top 1 bits (of 6) from port B of cell b15.$verific$sub_731$b15.vhd:565$908 ($sub).
Removed top 1 bits (of 6) from port A of cell b15.$verific$LessThan_732$b15.vhd:565$909 ($lt).
Removed top 1 bits (of 32) from port A of cell b15.$verific$LessThan_742$b15.vhd:581$917 ($lt).
Removed top 1 bits (of 33) from port Y of cell b15.$verific$unary_minus_743$b15.vhd:582$918 ($neg).
Removed top 1 bits (of 33) from port A of cell b15.$verific$unary_minus_743$b15.vhd:582$918 ($neg).
Removed top 30 bits (of 32) from mux cell b15.$verific$mux_746$b15.vhd:587$922 ($mux).
Removed top 1 bits (of 2) from port A of cell b15.$verific$add_747$b15.vhd:588$924 ($add).
Removed top 1 bits (of 4) from mux cell b15.$verific$mux_751$b15.vhd:589$926 ($mux).
Removed top 1 bits (of 5) from mux cell b15.$verific$mux_752$b15.vhd:590$927 ($mux).
Removed top 1 bits (of 5) from mux cell b15.$verific$mux_753$b15.vhd:590$928 ($mux).
Removed top 2 bits (of 6) from port A of cell b15.$verific$sub_754$b15.vhd:591$929 ($sub).
Removed top 2 bits (of 6) from port B of cell b15.$verific$sub_754$b15.vhd:591$929 ($sub).
Removed top 1 bits (of 6) from port Y of cell b15.$verific$sub_754$b15.vhd:591$929 ($sub).
Removed top 1 bits (of 6) from port A of cell b15.$verific$LessThan_755$b15.vhd:591$930 ($lt).
Removed top 1 bits (of 5) from mux cell b15.$verific$mux_757$b15.vhd:596$931 ($mux).
Removed top 1 bits (of 5) from port A of cell b15.$verific$LessThan_758$b15.vhd:599$932 ($le).
Removed top 1 bits (of 5) from port B of cell b15.$verific$LessThan_758$b15.vhd:599$932 ($le).
Removed top 1 bits (of 5) from mux cell b15.$verific$mux_799$b15.vhd:607$968 ($mux).
Removed top 1 bits (of 33) from FF cell b15.$verific$rEIP_reg$b15.vhd:614$1033 ($adff).
Removed top 1 bits (of 2) from port A of cell b15.$verific$equal_896$b15.vhd:636$1047 ($eq).
Removed top 30 bits (of 32) from port Y of cell b15.$verific$unary_minus_743$b15.vhd:582$918 ($neg).
Removed top 30 bits (of 32) from port A of cell b15.$verific$unary_minus_743$b15.vhd:582$918 ($neg).
Removed top 30 bits (of 32) from wire b15.$verific$n1001$168.
Removed top 1 bits (of 31) from wire b15.$verific$n1151$173.
Removed top 1 bits (of 3) from wire b15.$verific$n1294$178.
Removed top 1 bits (of 5) from wire b15.$verific$n2071$211.
Removed top 8 bits (of 16) from wire b15.$verific$n2267$232.
Removed top 1 bits (of 33) from wire b15.$verific$n2793$278.
Removed top 1 bits (of 5) from wire b15.$verific$n3660$305.
Removed top 1 bits (of 33) from wire b15.$verific$n3837$312.
Removed top 1 bits (of 3) from wire b15.$verific$n4619$333.
Removed top 1 bits (of 5) from wire b15.$verific$n4633$335.
Removed top 1 bits (of 4) from wire b15.$verific$n4659$338.
Removed top 1 bits (of 5) from wire b15.$verific$n4791$342.
Removed top 1 bits (of 5) from wire b15.$verific$n4868$346.
Removed top 1 bits (of 5) from wire b15.$verific$n5590$365.
Removed top 1 bits (of 32) from wire b15.$verific$n6129$379.
Removed top 1 bits (of 5) from wire b15.$verific$n6239$383.
Removed top 1 bits (of 32) from wire b15.$verific$n6315$387.
Removed top 31 bits (of 33) from wire b15.$verific$n8109$437.
Removed top 30 bits (of 32) from wire b15.$verific$n8209$440.
Removed top 1 bits (of 4) from wire b15.$verific$n8249$442.
Removed top 1 bits (of 5) from wire b15.$verific$n8254$443.
Removed top 1 bits (of 5) from wire b15.$verific$n8260$444.
Removed top 3 bits (of 4) from wire b15.$verific$n8274$446.
Removed top 1 bits (of 5) from wire b15.$verific$n8279$447.
Removed top 1 bits (of 5) from wire b15.$verific$n8638$483.
Removed top 30 bits (of 32) from wire b15.DataWidth.
Removed top 1 bits (of 5) from wire b15.P1.InstQueueRd_Addr.
Removed top 1 bits (of 5) from wire b15.P1.InstQueueWr_Addr.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 34 unused cells and 94 unused wires.
<suppressed ~35 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module b15:
  creating $macc model for $verific$add_113$b15.vhd:199$592 ($add).
  creating $macc model for $verific$add_210$b15.vhd:308$650 ($add).
  creating $macc model for $verific$add_230$b15.vhd:311$670 ($add).
  creating $macc model for $verific$add_235$b15.vhd:313$674 ($add).
  creating $macc model for $verific$add_254$b15.vhd:314$696 ($add).
  creating $macc model for $verific$add_259$b15.vhd:315$700 ($add).
  creating $macc model for $verific$add_278$b15.vhd:316$721 ($add).
  creating $macc model for $verific$add_28$b15.vhd:127$542 ($add).
  creating $macc model for $verific$add_281$b15.vhd:317$722 ($add).
  creating $macc model for $verific$add_284$b15.vhd:320$724 ($add).
  creating $macc model for $verific$add_360$b15.vhd:346$752 ($add).
  creating $macc model for $verific$add_362$b15.vhd:347$754 ($add).
  creating $macc model for $verific$add_383$b15.vhd:362$763 ($add).
  creating $macc model for $verific$add_387$b15.vhd:362$764 ($add).
  creating $macc model for $verific$add_399$b15.vhd:373$772 ($add).
  creating $macc model for $verific$add_403$b15.vhd:373$773 ($add).
  creating $macc model for $verific$add_422$b15.vhd:393$778 ($add).
  creating $macc model for $verific$add_424$b15.vhd:393$781 ($add).
  creating $macc model for $verific$add_426$b15.vhd:393$784 ($add).
  creating $macc model for $verific$add_427$b15.vhd:393$785 ($add).
  creating $macc model for $verific$add_435$b15.vhd:397$789 ($add).
  creating $macc model for $verific$add_473$b15.vhd:432$801 ($add).
  creating $macc model for $verific$add_669$b15.vhd:548$860 ($add).
  creating $macc model for $verific$add_676$b15.vhd:554$863 ($add).
  creating $macc model for $verific$add_747$b15.vhd:588$924 ($add).
  creating $macc model for $verific$sub_369$b15.vhd:357$756 ($sub).
  creating $macc model for $verific$sub_378$b15.vhd:359$760 ($sub).
  creating $macc model for $verific$sub_379$b15.vhd:359$761 ($sub).
  creating $macc model for $verific$sub_731$b15.vhd:565$908 ($sub).
  creating $macc model for $verific$sub_754$b15.vhd:591$929 ($sub).
  creating $macc model for $verific$unary_minus_287$b15.vhd:322$727 ($neg).
  creating $macc model for $verific$unary_minus_743$b15.vhd:582$918 ($neg).
  creating $alu model for $macc $verific$unary_minus_743$b15.vhd:582$918.
  creating $alu model for $macc $verific$unary_minus_287$b15.vhd:322$727.
  creating $alu model for $macc $verific$sub_754$b15.vhd:591$929.
  creating $alu model for $macc $verific$sub_731$b15.vhd:565$908.
  creating $alu model for $macc $verific$sub_379$b15.vhd:359$761.
  creating $alu model for $macc $verific$sub_378$b15.vhd:359$760.
  creating $alu model for $macc $verific$sub_369$b15.vhd:357$756.
  creating $alu model for $macc $verific$add_747$b15.vhd:588$924.
  creating $alu model for $macc $verific$add_676$b15.vhd:554$863.
  creating $alu model for $macc $verific$add_669$b15.vhd:548$860.
  creating $alu model for $macc $verific$add_473$b15.vhd:432$801.
  creating $alu model for $macc $verific$add_435$b15.vhd:397$789.
  creating $alu model for $macc $verific$add_427$b15.vhd:393$785.
  creating $alu model for $macc $verific$add_426$b15.vhd:393$784.
  creating $alu model for $macc $verific$add_424$b15.vhd:393$781.
  creating $alu model for $macc $verific$add_422$b15.vhd:393$778.
  creating $alu model for $macc $verific$add_403$b15.vhd:373$773.
  creating $alu model for $macc $verific$add_399$b15.vhd:373$772.
  creating $alu model for $macc $verific$add_387$b15.vhd:362$764.
  creating $alu model for $macc $verific$add_383$b15.vhd:362$763.
  creating $alu model for $macc $verific$add_362$b15.vhd:347$754.
  creating $alu model for $macc $verific$add_360$b15.vhd:346$752.
  creating $alu model for $macc $verific$add_284$b15.vhd:320$724.
  creating $alu model for $macc $verific$add_281$b15.vhd:317$722.
  creating $alu model for $macc $verific$add_28$b15.vhd:127$542.
  creating $alu model for $macc $verific$add_278$b15.vhd:316$721.
  creating $alu model for $macc $verific$add_259$b15.vhd:315$700.
  creating $alu model for $macc $verific$add_254$b15.vhd:314$696.
  creating $alu model for $macc $verific$add_235$b15.vhd:313$674.
  creating $alu model for $macc $verific$add_230$b15.vhd:311$670.
  creating $alu model for $macc $verific$add_210$b15.vhd:308$650.
  creating $alu model for $macc $verific$add_113$b15.vhd:199$592.
  creating $alu model for $verific$LessThan_286$b15.vhd:321$726 ($lt): new $alu
  creating $alu model for $verific$LessThan_370$b15.vhd:357$757 ($le): new $alu
  creating $alu model for $verific$LessThan_373$b15.vhd:358$759 ($lt): new $alu
  creating $alu model for $verific$LessThan_397$b15.vhd:372$771 ($le): new $alu
  creating $alu model for $verific$LessThan_462$b15.vhd:414$798 ($le): new $alu
  creating $alu model for $verific$LessThan_729$b15.vhd:565$906 ($lt): new $alu
  creating $alu model for $verific$LessThan_732$b15.vhd:565$909 ($lt): new $alu
  creating $alu model for $verific$LessThan_742$b15.vhd:581$917 ($lt): new $alu
  creating $alu model for $verific$LessThan_755$b15.vhd:591$930 ($lt): new $alu
  creating $alu model for $verific$LessThan_758$b15.vhd:599$932 ($le): new $alu
  creating $alu cell for $verific$LessThan_758$b15.vhd:599$932: $auto$alumacc.cc:485:replace_alu$1399
  creating $alu cell for $verific$LessThan_755$b15.vhd:591$930: $auto$alumacc.cc:485:replace_alu$1408
  creating $alu cell for $verific$LessThan_742$b15.vhd:581$917: $auto$alumacc.cc:485:replace_alu$1413
  creating $alu cell for $verific$LessThan_732$b15.vhd:565$909: $auto$alumacc.cc:485:replace_alu$1418
  creating $alu cell for $verific$LessThan_729$b15.vhd:565$906: $auto$alumacc.cc:485:replace_alu$1423
  creating $alu cell for $verific$LessThan_462$b15.vhd:414$798: $auto$alumacc.cc:485:replace_alu$1434
  creating $alu cell for $verific$LessThan_397$b15.vhd:372$771: $auto$alumacc.cc:485:replace_alu$1447
  creating $alu cell for $verific$LessThan_373$b15.vhd:358$759: $auto$alumacc.cc:485:replace_alu$1460
  creating $alu cell for $verific$LessThan_370$b15.vhd:357$757: $auto$alumacc.cc:485:replace_alu$1465
  creating $alu cell for $verific$LessThan_286$b15.vhd:321$726: $auto$alumacc.cc:485:replace_alu$1478
  creating $alu cell for $verific$add_113$b15.vhd:199$592: $auto$alumacc.cc:485:replace_alu$1483
  creating $alu cell for $verific$add_210$b15.vhd:308$650: $auto$alumacc.cc:485:replace_alu$1486
  creating $alu cell for $verific$add_230$b15.vhd:311$670: $auto$alumacc.cc:485:replace_alu$1489
  creating $alu cell for $verific$add_235$b15.vhd:313$674: $auto$alumacc.cc:485:replace_alu$1492
  creating $alu cell for $verific$add_254$b15.vhd:314$696: $auto$alumacc.cc:485:replace_alu$1495
  creating $alu cell for $verific$add_259$b15.vhd:315$700: $auto$alumacc.cc:485:replace_alu$1498
  creating $alu cell for $verific$add_278$b15.vhd:316$721: $auto$alumacc.cc:485:replace_alu$1501
  creating $alu cell for $verific$add_28$b15.vhd:127$542: $auto$alumacc.cc:485:replace_alu$1504
  creating $alu cell for $verific$add_281$b15.vhd:317$722: $auto$alumacc.cc:485:replace_alu$1507
  creating $alu cell for $verific$add_284$b15.vhd:320$724: $auto$alumacc.cc:485:replace_alu$1510
  creating $alu cell for $verific$add_360$b15.vhd:346$752: $auto$alumacc.cc:485:replace_alu$1513
  creating $alu cell for $verific$add_362$b15.vhd:347$754: $auto$alumacc.cc:485:replace_alu$1516
  creating $alu cell for $verific$add_383$b15.vhd:362$763: $auto$alumacc.cc:485:replace_alu$1519
  creating $alu cell for $verific$add_387$b15.vhd:362$764: $auto$alumacc.cc:485:replace_alu$1522
  creating $alu cell for $verific$add_399$b15.vhd:373$772: $auto$alumacc.cc:485:replace_alu$1525
  creating $alu cell for $verific$add_403$b15.vhd:373$773: $auto$alumacc.cc:485:replace_alu$1528
  creating $alu cell for $verific$add_422$b15.vhd:393$778: $auto$alumacc.cc:485:replace_alu$1531
  creating $alu cell for $verific$add_424$b15.vhd:393$781: $auto$alumacc.cc:485:replace_alu$1534
  creating $alu cell for $verific$add_426$b15.vhd:393$784: $auto$alumacc.cc:485:replace_alu$1537
  creating $alu cell for $verific$add_427$b15.vhd:393$785: $auto$alumacc.cc:485:replace_alu$1540
  creating $alu cell for $verific$add_435$b15.vhd:397$789: $auto$alumacc.cc:485:replace_alu$1543
  creating $alu cell for $verific$add_473$b15.vhd:432$801: $auto$alumacc.cc:485:replace_alu$1546
  creating $alu cell for $verific$add_669$b15.vhd:548$860: $auto$alumacc.cc:485:replace_alu$1549
  creating $alu cell for $verific$add_676$b15.vhd:554$863: $auto$alumacc.cc:485:replace_alu$1552
  creating $alu cell for $verific$add_747$b15.vhd:588$924: $auto$alumacc.cc:485:replace_alu$1555
  creating $alu cell for $verific$sub_369$b15.vhd:357$756: $auto$alumacc.cc:485:replace_alu$1558
  creating $alu cell for $verific$sub_378$b15.vhd:359$760: $auto$alumacc.cc:485:replace_alu$1561
  creating $alu cell for $verific$sub_379$b15.vhd:359$761: $auto$alumacc.cc:485:replace_alu$1564
  creating $alu cell for $verific$sub_731$b15.vhd:565$908: $auto$alumacc.cc:485:replace_alu$1567
  creating $alu cell for $verific$sub_754$b15.vhd:591$929: $auto$alumacc.cc:485:replace_alu$1570
  creating $alu cell for $verific$unary_minus_287$b15.vhd:322$727: $auto$alumacc.cc:485:replace_alu$1573
  creating $alu cell for $verific$unary_minus_743$b15.vhd:582$918: $auto$alumacc.cc:485:replace_alu$1576
  created 42 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~6 debug messages>

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~96 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1301: { $verific$n7796$102 $verific$n7795$101 $verific$n7794$100 $verific$n7793$99 $verific$n7792$98 $verific$n7791$97 $verific$n7790$96 $verific$n7789$95 $verific$n7788$94 $verific$n7787$93 $verific$n7785$91 $verific$n7783$89 $verific$n7782$88 $verific$n7781$87 $verific$n7780$86 $verific$n7779$85 $verific$n7778$84 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1249: { $verific$n7789$95 $verific$n7788$94 $verific$n7787$93 $verific$n7786$92 $auto$rtlil.cc:2400:Or$1238 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$1273: { $verific$n7789$95 $verific$n7788$94 $verific$n7787$93 $auto$rtlil.cc:2400:Or$1238 }
  Optimizing cells in module \b15.
Performed a total of 3 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 4 unused cells and 19 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~96 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== b15 ===

   Number of wires:                632
   Number of wire bits:           6283
   Number of public wires:          50
   Number of public wire bits:     453
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                520
     $adff                          42
     $adffe                          1
     $alu                           42
     $and                           22
     $bmux                          48
     $eq                            22
     $logic_not                      1
     $mux                          264
     $not                           18
     $or                            22
     $reduce_and                     5
     $reduce_or                     29
     $shl                            4


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.21.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.21.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> memory_share

3.21.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> memory_collect

3.21.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== b15 ===

   Number of wires:                632
   Number of wire bits:           6283
   Number of public wires:          50
   Number of public wire bits:     453
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                520
     $adff                          42
     $adffe                          1
     $alu                           42
     $and                           22
     $bmux                          48
     $eq                            22
     $logic_not                      1
     $mux                          264
     $not                           18
     $or                            22
     $reduce_and                     5
     $reduce_or                     29
     $shl                            4


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> stat

3.24. Printing statistics.

=== b15 ===

   Number of wires:                632
   Number of wire bits:           6283
   Number of public wires:          50
   Number of public wire bits:     453
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                520
     $adff                          42
     $adffe                          1
     $alu                           42
     $and                           22
     $bmux                          48
     $eq                            22
     $logic_not                      1
     $mux                          264
     $not                           18
     $or                            22
     $reduce_and                     5
     $reduce_or                     29
     $shl                            4


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $and.
Using template $paramod$44a13d10af618e7fbe7b9aad2f6151ffcee1e2fa\_90_alu for cells of type $alu.
Using template $paramod$32a7b7b86c07519b7537abc18e96f0331f97914d\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $bmux.
Using template $paramod$constmap:0c58e37f7f9ab9c08bb604a660a738f4cdfdf6a8$paramod$0c53878c2ab6a84f047b5c15f705bf752551700e\_90_shift_ops_shr_shl_sshl_sshr for cells of type $shl.
Using template $paramod$c3cd1564c35d873179656addd6052d7ea8b6d991\_90_alu for cells of type $alu.
Using template $paramod$354e377aaa263356a1a43d04ca847f8b92483a2a\_80_rs_alu for cells of type $alu.
Using template $paramod$788c3d57e5abb3a3f89aea6d4acd665be37f4e9b\_90_alu for cells of type $alu.
Using template $paramod$6a42b6fefed750f8a1c58eab59479d960557103c\_90_alu for cells of type $alu.
Using template $paramod$d1615bf4e5e328245ffd1550e5fe105901cda77b\_90_alu for cells of type $alu.
Using template $paramod$943564b9366bbc392bf4bbc801aa0a2d7742a4e0\_90_alu for cells of type $alu.
Using template $paramod$4ccbe221165818e15f326ddee3d1183c7924e12f\_90_alu for cells of type $alu.
Using template $paramod$e891e6b399cf52748460a311fafe476815d24bd7\_90_alu for cells of type $alu.
Using template $paramod$b85fbb3374a1d9ba7ee4f4d6323c30f939df3ada\_90_alu for cells of type $alu.
Using template $paramod$e04283ca12514baf3d204c6994bec8f178dd89f8\_90_alu for cells of type $alu.
Using template $paramod$79fc87901d7fd8aaad689b5406671422f5fa25b9\_80_rs_alu for cells of type $alu.
Using template $paramod$653d0dc5a667330298513325d0bd1def0e6c1128\_90_alu for cells of type $alu.
Using template $paramod$2c4d537db249d5ee7774cabca037a7502075cb7a\_80_rs_alu for cells of type $alu.
Using template $paramod$076c9a7a3f037230073fe14dd4865d470cb48917\_90_alu for cells of type $alu.
Using template $paramod$dfca81329cbbac01700318224209a5f2318c7128\_90_alu for cells of type $alu.
Using template $paramod$175e67c02b86e96b1288b9dc100122520d7240d8\_90_alu for cells of type $alu.
Using template $paramod$f85408ed1aa3d09e465edae8a7bf590332ae9f7b\_90_alu for cells of type $alu.
Using template $paramod$bfceb922395790c0ce92e9f9b5b428d4fc72cc30\_90_alu for cells of type $alu.
Using template $paramod$1a3a0c35c4a4896fbfd612699525c057298e72d2\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $eq.
Using template $paramod$b3c20b05d9b1fc2c940ef2f6c917486aead042e8\_90_alu for cells of type $alu.
Using template $paramod$83dd457849c736323edf2edb15923eb27f99c683\_90_alu for cells of type $alu.
Using template $paramod$63a3f1ffa662be02d3403b533885c56d18ebe02a\_80_rs_alu for cells of type $alu.
Using template $paramod$740b056ede97228d3eae64ea2fdc81f0a33e0fe7\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011110 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011111 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000011 for cells of type $lcu.
No more expansions possible.
<suppressed ~6123 debug messages>

yosys> stat

3.26. Printing statistics.

=== b15 ===

   Number of wires:               3366
   Number of wire bits:          73408
   Number of public wires:          50
   Number of public wire bits:     453
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              15777
     $_AND_                       1502
     $_DFFE_PP0P_                    4
     $_DFF_PP0_                    410
     $_MUX_                      10572
     $_NOT_                        685
     $_OR_                        1128
     $_XOR_                       1288
     adder_carry                   188


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~6687 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
<suppressed ~3174 debug messages>
Removed a total of 1058 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 469 unused cells and 2382 unused wires.
<suppressed ~470 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~146 debug messages>

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$3026 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10781 [3], Q = \P1.InstQueueRd_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$3025 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10781 [2], Q = \P1.InstQueueRd_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$3024 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10781 [1], Q = \P1.InstQueueRd_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$3023 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10781 [0], Q = \P1.InstQueueRd_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$3022 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2481, Q = \StateBS16).
Adding EN signal on $auto$ff.cc:262:slice$3021 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2464 [2], Q = \State [2]).
Adding EN signal on $auto$ff.cc:262:slice$3020 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2464 [1], Q = \State [1]).
Adding EN signal on $auto$ff.cc:262:slice$3019 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2464 [0], Q = \State [0]).
Adding EN signal on $auto$ff.cc:262:slice$3018 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2442, Q = \ADS_n).
Adding EN signal on $auto$ff.cc:262:slice$3016 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2432, Q = \D_C_n).
Adding EN signal on $auto$ff.cc:262:slice$3014 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [29], Q = \Address [29]).
Adding EN signal on $auto$ff.cc:262:slice$3013 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [28], Q = \Address [28]).
Adding EN signal on $auto$ff.cc:262:slice$3012 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [27], Q = \Address [27]).
Adding EN signal on $auto$ff.cc:262:slice$3011 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [26], Q = \Address [26]).
Adding EN signal on $auto$ff.cc:262:slice$3010 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [25], Q = \Address [25]).
Adding EN signal on $auto$ff.cc:262:slice$3009 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [24], Q = \Address [24]).
Adding EN signal on $auto$ff.cc:262:slice$3008 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [23], Q = \Address [23]).
Adding EN signal on $auto$ff.cc:262:slice$3007 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [22], Q = \Address [22]).
Adding EN signal on $auto$ff.cc:262:slice$3006 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [21], Q = \Address [21]).
Adding EN signal on $auto$ff.cc:262:slice$3005 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [20], Q = \Address [20]).
Adding EN signal on $auto$ff.cc:262:slice$3004 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [19], Q = \Address [19]).
Adding EN signal on $auto$ff.cc:262:slice$3003 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [18], Q = \Address [18]).
Adding EN signal on $auto$ff.cc:262:slice$3002 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [17], Q = \Address [17]).
Adding EN signal on $auto$ff.cc:262:slice$3001 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [16], Q = \Address [16]).
Adding EN signal on $auto$ff.cc:262:slice$3000 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [15], Q = \Address [15]).
Adding EN signal on $auto$ff.cc:262:slice$2999 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [14], Q = \Address [14]).
Adding EN signal on $auto$ff.cc:262:slice$2998 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [13], Q = \Address [13]).
Adding EN signal on $auto$ff.cc:262:slice$2997 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [12], Q = \Address [12]).
Adding EN signal on $auto$ff.cc:262:slice$2996 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [11], Q = \Address [11]).
Adding EN signal on $auto$ff.cc:262:slice$2995 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [10], Q = \Address [10]).
Adding EN signal on $auto$ff.cc:262:slice$2994 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [9], Q = \Address [9]).
Adding EN signal on $auto$ff.cc:262:slice$2993 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [8], Q = \Address [8]).
Adding EN signal on $auto$ff.cc:262:slice$2992 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [7], Q = \Address [7]).
Adding EN signal on $auto$ff.cc:262:slice$2991 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [6], Q = \Address [6]).
Adding EN signal on $auto$ff.cc:262:slice$2990 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [5], Q = \Address [5]).
Adding EN signal on $auto$ff.cc:262:slice$2989 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [4], Q = \Address [4]).
Adding EN signal on $auto$ff.cc:262:slice$2988 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [3], Q = \Address [3]).
Adding EN signal on $auto$ff.cc:262:slice$2987 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [2], Q = \Address [2]).
Adding EN signal on $auto$ff.cc:262:slice$2986 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [1], Q = \Address [1]).
Adding EN signal on $auto$ff.cc:262:slice$2985 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2899 [0], Q = \Address [0]).
Adding EN signal on $auto$ff.cc:262:slice$2096 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2683 [1], Q = \DataWidth [1]).
Adding EN signal on $auto$ff.cc:262:slice$2095 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$2683 [0], Q = \DataWidth [0]).
Adding EN signal on $auto$ff.cc:262:slice$13222 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [30], Q = \Datao [30]).
Adding EN signal on $auto$ff.cc:262:slice$13221 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [29], Q = \Datao [29]).
Adding EN signal on $auto$ff.cc:262:slice$13220 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [28], Q = \Datao [28]).
Adding EN signal on $auto$ff.cc:262:slice$13219 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [27], Q = \Datao [27]).
Adding EN signal on $auto$ff.cc:262:slice$13218 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [26], Q = \Datao [26]).
Adding EN signal on $auto$ff.cc:262:slice$13217 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [25], Q = \Datao [25]).
Adding EN signal on $auto$ff.cc:262:slice$13216 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [24], Q = \Datao [24]).
Adding EN signal on $auto$ff.cc:262:slice$13215 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [23], Q = \Datao [23]).
Adding EN signal on $auto$ff.cc:262:slice$13214 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [22], Q = \Datao [22]).
Adding EN signal on $auto$ff.cc:262:slice$13213 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [21], Q = \Datao [21]).
Adding EN signal on $auto$ff.cc:262:slice$13212 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [20], Q = \Datao [20]).
Adding EN signal on $auto$ff.cc:262:slice$13211 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [19], Q = \Datao [19]).
Adding EN signal on $auto$ff.cc:262:slice$13210 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [18], Q = \Datao [18]).
Adding EN signal on $auto$ff.cc:262:slice$13209 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [17], Q = \Datao [17]).
Adding EN signal on $auto$ff.cc:262:slice$13208 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [16], Q = \Datao [16]).
Adding EN signal on $auto$ff.cc:262:slice$13207 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [15], Q = \Datao [15]).
Adding EN signal on $auto$ff.cc:262:slice$13206 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [14], Q = \Datao [14]).
Adding EN signal on $auto$ff.cc:262:slice$13205 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [13], Q = \Datao [13]).
Adding EN signal on $auto$ff.cc:262:slice$13204 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [12], Q = \Datao [12]).
Adding EN signal on $auto$ff.cc:262:slice$13203 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [11], Q = \Datao [11]).
Adding EN signal on $auto$ff.cc:262:slice$13202 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [10], Q = \Datao [10]).
Adding EN signal on $auto$ff.cc:262:slice$13201 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [9], Q = \Datao [9]).
Adding EN signal on $auto$ff.cc:262:slice$13200 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [8], Q = \Datao [8]).
Adding EN signal on $auto$ff.cc:262:slice$13199 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [7], Q = \Datao [7]).
Adding EN signal on $auto$ff.cc:262:slice$13198 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [6], Q = \Datao [6]).
Adding EN signal on $auto$ff.cc:262:slice$13197 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [5], Q = \Datao [5]).
Adding EN signal on $auto$ff.cc:262:slice$13196 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [4], Q = \Datao [4]).
Adding EN signal on $auto$ff.cc:262:slice$13195 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [3], Q = \Datao [3]).
Adding EN signal on $auto$ff.cc:262:slice$13194 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [2], Q = \Datao [2]).
Adding EN signal on $auto$ff.cc:262:slice$13193 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [1], Q = \Datao [1]).
Adding EN signal on $auto$ff.cc:262:slice$13192 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12683 [0], Q = \Datao [0]).
Adding EN signal on $auto$ff.cc:262:slice$13047 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8624, Q = \RequestPending).
Adding EN signal on $auto$ff.cc:262:slice$13046 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8605, Q = \MemoryFetch).
Adding EN signal on $auto$ff.cc:262:slice$13045 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8586, Q = \ReadRequest).
Adding EN signal on $auto$ff.cc:262:slice$13044 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [32], Q = \rEIP [31]).
Adding EN signal on $auto$ff.cc:262:slice$13043 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [30], Q = \rEIP [30]).
Adding EN signal on $auto$ff.cc:262:slice$13042 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [29], Q = \rEIP [29]).
Adding EN signal on $auto$ff.cc:262:slice$13041 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [28], Q = \rEIP [28]).
Adding EN signal on $auto$ff.cc:262:slice$13040 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [27], Q = \rEIP [27]).
Adding EN signal on $auto$ff.cc:262:slice$13039 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [26], Q = \rEIP [26]).
Adding EN signal on $auto$ff.cc:262:slice$13038 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [25], Q = \rEIP [25]).
Adding EN signal on $auto$ff.cc:262:slice$13037 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [24], Q = \rEIP [24]).
Adding EN signal on $auto$ff.cc:262:slice$13036 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [23], Q = \rEIP [23]).
Adding EN signal on $auto$ff.cc:262:slice$13035 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [22], Q = \rEIP [22]).
Adding EN signal on $auto$ff.cc:262:slice$13034 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [21], Q = \rEIP [21]).
Adding EN signal on $auto$ff.cc:262:slice$13033 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [20], Q = \rEIP [20]).
Adding EN signal on $auto$ff.cc:262:slice$13032 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [19], Q = \rEIP [19]).
Adding EN signal on $auto$ff.cc:262:slice$13031 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [18], Q = \rEIP [18]).
Adding EN signal on $auto$ff.cc:262:slice$13030 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [17], Q = \rEIP [17]).
Adding EN signal on $auto$ff.cc:262:slice$13029 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [16], Q = \rEIP [16]).
Adding EN signal on $auto$ff.cc:262:slice$13028 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [15], Q = \rEIP [15]).
Adding EN signal on $auto$ff.cc:262:slice$13027 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [14], Q = \rEIP [14]).
Adding EN signal on $auto$ff.cc:262:slice$13026 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [13], Q = \rEIP [13]).
Adding EN signal on $auto$ff.cc:262:slice$13025 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [12], Q = \rEIP [12]).
Adding EN signal on $auto$ff.cc:262:slice$13024 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [11], Q = \rEIP [11]).
Adding EN signal on $auto$ff.cc:262:slice$13023 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [10], Q = \rEIP [10]).
Adding EN signal on $auto$ff.cc:262:slice$13022 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [9], Q = \rEIP [9]).
Adding EN signal on $auto$ff.cc:262:slice$13021 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [8], Q = \rEIP [8]).
Adding EN signal on $auto$ff.cc:262:slice$13020 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [7], Q = \rEIP [7]).
Adding EN signal on $auto$ff.cc:262:slice$13019 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [6], Q = \rEIP [6]).
Adding EN signal on $auto$ff.cc:262:slice$13018 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [5], Q = \rEIP [5]).
Adding EN signal on $auto$ff.cc:262:slice$13017 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [4], Q = \rEIP [4]).
Adding EN signal on $auto$ff.cc:262:slice$13016 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [3], Q = \rEIP [3]).
Adding EN signal on $auto$ff.cc:262:slice$13015 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [2], Q = \rEIP [2]).
Adding EN signal on $auto$ff.cc:262:slice$13014 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [1], Q = \rEIP [1]).
Adding EN signal on $auto$ff.cc:262:slice$13013 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8535 [0], Q = \rEIP [0]).
Adding EN signal on $auto$ff.cc:262:slice$13012 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [30], Q = \EBX [30]).
Adding EN signal on $auto$ff.cc:262:slice$13011 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [29], Q = \EBX [29]).
Adding EN signal on $auto$ff.cc:262:slice$13010 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [28], Q = \EBX [28]).
Adding EN signal on $auto$ff.cc:262:slice$13009 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [27], Q = \EBX [27]).
Adding EN signal on $auto$ff.cc:262:slice$13008 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [26], Q = \EBX [26]).
Adding EN signal on $auto$ff.cc:262:slice$13007 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [25], Q = \EBX [25]).
Adding EN signal on $auto$ff.cc:262:slice$13006 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [24], Q = \EBX [24]).
Adding EN signal on $auto$ff.cc:262:slice$13005 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [23], Q = \EBX [23]).
Adding EN signal on $auto$ff.cc:262:slice$13004 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [22], Q = \EBX [22]).
Adding EN signal on $auto$ff.cc:262:slice$13003 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [21], Q = \EBX [21]).
Adding EN signal on $auto$ff.cc:262:slice$13002 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [20], Q = \EBX [20]).
Adding EN signal on $auto$ff.cc:262:slice$13001 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [19], Q = \EBX [19]).
Adding EN signal on $auto$ff.cc:262:slice$13000 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [18], Q = \EBX [18]).
Adding EN signal on $auto$ff.cc:262:slice$12999 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [17], Q = \EBX [17]).
Adding EN signal on $auto$ff.cc:262:slice$12998 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [16], Q = \EBX [16]).
Adding EN signal on $auto$ff.cc:262:slice$12997 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [15], Q = \EBX [15]).
Adding EN signal on $auto$ff.cc:262:slice$12996 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [14], Q = \EBX [14]).
Adding EN signal on $auto$ff.cc:262:slice$12995 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [13], Q = \EBX [13]).
Adding EN signal on $auto$ff.cc:262:slice$12994 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [12], Q = \EBX [12]).
Adding EN signal on $auto$ff.cc:262:slice$12993 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [11], Q = \EBX [11]).
Adding EN signal on $auto$ff.cc:262:slice$12992 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [10], Q = \EBX [10]).
Adding EN signal on $auto$ff.cc:262:slice$12991 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [9], Q = \EBX [9]).
Adding EN signal on $auto$ff.cc:262:slice$12990 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [8], Q = \EBX [8]).
Adding EN signal on $auto$ff.cc:262:slice$12989 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [7], Q = \EBX [7]).
Adding EN signal on $auto$ff.cc:262:slice$12988 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [6], Q = \EBX [6]).
Adding EN signal on $auto$ff.cc:262:slice$12987 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [5], Q = \EBX [5]).
Adding EN signal on $auto$ff.cc:262:slice$12986 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [4], Q = \EBX [4]).
Adding EN signal on $auto$ff.cc:262:slice$12985 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [3], Q = \EBX [3]).
Adding EN signal on $auto$ff.cc:262:slice$12984 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [2], Q = \EBX [2]).
Adding EN signal on $auto$ff.cc:262:slice$12983 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [1], Q = \EBX [1]).
Adding EN signal on $auto$ff.cc:262:slice$12982 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11713 [0], Q = \EBX [0]).
Adding EN signal on $auto$ff.cc:262:slice$12981 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [30], Q = \EAX [30]).
Adding EN signal on $auto$ff.cc:262:slice$12980 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [29], Q = \EAX [29]).
Adding EN signal on $auto$ff.cc:262:slice$12979 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [28], Q = \EAX [28]).
Adding EN signal on $auto$ff.cc:262:slice$12978 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [27], Q = \EAX [27]).
Adding EN signal on $auto$ff.cc:262:slice$12977 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [26], Q = \EAX [26]).
Adding EN signal on $auto$ff.cc:262:slice$12976 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [25], Q = \EAX [25]).
Adding EN signal on $auto$ff.cc:262:slice$12975 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [24], Q = \EAX [24]).
Adding EN signal on $auto$ff.cc:262:slice$12974 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [23], Q = \EAX [23]).
Adding EN signal on $auto$ff.cc:262:slice$12973 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [22], Q = \EAX [22]).
Adding EN signal on $auto$ff.cc:262:slice$12972 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [21], Q = \EAX [21]).
Adding EN signal on $auto$ff.cc:262:slice$12971 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [20], Q = \EAX [20]).
Adding EN signal on $auto$ff.cc:262:slice$12970 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [19], Q = \EAX [19]).
Adding EN signal on $auto$ff.cc:262:slice$12969 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [18], Q = \EAX [18]).
Adding EN signal on $auto$ff.cc:262:slice$12968 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [17], Q = \EAX [17]).
Adding EN signal on $auto$ff.cc:262:slice$12967 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [16], Q = \EAX [16]).
Adding EN signal on $auto$ff.cc:262:slice$12966 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [15], Q = \EAX [15]).
Adding EN signal on $auto$ff.cc:262:slice$12965 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [14], Q = \EAX [14]).
Adding EN signal on $auto$ff.cc:262:slice$12964 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [13], Q = \EAX [13]).
Adding EN signal on $auto$ff.cc:262:slice$12963 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [12], Q = \EAX [12]).
Adding EN signal on $auto$ff.cc:262:slice$12962 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [11], Q = \EAX [11]).
Adding EN signal on $auto$ff.cc:262:slice$12961 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [10], Q = \EAX [10]).
Adding EN signal on $auto$ff.cc:262:slice$12960 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [9], Q = \EAX [9]).
Adding EN signal on $auto$ff.cc:262:slice$12959 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [8], Q = \EAX [8]).
Adding EN signal on $auto$ff.cc:262:slice$12958 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [7], Q = \EAX [7]).
Adding EN signal on $auto$ff.cc:262:slice$12957 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [6], Q = \EAX [6]).
Adding EN signal on $auto$ff.cc:262:slice$12956 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [5], Q = \EAX [5]).
Adding EN signal on $auto$ff.cc:262:slice$12955 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [4], Q = \EAX [4]).
Adding EN signal on $auto$ff.cc:262:slice$12954 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [3], Q = \EAX [3]).
Adding EN signal on $auto$ff.cc:262:slice$12953 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [2], Q = \EAX [2]).
Adding EN signal on $auto$ff.cc:262:slice$12952 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [1], Q = \EAX [1]).
Adding EN signal on $auto$ff.cc:262:slice$12951 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11244 [0], Q = \EAX [0]).
Adding EN signal on $auto$ff.cc:262:slice$12950 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10702 [3], Q = \P1.InstQueueWr_Addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$12949 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10702 [2], Q = \P1.InstQueueWr_Addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$12948 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10702 [1], Q = \P1.InstQueueWr_Addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$12947 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10702 [0], Q = \P1.InstQueueWr_Addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$12946 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8643, Q = \CodeFetch).
Adding EN signal on $auto$ff.cc:262:slice$12945 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [14], Q = \P1.uWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$12944 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [13], Q = \P1.uWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$12943 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [12], Q = \P1.uWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$12942 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [11], Q = \P1.uWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$12941 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [10], Q = \P1.uWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$12940 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [9], Q = \P1.uWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$12939 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [8], Q = \P1.uWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$12938 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [7], Q = \P1.uWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$12937 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [6], Q = \P1.uWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$12936 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [5], Q = \P1.uWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$12935 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [4], Q = \P1.uWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$12934 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [3], Q = \P1.uWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$12933 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [2], Q = \P1.uWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$12932 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [1], Q = \P1.uWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$12931 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$11958 [0], Q = \P1.uWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$12930 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [15], Q = \P1.lWord [15]).
Adding EN signal on $auto$ff.cc:262:slice$12929 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [14], Q = \P1.lWord [14]).
Adding EN signal on $auto$ff.cc:262:slice$12928 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [13], Q = \P1.lWord [13]).
Adding EN signal on $auto$ff.cc:262:slice$12927 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [12], Q = \P1.lWord [12]).
Adding EN signal on $auto$ff.cc:262:slice$12926 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [11], Q = \P1.lWord [11]).
Adding EN signal on $auto$ff.cc:262:slice$12925 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [10], Q = \P1.lWord [10]).
Adding EN signal on $auto$ff.cc:262:slice$12924 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [9], Q = \P1.lWord [9]).
Adding EN signal on $auto$ff.cc:262:slice$12923 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [8], Q = \P1.lWord [8]).
Adding EN signal on $auto$ff.cc:262:slice$12922 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [7], Q = \P1.lWord [7]).
Adding EN signal on $auto$ff.cc:262:slice$12921 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [6], Q = \P1.lWord [6]).
Adding EN signal on $auto$ff.cc:262:slice$12920 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [5], Q = \P1.lWord [5]).
Adding EN signal on $auto$ff.cc:262:slice$12919 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [4], Q = \P1.lWord [4]).
Adding EN signal on $auto$ff.cc:262:slice$12918 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [3], Q = \P1.lWord [3]).
Adding EN signal on $auto$ff.cc:262:slice$12917 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [2], Q = \P1.lWord [2]).
Adding EN signal on $auto$ff.cc:262:slice$12916 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [1], Q = \P1.lWord [1]).
Adding EN signal on $auto$ff.cc:262:slice$12915 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$12201 [0], Q = \P1.lWord [0]).
Adding EN signal on $auto$ff.cc:262:slice$12914 ($_DFF_PP0_) from module b15 (D = $auto$rtlil.cc:2466:Mux$1168, Q = \P1.Flush).
Adding EN signal on $auto$ff.cc:262:slice$12913 ($_DFF_PP0_) from module b15 (D = $auto$rtlil.cc:2466:Mux$1182, Q = \P1.More).
Adding EN signal on $auto$ff.cc:262:slice$12912 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [31], Q = \P1.PhyAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$12911 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [30], Q = \P1.PhyAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$12910 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [29], Q = \P1.PhyAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$12909 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [28], Q = \P1.PhyAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$12908 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [27], Q = \P1.PhyAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$12907 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [26], Q = \P1.PhyAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$12906 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [25], Q = \P1.PhyAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$12905 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [24], Q = \P1.PhyAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$12904 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [23], Q = \P1.PhyAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$12903 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [22], Q = \P1.PhyAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$12902 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [21], Q = \P1.PhyAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$12901 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [20], Q = \P1.PhyAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$12900 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [19], Q = \P1.PhyAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$12899 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [18], Q = \P1.PhyAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$12898 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [17], Q = \P1.PhyAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$12897 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [16], Q = \P1.PhyAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$12896 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [15], Q = \P1.PhyAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$12895 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [14], Q = \P1.PhyAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$12894 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [13], Q = \P1.PhyAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$12893 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [12], Q = \P1.PhyAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$12892 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [11], Q = \P1.PhyAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$12891 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [10], Q = \P1.PhyAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$12890 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [9], Q = \P1.PhyAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$12889 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [8], Q = \P1.PhyAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$12888 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [7], Q = \P1.PhyAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$12887 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [6], Q = \P1.PhyAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$12886 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [5], Q = \P1.PhyAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$12885 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [4], Q = \P1.PhyAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$12884 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [3], Q = \P1.PhyAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$12883 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [2], Q = \P1.PhyAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$12882 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [1], Q = \P1.PhyAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$12881 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7489 [0], Q = \P1.PhyAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$12880 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [31], Q = \P1.InstAddrPointer [31]).
Adding EN signal on $auto$ff.cc:262:slice$12879 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [30], Q = \P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$12878 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [29], Q = \P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$12877 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [28], Q = \P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$12876 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [27], Q = \P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$12875 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [26], Q = \P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$12874 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [25], Q = \P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$12873 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [24], Q = \P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$12872 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [23], Q = \P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$12871 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [22], Q = \P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$12870 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [21], Q = \P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$12869 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [20], Q = \P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$12868 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [19], Q = \P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$12867 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [18], Q = \P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$12866 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [17], Q = \P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$12865 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [16], Q = \P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$12864 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [15], Q = \P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$12863 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [14], Q = \P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$12862 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [13], Q = \P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$12861 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [12], Q = \P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$12860 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [11], Q = \P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$12859 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [10], Q = \P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$12858 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [9], Q = \P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$12857 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [8], Q = \P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$12856 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [7], Q = \P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$12855 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [6], Q = \P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$12854 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [5], Q = \P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$12853 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [4], Q = \P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$12852 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [3], Q = \P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$12851 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [2], Q = \P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$12850 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [1], Q = \P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$12849 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7973 [0], Q = \P1.InstAddrPointer [0]).
Adding EN signal on $auto$ff.cc:262:slice$12848 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10620 [7], Q = \P1.InstQueue[0] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12847 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10620 [6], Q = \P1.InstQueue[0] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12846 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10620 [5], Q = \P1.InstQueue[0] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12845 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10620 [4], Q = \P1.InstQueue[0] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12844 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10620 [3], Q = \P1.InstQueue[0] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12843 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10620 [2], Q = \P1.InstQueue[0] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12842 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10620 [1], Q = \P1.InstQueue[0] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12841 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10620 [0], Q = \P1.InstQueue[0] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12840 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10496 [7], Q = \P1.InstQueue[1] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12839 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10496 [6], Q = \P1.InstQueue[1] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12838 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10496 [5], Q = \P1.InstQueue[1] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12837 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10496 [4], Q = \P1.InstQueue[1] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12836 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10496 [3], Q = \P1.InstQueue[1] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12835 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10496 [2], Q = \P1.InstQueue[1] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12834 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10496 [1], Q = \P1.InstQueue[1] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12833 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10496 [0], Q = \P1.InstQueue[1] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12832 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10372 [7], Q = \P1.InstQueue[2] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12831 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10372 [6], Q = \P1.InstQueue[2] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12830 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10372 [5], Q = \P1.InstQueue[2] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12829 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10372 [4], Q = \P1.InstQueue[2] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12828 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10372 [3], Q = \P1.InstQueue[2] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12827 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10372 [2], Q = \P1.InstQueue[2] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12826 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10372 [1], Q = \P1.InstQueue[2] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12825 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10372 [0], Q = \P1.InstQueue[2] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12824 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10248 [7], Q = \P1.InstQueue[3] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12823 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10248 [6], Q = \P1.InstQueue[3] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12822 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10248 [5], Q = \P1.InstQueue[3] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12821 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10248 [4], Q = \P1.InstQueue[3] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12820 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10248 [3], Q = \P1.InstQueue[3] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12819 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10248 [2], Q = \P1.InstQueue[3] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12818 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10248 [1], Q = \P1.InstQueue[3] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12817 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10248 [0], Q = \P1.InstQueue[3] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12816 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10124 [7], Q = \P1.InstQueue[4] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12815 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10124 [6], Q = \P1.InstQueue[4] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12814 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10124 [5], Q = \P1.InstQueue[4] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12813 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10124 [4], Q = \P1.InstQueue[4] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12812 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10124 [3], Q = \P1.InstQueue[4] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12811 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10124 [2], Q = \P1.InstQueue[4] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12810 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10124 [1], Q = \P1.InstQueue[4] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12809 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10124 [0], Q = \P1.InstQueue[4] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12808 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10000 [7], Q = \P1.InstQueue[5] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12807 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10000 [6], Q = \P1.InstQueue[5] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12806 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10000 [5], Q = \P1.InstQueue[5] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12805 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10000 [4], Q = \P1.InstQueue[5] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12804 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10000 [3], Q = \P1.InstQueue[5] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12803 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10000 [2], Q = \P1.InstQueue[5] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12802 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10000 [1], Q = \P1.InstQueue[5] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12801 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$10000 [0], Q = \P1.InstQueue[5] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12800 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9876 [7], Q = \P1.InstQueue[6] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12799 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9876 [6], Q = \P1.InstQueue[6] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12798 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9876 [5], Q = \P1.InstQueue[6] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12797 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9876 [4], Q = \P1.InstQueue[6] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12796 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9876 [3], Q = \P1.InstQueue[6] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12795 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9876 [2], Q = \P1.InstQueue[6] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12794 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9876 [1], Q = \P1.InstQueue[6] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12793 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9876 [0], Q = \P1.InstQueue[6] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12792 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9752 [7], Q = \P1.InstQueue[7] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12791 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9752 [6], Q = \P1.InstQueue[7] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12790 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9752 [5], Q = \P1.InstQueue[7] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12789 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9752 [4], Q = \P1.InstQueue[7] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12788 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9752 [3], Q = \P1.InstQueue[7] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12787 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9752 [2], Q = \P1.InstQueue[7] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12786 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9752 [1], Q = \P1.InstQueue[7] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12785 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9752 [0], Q = \P1.InstQueue[7] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12784 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9628 [7], Q = \P1.InstQueue[8] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12783 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9628 [6], Q = \P1.InstQueue[8] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12782 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9628 [5], Q = \P1.InstQueue[8] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12781 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9628 [4], Q = \P1.InstQueue[8] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12780 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9628 [3], Q = \P1.InstQueue[8] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12779 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9628 [2], Q = \P1.InstQueue[8] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12778 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9628 [1], Q = \P1.InstQueue[8] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12777 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9628 [0], Q = \P1.InstQueue[8] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12776 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9504 [7], Q = \P1.InstQueue[9] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12775 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9504 [6], Q = \P1.InstQueue[9] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12774 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9504 [5], Q = \P1.InstQueue[9] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12773 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9504 [4], Q = \P1.InstQueue[9] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12772 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9504 [3], Q = \P1.InstQueue[9] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12771 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9504 [2], Q = \P1.InstQueue[9] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12770 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9504 [1], Q = \P1.InstQueue[9] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12769 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9504 [0], Q = \P1.InstQueue[9] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12768 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9380 [7], Q = \P1.InstQueue[10] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12767 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9380 [6], Q = \P1.InstQueue[10] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12766 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9380 [5], Q = \P1.InstQueue[10] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12765 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9380 [4], Q = \P1.InstQueue[10] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12764 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9380 [3], Q = \P1.InstQueue[10] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12763 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9380 [2], Q = \P1.InstQueue[10] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12762 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9380 [1], Q = \P1.InstQueue[10] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12761 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9380 [0], Q = \P1.InstQueue[10] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12760 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9256 [7], Q = \P1.InstQueue[11] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12759 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9256 [6], Q = \P1.InstQueue[11] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12758 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9256 [5], Q = \P1.InstQueue[11] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12757 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9256 [4], Q = \P1.InstQueue[11] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12756 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9256 [3], Q = \P1.InstQueue[11] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12755 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9256 [2], Q = \P1.InstQueue[11] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12754 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9256 [1], Q = \P1.InstQueue[11] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12753 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9256 [0], Q = \P1.InstQueue[11] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12752 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9132 [7], Q = \P1.InstQueue[12] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12751 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9132 [6], Q = \P1.InstQueue[12] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12750 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9132 [5], Q = \P1.InstQueue[12] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12749 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9132 [4], Q = \P1.InstQueue[12] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12748 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9132 [3], Q = \P1.InstQueue[12] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12747 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9132 [2], Q = \P1.InstQueue[12] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12746 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9132 [1], Q = \P1.InstQueue[12] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12745 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9132 [0], Q = \P1.InstQueue[12] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12744 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9008 [7], Q = \P1.InstQueue[13] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12743 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9008 [6], Q = \P1.InstQueue[13] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12742 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9008 [5], Q = \P1.InstQueue[13] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12741 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9008 [4], Q = \P1.InstQueue[13] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12740 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9008 [3], Q = \P1.InstQueue[13] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12739 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9008 [2], Q = \P1.InstQueue[13] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12738 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9008 [1], Q = \P1.InstQueue[13] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12737 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$9008 [0], Q = \P1.InstQueue[13] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12736 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8884 [7], Q = \P1.InstQueue[14] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12735 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8884 [6], Q = \P1.InstQueue[14] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12734 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8884 [5], Q = \P1.InstQueue[14] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12733 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8884 [4], Q = \P1.InstQueue[14] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12732 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8884 [3], Q = \P1.InstQueue[14] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12731 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8884 [2], Q = \P1.InstQueue[14] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12730 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8884 [1], Q = \P1.InstQueue[14] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12729 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8884 [0], Q = \P1.InstQueue[14] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12728 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8760 [7], Q = \P1.InstQueue[15] [7]).
Adding EN signal on $auto$ff.cc:262:slice$12727 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8760 [6], Q = \P1.InstQueue[15] [6]).
Adding EN signal on $auto$ff.cc:262:slice$12726 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8760 [5], Q = \P1.InstQueue[15] [5]).
Adding EN signal on $auto$ff.cc:262:slice$12725 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8760 [4], Q = \P1.InstQueue[15] [4]).
Adding EN signal on $auto$ff.cc:262:slice$12724 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8760 [3], Q = \P1.InstQueue[15] [3]).
Adding EN signal on $auto$ff.cc:262:slice$12723 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8760 [2], Q = \P1.InstQueue[15] [2]).
Adding EN signal on $auto$ff.cc:262:slice$12722 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8760 [1], Q = \P1.InstQueue[15] [1]).
Adding EN signal on $auto$ff.cc:262:slice$12721 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8760 [0], Q = \P1.InstQueue[15] [0]).
Adding EN signal on $auto$ff.cc:262:slice$12720 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8065 [3], Q = \P1.State2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$12719 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8065 [2], Q = \P1.State2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$12718 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8065 [1], Q = \P1.State2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$12717 ($_DFF_PP0_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$8065 [0], Q = \P1.State2 [0]).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 7 unused cells and 3156 unused wires.
<suppressed ~8 debug messages>

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~13114 debug messages>

3.27.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.27.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
<suppressed ~53025 debug messages>
Removed a total of 17675 cells.

yosys> opt_dff

3.27.20. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$2983 ($_DFF_PP0_) from module b15 (D = \ByteEnable [2], Q = \BE_n [2]).
Adding EN signal on $auto$ff.cc:262:slice$2981 ($_DFF_PP0_) from module b15 (D = \ByteEnable [0], Q = \BE_n [0]).
Adding EN signal on $auto$ff.cc:262:slice$2982 ($_DFF_PP0_) from module b15 (D = \ByteEnable [1], Q = \BE_n [1]).
Adding EN signal on $auto$ff.cc:262:slice$2984 ($_DFF_PP0_) from module b15 (D = \ByteEnable [3], Q = \BE_n [3]).
Adding EN signal on $auto$ff.cc:262:slice$3015 ($_DFF_PP0_) from module b15 (D = $verific$n398$9, Q = \W_R_n).
Adding EN signal on $auto$ff.cc:262:slice$3017 ($_DFF_PP0_) from module b15 (D = \MemoryFetch, Q = \M_IO_n).

yosys> opt_clean

3.27.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 12 unused cells and 15399 unused wires.
<suppressed ~13 debug messages>

yosys> opt_expr

3.27.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.27.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.27.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
<suppressed ~33 debug messages>
Removed a total of 11 cells.

yosys> opt_dff

3.27.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 0 unused cells and 11 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.27.30. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.31. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.32. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.27.33. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.34. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.35. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> opt_expr

3.27.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.27.37. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~2909 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
<suppressed ~45 debug messages>
Removed a total of 15 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 0 unused cells and 159 unused wires.
<suppressed ~1 debug messages>

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~20 debug messages>

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:278:simplemap_mux$2122 in front of them:
        $auto$simplemap.cc:278:simplemap_mux$6068
        $auto$simplemap.cc:278:simplemap_mux$5721

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$2460 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$2450
        $auto$simplemap.cc:312:simplemap_bmux$2447


yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$53555 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [1], Q = \P1.InstAddrPointer [1]).
Adding EN signal on $auto$ff.cc:262:slice$53333 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [2], Q = \P1.InstAddrPointer [2]).
Adding EN signal on $auto$ff.cc:262:slice$53111 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [3], Q = \P1.InstAddrPointer [3]).
Adding EN signal on $auto$ff.cc:262:slice$52889 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [4], Q = \P1.InstAddrPointer [4]).
Adding EN signal on $auto$ff.cc:262:slice$52667 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [5], Q = \P1.InstAddrPointer [5]).
Adding EN signal on $auto$ff.cc:262:slice$52445 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [6], Q = \P1.InstAddrPointer [6]).
Adding EN signal on $auto$ff.cc:262:slice$52223 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [7], Q = \P1.InstAddrPointer [7]).
Adding EN signal on $auto$ff.cc:262:slice$52001 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [8], Q = \P1.InstAddrPointer [8]).
Adding EN signal on $auto$ff.cc:262:slice$51779 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [9], Q = \P1.InstAddrPointer [9]).
Adding EN signal on $auto$ff.cc:262:slice$51557 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [10], Q = \P1.InstAddrPointer [10]).
Adding EN signal on $auto$ff.cc:262:slice$51335 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [11], Q = \P1.InstAddrPointer [11]).
Adding EN signal on $auto$ff.cc:262:slice$51113 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [12], Q = \P1.InstAddrPointer [12]).
Adding EN signal on $auto$ff.cc:262:slice$50891 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [13], Q = \P1.InstAddrPointer [13]).
Adding EN signal on $auto$ff.cc:262:slice$50669 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [14], Q = \P1.InstAddrPointer [14]).
Adding EN signal on $auto$ff.cc:262:slice$50447 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [15], Q = \P1.InstAddrPointer [15]).
Adding EN signal on $auto$ff.cc:262:slice$50225 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [16], Q = \P1.InstAddrPointer [16]).
Adding EN signal on $auto$ff.cc:262:slice$50003 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [17], Q = \P1.InstAddrPointer [17]).
Adding EN signal on $auto$ff.cc:262:slice$49781 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [18], Q = \P1.InstAddrPointer [18]).
Adding EN signal on $auto$ff.cc:262:slice$49559 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [19], Q = \P1.InstAddrPointer [19]).
Adding EN signal on $auto$ff.cc:262:slice$49337 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [20], Q = \P1.InstAddrPointer [20]).
Adding EN signal on $auto$ff.cc:262:slice$49115 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [21], Q = \P1.InstAddrPointer [21]).
Adding EN signal on $auto$ff.cc:262:slice$48893 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [22], Q = \P1.InstAddrPointer [22]).
Adding EN signal on $auto$ff.cc:262:slice$48671 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [23], Q = \P1.InstAddrPointer [23]).
Adding EN signal on $auto$ff.cc:262:slice$48449 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [24], Q = \P1.InstAddrPointer [24]).
Adding EN signal on $auto$ff.cc:262:slice$48227 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [25], Q = \P1.InstAddrPointer [25]).
Adding EN signal on $auto$ff.cc:262:slice$48005 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [26], Q = \P1.InstAddrPointer [26]).
Adding EN signal on $auto$ff.cc:262:slice$47783 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [27], Q = \P1.InstAddrPointer [27]).
Adding EN signal on $auto$ff.cc:262:slice$47561 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [28], Q = \P1.InstAddrPointer [28]).
Adding EN signal on $auto$ff.cc:262:slice$47339 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [29], Q = \P1.InstAddrPointer [29]).
Adding EN signal on $auto$ff.cc:262:slice$47117 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [30], Q = \P1.InstAddrPointer [30]).
Adding EN signal on $auto$ff.cc:262:slice$46895 ($_DFFE_PP0P_) from module b15 (D = $auto$simplemap.cc:309:simplemap_bmux$7908 [31], Q = \P1.InstAddrPointer [31]).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 0 unused cells and 64 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~157 debug messages>

3.30.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce -full

3.30.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.30.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
<suppressed ~639 debug messages>
Removed a total of 213 cells.

yosys> opt_share

3.30.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 0 unused cells and 216 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.30.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce -full

3.30.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.30.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_share

3.30.22. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> opt_expr -full

3.30.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.30.26. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
No more expansions possible.
<suppressed ~73 debug messages>

yosys> opt -sat

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.32.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  588 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$77492, arst=\RESET, srst={ }
  8 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$77432, arst=\RESET, srst={ }
  418 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$66616, arst=\RESET, srst={ }
  851 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$66142, arst=\RESET, srst={ }
  38 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$65330, arst=\RESET, srst={ }
  20 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$64578, arst=\RESET, srst={ }
  36 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$63826, arst=\RESET, srst={ }
  20 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$63074, arst=\RESET, srst={ }
  36 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$62322, arst=\RESET, srst={ }
  20 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$61570, arst=\RESET, srst={ }
  36 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$60818, arst=\RESET, srst={ }
  20 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$60066, arst=\RESET, srst={ }
  36 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$59314, arst=\RESET, srst={ }
  20 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$58562, arst=\RESET, srst={ }
  36 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$57810, arst=\RESET, srst={ }
  20 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$57058, arst=\RESET, srst={ }
  36 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$56306, arst=\RESET, srst={ }
  20 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$55554, arst=\RESET, srst={ }
  36 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$54802, arst=\RESET, srst={ }
  38 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$54050, arst=\RESET, srst={ }
  48 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$53951, arst=\RESET, srst={ }
  91 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$46884, arst=\RESET, srst={ }
  12 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$46761, arst=\RESET, srst={ }
  203 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$43444, arst=\RESET, srst={ }
  49 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$43329, arst=\RESET, srst={ }
  102 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$38994, arst=\RESET, srst={ }
  10 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$38851, arst=\RESET, srst={ }
  23 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$38739, arst=\RESET, srst={ }
  53 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$38464, arst=\RESET, srst={ }
  240 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$36866, arst=\RESET, srst={ }
  180 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$33989, arst=\RESET, srst={ }
  391 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$30856, arst=\RESET, srst={ }
  210 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$25484, arst=\RESET, srst={ }
  13 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$25317, arst=\RESET, srst={ }
  14 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$25194, arst=\RESET, srst={ }
  31 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$25071, arst=\RESET, srst={ }
  41 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$23764, arst=\RESET, srst={ }
  36 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$21287, arst=\RESET, srst={ }
  705 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$19424, arst=\RESET, srst={ }
  20 cells in clk=\CLOCK, en=$auto$opt_dff.cc:194:make_patterns_logic$1119, arst=\RESET, srst={ }
  67 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$19567, arst=\RESET, srst={ }
  4 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$19520, arst=\RESET, srst={ }
  4 cells in clk=\CLOCK, en=$auto$opt_dff.cc:194:make_patterns_logic$19486, arst=\RESET, srst={ }
  87 cells in clk=\CLOCK, en=$auto$opt_dff.cc:194:make_patterns_logic$19432, arst=\RESET, srst={ }
  246 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$19194, arst=\RESET, srst={ }

3.33.2. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$77492, asynchronously reset by \RESET
Extracted 588 gates and 708 wires to a netlist network with 120 inputs and 98 outputs.

3.33.2.1. Executing ABC.

3.33.3. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$77432, asynchronously reset by \RESET
Extracted 8 gates and 16 wires to a netlist network with 8 inputs and 7 outputs.

3.33.3.1. Executing ABC.

3.33.4. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$66616, asynchronously reset by \RESET
Extracted 328 gates and 617 wires to a netlist network with 287 inputs and 168 outputs.

3.33.4.1. Executing ABC.

3.33.5. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$66142, asynchronously reset by \RESET
Extracted 816 gates and 1455 wires to a netlist network with 637 inputs and 311 outputs.

3.33.5.1. Executing ABC.

3.33.6. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$65330, asynchronously reset by \RESET
Extracted 38 gates and 70 wires to a netlist network with 32 inputs and 27 outputs.

3.33.6.1. Executing ABC.

3.33.7. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$64578, asynchronously reset by \RESET
Extracted 20 gates and 41 wires to a netlist network with 21 inputs and 17 outputs.

3.33.7.1. Executing ABC.

3.33.8. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$63826, asynchronously reset by \RESET
Extracted 36 gates and 66 wires to a netlist network with 30 inputs and 25 outputs.

3.33.8.1. Executing ABC.

3.33.9. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$63074, asynchronously reset by \RESET
Extracted 20 gates and 41 wires to a netlist network with 21 inputs and 17 outputs.

3.33.9.1. Executing ABC.

3.33.10. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$62322, asynchronously reset by \RESET
Extracted 36 gates and 66 wires to a netlist network with 30 inputs and 25 outputs.

3.33.10.1. Executing ABC.

3.33.11. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$61570, asynchronously reset by \RESET
Extracted 20 gates and 41 wires to a netlist network with 21 inputs and 17 outputs.

3.33.11.1. Executing ABC.

3.33.12. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$60818, asynchronously reset by \RESET
Extracted 36 gates and 66 wires to a netlist network with 30 inputs and 25 outputs.

3.33.12.1. Executing ABC.

3.33.13. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$60066, asynchronously reset by \RESET
Extracted 20 gates and 41 wires to a netlist network with 21 inputs and 17 outputs.

3.33.13.1. Executing ABC.

3.33.14. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$59314, asynchronously reset by \RESET
Extracted 36 gates and 66 wires to a netlist network with 30 inputs and 25 outputs.

3.33.14.1. Executing ABC.

3.33.15. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$58562, asynchronously reset by \RESET
Extracted 20 gates and 41 wires to a netlist network with 21 inputs and 17 outputs.

3.33.15.1. Executing ABC.

3.33.16. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$57810, asynchronously reset by \RESET
Extracted 36 gates and 66 wires to a netlist network with 30 inputs and 25 outputs.

3.33.16.1. Executing ABC.

3.33.17. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$57058, asynchronously reset by \RESET
Extracted 20 gates and 41 wires to a netlist network with 21 inputs and 17 outputs.

3.33.17.1. Executing ABC.

3.33.18. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$56306, asynchronously reset by \RESET
Extracted 36 gates and 66 wires to a netlist network with 30 inputs and 25 outputs.

3.33.18.1. Executing ABC.

3.33.19. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$55554, asynchronously reset by \RESET
Extracted 20 gates and 41 wires to a netlist network with 21 inputs and 17 outputs.

3.33.19.1. Executing ABC.

3.33.20. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$54802, asynchronously reset by \RESET
Extracted 36 gates and 66 wires to a netlist network with 30 inputs and 25 outputs.

3.33.20.1. Executing ABC.

3.33.21. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$54050, asynchronously reset by \RESET
Extracted 38 gates and 67 wires to a netlist network with 28 inputs and 34 outputs.

3.33.21.1. Executing ABC.

3.33.22. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$53951, asynchronously reset by \RESET
Extracted 48 gates and 78 wires to a netlist network with 29 inputs and 12 outputs.

3.33.22.1. Executing ABC.

3.33.23. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$46884, asynchronously reset by \RESET
Extracted 91 gates and 157 wires to a netlist network with 66 inputs and 6 outputs.

3.33.23.1. Executing ABC.

3.33.24. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$46761, asynchronously reset by \RESET
Extracted 9 gates and 17 wires to a netlist network with 8 inputs and 5 outputs.

3.33.24.1. Executing ABC.

3.33.25. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$43444, asynchronously reset by \RESET
Extracted 203 gates and 243 wires to a netlist network with 40 inputs and 93 outputs.

3.33.25.1. Executing ABC.

3.33.26. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$79283$auto$opt_dff.cc:219:make_patterns_logic$43329, asynchronously reset by \RESET
Extracted 49 gates and 82 wires to a netlist network with 31 inputs and 21 outputs.

3.33.26.1. Executing ABC.

3.33.27. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$38994, asynchronously reset by \RESET
Extracted 102 gates and 164 wires to a netlist network with 61 inputs and 33 outputs.

3.33.27.1. Executing ABC.

3.33.28. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$38851, asynchronously reset by \RESET
Extracted 10 gates and 19 wires to a netlist network with 9 inputs and 3 outputs.

3.33.28.1. Executing ABC.

3.33.29. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$38739, asynchronously reset by \RESET
Extracted 23 gates and 36 wires to a netlist network with 12 inputs and 17 outputs.

3.33.29.1. Executing ABC.

3.33.30. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$38464, asynchronously reset by \RESET
Extracted 53 gates and 74 wires to a netlist network with 20 inputs and 37 outputs.

3.33.30.1. Executing ABC.

3.33.31. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$36866, asynchronously reset by \RESET
Extracted 240 gates and 366 wires to a netlist network with 125 inputs and 55 outputs.

3.33.31.1. Executing ABC.

3.33.32. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$33989, asynchronously reset by \RESET
Extracted 180 gates and 264 wires to a netlist network with 83 inputs and 48 outputs.

3.33.32.1. Executing ABC.

3.33.33. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$30856, asynchronously reset by \RESET
Extracted 391 gates and 573 wires to a netlist network with 181 inputs and 90 outputs.

3.33.33.1. Executing ABC.

3.33.34. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$25484, asynchronously reset by \RESET
Extracted 154 gates and 206 wires to a netlist network with 50 inputs and 78 outputs.

3.33.34.1. Executing ABC.

3.33.35. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$25317, asynchronously reset by \RESET
Extracted 13 gates and 22 wires to a netlist network with 9 inputs and 2 outputs.

3.33.35.1. Executing ABC.

3.33.36. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$25194, asynchronously reset by \RESET
Extracted 14 gates and 25 wires to a netlist network with 11 inputs and 5 outputs.

3.33.36.1. Executing ABC.

3.33.37. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$25071, asynchronously reset by \RESET
Extracted 31 gates and 49 wires to a netlist network with 17 inputs and 12 outputs.

3.33.37.1. Executing ABC.

3.33.38. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$23764, asynchronously reset by \RESET
Extracted 41 gates and 82 wires to a netlist network with 41 inputs and 37 outputs.

3.33.38.1. Executing ABC.

3.33.39. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$21287, asynchronously reset by \RESET
Extracted 36 gates and 65 wires to a netlist network with 29 inputs and 16 outputs.

3.33.39.1. Executing ABC.

3.33.40. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$19424, asynchronously reset by \RESET
Extracted 705 gates and 948 wires to a netlist network with 242 inputs and 299 outputs.

3.33.40.1. Executing ABC.

3.33.41. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1119, asynchronously reset by \RESET
Extracted 20 gates and 31 wires to a netlist network with 10 inputs and 6 outputs.

3.33.41.1. Executing ABC.

3.33.42. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$19567, asynchronously reset by \RESET
Extracted 63 gates and 128 wires to a netlist network with 65 inputs and 31 outputs.

3.33.42.1. Executing ABC.

3.33.43. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$19520, asynchronously reset by \RESET
Extracted 4 gates and 10 wires to a netlist network with 6 inputs and 3 outputs.

3.33.43.1. Executing ABC.

3.33.44. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:194:make_patterns_logic$19486, asynchronously reset by \RESET
Extracted 4 gates and 11 wires to a netlist network with 6 inputs and 3 outputs.

3.33.44.1. Executing ABC.

3.33.45. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:194:make_patterns_logic$19432, asynchronously reset by \RESET
Extracted 87 gates and 107 wires to a netlist network with 18 inputs and 21 outputs.

3.33.45.1. Executing ABC.

3.33.46. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$19194, asynchronously reset by \RESET
Extracted 246 gates and 352 wires to a netlist network with 106 inputs and 118 outputs.

3.33.46.1. Executing ABC.

yosys> abc -dff

3.34. Executing ABC pass (technology mapping using ABC).

3.34.1. Summary of detected clock domains:
  361 cells in clk=\CLOCK, en=$abc$79002$auto$opt_dff.cc:219:make_patterns_logic$66616, arst=\RESET, srst={ }
  79 cells in clk=\CLOCK, en=$abc$80623$auto$opt_dff.cc:219:make_patterns_logic$64578, arst=\RESET, srst={ }
  5 cells in clk=\CLOCK, en=$abc$84400$auto$opt_dff.cc:194:make_patterns_logic$19486, arst=\RESET, srst={ }
  35 cells in clk=\CLOCK, en=$abc$81837$auto$opt_dff.cc:219:make_patterns_logic$38739, arst=\RESET, srst={ }
  42 cells in clk=\CLOCK, en=$abc$81255$auto$opt_dff.cc:219:make_patterns_logic$53951, arst=\RESET, srst={ }
  5 cells in clk=\CLOCK, en=$abc$84394$auto$opt_dff.cc:219:make_patterns_logic$19520, arst=\RESET, srst={ }
  86 cells in clk=\CLOCK, en=$abc$80660$auto$opt_dff.cc:219:make_patterns_logic$63826, arst=\RESET, srst={ }
  19 cells in clk=\CLOCK, en=$abc$83015$auto$opt_dff.cc:219:make_patterns_logic$25194, arst=\RESET, srst={ }
  826 cells in clk=\CLOCK, en=$abc$83188$auto$opt_dff.cc:219:make_patterns_logic$19424, arst=\RESET, srst={ }
  21 cells in clk=\CLOCK, en=$abc$83030$auto$opt_dff.cc:219:make_patterns_logic$25071, arst=\RESET, srst={ }
  24 cells in clk=\CLOCK, en=$abc$83003$auto$opt_dff.cc:219:make_patterns_logic$25317, arst=\RESET, srst={ }
  71 cells in clk=\CLOCK, en=$abc$80787$auto$opt_dff.cc:219:make_patterns_logic$61570, arst=\RESET, srst={ }
  84 cells in clk=\CLOCK, en=$abc$80824$auto$opt_dff.cc:219:make_patterns_logic$60818, arst=\RESET, srst={ }
  69 cells in clk=\CLOCK, en=$abc$80869$auto$opt_dff.cc:219:make_patterns_logic$60066, arst=\RESET, srst={ }
  84 cells in clk=\CLOCK, en=$abc$80906$auto$opt_dff.cc:219:make_patterns_logic$59314, arst=\RESET, srst={ }
  65 cells in clk=\CLOCK, en=$abc$80951$auto$opt_dff.cc:219:make_patterns_logic$58562, arst=\RESET, srst={ }
  87 cells in clk=\CLOCK, en=$abc$80988$auto$opt_dff.cc:219:make_patterns_logic$57810, arst=\RESET, srst={ }
  64 cells in clk=\CLOCK, en=$abc$81033$auto$opt_dff.cc:219:make_patterns_logic$57058, arst=\RESET, srst={ }
  80 cells in clk=\CLOCK, en=$abc$81070$auto$opt_dff.cc:219:make_patterns_logic$56306, arst=\RESET, srst={ }
  15 cells in clk=\CLOCK, en=$abc$81384$auto$opt_dff.cc:219:make_patterns_logic$46761, arst=\RESET, srst={ }
  109 cells in clk=\CLOCK, en=$abc$81295$auto$opt_dff.cc:219:make_patterns_logic$46884, arst=\RESET, srst={ }
  74 cells in clk=\CLOCK, en=$abc$81152$auto$opt_dff.cc:219:make_patterns_logic$54802, arst=\RESET, srst={ }
  75 cells in clk=\CLOCK, en=$abc$81115$auto$opt_dff.cc:219:make_patterns_logic$55554, arst=\RESET, srst={ }
  11 cells in clk=\CLOCK, en=$abc$81826$auto$opt_dff.cc:219:make_patterns_logic$38851, arst=\RESET, srst={ }
  90 cells in clk=\CLOCK, en=$abc$81861$auto$opt_dff.cc:219:make_patterns_logic$38464, arst=\RESET, srst={ }
  231 cells in clk=\CLOCK, en=$abc$82211$auto$opt_dff.cc:219:make_patterns_logic$33989, arst=\RESET, srst={ }
  22 cells in clk=\CLOCK, en=$abc$84276$auto$opt_dff.cc:194:make_patterns_logic$1119, arst=\RESET, srst={ }
  126 cells in clk=\CLOCK, en=$abc$84406$auto$opt_dff.cc:194:make_patterns_logic$19432, arst=\RESET, srst={ }
  366 cells in clk=\CLOCK, en=$abc$82456$auto$opt_dff.cc:219:make_patterns_logic$30856, arst=\RESET, srst={ }
  48 cells in clk=\CLOCK, en=$abc$83129$auto$opt_dff.cc:219:make_patterns_logic$21287, arst=\RESET, srst={ }
  37 cells in clk=\CLOCK, en=$abc$79283$auto$opt_dff.cc:219:make_patterns_logic$43329, arst=\RESET, srst={ }
  431 cells in clk=\CLOCK, en=$abc$78331$auto$opt_dff.cc:219:make_patterns_logic$77492, arst=\RESET, srst={ }
  7 cells in clk=\CLOCK, en=$abc$78982$auto$opt_dff.cc:219:make_patterns_logic$77432, arst=\RESET, srst={ }
  70 cells in clk=\CLOCK, en=$abc$83056$auto$opt_dff.cc:219:make_patterns_logic$23764, arst=\RESET, srst={ }
  34 cells in clk=\CLOCK, en=$abc$84300$auto$opt_dff.cc:219:make_patterns_logic$19567, arst=\RESET, srst={ }
  95 cells in clk=\CLOCK, en=$abc$81197$auto$opt_dff.cc:219:make_patterns_logic$54050, arst=\RESET, srst={ }
  82 cells in clk=\CLOCK, en=$abc$80742$auto$opt_dff.cc:219:make_patterns_logic$62322, arst=\RESET, srst={ }
  67 cells in clk=\CLOCK, en=$abc$80705$auto$opt_dff.cc:219:make_patterns_logic$63074, arst=\RESET, srst={ }
  78 cells in clk=\CLOCK, en=$abc$80576$auto$opt_dff.cc:219:make_patterns_logic$65330, arst=\RESET, srst={ }
  493 cells in clk=\CLOCK, en=$abc$79283$auto$opt_dff.cc:219:make_patterns_logic$66142, arst=\RESET, srst={ }
  278 cells in clk=\CLOCK, en=$abc$81396$auto$opt_dff.cc:219:make_patterns_logic$43444, arst=\RESET, srst={ }
  304 cells in clk=\CLOCK, en=$abc$81918$auto$opt_dff.cc:219:make_patterns_logic$36866, arst=\RESET, srst={ }
  122 cells in clk=\CLOCK, en=$abc$81669$auto$opt_dff.cc:219:make_patterns_logic$38994, arst=\RESET, srst={ }
  496 cells in clk=\CLOCK, en=$abc$82812$auto$opt_dff.cc:219:make_patterns_logic$25484, arst=\RESET, srst={ }
  188 cells in clk=\CLOCK, en=$abc$84503$auto$opt_dff.cc:219:make_patterns_logic$19194, arst=\RESET, srst={ }

3.34.2. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$79002$auto$opt_dff.cc:219:make_patterns_logic$66616, asynchronously reset by \RESET
Extracted 271 gates and 551 wires to a netlist network with 280 inputs and 165 outputs.

3.34.2.1. Executing ABC.

3.34.3. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$80623$auto$opt_dff.cc:219:make_patterns_logic$64578, asynchronously reset by \RESET
Extracted 79 gates and 128 wires to a netlist network with 49 inputs and 20 outputs.

3.34.3.1. Executing ABC.

3.34.4. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$84400$auto$opt_dff.cc:194:make_patterns_logic$19486, asynchronously reset by \RESET
Extracted 5 gates and 11 wires to a netlist network with 6 inputs and 3 outputs.

3.34.4.1. Executing ABC.

3.34.5. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81837$auto$opt_dff.cc:219:make_patterns_logic$38739, asynchronously reset by \RESET
Extracted 35 gates and 58 wires to a netlist network with 23 inputs and 21 outputs.

3.34.5.1. Executing ABC.

3.34.6. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81255$auto$opt_dff.cc:219:make_patterns_logic$53951, asynchronously reset by \RESET
Extracted 42 gates and 73 wires to a netlist network with 31 inputs and 17 outputs.

3.34.6.1. Executing ABC.

3.34.7. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$84394$auto$opt_dff.cc:219:make_patterns_logic$19520, asynchronously reset by \RESET
Extracted 5 gates and 11 wires to a netlist network with 6 inputs and 4 outputs.

3.34.7.1. Executing ABC.

3.34.8. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$80660$auto$opt_dff.cc:219:make_patterns_logic$63826, asynchronously reset by \RESET
Extracted 86 gates and 138 wires to a netlist network with 52 inputs and 21 outputs.

3.34.8.1. Executing ABC.

3.34.9. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$83015$auto$opt_dff.cc:219:make_patterns_logic$25194, asynchronously reset by \RESET
Extracted 19 gates and 33 wires to a netlist network with 14 inputs and 10 outputs.

3.34.9.1. Executing ABC.

3.34.10. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$83188$auto$opt_dff.cc:219:make_patterns_logic$19424, asynchronously reset by \RESET
Extracted 826 gates and 1015 wires to a netlist network with 189 inputs and 317 outputs.

3.34.10.1. Executing ABC.

3.34.11. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$83030$auto$opt_dff.cc:219:make_patterns_logic$25071, asynchronously reset by \RESET
Extracted 21 gates and 38 wires to a netlist network with 17 inputs and 7 outputs.

3.34.11.1. Executing ABC.

3.34.12. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$83003$auto$opt_dff.cc:219:make_patterns_logic$25317, asynchronously reset by \RESET
Extracted 24 gates and 39 wires to a netlist network with 15 inputs and 13 outputs.

3.34.12.1. Executing ABC.

3.34.13. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$80787$auto$opt_dff.cc:219:make_patterns_logic$61570, asynchronously reset by \RESET
Extracted 71 gates and 116 wires to a netlist network with 45 inputs and 16 outputs.

3.34.13.1. Executing ABC.

3.34.14. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$80824$auto$opt_dff.cc:219:make_patterns_logic$60818, asynchronously reset by \RESET
Extracted 84 gates and 136 wires to a netlist network with 52 inputs and 20 outputs.

3.34.14.1. Executing ABC.

3.34.15. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$80869$auto$opt_dff.cc:219:make_patterns_logic$60066, asynchronously reset by \RESET
Extracted 69 gates and 113 wires to a netlist network with 44 inputs and 15 outputs.

3.34.15.1. Executing ABC.

3.34.16. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$80906$auto$opt_dff.cc:219:make_patterns_logic$59314, asynchronously reset by \RESET
Extracted 84 gates and 133 wires to a netlist network with 49 inputs and 20 outputs.

3.34.16.1. Executing ABC.

3.34.17. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$80951$auto$opt_dff.cc:219:make_patterns_logic$58562, asynchronously reset by \RESET
Extracted 65 gates and 113 wires to a netlist network with 48 inputs and 16 outputs.

3.34.17.1. Executing ABC.

3.34.18. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$80988$auto$opt_dff.cc:219:make_patterns_logic$57810, asynchronously reset by \RESET
Extracted 87 gates and 141 wires to a netlist network with 54 inputs and 21 outputs.

3.34.18.1. Executing ABC.

3.34.19. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81033$auto$opt_dff.cc:219:make_patterns_logic$57058, asynchronously reset by \RESET
Extracted 64 gates and 111 wires to a netlist network with 47 inputs and 15 outputs.

3.34.19.1. Executing ABC.

3.34.20. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81070$auto$opt_dff.cc:219:make_patterns_logic$56306, asynchronously reset by \RESET
Extracted 80 gates and 133 wires to a netlist network with 53 inputs and 20 outputs.

3.34.20.1. Executing ABC.

3.34.21. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81384$auto$opt_dff.cc:219:make_patterns_logic$46761, asynchronously reset by \RESET
Extracted 14 gates and 26 wires to a netlist network with 12 inputs and 6 outputs.

3.34.21.1. Executing ABC.

3.34.22. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81295$auto$opt_dff.cc:219:make_patterns_logic$46884, asynchronously reset by \RESET
Extracted 101 gates and 180 wires to a netlist network with 79 inputs and 11 outputs.

3.34.22.1. Executing ABC.

3.34.23. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81152$auto$opt_dff.cc:219:make_patterns_logic$54802, asynchronously reset by \RESET
Extracted 74 gates and 118 wires to a netlist network with 44 inputs and 15 outputs.

3.34.23.1. Executing ABC.

3.34.24. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81115$auto$opt_dff.cc:219:make_patterns_logic$55554, asynchronously reset by \RESET
Extracted 75 gates and 122 wires to a netlist network with 47 inputs and 19 outputs.

3.34.24.1. Executing ABC.

3.34.25. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81826$auto$opt_dff.cc:219:make_patterns_logic$38851, asynchronously reset by \RESET
Extracted 11 gates and 21 wires to a netlist network with 10 inputs and 5 outputs.

3.34.25.1. Executing ABC.

3.34.26. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81861$auto$opt_dff.cc:219:make_patterns_logic$38464, asynchronously reset by \RESET
Extracted 90 gates and 141 wires to a netlist network with 51 inputs and 45 outputs.

3.34.26.1. Executing ABC.

3.34.27. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$82211$auto$opt_dff.cc:219:make_patterns_logic$33989, asynchronously reset by \RESET
Extracted 231 gates and 314 wires to a netlist network with 83 inputs and 45 outputs.

3.34.27.1. Executing ABC.

3.34.28. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$84276$auto$opt_dff.cc:194:make_patterns_logic$1119, asynchronously reset by \RESET
Extracted 22 gates and 32 wires to a netlist network with 10 inputs and 7 outputs.

3.34.28.1. Executing ABC.

3.34.29. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$84406$auto$opt_dff.cc:194:make_patterns_logic$19432, asynchronously reset by \RESET
Extracted 126 gates and 197 wires to a netlist network with 71 inputs and 49 outputs.

3.34.29.1. Executing ABC.

3.34.30. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$82456$auto$opt_dff.cc:219:make_patterns_logic$30856, asynchronously reset by \RESET
Extracted 366 gates and 552 wires to a netlist network with 186 inputs and 93 outputs.

3.34.30.1. Executing ABC.

3.34.31. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$83129$auto$opt_dff.cc:219:make_patterns_logic$21287, asynchronously reset by \RESET
Extracted 48 gates and 87 wires to a netlist network with 39 inputs and 17 outputs.

3.34.31.1. Executing ABC.

3.34.32. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$79283$auto$opt_dff.cc:219:make_patterns_logic$43329, asynchronously reset by \RESET
Extracted 37 gates and 62 wires to a netlist network with 25 inputs and 11 outputs.

3.34.32.1. Executing ABC.

3.34.33. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$78331$auto$opt_dff.cc:219:make_patterns_logic$77492, asynchronously reset by \RESET
Extracted 431 gates and 549 wires to a netlist network with 118 inputs and 107 outputs.

3.34.33.1. Executing ABC.

3.34.34. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$78982$auto$opt_dff.cc:219:make_patterns_logic$77432, asynchronously reset by \RESET
Extracted 7 gates and 15 wires to a netlist network with 8 inputs and 7 outputs.

3.34.34.1. Executing ABC.

3.34.35. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$83056$auto$opt_dff.cc:219:make_patterns_logic$23764, asynchronously reset by \RESET
Extracted 70 gates and 116 wires to a netlist network with 46 inputs and 29 outputs.

3.34.35.1. Executing ABC.

3.34.36. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$84300$auto$opt_dff.cc:219:make_patterns_logic$19567, asynchronously reset by \RESET
Extracted 34 gates and 70 wires to a netlist network with 36 inputs and 31 outputs.

3.34.36.1. Executing ABC.

3.34.37. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81197$auto$opt_dff.cc:219:make_patterns_logic$54050, asynchronously reset by \RESET
Extracted 95 gates and 154 wires to a netlist network with 59 inputs and 36 outputs.

3.34.37.1. Executing ABC.

3.34.38. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$80742$auto$opt_dff.cc:219:make_patterns_logic$62322, asynchronously reset by \RESET
Extracted 82 gates and 130 wires to a netlist network with 48 inputs and 19 outputs.

3.34.38.1. Executing ABC.

3.34.39. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$80705$auto$opt_dff.cc:219:make_patterns_logic$63074, asynchronously reset by \RESET
Extracted 67 gates and 109 wires to a netlist network with 42 inputs and 14 outputs.

3.34.39.1. Executing ABC.

3.34.40. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$80576$auto$opt_dff.cc:219:make_patterns_logic$65330, asynchronously reset by \RESET
Extracted 78 gates and 129 wires to a netlist network with 51 inputs and 18 outputs.

3.34.40.1. Executing ABC.

3.34.41. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$79283$auto$opt_dff.cc:219:make_patterns_logic$66142, asynchronously reset by \RESET
Extracted 476 gates and 752 wires to a netlist network with 276 inputs and 203 outputs.

3.34.41.1. Executing ABC.

3.34.42. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81396$auto$opt_dff.cc:219:make_patterns_logic$43444, asynchronously reset by \RESET
Extracted 278 gates and 381 wires to a netlist network with 103 inputs and 93 outputs.

3.34.42.1. Executing ABC.

3.34.43. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81918$auto$opt_dff.cc:219:make_patterns_logic$36866, asynchronously reset by \RESET
Extracted 304 gates and 431 wires to a netlist network with 127 inputs and 65 outputs.

3.34.43.1. Executing ABC.

3.34.44. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$81669$auto$opt_dff.cc:219:make_patterns_logic$38994, asynchronously reset by \RESET
Extracted 122 gates and 200 wires to a netlist network with 78 inputs and 37 outputs.

3.34.44.1. Executing ABC.

3.34.45. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$82812$auto$opt_dff.cc:219:make_patterns_logic$25484, asynchronously reset by \RESET
Extracted 424 gates and 613 wires to a netlist network with 189 inputs and 97 outputs.

3.34.45.1. Executing ABC.

3.34.46. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$84503$auto$opt_dff.cc:219:make_patterns_logic$19194, asynchronously reset by \RESET
Extracted 188 gates and 299 wires to a netlist network with 111 inputs and 138 outputs.

3.34.46.1. Executing ABC.

yosys> abc -dff

3.35. Executing ABC pass (technology mapping using ABC).

3.35.1. Summary of detected clock domains:
  347 cells in clk=\CLOCK, en=$abc$84764$abc$79002$auto$opt_dff.cc:219:make_patterns_logic$66616, arst=\RESET, srst={ }
  4 cells in clk=\CLOCK, en=$abc$85114$abc$84400$auto$opt_dff.cc:194:make_patterns_logic$19486, arst=\RESET, srst={ }
  36 cells in clk=\CLOCK, en=$abc$85120$abc$81837$auto$opt_dff.cc:219:make_patterns_logic$38739, arst=\RESET, srst={ }
  42 cells in clk=\CLOCK, en=$abc$85159$abc$81255$auto$opt_dff.cc:219:make_patterns_logic$53951, arst=\RESET, srst={ }
  4 cells in clk=\CLOCK, en=$abc$85203$abc$84394$auto$opt_dff.cc:219:make_patterns_logic$19520, arst=\RESET, srst={ }
  15 cells in clk=\CLOCK, en=$abc$85295$abc$83015$auto$opt_dff.cc:219:make_patterns_logic$25194, arst=\RESET, srst={ }
  740 cells in clk=\CLOCK, en=$abc$85314$abc$83188$auto$opt_dff.cc:219:make_patterns_logic$19424, arst=\RESET, srst={ }
  28 cells in clk=\CLOCK, en=$abc$86232$abc$83030$auto$opt_dff.cc:219:make_patterns_logic$25071, arst=\RESET, srst={ }
  90 cells in clk=\CLOCK, en=$abc$85210$abc$80660$auto$opt_dff.cc:219:make_patterns_logic$63826, arst=\RESET, srst={ }
  20 cells in clk=\CLOCK, en=$abc$86254$abc$83003$auto$opt_dff.cc:219:make_patterns_logic$25317, arst=\RESET, srst={ }
  82 cells in clk=\CLOCK, en=$abc$86276$abc$80787$auto$opt_dff.cc:219:make_patterns_logic$61570, arst=\RESET, srst={ }
  95 cells in clk=\CLOCK, en=$abc$86350$abc$80824$auto$opt_dff.cc:219:make_patterns_logic$60818, arst=\RESET, srst={ }
  85 cells in clk=\CLOCK, en=$abc$86439$abc$80869$auto$opt_dff.cc:219:make_patterns_logic$60066, arst=\RESET, srst={ }
  81 cells in clk=\CLOCK, en=$abc$86512$abc$80906$auto$opt_dff.cc:219:make_patterns_logic$59314, arst=\RESET, srst={ }
  83 cells in clk=\CLOCK, en=$abc$86591$abc$80951$auto$opt_dff.cc:219:make_patterns_logic$58562, arst=\RESET, srst={ }
  81 cells in clk=\CLOCK, en=$abc$86665$abc$80988$auto$opt_dff.cc:219:make_patterns_logic$57810, arst=\RESET, srst={ }
  97 cells in clk=\CLOCK, en=$abc$86758$abc$81033$auto$opt_dff.cc:219:make_patterns_logic$57058, arst=\RESET, srst={ }
  86 cells in clk=\CLOCK, en=$abc$86830$abc$81070$auto$opt_dff.cc:219:make_patterns_logic$56306, arst=\RESET, srst={ }
  16 cells in clk=\CLOCK, en=$abc$86917$abc$81384$auto$opt_dff.cc:219:make_patterns_logic$46761, arst=\RESET, srst={ }
  106 cells in clk=\CLOCK, en=$abc$86933$abc$81295$auto$opt_dff.cc:219:make_patterns_logic$46884, arst=\RESET, srst={ }
  82 cells in clk=\CLOCK, en=$abc$87032$abc$81152$auto$opt_dff.cc:219:make_patterns_logic$54802, arst=\RESET, srst={ }
  11 cells in clk=\CLOCK, en=$abc$87183$abc$81826$auto$opt_dff.cc:219:make_patterns_logic$38851, arst=\RESET, srst={ }
  100 cells in clk=\CLOCK, en=$abc$87196$abc$81861$auto$opt_dff.cc:219:make_patterns_logic$38464, arst=\RESET, srst={ }
  22 cells in clk=\CLOCK, en=$abc$87533$abc$84276$auto$opt_dff.cc:194:make_patterns_logic$1119, arst=\RESET, srst={ }
  103 cells in clk=\CLOCK, en=$abc$87562$abc$84406$auto$opt_dff.cc:194:make_patterns_logic$19432, arst=\RESET, srst={ }
  85 cells in clk=\CLOCK, en=$abc$85036$abc$80623$auto$opt_dff.cc:219:make_patterns_logic$64578, arst=\RESET, srst={ }
  375 cells in clk=\CLOCK, en=$abc$87683$abc$82456$auto$opt_dff.cc:219:make_patterns_logic$30856, arst=\RESET, srst={ }
  63 cells in clk=\CLOCK, en=$abc$88046$abc$83129$auto$opt_dff.cc:219:make_patterns_logic$21287, arst=\RESET, srst={ }
  36 cells in clk=\CLOCK, en=$abc$88123$abc$79283$auto$opt_dff.cc:219:make_patterns_logic$43329, arst=\RESET, srst={ }
  8 cells in clk=\CLOCK, en=$abc$88604$abc$78982$auto$opt_dff.cc:219:make_patterns_logic$77432, arst=\RESET, srst={ }
  446 cells in clk=\CLOCK, en=$abc$88157$abc$78331$auto$opt_dff.cc:219:make_patterns_logic$77492, arst=\RESET, srst={ }
  101 cells in clk=\CLOCK, en=$abc$88624$abc$83056$auto$opt_dff.cc:219:make_patterns_logic$23764, arst=\RESET, srst={ }
  231 cells in clk=\CLOCK, en=$abc$87300$abc$82211$auto$opt_dff.cc:219:make_patterns_logic$33989, arst=\RESET, srst={ }
  99 cells in clk=\CLOCK, en=$abc$88831$abc$81197$auto$opt_dff.cc:219:make_patterns_logic$54050, arst=\RESET, srst={ }
  73 cells in clk=\CLOCK, en=$abc$88931$abc$80742$auto$opt_dff.cc:219:make_patterns_logic$62322, arst=\RESET, srst={ }
  81 cells in clk=\CLOCK, en=$abc$89009$abc$80705$auto$opt_dff.cc:219:make_patterns_logic$63074, arst=\RESET, srst={ }
  91 cells in clk=\CLOCK, en=$abc$87106$abc$81115$auto$opt_dff.cc:219:make_patterns_logic$55554, arst=\RESET, srst={ }
  463 cells in clk=\CLOCK, en=$abc$89167$abc$79283$auto$opt_dff.cc:219:make_patterns_logic$66142, arst=\RESET, srst={ }
  281 cells in clk=\CLOCK, en=$abc$89638$abc$81396$auto$opt_dff.cc:219:make_patterns_logic$43444, arst=\RESET, srst={ }
  290 cells in clk=\CLOCK, en=$abc$89946$abc$81918$auto$opt_dff.cc:219:make_patterns_logic$36866, arst=\RESET, srst={ }
  119 cells in clk=\CLOCK, en=$abc$90246$abc$81669$auto$opt_dff.cc:219:make_patterns_logic$38994, arst=\RESET, srst={ }
  98 cells in clk=\CLOCK, en=$abc$89081$abc$80576$auto$opt_dff.cc:219:make_patterns_logic$65330, arst=\RESET, srst={ }
  53 cells in clk=\CLOCK, en=$abc$88737$abc$84300$auto$opt_dff.cc:219:make_patterns_logic$19567, arst=\RESET, srst={ }
  520 cells in clk=\CLOCK, en=$abc$90401$abc$82812$auto$opt_dff.cc:219:make_patterns_logic$25484, arst=\RESET, srst={ }
  167 cells in clk=\CLOCK, en=$abc$90861$abc$84503$auto$opt_dff.cc:219:make_patterns_logic$19194, arst=\RESET, srst={ }

3.35.2. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$84764$abc$79002$auto$opt_dff.cc:219:make_patterns_logic$66616, asynchronously reset by \RESET
Extracted 257 gates and 537 wires to a netlist network with 280 inputs and 165 outputs.

3.35.2.1. Executing ABC.

3.35.3. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$85114$abc$84400$auto$opt_dff.cc:194:make_patterns_logic$19486, asynchronously reset by \RESET
Extracted 4 gates and 10 wires to a netlist network with 6 inputs and 3 outputs.

3.35.3.1. Executing ABC.

3.35.4. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$85120$abc$81837$auto$opt_dff.cc:219:make_patterns_logic$38739, asynchronously reset by \RESET
Extracted 36 gates and 57 wires to a netlist network with 21 inputs and 20 outputs.

3.35.4.1. Executing ABC.

3.35.5. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$85159$abc$81255$auto$opt_dff.cc:219:make_patterns_logic$53951, asynchronously reset by \RESET
Extracted 42 gates and 73 wires to a netlist network with 31 inputs and 17 outputs.

3.35.5.1. Executing ABC.

3.35.6. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$85203$abc$84394$auto$opt_dff.cc:219:make_patterns_logic$19520, asynchronously reset by \RESET
Extracted 4 gates and 10 wires to a netlist network with 6 inputs and 3 outputs.

3.35.6.1. Executing ABC.

3.35.7. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$85295$abc$83015$auto$opt_dff.cc:219:make_patterns_logic$25194, asynchronously reset by \RESET
Extracted 15 gates and 28 wires to a netlist network with 13 inputs and 7 outputs.

3.35.7.1. Executing ABC.

3.35.8. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$85314$abc$83188$auto$opt_dff.cc:219:make_patterns_logic$19424, asynchronously reset by \RESET
Extracted 740 gates and 931 wires to a netlist network with 191 inputs and 340 outputs.

3.35.8.1. Executing ABC.

3.35.9. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$86232$abc$83030$auto$opt_dff.cc:219:make_patterns_logic$25071, asynchronously reset by \RESET
Extracted 28 gates and 48 wires to a netlist network with 20 inputs and 9 outputs.

3.35.9.1. Executing ABC.

3.35.10. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$85210$abc$80660$auto$opt_dff.cc:219:make_patterns_logic$63826, asynchronously reset by \RESET
Extracted 90 gates and 145 wires to a netlist network with 55 inputs and 18 outputs.

3.35.10.1. Executing ABC.

3.35.11. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$86254$abc$83003$auto$opt_dff.cc:219:make_patterns_logic$25317, asynchronously reset by \RESET
Extracted 20 gates and 36 wires to a netlist network with 16 inputs and 14 outputs.

3.35.11.1. Executing ABC.

3.35.12. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$86276$abc$80787$auto$opt_dff.cc:219:make_patterns_logic$61570, asynchronously reset by \RESET
Extracted 82 gates and 136 wires to a netlist network with 54 inputs and 21 outputs.

3.35.12.1. Executing ABC.

3.35.13. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$86350$abc$80824$auto$opt_dff.cc:219:make_patterns_logic$60818, asynchronously reset by \RESET
Extracted 95 gates and 150 wires to a netlist network with 55 inputs and 18 outputs.

3.35.13.1. Executing ABC.

3.35.14. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$86439$abc$80869$auto$opt_dff.cc:219:make_patterns_logic$60066, asynchronously reset by \RESET
Extracted 85 gates and 141 wires to a netlist network with 56 inputs and 17 outputs.

3.35.14.1. Executing ABC.

3.35.15. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$86512$abc$80906$auto$opt_dff.cc:219:make_patterns_logic$59314, asynchronously reset by \RESET
Extracted 81 gates and 132 wires to a netlist network with 51 inputs and 19 outputs.

3.35.15.1. Executing ABC.

3.35.16. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$86591$abc$80951$auto$opt_dff.cc:219:make_patterns_logic$58562, asynchronously reset by \RESET
Extracted 83 gates and 136 wires to a netlist network with 53 inputs and 16 outputs.

3.35.16.1. Executing ABC.

3.35.17. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$86665$abc$80988$auto$opt_dff.cc:219:make_patterns_logic$57810, asynchronously reset by \RESET
Extracted 81 gates and 130 wires to a netlist network with 49 inputs and 16 outputs.

3.35.17.1. Executing ABC.

3.35.18. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$86758$abc$81033$auto$opt_dff.cc:219:make_patterns_logic$57058, asynchronously reset by \RESET
Extracted 97 gates and 156 wires to a netlist network with 59 inputs and 20 outputs.

3.35.18.1. Executing ABC.

3.35.19. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$86830$abc$81070$auto$opt_dff.cc:219:make_patterns_logic$56306, asynchronously reset by \RESET
Extracted 86 gates and 139 wires to a netlist network with 53 inputs and 16 outputs.

3.35.19.1. Executing ABC.

3.35.20. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$86917$abc$81384$auto$opt_dff.cc:219:make_patterns_logic$46761, asynchronously reset by \RESET
Extracted 15 gates and 27 wires to a netlist network with 12 inputs and 7 outputs.

3.35.20.1. Executing ABC.

3.35.21. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$86933$abc$81295$auto$opt_dff.cc:219:make_patterns_logic$46884, asynchronously reset by \RESET
Extracted 98 gates and 176 wires to a netlist network with 78 inputs and 11 outputs.

3.35.21.1. Executing ABC.

3.35.22. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$87032$abc$81152$auto$opt_dff.cc:219:make_patterns_logic$54802, asynchronously reset by \RESET
Extracted 82 gates and 136 wires to a netlist network with 54 inputs and 17 outputs.

3.35.22.1. Executing ABC.

3.35.23. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$87183$abc$81826$auto$opt_dff.cc:219:make_patterns_logic$38851, asynchronously reset by \RESET
Extracted 11 gates and 21 wires to a netlist network with 10 inputs and 4 outputs.

3.35.23.1. Executing ABC.

3.35.24. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$87196$abc$81861$auto$opt_dff.cc:219:make_patterns_logic$38464, asynchronously reset by \RESET
Extracted 100 gates and 149 wires to a netlist network with 49 inputs and 43 outputs.

3.35.24.1. Executing ABC.

3.35.25. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$87533$abc$84276$auto$opt_dff.cc:194:make_patterns_logic$1119, asynchronously reset by \RESET
Extracted 22 gates and 32 wires to a netlist network with 10 inputs and 6 outputs.

3.35.25.1. Executing ABC.

3.35.26. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$87562$abc$84406$auto$opt_dff.cc:194:make_patterns_logic$19432, asynchronously reset by \RESET
Extracted 103 gates and 150 wires to a netlist network with 47 inputs and 36 outputs.

3.35.26.1. Executing ABC.

3.35.27. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$85036$abc$80623$auto$opt_dff.cc:219:make_patterns_logic$64578, asynchronously reset by \RESET
Extracted 85 gates and 141 wires to a netlist network with 56 inputs and 20 outputs.

3.35.27.1. Executing ABC.

3.35.28. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$87683$abc$82456$auto$opt_dff.cc:219:make_patterns_logic$30856, asynchronously reset by \RESET
Extracted 375 gates and 575 wires to a netlist network with 200 inputs and 91 outputs.

3.35.28.1. Executing ABC.

3.35.29. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$88046$abc$83129$auto$opt_dff.cc:219:make_patterns_logic$21287, asynchronously reset by \RESET
Extracted 63 gates and 112 wires to a netlist network with 49 inputs and 20 outputs.

3.35.29.1. Executing ABC.

3.35.30. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$88123$abc$79283$auto$opt_dff.cc:219:make_patterns_logic$43329, asynchronously reset by \RESET
Extracted 36 gates and 61 wires to a netlist network with 25 inputs and 13 outputs.

3.35.30.1. Executing ABC.

3.35.31. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$88604$abc$78982$auto$opt_dff.cc:219:make_patterns_logic$77432, asynchronously reset by \RESET
Extracted 8 gates and 16 wires to a netlist network with 8 inputs and 7 outputs.

3.35.31.1. Executing ABC.

3.35.32. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$88157$abc$78331$auto$opt_dff.cc:219:make_patterns_logic$77492, asynchronously reset by \RESET
Extracted 446 gates and 570 wires to a netlist network with 124 inputs and 111 outputs.

3.35.32.1. Executing ABC.

3.35.33. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$88624$abc$83056$auto$opt_dff.cc:219:make_patterns_logic$23764, asynchronously reset by \RESET
Extracted 101 gates and 148 wires to a netlist network with 47 inputs and 22 outputs.

3.35.33.1. Executing ABC.

3.35.34. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$87300$abc$82211$auto$opt_dff.cc:219:make_patterns_logic$33989, asynchronously reset by \RESET
Extracted 231 gates and 308 wires to a netlist network with 77 inputs and 42 outputs.

3.35.34.1. Executing ABC.

3.35.35. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$88831$abc$81197$auto$opt_dff.cc:219:make_patterns_logic$54050, asynchronously reset by \RESET
Extracted 99 gates and 160 wires to a netlist network with 61 inputs and 34 outputs.

3.35.35.1. Executing ABC.

3.35.36. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$88931$abc$80742$auto$opt_dff.cc:219:make_patterns_logic$62322, asynchronously reset by \RESET
Extracted 73 gates and 118 wires to a netlist network with 45 inputs and 13 outputs.

3.35.36.1. Executing ABC.

3.35.37. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$89009$abc$80705$auto$opt_dff.cc:219:make_patterns_logic$63074, asynchronously reset by \RESET
Extracted 81 gates and 135 wires to a netlist network with 54 inputs and 18 outputs.

3.35.37.1. Executing ABC.

3.35.38. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$87106$abc$81115$auto$opt_dff.cc:219:make_patterns_logic$55554, asynchronously reset by \RESET
Extracted 91 gates and 150 wires to a netlist network with 59 inputs and 21 outputs.

3.35.38.1. Executing ABC.

3.35.39. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$89167$abc$79283$auto$opt_dff.cc:219:make_patterns_logic$66142, asynchronously reset by \RESET
Extracted 447 gates and 705 wires to a netlist network with 258 inputs and 176 outputs.

3.35.39.1. Executing ABC.

3.35.40. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$89638$abc$81396$auto$opt_dff.cc:219:make_patterns_logic$43444, asynchronously reset by \RESET
Extracted 281 gates and 385 wires to a netlist network with 104 inputs and 93 outputs.

3.35.40.1. Executing ABC.

3.35.41. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$89946$abc$81918$auto$opt_dff.cc:219:make_patterns_logic$36866, asynchronously reset by \RESET
Extracted 290 gates and 413 wires to a netlist network with 123 inputs and 64 outputs.

3.35.41.1. Executing ABC.

3.35.42. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$90246$abc$81669$auto$opt_dff.cc:219:make_patterns_logic$38994, asynchronously reset by \RESET
Extracted 119 gates and 180 wires to a netlist network with 61 inputs and 35 outputs.

3.35.42.1. Executing ABC.

3.35.43. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$89081$abc$80576$auto$opt_dff.cc:219:make_patterns_logic$65330, asynchronously reset by \RESET
Extracted 98 gates and 156 wires to a netlist network with 58 inputs and 22 outputs.

3.35.43.1. Executing ABC.

3.35.44. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$88737$abc$84300$auto$opt_dff.cc:219:make_patterns_logic$19567, asynchronously reset by \RESET
Extracted 49 gates and 99 wires to a netlist network with 50 inputs and 32 outputs.

3.35.44.1. Executing ABC.

3.35.45. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$90401$abc$82812$auto$opt_dff.cc:219:make_patterns_logic$25484, asynchronously reset by \RESET
Extracted 451 gates and 639 wires to a netlist network with 188 inputs and 120 outputs.

3.35.45.1. Executing ABC.

3.35.46. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$90861$abc$84503$auto$opt_dff.cc:219:make_patterns_logic$19194, asynchronously reset by \RESET
Extracted 167 gates and 276 wires to a netlist network with 109 inputs and 120 outputs.

3.35.46.1. Executing ABC.

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  345 cells in clk=\CLOCK, en=$abc$91048$abc$84764$abc$79002$auto$opt_dff.cc:219:make_patterns_logic$66616, arst=\RESET, srst={ }
  3 cells in clk=\CLOCK, en=$abc$91311$abc$85114$abc$84400$auto$opt_dff.cc:194:make_patterns_logic$19486, arst=\RESET, srst={ }
  39 cells in clk=\CLOCK, en=$abc$91317$abc$85120$abc$81837$auto$opt_dff.cc:219:make_patterns_logic$38739, arst=\RESET, srst={ }
  43 cells in clk=\CLOCK, en=$abc$91354$abc$85159$abc$81255$auto$opt_dff.cc:219:make_patterns_logic$53951, arst=\RESET, srst={ }
  4 cells in clk=\CLOCK, en=$abc$91398$abc$85203$abc$84394$auto$opt_dff.cc:219:make_patterns_logic$19520, arst=\RESET, srst={ }
  21 cells in clk=\CLOCK, en=$abc$91404$abc$85295$abc$83015$auto$opt_dff.cc:219:make_patterns_logic$25194, arst=\RESET, srst={ }
  27 cells in clk=\CLOCK, en=$abc$92165$abc$86232$abc$83030$auto$opt_dff.cc:219:make_patterns_logic$25071, arst=\RESET, srst={ }
  88 cells in clk=\CLOCK, en=$abc$92194$abc$85210$abc$80660$auto$opt_dff.cc:219:make_patterns_logic$63826, arst=\RESET, srst={ }
  19 cells in clk=\CLOCK, en=$abc$92284$abc$86254$abc$83003$auto$opt_dff.cc:219:make_patterns_logic$25317, arst=\RESET, srst={ }
  77 cells in clk=\CLOCK, en=$abc$92305$abc$86276$abc$80787$auto$opt_dff.cc:219:make_patterns_logic$61570, arst=\RESET, srst={ }
  98 cells in clk=\CLOCK, en=$abc$92389$abc$86350$abc$80824$auto$opt_dff.cc:219:make_patterns_logic$60818, arst=\RESET, srst={ }
  82 cells in clk=\CLOCK, en=$abc$92484$abc$86439$abc$80869$auto$opt_dff.cc:219:make_patterns_logic$60066, arst=\RESET, srst={ }
  82 cells in clk=\CLOCK, en=$abc$92575$abc$86512$abc$80906$auto$opt_dff.cc:219:make_patterns_logic$59314, arst=\RESET, srst={ }
  87 cells in clk=\CLOCK, en=$abc$92659$abc$86591$abc$80951$auto$opt_dff.cc:219:make_patterns_logic$58562, arst=\RESET, srst={ }
  96 cells in clk=\CLOCK, en=$abc$92746$abc$86665$abc$80988$auto$opt_dff.cc:219:make_patterns_logic$57810, arst=\RESET, srst={ }
  90 cells in clk=\CLOCK, en=$abc$92837$abc$86758$abc$81033$auto$opt_dff.cc:219:make_patterns_logic$57058, arst=\RESET, srst={ }
  16 cells in clk=\CLOCK, en=$abc$93028$abc$86917$abc$81384$auto$opt_dff.cc:219:make_patterns_logic$46761, arst=\RESET, srst={ }
  105 cells in clk=\CLOCK, en=$abc$93045$abc$86933$abc$81295$auto$opt_dff.cc:219:make_patterns_logic$46884, arst=\RESET, srst={ }
  92 cells in clk=\CLOCK, en=$abc$93143$abc$87032$abc$81152$auto$opt_dff.cc:219:make_patterns_logic$54802, arst=\RESET, srst={ }
  11 cells in clk=\CLOCK, en=$abc$93230$abc$87183$abc$81826$auto$opt_dff.cc:219:make_patterns_logic$38851, arst=\RESET, srst={ }
  105 cells in clk=\CLOCK, en=$abc$93242$abc$87196$abc$81861$auto$opt_dff.cc:219:make_patterns_logic$38464, arst=\RESET, srst={ }
  22 cells in clk=\CLOCK, en=$abc$93351$abc$87533$abc$84276$auto$opt_dff.cc:194:make_patterns_logic$1119, arst=\RESET, srst={ }
  119 cells in clk=\CLOCK, en=$abc$93379$abc$87562$abc$84406$auto$opt_dff.cc:194:make_patterns_logic$19432, arst=\RESET, srst={ }
  91 cells in clk=\CLOCK, en=$abc$93487$abc$85036$abc$80623$auto$opt_dff.cc:219:make_patterns_logic$64578, arst=\RESET, srst={ }
  64 cells in clk=\CLOCK, en=$abc$93950$abc$88046$abc$83129$auto$opt_dff.cc:219:make_patterns_logic$21287, arst=\RESET, srst={ }
  35 cells in clk=\CLOCK, en=$abc$94035$abc$88123$abc$79283$auto$opt_dff.cc:219:make_patterns_logic$43329, arst=\RESET, srst={ }
  7 cells in clk=\CLOCK, en=$abc$94071$abc$88604$abc$78982$auto$opt_dff.cc:219:make_patterns_logic$77432, arst=\RESET, srst={ }
  227 cells in clk=\CLOCK, en=$abc$94653$abc$87300$abc$82211$auto$opt_dff.cc:219:make_patterns_logic$33989, arst=\RESET, srst={ }
  95 cells in clk=\CLOCK, en=$abc$94883$abc$88831$abc$81197$auto$opt_dff.cc:219:make_patterns_logic$54050, arst=\RESET, srst={ }
  80 cells in clk=\CLOCK, en=$abc$94987$abc$88931$abc$80742$auto$opt_dff.cc:219:make_patterns_logic$62322, arst=\RESET, srst={ }
  87 cells in clk=\CLOCK, en=$abc$95067$abc$89009$abc$80705$auto$opt_dff.cc:219:make_patterns_logic$63074, arst=\RESET, srst={ }
  94 cells in clk=\CLOCK, en=$abc$95155$abc$87106$abc$81115$auto$opt_dff.cc:219:make_patterns_logic$55554, arst=\RESET, srst={ }
  477 cells in clk=\CLOCK, en=$abc$95250$abc$89167$abc$79283$auto$opt_dff.cc:219:make_patterns_logic$66142, arst=\RESET, srst={ }
  86 cells in clk=\CLOCK, en=$abc$92937$abc$86830$abc$81070$auto$opt_dff.cc:219:make_patterns_logic$56306, arst=\RESET, srst={ }
  705 cells in clk=\CLOCK, en=$abc$91420$abc$85314$abc$83188$auto$opt_dff.cc:219:make_patterns_logic$19424, arst=\RESET, srst={ }
  294 cells in clk=\CLOCK, en=$abc$96021$abc$89946$abc$81918$auto$opt_dff.cc:219:make_patterns_logic$36866, arst=\RESET, srst={ }
  95 cells in clk=\CLOCK, en=$abc$96444$abc$89081$abc$80576$auto$opt_dff.cc:219:make_patterns_logic$65330, arst=\RESET, srst={ }
  443 cells in clk=\CLOCK, en=$abc$94091$abc$88157$abc$78331$auto$opt_dff.cc:219:make_patterns_logic$77492, arst=\RESET, srst={ }
  33 cells in clk=\CLOCK, en=$abc$96550$abc$88737$abc$84300$auto$opt_dff.cc:219:make_patterns_logic$19567, arst=\RESET, srst={ }
  122 cells in clk=\CLOCK, en=$abc$96319$abc$90246$abc$81669$auto$opt_dff.cc:219:make_patterns_logic$38994, arst=\RESET, srst={ }
  282 cells in clk=\CLOCK, en=$abc$95711$abc$89638$abc$81396$auto$opt_dff.cc:219:make_patterns_logic$43444, arst=\RESET, srst={ }
  375 cells in clk=\CLOCK, en=$abc$93575$abc$87683$abc$82456$auto$opt_dff.cc:219:make_patterns_logic$30856, arst=\RESET, srst={ }
  87 cells in clk=\CLOCK, en=$abc$94540$abc$88624$abc$83056$auto$opt_dff.cc:219:make_patterns_logic$23764, arst=\RESET, srst={ }
  527 cells in clk=\CLOCK, en=$abc$96645$abc$90401$abc$82812$auto$opt_dff.cc:219:make_patterns_logic$25484, arst=\RESET, srst={ }
  164 cells in clk=\CLOCK, en=$abc$97134$abc$90861$abc$84503$auto$opt_dff.cc:219:make_patterns_logic$19194, arst=\RESET, srst={ }

3.36.2. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$91048$abc$84764$abc$79002$auto$opt_dff.cc:219:make_patterns_logic$66616, asynchronously reset by \RESET
Extracted 256 gates and 529 wires to a netlist network with 273 inputs and 160 outputs.

3.36.2.1. Executing ABC.

3.36.3. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$91311$abc$85114$abc$84400$auto$opt_dff.cc:194:make_patterns_logic$19486, asynchronously reset by \RESET
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.36.3.1. Executing ABC.

3.36.4. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$91317$abc$85120$abc$81837$auto$opt_dff.cc:219:make_patterns_logic$38739, asynchronously reset by \RESET
Extracted 39 gates and 60 wires to a netlist network with 21 inputs and 23 outputs.

3.36.4.1. Executing ABC.

3.36.5. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$91354$abc$85159$abc$81255$auto$opt_dff.cc:219:make_patterns_logic$53951, asynchronously reset by \RESET
Extracted 43 gates and 75 wires to a netlist network with 32 inputs and 17 outputs.

3.36.5.1. Executing ABC.

3.36.6. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$91398$abc$85203$abc$84394$auto$opt_dff.cc:219:make_patterns_logic$19520, asynchronously reset by \RESET
Extracted 4 gates and 10 wires to a netlist network with 6 inputs and 4 outputs.

3.36.6.1. Executing ABC.

3.36.7. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$91404$abc$85295$abc$83015$auto$opt_dff.cc:219:make_patterns_logic$25194, asynchronously reset by \RESET
Extracted 21 gates and 38 wires to a netlist network with 17 inputs and 12 outputs.

3.36.7.1. Executing ABC.

3.36.8. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$92165$abc$86232$abc$83030$auto$opt_dff.cc:219:make_patterns_logic$25071, asynchronously reset by \RESET
Extracted 27 gates and 46 wires to a netlist network with 19 inputs and 9 outputs.

3.36.8.1. Executing ABC.

3.36.9. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$92194$abc$85210$abc$80660$auto$opt_dff.cc:219:make_patterns_logic$63826, asynchronously reset by \RESET
Extracted 88 gates and 142 wires to a netlist network with 54 inputs and 19 outputs.

3.36.9.1. Executing ABC.

3.36.10. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$92284$abc$86254$abc$83003$auto$opt_dff.cc:219:make_patterns_logic$25317, asynchronously reset by \RESET
Extracted 19 gates and 35 wires to a netlist network with 16 inputs and 13 outputs.

3.36.10.1. Executing ABC.

3.36.11. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$92305$abc$86276$abc$80787$auto$opt_dff.cc:219:make_patterns_logic$61570, asynchronously reset by \RESET
Extracted 77 gates and 129 wires to a netlist network with 52 inputs and 19 outputs.

3.36.11.1. Executing ABC.

3.36.12. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$92389$abc$86350$abc$80824$auto$opt_dff.cc:219:make_patterns_logic$60818, asynchronously reset by \RESET
Extracted 98 gates and 154 wires to a netlist network with 56 inputs and 21 outputs.

3.36.12.1. Executing ABC.

3.36.13. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$92484$abc$86439$abc$80869$auto$opt_dff.cc:219:make_patterns_logic$60066, asynchronously reset by \RESET
Extracted 82 gates and 137 wires to a netlist network with 55 inputs and 16 outputs.

3.36.13.1. Executing ABC.

3.36.14. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$92575$abc$86512$abc$80906$auto$opt_dff.cc:219:make_patterns_logic$59314, asynchronously reset by \RESET
Extracted 82 gates and 134 wires to a netlist network with 52 inputs and 20 outputs.

3.36.14.1. Executing ABC.

3.36.15. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$92659$abc$86591$abc$80951$auto$opt_dff.cc:219:make_patterns_logic$58562, asynchronously reset by \RESET
Extracted 87 gates and 143 wires to a netlist network with 56 inputs and 20 outputs.

3.36.15.1. Executing ABC.

3.36.16. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$92746$abc$86665$abc$80988$auto$opt_dff.cc:219:make_patterns_logic$57810, asynchronously reset by \RESET
Extracted 96 gates and 151 wires to a netlist network with 55 inputs and 22 outputs.

3.36.16.1. Executing ABC.

3.36.17. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$92837$abc$86758$abc$81033$auto$opt_dff.cc:219:make_patterns_logic$57058, asynchronously reset by \RESET
Extracted 90 gates and 141 wires to a netlist network with 51 inputs and 16 outputs.

3.36.17.1. Executing ABC.

3.36.18. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$93028$abc$86917$abc$81384$auto$opt_dff.cc:219:make_patterns_logic$46761, asynchronously reset by \RESET
Extracted 15 gates and 27 wires to a netlist network with 12 inputs and 7 outputs.

3.36.18.1. Executing ABC.

3.36.19. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$93045$abc$86933$abc$81295$auto$opt_dff.cc:219:make_patterns_logic$46884, asynchronously reset by \RESET
Extracted 97 gates and 174 wires to a netlist network with 77 inputs and 12 outputs.

3.36.19.1. Executing ABC.

3.36.20. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$93143$abc$87032$abc$81152$auto$opt_dff.cc:219:make_patterns_logic$54802, asynchronously reset by \RESET
Extracted 92 gates and 152 wires to a netlist network with 60 inputs and 23 outputs.

3.36.20.1. Executing ABC.

3.36.21. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$93230$abc$87183$abc$81826$auto$opt_dff.cc:219:make_patterns_logic$38851, asynchronously reset by \RESET
Extracted 11 gates and 21 wires to a netlist network with 10 inputs and 4 outputs.

3.36.21.1. Executing ABC.

3.36.22. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$93242$abc$87196$abc$81861$auto$opt_dff.cc:219:make_patterns_logic$38464, asynchronously reset by \RESET
Extracted 105 gates and 155 wires to a netlist network with 50 inputs and 42 outputs.

3.36.22.1. Executing ABC.

3.36.23. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$93351$abc$87533$abc$84276$auto$opt_dff.cc:194:make_patterns_logic$1119, asynchronously reset by \RESET
Extracted 22 gates and 32 wires to a netlist network with 10 inputs and 6 outputs.

3.36.23.1. Executing ABC.

3.36.24. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$93379$abc$87562$abc$84406$auto$opt_dff.cc:194:make_patterns_logic$19432, asynchronously reset by \RESET
Extracted 119 gates and 193 wires to a netlist network with 74 inputs and 46 outputs.

3.36.24.1. Executing ABC.

3.36.25. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$93487$abc$85036$abc$80623$auto$opt_dff.cc:219:make_patterns_logic$64578, asynchronously reset by \RESET
Extracted 91 gates and 151 wires to a netlist network with 60 inputs and 24 outputs.

3.36.25.1. Executing ABC.

3.36.26. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$93950$abc$88046$abc$83129$auto$opt_dff.cc:219:make_patterns_logic$21287, asynchronously reset by \RESET
Extracted 64 gates and 112 wires to a netlist network with 48 inputs and 19 outputs.

3.36.26.1. Executing ABC.

3.36.27. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$94035$abc$88123$abc$79283$auto$opt_dff.cc:219:make_patterns_logic$43329, asynchronously reset by \RESET
Extracted 35 gates and 60 wires to a netlist network with 25 inputs and 12 outputs.

3.36.27.1. Executing ABC.

3.36.28. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$94071$abc$88604$abc$78982$auto$opt_dff.cc:219:make_patterns_logic$77432, asynchronously reset by \RESET
Extracted 7 gates and 15 wires to a netlist network with 8 inputs and 7 outputs.

3.36.28.1. Executing ABC.

3.36.29. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$94653$abc$87300$abc$82211$auto$opt_dff.cc:219:make_patterns_logic$33989, asynchronously reset by \RESET
Extracted 227 gates and 303 wires to a netlist network with 76 inputs and 37 outputs.

3.36.29.1. Executing ABC.

3.36.30. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$94883$abc$88831$abc$81197$auto$opt_dff.cc:219:make_patterns_logic$54050, asynchronously reset by \RESET
Extracted 95 gates and 155 wires to a netlist network with 60 inputs and 34 outputs.

3.36.30.1. Executing ABC.

3.36.31. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$94987$abc$88931$abc$80742$auto$opt_dff.cc:219:make_patterns_logic$62322, asynchronously reset by \RESET
Extracted 80 gates and 129 wires to a netlist network with 49 inputs and 17 outputs.

3.36.31.1. Executing ABC.

3.36.32. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$95067$abc$89009$abc$80705$auto$opt_dff.cc:219:make_patterns_logic$63074, asynchronously reset by \RESET
Extracted 87 gates and 144 wires to a netlist network with 57 inputs and 21 outputs.

3.36.32.1. Executing ABC.

3.36.33. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$95155$abc$87106$abc$81115$auto$opt_dff.cc:219:make_patterns_logic$55554, asynchronously reset by \RESET
Extracted 94 gates and 156 wires to a netlist network with 62 inputs and 23 outputs.

3.36.33.1. Executing ABC.

3.36.34. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$95250$abc$89167$abc$79283$auto$opt_dff.cc:219:make_patterns_logic$66142, asynchronously reset by \RESET
Extracted 460 gates and 722 wires to a netlist network with 262 inputs and 184 outputs.

3.36.34.1. Executing ABC.

3.36.35. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$92937$abc$86830$abc$81070$auto$opt_dff.cc:219:make_patterns_logic$56306, asynchronously reset by \RESET
Extracted 86 gates and 139 wires to a netlist network with 53 inputs and 17 outputs.

3.36.35.1. Executing ABC.

3.36.36. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$91420$abc$85314$abc$83188$auto$opt_dff.cc:219:make_patterns_logic$19424, asynchronously reset by \RESET
Extracted 705 gates and 908 wires to a netlist network with 203 inputs and 316 outputs.

3.36.36.1. Executing ABC.

3.36.37. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$96021$abc$89946$abc$81918$auto$opt_dff.cc:219:make_patterns_logic$36866, asynchronously reset by \RESET
Extracted 294 gates and 419 wires to a netlist network with 125 inputs and 67 outputs.

3.36.37.1. Executing ABC.

3.36.38. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$96444$abc$89081$abc$80576$auto$opt_dff.cc:219:make_patterns_logic$65330, asynchronously reset by \RESET
Extracted 95 gates and 147 wires to a netlist network with 52 inputs and 19 outputs.

3.36.38.1. Executing ABC.

3.36.39. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$94091$abc$88157$abc$78331$auto$opt_dff.cc:219:make_patterns_logic$77492, asynchronously reset by \RESET
Extracted 443 gates and 568 wires to a netlist network with 125 inputs and 110 outputs.

3.36.39.1. Executing ABC.

3.36.40. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$96550$abc$88737$abc$84300$auto$opt_dff.cc:219:make_patterns_logic$19567, asynchronously reset by \RESET
Extracted 33 gates and 67 wires to a netlist network with 34 inputs and 31 outputs.

3.36.40.1. Executing ABC.

3.36.41. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$96319$abc$90246$abc$81669$auto$opt_dff.cc:219:make_patterns_logic$38994, asynchronously reset by \RESET
Extracted 122 gates and 182 wires to a netlist network with 60 inputs and 33 outputs.

3.36.41.1. Executing ABC.

3.36.42. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$95711$abc$89638$abc$81396$auto$opt_dff.cc:219:make_patterns_logic$43444, asynchronously reset by \RESET
Extracted 282 gates and 388 wires to a netlist network with 106 inputs and 93 outputs.

3.36.42.1. Executing ABC.

3.36.43. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$93575$abc$87683$abc$82456$auto$opt_dff.cc:219:make_patterns_logic$30856, asynchronously reset by \RESET
Extracted 375 gates and 576 wires to a netlist network with 201 inputs and 91 outputs.

3.36.43.1. Executing ABC.

3.36.44. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$94540$abc$88624$abc$83056$auto$opt_dff.cc:219:make_patterns_logic$23764, asynchronously reset by \RESET
Extracted 87 gates and 131 wires to a netlist network with 44 inputs and 21 outputs.

3.36.44.1. Executing ABC.

3.36.45. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$96645$abc$90401$abc$82812$auto$opt_dff.cc:219:make_patterns_logic$25484, asynchronously reset by \RESET
Extracted 454 gates and 643 wires to a netlist network with 189 inputs and 117 outputs.

3.36.45.1. Executing ABC.

3.36.46. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$97134$abc$90861$abc$84503$auto$opt_dff.cc:219:make_patterns_logic$19194, asynchronously reset by \RESET
Extracted 164 gates and 273 wires to a netlist network with 109 inputs and 119 outputs.

3.36.46.1. Executing ABC.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 1 inverters.

yosys> opt -sat

3.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~66 debug messages>

yosys> opt_merge -nomux

3.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
<suppressed ~192 debug messages>
Removed a total of 64 cells.

yosys> opt_muxtree

3.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 0 unused cells and 32923 unused wires.
<suppressed ~19 debug messages>

yosys> opt_expr

3.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> opt_expr

3.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.38.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_TKkijU/abc_tmp_1.scr

3.39. Executing ABC pass (technology mapping using ABC).

3.39.1. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Extracted 5488 gates and 6065 wires to a netlist network with 575 inputs and 611 outputs.

3.39.1.1. Executing ABC.
DE:   #PIs = 575  #Luts =  1772  Max Lvl =  22  Avg Lvl =   9.77  [   0.29 sec. at Pass 0]
DE:   #PIs = 575  #Luts =  1509  Max Lvl =  17  Avg Lvl =   7.50  [  13.76 sec. at Pass 1]
DE:   #PIs = 575  #Luts =  1480  Max Lvl =  15  Avg Lvl =   6.37  [   2.84 sec. at Pass 2]
DE:   #PIs = 575  #Luts =  1465  Max Lvl =  14  Avg Lvl =   6.36  [   5.38 sec. at Pass 3]
DE:   #PIs = 575  #Luts =  1465  Max Lvl =  14  Avg Lvl =   6.36  [   3.88 sec. at Pass 4]
DE:   #PIs = 575  #Luts =  1462  Max Lvl =  16  Avg Lvl =   6.10  [   7.43 sec. at Pass 5]
DE:   #PIs = 575  #Luts =  1461  Max Lvl =  15  Avg Lvl =   6.08  [   3.25 sec. at Pass 6]
DE:   #PIs = 575  #Luts =  1449  Max Lvl =  15  Avg Lvl =   6.31  [   5.68 sec. at Pass 7]
DE:   #PIs = 575  #Luts =  1434  Max Lvl =  15  Avg Lvl =   6.15  [   2.97 sec. at Pass 8]
DE:   #PIs = 575  #Luts =  1432  Max Lvl =  16  Avg Lvl =   6.43  [   5.63 sec. at Pass 9]
DE:   #PIs = 575  #Luts =  1430  Max Lvl =  15  Avg Lvl =   6.03  [   2.74 sec. at Pass 10]
DE:   #PIs = 575  #Luts =  1426  Max Lvl =  15  Avg Lvl =   6.25  [   5.87 sec. at Pass 11]
DE:   #PIs = 575  #Luts =  1426  Max Lvl =  15  Avg Lvl =   6.25  [   2.83 sec. at Pass 12]
DE:   #PIs = 575  #Luts =  1421  Max Lvl =  15  Avg Lvl =   6.22  [   6.41 sec. at Pass 13]
DE:   #PIs = 575  #Luts =  1421  Max Lvl =  15  Avg Lvl =   6.22  [   3.30 sec. at Pass 14]
DE:   #PIs = 575  #Luts =  1421  Max Lvl =  15  Avg Lvl =   6.22  [   7.59 sec. at Pass 15]
DE:   #PIs = 575  #Luts =  1421  Max Lvl =  15  Avg Lvl =   6.22  [   4.14 sec. at Pass 16]
DE:   #PIs = 575  #Luts =  1421  Max Lvl =  15  Avg Lvl =   6.22  [   0.93 sec. at Pass 17]

yosys> opt

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 0 unused cells and 5912 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 2 inverters.

yosys> stat

3.42. Printing statistics.

=== b15 ===

   Number of wires:               1567
   Number of wire bits:           2499
   Number of public wires:          32
   Number of public wire bits:     282
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2019
     $_DFFE_PP0P_                  410
     $_DFFE_PP1P_                    3
     $lut                         1418
     adder_carry                   188


yosys> shregmap -minlen 8 -maxlen 20

3.43. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.45. Printing statistics.

=== b15 ===

   Number of wires:               1567
   Number of wire bits:           2499
   Number of public wires:          32
   Number of public wire bits:     282
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2019
     $_DFFE_PP0P_                  410
     $_DFFE_PP1P_                    3
     $lut                         1418
     adder_carry                   188


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.46. Executing TECHMAP pass (map to technology primitives).

3.46.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.46.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.46.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using template \$_DFFE_PP1P_ for cells of type $_DFFE_PP1P_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~2380 debug messages>

yosys> opt_expr -mux_undef

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~35851 debug messages>

yosys> simplemap

3.48. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

yosys> opt_merge

3.50. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
<suppressed ~13734 debug messages>
Removed a total of 4578 cells.

yosys> opt_dff -nodffe -nosdff

3.51. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 1 unused cells and 5718 unused wires.
<suppressed ~2 debug messages>

yosys> opt -nodffe -nosdff

3.53. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.53.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.
<suppressed ~1154 debug messages>

yosys> opt_merge -nomux

3.53.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
<suppressed ~45 debug messages>
Removed a total of 15 cells.

yosys> opt_muxtree

3.53.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.53.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 0 unused cells and 385 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.53.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.53.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.53.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.53.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> opt_expr

3.53.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.53.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_TKkijU/abc_tmp_2.scr

3.54. Executing ABC pass (technology mapping using ABC).

3.54.1. Extracting gate netlist of module `\b15' to `<abc-temp-dir>/input.blif'..
Extracted 5250 gates and 5827 wires to a netlist network with 575 inputs and 608 outputs.

3.54.1.1. Executing ABC.
DE:   #PIs = 575  #Luts =  1426  Max Lvl =  15  Avg Lvl =   6.70  [   0.42 sec. at Pass 0]
DE:   #PIs = 575  #Luts =  1426  Max Lvl =  15  Avg Lvl =   6.70  [  17.92 sec. at Pass 1]
DE:   #PIs = 575  #Luts =  1424  Max Lvl =  16  Avg Lvl =   6.24  [   3.60 sec. at Pass 2]
DE:   #PIs = 575  #Luts =  1419  Max Lvl =  15  Avg Lvl =   6.51  [   6.29 sec. at Pass 3]
DE:   #PIs = 575  #Luts =  1401  Max Lvl =  16  Avg Lvl =   6.45  [   3.08 sec. at Pass 4]
DE:   #PIs = 575  #Luts =  1396  Max Lvl =  14  Avg Lvl =   6.29  [   6.52 sec. at Pass 5]
DE:   #PIs = 575  #Luts =  1391  Max Lvl =  15  Avg Lvl =   6.42  [   4.07 sec. at Pass 6]
DE:   #PIs = 575  #Luts =  1388  Max Lvl =  15  Avg Lvl =   6.28  [   5.73 sec. at Pass 7]
DE:   #PIs = 575  #Luts =  1385  Max Lvl =  14  Avg Lvl =   6.43  [   3.32 sec. at Pass 8]
DE:   #PIs = 575  #Luts =  1380  Max Lvl =  15  Avg Lvl =   6.34  [   4.76 sec. at Pass 9]
DE:   #PIs = 575  #Luts =  1380  Max Lvl =  15  Avg Lvl =   6.34  [   2.59 sec. at Pass 10]
DE:   #PIs = 575  #Luts =  1380  Max Lvl =  15  Avg Lvl =   6.34  [   4.34 sec. at Pass 11]
DE:   #PIs = 575  #Luts =  1380  Max Lvl =  15  Avg Lvl =   6.34  [   2.69 sec. at Pass 12]
DE:   #PIs = 575  #Luts =  1380  Max Lvl =  15  Avg Lvl =   6.34  [   0.48 sec. at Pass 13]

yosys> opt

3.55. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.55.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

yosys> opt_merge -nomux

3.55.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.55.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.55.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 0 unused cells and 4819 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.55.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.55.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.55.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b15..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b15.
Performed a total of 0 changes.

yosys> opt_merge

3.55.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b15'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..

yosys> opt_expr

3.55.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b15.

3.55.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.56. Executing HIERARCHY pass (managing design hierarchy).

3.56.1. Analyzing design hierarchy..
Top module:  \b15

3.56.2. Analyzing design hierarchy..
Top module:  \b15
Removed 0 unused modules.

yosys> stat

3.57. Printing statistics.

=== b15 ===

   Number of wires:               1528
   Number of wire bits:           2460
   Number of public wires:          32
   Number of public wire bits:     282
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1981
     $lut                         1380
     adder_carry                   188
     dffsre                        413


yosys> opt_clean -purge

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b15..
Removed 0 unused cells and 2 unused wires.
<suppressed ~2 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.59. Executing Verilog backend.
Dumping module `\b15'.

End of script. Logfile hash: 18f61f127e, CPU: user 52.35s system 1.67s, MEM: 114.00 MB peak
Yosys 0.18+10 (git sha1 8217e4c48, gcc 9.1.0 -fPIC -Os)
Time spent: 96% 6x abc (1367 sec), 1% 61x opt_expr (14 sec), ...
real 232.74
user 1319.62
sys 94.18
