
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.36
 Yosys 0.17+76 (git sha1 ba67c2ec9, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -sv prim_mubi_pkg.sv prim_secded_pkg.sv tl_peri_pkg.sv top_pkg.sv tlul_pkg.sv prim_arbiter_ppc.sv prim_arbiter_tree.sv prim_fifo_async.sv prim_fifo_sync.sv prim_flop_2sync.sv tlul_err_resp.sv tlul_fifo_async.sv tlul_fifo_sync.sv tlul_socket_1n.sv tlul_socket_m1.sv xbar_peri.sv

yosys> verific -sv prim_mubi_pkg.sv prim_secded_pkg.sv tl_peri_pkg.sv top_pkg.sv tlul_pkg.sv prim_arbiter_ppc.sv prim_arbiter_tree.sv prim_fifo_async.sv prim_fifo_sync.sv prim_flop_2sync.sv tlul_err_resp.sv tlul_fifo_async.sv tlul_fifo_sync.sv tlul_socket_1n.sv tlul_socket_m1.sv xbar_peri.sv

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_mubi_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:19: parameter 'MuBi4Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:148: parameter 'MuBi8Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:277: parameter 'MuBi12Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:406: parameter 'MuBi16Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_secded_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:81: parameter 'Secded2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:82: parameter 'Secded2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:90: parameter 'Secded2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:91: parameter 'Secded2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:99: parameter 'Secded3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:100: parameter 'Secded3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:108: parameter 'Secded6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:109: parameter 'Secded6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:117: parameter 'Secded7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:118: parameter 'Secded7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:126: parameter 'SecdedHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:127: parameter 'SecdedHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:135: parameter 'SecdedHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:136: parameter 'SecdedHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:144: parameter 'SecdedHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:145: parameter 'SecdedHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:153: parameter 'SecdedHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:154: parameter 'SecdedHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:162: parameter 'SecdedInv2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:163: parameter 'SecdedInv2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:171: parameter 'SecdedInv2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:172: parameter 'SecdedInv2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:180: parameter 'SecdedInv3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:181: parameter 'SecdedInv3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:189: parameter 'SecdedInv6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:190: parameter 'SecdedInv6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:198: parameter 'SecdedInv7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:199: parameter 'SecdedInv7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:207: parameter 'SecdedInvHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:208: parameter 'SecdedInvHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:216: parameter 'SecdedInvHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:217: parameter 'SecdedInvHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:225: parameter 'SecdedInvHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:226: parameter 'SecdedInvHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:234: parameter 'SecdedInvHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:235: parameter 'SecdedInvHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tl_peri_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'top_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_pkg.sv'
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:14: parameter 'ArbiterImpl' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:27: parameter 'H2DCmdMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:28: parameter 'H2DCmdIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:29: parameter 'H2DCmdFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:30: parameter 'D2HRspMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:31: parameter 'D2HRspIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:32: parameter 'D2HRspFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:33: parameter 'DataMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:34: parameter 'DataIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:35: parameter 'DataFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:44: parameter 'TL_A_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:84: parameter 'TL_D_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_arbiter_ppc.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_arbiter_tree.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_fifo_async.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_fifo_sync.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_flop_2sync.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_err_resp.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_fifo_async.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_fifo_sync.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_socket_1n.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_socket_m1.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'xbar_peri.sv'

yosys> synth_rs -top xbar_peri -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.52

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top xbar_peri

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] xbar_peri.sv:40: compiling module 'xbar_peri'
VERIFIC-INFO [VERI-1018] tlul_socket_1n.sv:43: compiling module 'tlul_socket_1n(N=32'b011100,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=112'b0,DRspDepth=112'b0)'
VERIFIC-INFO [VERI-1018] tlul_fifo_sync.sv:9: compiling module 'tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101)'
VERIFIC-INFO [VERI-1018] prim_fifo_sync.sv:6: compiling module 'prim_fifo_sync(Width=32'b01110000,Depth=32'b0)'
VERIFIC-INFO [VERI-1018] prim_fifo_sync.sv:6: compiling module 'prim_fifo_sync(Width=32'b01000001,Depth=32'b0)'
VERIFIC-INFO [VERI-1018] tlul_fifo_sync.sv:9: compiling module 'tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0)'
VERIFIC-INFO [VERI-1018] prim_fifo_sync.sv:6: compiling module 'prim_fifo_sync(Width=32'b01101100,Depth=32'b0)'
VERIFIC-INFO [VERI-1018] tlul_err_resp.sv:9: compiling module 'tlul_err_resp'
Importing module xbar_peri.
Importing module tlul_socket_1n(N=32'b011100,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=112'b0,DRspDepth=112'b0).
Importing module tlul_err_resp.
Importing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0).
Importing module prim_fifo_sync(Width=32'b01000001,Depth=32'b0).
Importing module prim_fifo_sync(Width=32'b01101100,Depth=32'b0).
Importing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101).
Importing module prim_fifo_sync(Width=32'b01110000,Depth=32'b0).

3.3.1. Analyzing design hierarchy..
Top module:  \xbar_peri
Used module:     \tlul_socket_1n(N=32'b011100,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=112'b0,DRspDepth=112'b0)
Used module:         \tlul_err_resp
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0)
Used module:             \prim_fifo_sync(Width=32'b01000001,Depth=32'b0)
Used module:             \prim_fifo_sync(Width=32'b01101100,Depth=32'b0)
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101)
Used module:             \prim_fifo_sync(Width=32'b01110000,Depth=32'b0)

3.3.2. Analyzing design hierarchy..
Top module:  \xbar_peri
Used module:     \tlul_socket_1n(N=32'b011100,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=112'b0,DRspDepth=112'b0)
Used module:         \tlul_err_resp
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0)
Used module:             \prim_fifo_sync(Width=32'b01000001,Depth=32'b0)
Used module:             \prim_fifo_sync(Width=32'b01101100,Depth=32'b0)
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101)
Used module:             \prim_fifo_sync(Width=32'b01110000,Depth=32'b0)
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_fifo_sync(Width=32'b01110000,Depth=32'b0).
Optimizing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101).
Optimizing module prim_fifo_sync(Width=32'b01101100,Depth=32'b0).
Optimizing module prim_fifo_sync(Width=32'b01000001,Depth=32'b0).
Optimizing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0).
Optimizing module tlul_err_resp.
<suppressed ~11 debug messages>
Optimizing module tlul_socket_1n(N=32'b011100,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=112'b0,DRspDepth=112'b0).
<suppressed ~7 debug messages>
Optimizing module xbar_peri.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module prim_fifo_sync(Width=32'b01110000,Depth=32'b0).
Deleting now unused module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101).
Deleting now unused module prim_fifo_sync(Width=32'b01101100,Depth=32'b0).
Deleting now unused module prim_fifo_sync(Width=32'b01000001,Depth=32'b0).
Deleting now unused module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0).
Deleting now unused module tlul_err_resp.
Deleting now unused module tlul_socket_1n(N=32'b011100,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=112'b0,DRspDepth=112'b0).
<suppressed ~35 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 3 unused cells and 26243 unused wires.
<suppressed ~728 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module xbar_peri...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~11 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_source_reg$tlul_err_resp.sv:35$16553 ($aldff) from module xbar_peri.
Changing const-value async load to async reset on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_size_reg$tlul_err_resp.sv:35$16555 ($aldff) from module xbar_peri.
Changing const-value async load to async reset on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_rsp_pending_reg$tlul_err_resp.sv:56$16575 ($aldff) from module xbar_peri.
Changing const-value async load to async reset on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_req_pending_reg$tlul_err_resp.sv:35$16552 ($aldff) from module xbar_peri.
Changing const-value async load to async reset on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_opcode_reg$tlul_err_resp.sv:35$16554 ($aldff) from module xbar_peri.
Changing const-value async load to async reset on $flatten\u_s1n_29.$verific$num_req_outstanding_reg$tlul_socket_1n.sv:123$5883 ($aldff) from module xbar_peri.
Changing const-value async load to async reset on $flatten\u_s1n_29.$verific$dev_select_outstanding_reg$tlul_socket_1n.sv:123$5884 ($aldff) from module xbar_peri.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~11 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~11 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_source_reg$tlul_err_resp.sv:35$16553 ($adff) from module xbar_peri (D = \tl_main_i.a_source, Q = \u_s1n_29.gen_err_resp.err_resp.err_source).
Adding EN signal on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_size_reg$tlul_err_resp.sv:35$16555 ($adff) from module xbar_peri (D = \tl_main_i.a_size, Q = \u_s1n_29.gen_err_resp.err_resp.err_size).
Adding EN signal on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_req_pending_reg$tlul_err_resp.sv:35$16552 ($adff) from module xbar_peri (D = $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$n45$16516, Q = \u_s1n_29.gen_err_resp.err_resp.err_req_pending).
Adding EN signal on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_opcode_reg$tlul_err_resp.sv:35$16554 ($adff) from module xbar_peri (D = \tl_main_i.a_opcode, Q = \u_s1n_29.gen_err_resp.err_resp.err_opcode).
Adding EN signal on $flatten\u_s1n_29.$verific$num_req_outstanding_reg$tlul_socket_1n.sv:123$5883 ($adff) from module xbar_peri (D = $flatten\u_s1n_29.$verific$n215$5444, Q = \u_s1n_29.num_req_outstanding).
Adding EN signal on $flatten\u_s1n_29.$verific$dev_select_outstanding_reg$tlul_socket_1n.sv:123$5884 ($adff) from module xbar_peri (D = \u_s1n_29.dev_select_t, Q = \u_s1n_29.dev_select_outstanding).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 6 unused cells and 6 unused wires.
<suppressed ~7 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.13.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_63$xbar_peri.sv:220$122 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_64$xbar_peri.sv:224$123 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_65$xbar_peri.sv:228$124 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_66$xbar_peri.sv:232$125 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_67$xbar_peri.sv:236$126 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_68$xbar_peri.sv:240$127 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_69$xbar_peri.sv:244$128 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_70$xbar_peri.sv:248$129 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_71$xbar_peri.sv:252$130 ($eq).
Removed top 1 bits (of 19) from port B of cell xbar_peri.$verific$equal_72$xbar_peri.sv:256$131 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_73$xbar_peri.sv:260$132 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_74$xbar_peri.sv:264$133 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_75$xbar_peri.sv:268$134 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_76$xbar_peri.sv:272$135 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_77$xbar_peri.sv:276$136 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_78$xbar_peri.sv:280$137 ($eq).
Removed top 1 bits (of 19) from port B of cell xbar_peri.$verific$equal_79$xbar_peri.sv:284$138 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_80$xbar_peri.sv:288$139 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_81$xbar_peri.sv:292$140 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_82$xbar_peri.sv:296$141 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_83$xbar_peri.sv:300$142 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_84$xbar_peri.sv:304$143 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_85$xbar_peri.sv:308$144 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_86$xbar_peri.sv:312$145 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_87$xbar_peri.sv:316$146 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_88$xbar_peri.sv:320$147 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_89$xbar_peri.sv:324$148 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_90$xbar_peri.sv:328$149 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_peri.$auto$opt_dff.cc:195:make_patterns_logic$17345 ($ne).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[27].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[26].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[25].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[24].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[23].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[22].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[21].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[20].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[19].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[18].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[17].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[16].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[15].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[14].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[13].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[12].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[11].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[10].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[9].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[8].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[7].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[6].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[5].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[4].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[3].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[2].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[1].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[0].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\fifo_h.$verific$equal_3$tlul_fifo_sync.sv:75$17332 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_524$tlul_socket_1n.sv:169$6330 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_521$tlul_socket_1n.sv:169$6327 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_518$tlul_socket_1n.sv:169$6324 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_515$tlul_socket_1n.sv:169$6321 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_512$tlul_socket_1n.sv:169$6318 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_509$tlul_socket_1n.sv:169$6315 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_506$tlul_socket_1n.sv:169$6312 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_503$tlul_socket_1n.sv:169$6309 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_500$tlul_socket_1n.sv:169$6306 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_497$tlul_socket_1n.sv:169$6303 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_494$tlul_socket_1n.sv:169$6300 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_491$tlul_socket_1n.sv:169$6297 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_488$tlul_socket_1n.sv:169$6294 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_485$tlul_socket_1n.sv:169$6291 ($eq).
Removed top 4 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_482$tlul_socket_1n.sv:169$6288 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_220$tlul_socket_1n.sv:138$6070 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_207$tlul_socket_1n.sv:138$6058 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_194$tlul_socket_1n.sv:138$6046 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_181$tlul_socket_1n.sv:138$6034 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_168$tlul_socket_1n.sv:138$6022 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_155$tlul_socket_1n.sv:138$6010 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_142$tlul_socket_1n.sv:138$5998 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_129$tlul_socket_1n.sv:138$5986 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_116$tlul_socket_1n.sv:138$5974 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_103$tlul_socket_1n.sv:138$5962 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_90$tlul_socket_1n.sv:138$5950 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_77$tlul_socket_1n.sv:138$5938 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_64$tlul_socket_1n.sv:138$5926 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_51$tlul_socket_1n.sv:138$5914 ($eq).
Removed top 4 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_38$tlul_socket_1n.sv:138$5902 ($eq).
Removed top 8 bits (of 9) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$sub_14$tlul_socket_1n.sv:122$5878 ($sub).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module xbar_peri:
  creating $macc model for $flatten\u_s1n_29.$verific$sub_14$tlul_socket_1n.sv:122$5878 ($sub).
  creating $alu model for $macc $flatten\u_s1n_29.$verific$sub_14$tlul_socket_1n.sv:122$5878.
  creating $alu model for $flatten\u_s1n_29.$verific$LessThan_602$tlul_socket_1n.sv:213$16319 ($le): new $alu
  creating $alu cell for $flatten\u_s1n_29.$verific$LessThan_602$tlul_socket_1n.sv:213$16319: $auto$alumacc.cc:485:replace_alu$17354
  creating $alu cell for $flatten\u_s1n_29.$verific$sub_14$tlul_socket_1n.sv:122$5878: $auto$alumacc.cc:485:replace_alu$17363
  created 2 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== xbar_peri ===

   Number of wires:               5318
   Number of wire bits:          43865
   Number of public wires:        5070
   Number of public wire bits:   41734
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                319
     $adff                           1
     $adffe                          6
     $alu                            2
     $and                           66
     $eq                           112
     $logic_not                      2
     $mux                          116
     $ne                             2
     $not                            7
     $or                             1
     $reduce_and                     2
     $reduce_bool                    1
     $reduce_or                      1


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.21.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.21.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> memory_share

3.21.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> memory_collect

3.21.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== xbar_peri ===

   Number of wires:               5318
   Number of wire bits:          43865
   Number of public wires:        5070
   Number of public wire bits:   41734
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                319
     $adff                           1
     $adffe                          6
     $alu                            2
     $and                           66
     $eq                           112
     $logic_not                      2
     $mux                          116
     $ne                             2
     $not                            7
     $or                             1
     $reduce_and                     2
     $reduce_bool                    1
     $reduce_or                      1


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> stat

3.24. Printing statistics.

=== xbar_peri ===

   Number of wires:               5318
   Number of wire bits:          43865
   Number of public wires:        5070
   Number of public wire bits:   41734
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                319
     $adff                           1
     $adffe                          6
     $alu                            2
     $and                           66
     $eq                           112
     $logic_not                      2
     $mux                          116
     $ne                             2
     $not                            7
     $or                             1
     $reduce_and                     2
     $reduce_bool                    1
     $reduce_or                      1


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $mux.
Using template $paramod$b18e16801adf491a64caa0542270798e5d4ac6b6\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using template $paramod$6f67705c43e5e94c02b6ebb52209ce5aa5ade4c1\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000101 for cells of type $lcu.
No more expansions possible.
<suppressed ~887 debug messages>

yosys> stat

3.26. Printing statistics.

=== xbar_peri ===

   Number of wires:               6004
   Number of wire bits:          48206
   Number of public wires:        5070
   Number of public wire bits:   41734
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               5019
     $_AND_                        109
     $_DFFE_PN0P_                   27
     $_DFFE_PN1P_                    1
     $_DFF_PN0_                      1
     $_MUX_                       2943
     $_NOT_                        135
     $_OR_                         848
     $_XOR_                        955


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
<suppressed ~3913 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
<suppressed ~2160 debug messages>
Removed a total of 720 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 120 unused cells and 690 unused wires.
<suppressed ~122 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.27.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
<suppressed ~170 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 2 unused wires.
<suppressed ~1 debug messages>

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.30.10. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt -sat

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.32.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  432 cells in clk=\clk_peri_i, en=\u_s1n_29.accept_t_req, arst=!\rst_peri_ni, srst={ }
  85 cells in clk=\clk_peri_i, en=$auto$opt_dff.cc:194:make_patterns_logic$17344, arst=!\rst_peri_ni, srst={ }
  2900 cells in clk=\clk_peri_i, en=$auto$opt_dff.cc:219:make_patterns_logic$17350, arst=!\rst_peri_ni, srst={ }
  4 cells in clk=\clk_peri_i, en={ }, arst=!\rst_peri_ni, srst={ }
  27 cells in clk=\clk_peri_i, en=$auto$simplemap.cc:251:simplemap_eqne$18984 [1], arst=!\rst_peri_ni, srst={ }

3.33.2. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by \u_s1n_29.accept_t_req, asynchronously reset by !\rst_peri_ni
Extracted 432 gates and 488 wires to a netlist network with 54 inputs and 71 outputs.

3.33.2.1. Executing ABC.

3.33.3. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$17344, asynchronously reset by !\rst_peri_ni
Extracted 85 gates and 130 wires to a netlist network with 45 inputs and 36 outputs.

3.33.3.1. Executing ABC.

3.33.4. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$17350, asynchronously reset by !\rst_peri_ni
Extracted 2900 gates and 4754 wires to a netlist network with 1853 inputs and 67 outputs.

3.33.4.1. Executing ABC.

3.33.5. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, asynchronously reset by !\rst_peri_ni
Extracted 4 gates and 6 wires to a netlist network with 2 inputs and 3 outputs.

3.33.5.1. Executing ABC.

3.33.6. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$24521$auto$simplemap.cc:251:simplemap_eqne$18984[1], asynchronously reset by !\rst_peri_ni
Extracted 27 gates and 51 wires to a netlist network with 24 inputs and 11 outputs.

3.33.6.1. Executing ABC.

yosys> abc -dff

3.34. Executing ABC pass (technology mapping using ABC).

3.34.1. Summary of detected clock domains:
  4 cells in clk=\clk_peri_i, en={ }, arst=!\rst_peri_ni, srst={ }
  4 cells in clk=\clk_peri_i, en=$abc$29649$auto$rtlil.cc:2547:NotGate$24014, arst=!\rst_peri_ni, srst={ }
  424 cells in clk=\clk_peri_i, en=$abc$24092$u_s1n_29.accept_t_req, arst=!\rst_peri_ni, srst={ }
  5079 cells in clk=\clk_peri_i, en=$abc$24576$auto$opt_dff.cc:219:make_patterns_logic$17350, arst=!\rst_peri_ni, srst={ }
  70 cells in clk=\clk_peri_i, en=$abc$24521$auto$simplemap.cc:251:simplemap_eqne$18984[1], arst=!\rst_peri_ni, srst={ }

3.34.2. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, asynchronously reset by !\rst_peri_ni
Extracted 4 gates and 6 wires to a netlist network with 2 inputs and 2 outputs.

3.34.2.1. Executing ABC.

3.34.3. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$29690$abc$29649$auto$rtlil.cc:2547:NotGate$24014, asynchronously reset by !\rst_peri_ni
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.34.3.1. Executing ABC.

3.34.4. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$24092$u_s1n_29.accept_t_req, asynchronously reset by !\rst_peri_ni
Extracted 424 gates and 479 wires to a netlist network with 55 inputs and 67 outputs.

3.34.4.1. Executing ABC.

3.34.5. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$24576$auto$opt_dff.cc:219:make_patterns_logic$17350, asynchronously reset by !\rst_peri_ni
Extracted 5079 gates and 6932 wires to a netlist network with 1853 inputs and 69 outputs.

3.34.5.1. Executing ABC.

3.34.6. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$24521$auto$simplemap.cc:251:simplemap_eqne$18984[1], asynchronously reset by !\rst_peri_ni
Extracted 70 gates and 129 wires to a netlist network with 59 inputs and 38 outputs.

3.34.6.1. Executing ABC.

yosys> abc -dff

3.35. Executing ABC pass (technology mapping using ABC).

3.35.1. Summary of detected clock domains:
  321 cells in clk=\clk_peri_i, en=$abc$29701$abc$24092$u_s1n_29.accept_t_req, arst=!\rst_peri_ni, srst={ }
  5 cells in clk=\clk_peri_i, en={ }, arst=!\rst_peri_ni, srst={ }
  3 cells in clk=\clk_peri_i, en=$abc$29690$abc$29649$auto$rtlil.cc:2547:NotGate$24014, arst=!\rst_peri_ni, srst={ }
  5258 cells in clk=\clk_peri_i, en=$abc$30017$abc$24576$auto$opt_dff.cc:219:make_patterns_logic$17350, arst=!\rst_peri_ni, srst={ }
  58 cells in clk=\clk_peri_i, en=$abc$35278$abc$24521$auto$simplemap.cc:251:simplemap_eqne$18984[1], arst=!\rst_peri_ni, srst={ }

3.35.2. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$29701$abc$24092$u_s1n_29.accept_t_req, asynchronously reset by !\rst_peri_ni
Extracted 321 gates and 375 wires to a netlist network with 54 inputs and 66 outputs.

3.35.2.1. Executing ABC.

3.35.3. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, asynchronously reset by !\rst_peri_ni
Extracted 5 gates and 7 wires to a netlist network with 2 inputs and 2 outputs.

3.35.3.1. Executing ABC.

3.35.4. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$35660$abc$29690$abc$29649$auto$rtlil.cc:2547:NotGate$24014, asynchronously reset by !\rst_peri_ni
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 2 outputs.

3.35.4.1. Executing ABC.

3.35.5. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$30017$abc$24576$auto$opt_dff.cc:219:make_patterns_logic$17350, asynchronously reset by !\rst_peri_ni
Extracted 5258 gates and 7112 wires to a netlist network with 1854 inputs and 69 outputs.

3.35.5.1. Executing ABC.

3.35.6. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$35278$abc$24521$auto$simplemap.cc:251:simplemap_eqne$18984[1], asynchronously reset by !\rst_peri_ni
Extracted 58 gates and 111 wires to a netlist network with 53 inputs and 32 outputs.

3.35.6.1. Executing ABC.

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  309 cells in clk=\clk_peri_i, en=$abc$35352$abc$29701$abc$24092$u_s1n_29.accept_t_req, arst=!\rst_peri_ni, srst={ }
  5 cells in clk=\clk_peri_i, en={ }, arst=!\rst_peri_ni, srst={ }
  3 cells in clk=\clk_peri_i, en=$abc$35660$abc$29690$abc$29649$auto$rtlil.cc:2547:NotGate$24014, arst=!\rst_peri_ni, srst={ }
  5430 cells in clk=\clk_peri_i, en=$abc$35671$abc$30017$abc$24576$auto$opt_dff.cc:219:make_patterns_logic$17350, arst=!\rst_peri_ni, srst={ }
  52 cells in clk=\clk_peri_i, en=$abc$41102$abc$35278$abc$24521$auto$simplemap.cc:251:simplemap_eqne$18984[1], arst=!\rst_peri_ni, srst={ }

3.36.2. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$35352$abc$29701$abc$24092$u_s1n_29.accept_t_req, asynchronously reset by !\rst_peri_ni
Extracted 309 gates and 362 wires to a netlist network with 53 inputs and 65 outputs.

3.36.2.1. Executing ABC.

3.36.3. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, asynchronously reset by !\rst_peri_ni
Extracted 5 gates and 7 wires to a netlist network with 2 inputs and 2 outputs.

3.36.3.1. Executing ABC.

3.36.4. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$41470$abc$35660$abc$29690$abc$29649$auto$rtlil.cc:2547:NotGate$24014, asynchronously reset by !\rst_peri_ni
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 2 outputs.

3.36.4.1. Executing ABC.

3.36.5. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$35671$abc$30017$abc$24576$auto$opt_dff.cc:219:make_patterns_logic$17350, asynchronously reset by !\rst_peri_ni
Extracted 5430 gates and 7284 wires to a netlist network with 1854 inputs and 69 outputs.

3.36.5.1. Executing ABC.

3.36.6. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$41102$abc$35278$abc$24521$auto$simplemap.cc:251:simplemap_eqne$18984[1], asynchronously reset by !\rst_peri_ni
Extracted 52 gates and 103 wires to a netlist network with 51 inputs and 30 outputs.

3.36.6.1. Executing ABC.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_muxtree

3.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 25572 unused wires.
<suppressed ~19 debug messages>

yosys> opt_expr

3.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr

3.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.38.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_VKFKLQ/abc_tmp_1.scr

3.39. Executing ABC pass (technology mapping using ABC).

3.39.1. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Extracted 5925 gates and 7825 wires to a netlist network with 1900 inputs and 112 outputs.

3.39.1.1. Executing ABC.
DE:   #PIs = 1900  #Luts =  1447  Max Lvl =  25  Avg Lvl =  13.27  [   0.50 sec. at Pass 0]
DE:   #PIs = 1900  #Luts =  1267  Max Lvl =  23  Avg Lvl =  12.10  [  18.56 sec. at Pass 1]
DE:   #PIs = 1900  #Luts =  1255  Max Lvl =  20  Avg Lvl =  12.07  [   4.52 sec. at Pass 2]
DE:   #PIs = 1900  #Luts =  1234  Max Lvl =  18  Avg Lvl =  11.95  [   5.46 sec. at Pass 3]
DE:   #PIs = 1900  #Luts =  1206  Max Lvl =  18  Avg Lvl =  11.69  [   6.63 sec. at Pass 4]
DE:   #PIs = 1900  #Luts =  1189  Max Lvl =  17  Avg Lvl =  11.92  [   6.82 sec. at Pass 5]
DE:   #PIs = 1900  #Luts =  1189  Max Lvl =  17  Avg Lvl =  11.92  [   5.21 sec. at Pass 6]
DE:   #PIs = 1900  #Luts =  1180  Max Lvl =  17  Avg Lvl =  11.93  [  11.22 sec. at Pass 7]
DE:   #PIs = 1900  #Luts =  1179  Max Lvl =  16  Avg Lvl =  11.21  [   5.00 sec. at Pass 8]
DE:   #PIs = 1900  #Luts =  1157  Max Lvl =  17  Avg Lvl =  11.38  [   7.94 sec. at Pass 9]
DE:   #PIs = 1900  #Luts =  1157  Max Lvl =  17  Avg Lvl =  11.38  [   7.64 sec. at Pass 10]
DE:   #PIs = 1900  #Luts =  1157  Max Lvl =  17  Avg Lvl =  11.38  [  12.19 sec. at Pass 11]
DE:   #PIs = 1900  #Luts =  1157  Max Lvl =  17  Avg Lvl =  11.38  [   5.33 sec. at Pass 12]
DE:   #PIs = 1900  #Luts =  1157  Max Lvl =  17  Avg Lvl =  11.38  [   2.39 sec. at Pass 13]

yosys> opt

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 7827 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 1 inverters.

yosys> stat

3.42. Printing statistics.

=== xbar_peri ===

   Number of wires:               6135
   Number of wire bits:          42668
   Number of public wires:        5046
   Number of public wire bits:   41579
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1183
     $_DFFE_PN0N_                    1
     $_DFFE_PN0P_                   24
     $_DFFE_PN1P_                    1
     $_DFF_PN0_                      1
     $lut                         1156


yosys> shregmap -minlen 8 -maxlen 20

3.43. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.45. Printing statistics.

=== xbar_peri ===

   Number of wires:               6135
   Number of wire bits:          42668
   Number of public wires:        5046
   Number of public wire bits:   41579
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1183
     $_DFFE_PN0N_                    1
     $_DFFE_PN0P_                   24
     $_DFFE_PN1P_                    1
     $_DFF_PN0_                      1
     $lut                         1156


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.46. Executing TECHMAP pass (map to technology primitives).

3.46.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.46.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.46.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using template \$_DFFE_PN1P_ for cells of type $_DFFE_PN1P_.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_DFFE_PN0N_ for cells of type $_DFFE_PN0N_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~1320 debug messages>

yosys> opt_expr -mux_undef

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
<suppressed ~34854 debug messages>

yosys> simplemap

3.48. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge

3.50. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
<suppressed ~17304 debug messages>
Removed a total of 5768 cells.

yosys> opt_dff -nodffe -nosdff

3.51. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 2604 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.53. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.53.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
<suppressed ~933 debug messages>

yosys> opt_merge -nomux

3.53.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.53.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.53.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 59 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.53.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.53.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.53.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.53.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr

3.53.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.53.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_VKFKLQ/abc_tmp_2.scr

3.54. Executing ABC pass (technology mapping using ABC).

3.54.1. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Extracted 5082 gates and 6984 wires to a netlist network with 1900 inputs and 112 outputs.

3.54.1.1. Executing ABC.
DE:   #PIs = 1900  #Luts =  1170  Max Lvl =  20  Avg Lvl =  11.40  [   0.50 sec. at Pass 0]
DE:   #PIs = 1900  #Luts =  1170  Max Lvl =  20  Avg Lvl =  11.40  [  17.47 sec. at Pass 1]
DE:   #PIs = 1900  #Luts =  1170  Max Lvl =  20  Avg Lvl =  11.40  [   6.36 sec. at Pass 2]
DE:   #PIs = 1900  #Luts =  1147  Max Lvl =  18  Avg Lvl =  11.27  [   7.01 sec. at Pass 3]
DE:   #PIs = 1900  #Luts =  1129  Max Lvl =  21  Avg Lvl =  11.66  [   4.61 sec. at Pass 4]
DE:   #PIs = 1900  #Luts =  1129  Max Lvl =  21  Avg Lvl =  11.66  [   8.38 sec. at Pass 5]
DE:   #PIs = 1900  #Luts =  1129  Max Lvl =  21  Avg Lvl =  11.66  [   4.39 sec. at Pass 6]
DE:   #PIs = 1900  #Luts =  1128  Max Lvl =  19  Avg Lvl =  11.53  [   7.72 sec. at Pass 7]
DE:   #PIs = 1900  #Luts =  1128  Max Lvl =  19  Avg Lvl =  11.53  [   4.75 sec. at Pass 8]
DE:   #PIs = 1900  #Luts =  1128  Max Lvl =  19  Avg Lvl =  11.53  [   6.89 sec. at Pass 9]
DE:   #PIs = 1900  #Luts =  1128  Max Lvl =  17  Avg Lvl =  11.37  [   5.59 sec. at Pass 10]
DE:   #PIs = 1900  #Luts =  1128  Max Lvl =  17  Avg Lvl =  11.37  [   8.43 sec. at Pass 11]
DE:   #PIs = 1900  #Luts =  1127  Max Lvl =  18  Avg Lvl =  11.52  [   5.32 sec. at Pass 12]
DE:   #PIs = 1900  #Luts =  1124  Max Lvl =  18  Avg Lvl =  11.45  [   7.25 sec. at Pass 13]
DE:   #PIs = 1900  #Luts =  1124  Max Lvl =  18  Avg Lvl =  11.45  [   4.91 sec. at Pass 14]
DE:   #PIs = 1900  #Luts =  1124  Max Lvl =  18  Avg Lvl =  11.45  [   7.79 sec. at Pass 15]
DE:   #PIs = 1900  #Luts =  1124  Max Lvl =  18  Avg Lvl =  11.45  [   5.30 sec. at Pass 16]
DE:   #PIs = 1900  #Luts =  1124  Max Lvl =  17  Avg Lvl =  10.98  [   2.14 sec. at Pass 17]

yosys> opt

3.55. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.55.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge -nomux

3.55.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.55.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.55.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 6437 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.55.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.55.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.55.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.55.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr

3.55.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

3.55.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.56. Executing HIERARCHY pass (managing design hierarchy).

3.56.1. Analyzing design hierarchy..
Top module:  \xbar_peri

3.56.2. Analyzing design hierarchy..
Top module:  \xbar_peri
Removed 0 unused modules.

yosys> stat

3.57. Printing statistics.

=== xbar_peri ===

   Number of wires:               6102
   Number of wire bits:          42635
   Number of public wires:        5046
   Number of public wire bits:   41579
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1151
     $lut                         1124
     dffsre                         27


yosys> opt_clean -purge

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 4346 unused wires.
<suppressed ~4346 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.59. Executing Verilog backend.

yosys> bmuxmap

3.59.1. Executing BMUXMAP pass.

yosys> demuxmap

3.59.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\xbar_peri'.

Warnings: 52 unique messages, 52 total
End of script. Logfile hash: 001605d04b, CPU: user 31.53s system 0.64s, MEM: 130.61 MB peak
Yosys 0.17+76 (git sha1 ba67c2ec9, gcc 9.1.0 -fPIC -Os)
Time spent: 97% 6x abc (1319 sec), 0% 37x opt_expr (9 sec), ...
real 288.27
user 1268.85
sys 79.17
