
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.13
 Yosys 0.16+65 (git sha1 051517d61, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -sv aes128_enc.sv

yosys> verific -sv aes128_enc.sv

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'aes128_enc.sv'

yosys> synth_rs -top aes128_enc -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.2.41

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top aes128_enc

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] aes128_enc.sv:12: compiling module 'aes128_enc'
VERIFIC-WARNING [VERI-2457] aes128_enc.sv:99: assignment and/or driver for 'state_o' inside static function 'sub_bytes' is not preserved
VERIFIC-WARNING [VERI-2457] aes128_enc.sv:146: assignment and/or driver for 'state_o' inside static function 'mix_columns' is not preserved
VERIFIC-WARNING [VERI-2457] aes128_enc.sv:161: assignment and/or driver for 'key_o' inside static function 'compute_next_round_key' is not preserved
VERIFIC-WARNING [VERI-2457] aes128_enc.sv:189: assignment and/or driver for 'state_o' inside static function 'add_round_key' is not preserved
VERIFIC-WARNING [VERI-1209] aes128_enc.sv:268: expression size 5 truncated to fit in target size 4
Importing module aes128_enc.

3.3.1. Analyzing design hierarchy..
Top module:  \aes128_enc

3.3.2. Analyzing design hierarchy..
Top module:  \aes128_enc
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~6 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 1 unused cells and 574 unused wires.
<suppressed ~431 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module aes128_enc...
Warning: found logic loop in module aes128_enc:
    cell $verific$i503$aes128_enc.sv:175$1491 ($not)
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [16]
    wire $verific$n5414$475 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [10]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [11]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [12]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [13]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [14]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [15]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [16]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [17]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [18]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [19]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [20]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [21]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [22]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [23]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [8]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [9]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [10]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [11]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [12]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [13]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [14]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [15]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [16]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [17]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [18]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [19]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [20]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [21]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [22]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [23]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [8]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [9]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [10]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [11]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [12]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [13]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [14]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [15]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [16]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [17]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [18]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [19]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [20]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [21]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [22]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [23]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [8]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [9]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [10]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [11]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [12]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [13]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [14]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [15]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [17]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [18]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [19]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [20]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [21]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [22]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [23]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [8]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [9]
Found and reported 192 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~7 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$valid_o_reg$aes128_enc.sv:283$1637 ($aldff) from module aes128_enc.
Changing const-value async load to async reset on $verific$state_reg$aes128_enc.sv:283$1632 ($aldff) from module aes128_enc.
Changing const-value async load to async reset on $verific$round_reg$aes128_enc.sv:283$1634 ($aldff) from module aes128_enc.
Changing const-value async load to async reset on $verific$round_key_reg$aes128_enc.sv:283$1633 ($aldff) from module aes128_enc.
Changing const-value async load to async reset on $verific$data_o_reg$aes128_enc.sv:283$1636 ($aldff) from module aes128_enc.
Changing const-value async load to async reset on $verific$busy_reg$aes128_enc.sv:283$1635 ($aldff) from module aes128_enc.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~7 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~7 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

3.13.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 3 bits (of 64) from port B of cell aes128_enc.$verific$xor_1326$aes128_enc.sv:129$1230 ($xor).
Removed top 3 bits (of 160) from port B of cell aes128_enc.$verific$xor_1312$aes128_enc.sv:129$1478 ($xor).
Removed top 3 bits (of 64) from port B of cell aes128_enc.$verific$xor_1297$aes128_enc.sv:129$1575 ($xor).
Removed top 3 bits (of 160) from port B of cell aes128_enc.$verific$xor_1296$aes128_enc.sv:129$1576 ($xor).
Removed top 3 bits (of 4) from port B of cell aes128_enc.$verific$add_1248$aes128_enc.sv:268$1616 ($add).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module aes128_enc:
  creating $macc model for $verific$add_1248$aes128_enc.sv:268$1616 ($add).
  creating $alu model for $macc $verific$add_1248$aes128_enc.sv:268$1616.
  creating $alu cell for $verific$add_1248$aes128_enc.sv:268$1616: $auto$alumacc.cc:485:replace_alu$1639
  created 1 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~7 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> stat

3.22. Printing statistics.

=== aes128_enc ===

   Number of wires:               1058
   Number of wire bits:          10058
   Number of public wires:          42
   Number of public wire bits:     777
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                249
     $adff                           6
     $alu                            1
     $and                            1
     $bmux                         206
     $eq                             1
     $mux                           15
     $ne                             1
     $not                            3
     $xor                           15


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.23. Executing TECHMAP pass (map to technology primitives).

3.23.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.23.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.23.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $bmux.
Using template $paramod$32a7b7b86c07519b7537abc18e96f0331f97914d\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $adff.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~544 debug messages>

yosys> stat

3.24. Printing statistics.

=== aes128_enc ===

   Number of wires:               1921
   Number of wire bits:          99805
   Number of public wires:          42
   Number of public wire bits:     777
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              92249
     $_AND_                         11
     $_DFF_PN0_                    390
     $_MUX_                      89604
     $_NOT_                          8
     $_OR_                          11
     $_XOR_                       2225


yosys> opt

3.25. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.25.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~38668 debug messages>

yosys> opt_merge -nomux

3.25.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
<suppressed ~101523 debug messages>
Removed a total of 33841 cells.

yosys> opt_muxtree

3.25.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.25.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 4 unused cells and 1091 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.25.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~440 debug messages>

3.25.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.25.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.25.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 0 unused cells and 5 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.25.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

3.25.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.25.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.25.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.25.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.25.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.25.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> opt_expr

3.25.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

3.25.23. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~1315 debug messages>

yosys> opt_merge

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_dff

3.26.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

3.26.5. Finished fast OPT passes.

yosys> memory_map

3.27. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~2 debug messages>

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.28.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.28.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> opt_expr -full

3.28.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

3.28.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.29. Executing ABC pass (technology mapping using ABC).

3.29.1. Summary of detected clock domains:
  19398 cells in clk=\clk_i, en={ }, arst=!\rstn_i, srst={ }

3.29.2. Extracting gate netlist of module `\aes128_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, asynchronously reset by !\rstn_i
Extracted 19398 gates and 19657 wires to a netlist network with 257 inputs and 129 outputs.

3.29.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.29.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:      390
ABC RESULTS:             ORNOT cells:     1539
ABC RESULTS:               NOT cells:      151
ABC RESULTS:               NOR cells:      581
ABC RESULTS:               XOR cells:      486
ABC RESULTS:                OR cells:     2501
ABC RESULTS:              NAND cells:    10496
ABC RESULTS:              XNOR cells:     1148
ABC RESULTS:               MUX cells:     2530
ABC RESULTS:            ANDNOT cells:     1286
ABC RESULTS:               AND cells:     5640
ABC RESULTS:               BUF cells:      129
ABC RESULTS:        internal signals:    19271
ABC RESULTS:           input signals:      257
ABC RESULTS:          output signals:      129
Removing temp directory.

yosys> abc -script abc_tmp.scr

3.30. Executing ABC pass (technology mapping using ABC).

3.30.1. Extracting gate netlist of module `\aes128_enc' to `<abc-temp-dir>/input.blif'..
Extracted 26358 gates and 26876 wires to a netlist network with 518 inputs and 390 outputs.

3.30.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/yosys_verific_rs/result_10-05-2022T23-40-15/Golden_synth_rs_ade.json/aes-128-ecb-encoder/abc_tmp.scr 
ABC:   #Luts =  3431  Max Lvl =   9  Avg Lvl =   6.46  [   1.72 sec. at Pass 0]
ABC:   #Luts =  3201  Max Lvl =   9  Avg Lvl =   6.04  [ 121.48 sec. at Pass 1]
ABC:   #Luts =  3139  Max Lvl =   9  Avg Lvl =   5.90  [  24.15 sec. at Pass 2]
ABC:   #Luts =  3135  Max Lvl =   9  Avg Lvl =   5.90  [ 109.24 sec. at Pass 3]
ABC:   #Luts =  3019  Max Lvl =   9  Avg Lvl =   5.75  [  32.96 sec. at Pass 4]
ABC:   #Luts =  3006  Max Lvl =   9  Avg Lvl =   5.77  [ 102.97 sec. at Pass 5]
ABC:   #Luts =  2982  Max Lvl =   8  Avg Lvl =   5.71  [  34.28 sec. at Pass 6]
ABC:   #Luts =  2982  Max Lvl =   8  Avg Lvl =   5.71  [  98.13 sec. at Pass 7]
ABC:   #Luts =  2982  Max Lvl =   8  Avg Lvl =   5.71  [  25.15 sec. at Pass 8]
ABC:   #Luts =  2982  Max Lvl =   8  Avg Lvl =   5.71  [  90.16 sec. at Pass 9]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.30.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     2982
ABC RESULTS:        internal signals:    25968
ABC RESULTS:           input signals:      518
ABC RESULTS:          output signals:      390
Removing temp directory.

yosys> opt

3.31. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.31.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_merge -nomux

3.31.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.31.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.31.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.31.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.31.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 0 unused cells and 28210 unused wires.
<suppressed ~36 debug messages>

yosys> opt_expr

3.31.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

3.31.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.31.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.31.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.31.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.31.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> opt_expr

3.31.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

3.31.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.32. Printing statistics.

=== aes128_enc ===

   Number of wires:               3250
   Number of wire bits:           3631
   Number of public wires:           7
   Number of public wire bits:     388
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3372
     $_DFF_PN0_                    390
     $lut                         2982


yosys> shregmap -minlen 8 -maxlen 20

3.33. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.34. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.35. Printing statistics.

=== aes128_enc ===

   Number of wires:               3250
   Number of wire bits:           3631
   Number of public wires:           7
   Number of public wire bits:     388
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3372
     $_DFF_PN0_                    390
     $lut                         2982


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.36. Executing TECHMAP pass (map to technology primitives).

3.36.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.36.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.36.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
No more expansions possible.
<suppressed ~3508 debug messages>

yosys> opt_expr -mux_undef

3.37. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~71295 debug messages>

yosys> simplemap

3.38. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.39. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_merge

3.40. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
<suppressed ~77208 debug messages>
Removed a total of 25736 cells.

yosys> opt_dff -nodffe -nosdff

3.41. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 0 unused cells and 6989 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.43. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.43.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~2611 debug messages>

yosys> opt_merge -nomux

3.43.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
<suppressed ~525 debug messages>
Removed a total of 175 cells.

yosys> opt_muxtree

3.43.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.43.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.43.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.43.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.43.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 0 unused cells and 377 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.43.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

3.43.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.43.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.43.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.43.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.43.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.43.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> opt_expr

3.43.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

3.43.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.44. Executing ABC pass (technology mapping using ABC).

3.44.1. Extracting gate netlist of module `\aes128_enc' to `<abc-temp-dir>/input.blif'..
Extracted 30289 gates and 30809 wires to a netlist network with 518 inputs and 390 outputs.

3.44.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/yosys_verific_rs/result_10-05-2022T23-40-15/Golden_synth_rs_ade.json/aes-128-ecb-encoder/abc_tmp.scr 
ABC:   #Luts =  3223  Max Lvl =   9  Avg Lvl =   5.86  [   2.94 sec. at Pass 0]
ABC:   #Luts =  3158  Max Lvl =   9  Avg Lvl =   5.83  [ 180.65 sec. at Pass 1]
ABC:   #Luts =  2983  Max Lvl =   8  Avg Lvl =   5.71  [  24.25 sec. at Pass 2]
ABC:   #Luts =  2983  Max Lvl =   8  Avg Lvl =   5.71  [  76.04 sec. at Pass 3]
ABC:   #Luts =  2983  Max Lvl =   8  Avg Lvl =   5.71  [  26.35 sec. at Pass 4]
ABC:   #Luts =  2983  Max Lvl =   8  Avg Lvl =   5.71  [  83.79 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.44.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     2983
ABC RESULTS:        internal signals:    29901
ABC RESULTS:           input signals:      518
ABC RESULTS:          output signals:      390
Removing temp directory.

yosys> opt

3.45. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.45.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_merge -nomux

3.45.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.45.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.45.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.45.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 0 unused cells and 12602 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.45.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

3.45.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.45.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.45.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.45.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> opt_expr

3.45.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

3.45.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.46. Executing HIERARCHY pass (managing design hierarchy).

3.46.1. Analyzing design hierarchy..
Top module:  \aes128_enc

3.46.2. Analyzing design hierarchy..
Top module:  \aes128_enc
Removed 0 unused modules.

yosys> stat

3.47. Printing statistics.

=== aes128_enc ===

   Number of wires:               3251
   Number of wire bits:           3632
   Number of public wires:           7
   Number of public wire bits:     388
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3373
     $lut                         2983
     dffsre                        390


yosys> opt_clean -purge

3.48. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> write_verilog -noattr -nohex synthesized.v

3.49. Executing Verilog backend.

yosys> bmuxmap

3.49.1. Executing BMUXMAP pass.

yosys> demuxmap

3.49.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\aes128_enc'.

Warnings: 197 unique messages, 197 total
End of script. Logfile hash: 34094cb5ad, CPU: user 100.18s system 1.82s, MEM: 368.88 MB peak
Yosys 0.16+65 (git sha1 051517d61, gcc 9.1.0 -fPIC -Os)
Time spent: 98% 3x abc (6756 sec), 0% 29x opt_expr (38 sec), ...
real 1210.44
user 6542.10
sys 313.25
