
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.40
 Yosys 0.17+76 (git sha1 035496b50, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 08:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k des.v desround.v key_gen.v s1.v s2.v s3.v s4.v s5.v s6.v s7.v s8.v wb_descontroller_top.v

yosys> verific -vlog2k des.v desround.v key_gen.v s1.v s2.v s3.v s4.v s5.v s6.v s7.v s8.v wb_descontroller_top.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 08:08:21 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'des.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'desround.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'key_gen.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's1.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's2.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's4.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's5.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's6.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's7.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's8.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wb_descontroller_top.v'

yosys> synth_rs -top des_top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.55

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top des_top

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] wb_descontroller_top.v:46: compiling module 'des_top'
VERIFIC-INFO [VERI-1018] des.v:52: compiling module 'des'
VERIFIC-INFO [VERI-1018] desround.v:57: compiling module 'desround'
VERIFIC-INFO [VERI-1018] key_gen.v:53: compiling module 'key_gen'
VERIFIC-WARNING [VERI-2580] key_gen.v:194: latch inferred for net 'prev0'
VERIFIC-INFO [VERI-1018] s1.v:53: compiling module 's1'
VERIFIC-INFO [VERI-1018] s2.v:53: compiling module 's2'
VERIFIC-INFO [VERI-1018] s3.v:53: compiling module 's3'
VERIFIC-INFO [VERI-1018] s4.v:53: compiling module 's4'
VERIFIC-INFO [VERI-1018] s5.v:53: compiling module 's5'
VERIFIC-INFO [VERI-1018] s6.v:53: compiling module 's6'
VERIFIC-INFO [VERI-1018] s7.v:52: compiling module 's7'
VERIFIC-INFO [VERI-1018] s8.v:52: compiling module 's8'
VERIFIC-WARNING [VERI-1209] des.v:275: expression size 5 truncated to fit in target size 4
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:86: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:88: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:90: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:91: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:96: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:100: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:101: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:106: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:111: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:115: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:119: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:123: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:127: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:133: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:137: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:142: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:146: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:152: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:153: delay control is not supported for synthesis
Importing module des_top.
Importing module des.
Importing module desround.
Importing module key_gen.
Importing module s1.
Importing module s2.
Importing module s3.
Importing module s4.
Importing module s5.
Importing module s6.
Importing module s7.
Importing module s8.

3.3.1. Analyzing design hierarchy..
Top module:  \des_top
Used module:     \des
Used module:         \s8
Used module:         \s7
Used module:         \s6
Used module:         \s5
Used module:         \s4
Used module:         \s3
Used module:         \s2
Used module:         \s1
Used module:         \desround
Used module:             \key_gen

3.3.2. Analyzing design hierarchy..
Top module:  \des_top
Used module:     \des
Used module:         \s8
Used module:         \s7
Used module:         \s6
Used module:         \s5
Used module:         \s4
Used module:         \s3
Used module:         \s2
Used module:         \s1
Used module:         \desround
Used module:             \key_gen
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module s8.
Optimizing module s7.
Optimizing module s6.
Optimizing module s5.
Optimizing module s4.
Optimizing module s3.
Optimizing module s2.
Optimizing module s1.
Optimizing module key_gen.
<suppressed ~7 debug messages>
Optimizing module desround.
<suppressed ~3 debug messages>
Optimizing module des.
<suppressed ~7 debug messages>
Optimizing module des_top.
<suppressed ~5 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module s8.
Deleting now unused module s7.
Deleting now unused module s6.
Deleting now unused module s5.
Deleting now unused module s4.
Deleting now unused module s3.
Deleting now unused module s2.
Deleting now unused module s1.
Deleting now unused module key_gen.
Deleting now unused module desround.
Deleting now unused module des.
<suppressed ~11 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~9 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 13 unused cells and 983 unused wires.
<suppressed ~79 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module des_top...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
      Replacing known input bits on port B of cell $flatten\des.$verific$i216$des.v:268$761: \des.data_ready -> 1'1
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~13 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
    New ctrl vector for $pmux cell $flatten\des.$verific$select_227$des.v:277$775: { $flatten\des.$verific$n1202$309 $flatten\des.$verific$n1204$311 }
    New ctrl vector for $pmux cell $flatten\des.$verific$select_228$des.v:277$776: { $flatten\des.$verific$n1202$309 $auto$opt_reduce.cc:134:opt_pmux$1222 }
    New ctrl vector for $pmux cell $flatten\des.$verific$select_229$des.v:277$777: { $flatten\des.$verific$n1202$309 $auto$opt_reduce.cc:134:opt_pmux$1224 }
    New ctrl vector for $pmux cell $flatten\des.$verific$select_230$des.v:277$778: { $flatten\des.$verific$n1202$309 $auto$opt_reduce.cc:134:opt_pmux$1226 }
    New ctrl vector for $pmux cell $flatten\des.\rd1.\kg1.$verific$select_350$key_gen.v:165$1178: { $flatten\des.$verific$n1202$309 $auto$opt_reduce.cc:134:opt_pmux$1228 $flatten\des.\rd1.\kg1.$verific$n975$1114 }
    New ctrl vector for $pmux cell $verific$select_41$wb_descontroller_top.v:129$272: { $verific$n638$12 $verific$n639$13 $auto$opt_reduce.cc:134:opt_pmux$1230 }
    New ctrl vector for $pmux cell $verific$select_42$wb_descontroller_top.v:129$273: { $verific$n640$14 $verific$n641$15 $auto$opt_reduce.cc:134:opt_pmux$1232 }
  Optimizing cells in module \des_top.
Performed a total of 8 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$wb_dat_o_reg$wb_descontroller_top.v:156$293 ($aldff) from module des_top.
Changing const-value async load to async reset on $verific$wb_ack_o_reg$wb_descontroller_top.v:156$292 ($aldff) from module des_top.
Changing const-value async load to async reset on $verific$key_o_reg$wb_descontroller_top.v:156$296 ($aldff) from module des_top.
Changing const-value async load to async reset on $verific$data_o_reg$wb_descontroller_top.v:156$297 ($aldff) from module des_top.
Changing const-value async load to async reset on $verific$cypher_data_reg_reg$wb_descontroller_top.v:156$295 ($aldff) from module des_top.
Changing const-value async load to async reset on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.$verific$data_o_reg$des.v:141$743 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.\rd1.$verific$R_o_reg$desround.v:146$960 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.\rd1.$verific$L_o_reg$desround.v:146$959 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.\rd1.$verific$Key_o_reg$desround.v:146$961 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.$verific$stage1_iter_reg$des.v:141$744 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.$verific$ready_o_reg$des.v:141$742 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.$verific$data_ready_reg$des.v:141$745 ($aldff) from module des_top.
Setting constant 0-bit at position 4 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 1-bit at position 5 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 1-bit at position 6 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 7 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 8 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 9 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 10 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 11 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 12 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 13 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 14 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 15 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 16 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 17 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 18 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 19 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 20 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 21 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 22 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 23 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 24 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 25 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 26 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 27 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 28 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 29 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 30 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 31 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 5 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~13 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~13 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$wb_dat_o_reg$wb_descontroller_top.v:156$293 ($adff) from module des_top (D = $verific$n891$40, Q = \wb_dat_o).
Adding EN signal on $verific$key_o_reg$wb_descontroller_top.v:156$296 ($adff) from module des_top (D = $verific$n716$36 [31:0], Q = \key_o [31:0]).
Adding EN signal on $verific$key_o_reg$wb_descontroller_top.v:156$296 ($adff) from module des_top (D = $verific$n716$36 [63:32], Q = \key_o [63:32]).
Adding EN signal on $verific$data_o_reg$wb_descontroller_top.v:156$297 ($adff) from module des_top (D = $verific$n651$35 [31:0], Q = \data_o [31:0]).
Adding EN signal on $verific$data_o_reg$wb_descontroller_top.v:156$297 ($adff) from module des_top (D = $verific$n651$35 [63:32], Q = \data_o [63:32]).
Adding EN signal on $verific$cypher_data_reg_reg$wb_descontroller_top.v:156$295 ($adff) from module des_top (D = \des.data_o, Q = \cypher_data_reg).
Adding EN signal on $flatten\des.$verific$stage1_iter_reg$des.v:141$744 ($adff) from module des_top (D = \des.next_stage1_iter, Q = \des.stage1_iter).
Adding EN signal on $flatten\des.$verific$data_ready_reg$des.v:141$745 ($adff) from module des_top (D = $flatten\des.$verific$n1189$307, Q = \des.data_ready).
Adding EN signal on $auto$ff.cc:262:slice$1233 ($adff) from module des_top (D = { \wb_dat_i [3] \wb_dat_i [0] }, Q = { \control_reg [3] \control_reg [0] }).
Adding EN signal on $auto$ff.cc:262:slice$1233 ($adff) from module des_top (D = $verific$n1397$45 [1], Q = \control_reg [1]).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 6 unused cells and 6 unused wires.
<suppressed ~8 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~10 debug messages>

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~12 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.13.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~12 debug messages>

yosys> opt_reduce

3.13.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.13.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.13.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 4) from mux cell des_top.$verific$mux_83$wb_descontroller_top.v:154$263 ($mux).
Removed top 5 bits (of 8) from port B of cell des_top.$verific$equal_28$wb_descontroller_top.v:113$265 ($eq).
Removed top 4 bits (of 8) from port B of cell des_top.$verific$equal_29$wb_descontroller_top.v:117$266 ($eq).
Removed top 4 bits (of 8) from port B of cell des_top.$verific$equal_30$wb_descontroller_top.v:121$267 ($eq).
Removed top 3 bits (of 8) from port B of cell des_top.$verific$equal_31$wb_descontroller_top.v:125$268 ($eq).
Removed top 3 bits (of 8) from port B of cell des_top.$verific$equal_54$wb_descontroller_top.v:140$277 ($eq).
Removed top 3 bits (of 8) from port B of cell des_top.$verific$equal_55$wb_descontroller_top.v:144$278 ($eq).
Removed top 1 bits (of 4) from mux cell des_top.$verific$mux_85$wb_descontroller_top.v:129$286 ($mux).
Removed top 1 bits (of 2) from port B of cell des_top.$auto$opt_dff.cc:195:make_patterns_logic$1281 ($ne).
Removed top 3 bits (of 4) from port B of cell des_top.$flatten\des.\rd1.\kg1.$verific$equal_132$key_gen.v:86$1154 ($eq).
Removed top 3 bits (of 4) from port B of cell des_top.$flatten\des.$verific$add_222$des.v:275$768 ($add).
Removed top 1 bits (of 4) from wire des_top.$verific$n1397$45.
Removed top 1 bits (of 4) from wire des_top.$verific$n1399$47.
Removed top 28 bits (of 32) from wire des_top.control_reg.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 16 unused cells and 28 unused wires.
<suppressed ~17 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module des_top:
  creating $macc model for $flatten\des.$verific$add_222$des.v:275$768 ($add).
  creating $alu model for $macc $flatten\des.$verific$add_222$des.v:275$768.
  creating $alu cell for $flatten\des.$verific$add_222$des.v:275$768: $auto$alumacc.cc:485:replace_alu$1370
  created 1 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~3 debug messages>

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~13 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== des_top ===

   Number of wires:                206
   Number of wire bits:           3693
   Number of public wires:         120
   Number of public wire bits:    2513
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                117
     $adff                           7
     $adffe                         10
     $alu                            1
     $and                            5
     $bmux                           8
     $eq                             9
     $logic_not                      2
     $mux                           37
     $ne                             3
     $not                           14
     $or                             4
     $reduce_and                     7
     $reduce_or                      8
     $xor                            2


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.21.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.21.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `$auto$memory_bmux2rom.cc:63:execute$1394'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$1391'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$1388'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$1385'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$1382'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$1379'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$1376'[0] in module `\des_top': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$1373'[0] in module `\des_top': no output FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$1394'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$1391'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$1388'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$1385'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$1382'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$1379'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$1376'[0] in module `\des_top': no address FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$1373'[0] in module `\des_top': no address FF found.

yosys> opt_clean

3.21.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> memory_share

3.21.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> memory_collect

3.21.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== des_top ===

   Number of wires:                206
   Number of wire bits:           3693
   Number of public wires:         120
   Number of public wire bits:    2513
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                117
     $adff                           7
     $adffe                         10
     $alu                            1
     $and                            5
     $eq                             9
     $logic_not                      2
     $mem_v2                         8
     $mux                           37
     $ne                             3
     $not                           14
     $or                             4
     $reduce_and                     7
     $reduce_or                      8
     $xor                            2


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> stat

3.24. Printing statistics.

=== des_top ===

   Number of wires:                206
   Number of wire bits:           3693
   Number of public wires:         120
   Number of public wire bits:    2513
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                117
     $adff                           7
     $adffe                         10
     $alu                            1
     $and                            5
     $eq                             9
     $logic_not                      2
     $mem_v2                         8
     $mux                           37
     $ne                             3
     $not                           14
     $or                             4
     $reduce_and                     7
     $reduce_or                      8
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $or.
Using template $paramod$32a7b7b86c07519b7537abc18e96f0331f97914d\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
No more expansions possible.
<suppressed ~413 debug messages>

yosys> stat

3.26. Printing statistics.

=== des_top ===

   Number of wires:                319
   Number of wire bits:           5037
   Number of public wires:         120
   Number of public wire bits:    2513
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2031
     $_AND_                         27
     $_DFFE_PP0P_                  231
     $_DFFE_PP1P_                    1
     $_DFF_PP0_                    187
     $_MUX_                       1299
     $_NOT_                         29
     $_OR_                          93
     $_XOR_                        156
     $mem_v2                         8


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~618 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~525 debug messages>
Removed a total of 175 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 28 unused cells and 98 unused wires.
<suppressed ~29 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.27.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~171 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 5 unused wires.
<suppressed ~1 debug messages>

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory $auto$memory_bmux2rom.cc:63:execute$1373 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$1376 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$1379 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$1382 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$1385 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$1388 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$1391 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$1394 in module \des_top:
  created 64 $dff cells and 0 static cells of width 4.
  read interface: 0 $dff and 63 $mux cells.
  write interface: 0 write mux blocks.

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~61 debug messages>

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[0]$3701 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[1]$3703 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[2]$3705 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[3]$3707 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[4]$3709 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[5]$3711 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[6]$3713 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[7]$3715 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[8]$3717 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[9]$3719 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[10]$3721 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[11]$3723 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[12]$3725 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[13]$3727 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[14]$3729 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[15]$3731 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[16]$3733 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[17]$3735 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[18]$3737 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[19]$3739 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[20]$3741 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[21]$3743 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[22]$3745 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[23]$3747 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[24]$3749 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[25]$3751 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[26]$3753 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[27]$3755 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[28]$3757 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[29]$3759 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[30]$3761 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[31]$3763 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[32]$3765 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[33]$3767 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[34]$3769 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[35]$3771 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[36]$3773 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[37]$3775 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[38]$3777 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[39]$3779 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[40]$3781 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[41]$3783 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[42]$3785 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[43]$3787 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[44]$3789 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[45]$3791 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[46]$3793 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[47]$3795 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[48]$3797 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[49]$3799 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[50]$3801 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[51]$3803 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[52]$3805 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[53]$3807 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[54]$3809 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[55]$3811 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[56]$3813 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[57]$3815 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[58]$3817 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[59]$3819 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[60]$3821 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[61]$3823 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[62]$3825 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1373[63]$3827 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[0]$4018 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[1]$4020 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[2]$4022 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[3]$4024 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[4]$4026 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[5]$4028 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[6]$4030 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[7]$4032 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[8]$4034 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[9]$4036 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[10]$4038 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[11]$4040 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[12]$4042 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[13]$4044 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[14]$4046 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[15]$4048 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[16]$4050 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[17]$4052 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[18]$4054 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[19]$4056 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[20]$4058 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[21]$4060 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[22]$4062 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[23]$4064 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[24]$4066 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[25]$4068 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[26]$4070 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[27]$4072 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[28]$4074 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[29]$4076 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[30]$4078 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[31]$4080 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[32]$4082 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[33]$4084 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[34]$4086 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[35]$4088 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[36]$4090 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[37]$4092 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[38]$4094 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[39]$4096 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[40]$4098 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[41]$4100 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[42]$4102 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[43]$4104 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[44]$4106 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[45]$4108 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[46]$4110 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[47]$4112 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[48]$4114 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[49]$4116 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[50]$4118 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[51]$4120 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[52]$4122 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[53]$4124 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[54]$4126 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[55]$4128 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[56]$4130 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[57]$4132 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[58]$4134 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[59]$4136 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[60]$4138 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[61]$4140 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[62]$4142 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1376[63]$4144 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[0]$4335 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[1]$4337 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[2]$4339 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[3]$4341 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[4]$4343 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[5]$4345 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[6]$4347 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[7]$4349 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[8]$4351 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[9]$4353 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[10]$4355 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[11]$4357 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[12]$4359 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[13]$4361 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[14]$4363 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[15]$4365 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[16]$4367 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[17]$4369 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[18]$4371 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[19]$4373 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[20]$4375 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[21]$4377 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[22]$4379 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[23]$4381 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[24]$4383 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[25]$4385 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[26]$4387 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[27]$4389 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[28]$4391 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[29]$4393 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[30]$4395 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[31]$4397 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[32]$4399 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[33]$4401 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[34]$4403 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[35]$4405 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[36]$4407 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[37]$4409 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[38]$4411 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[39]$4413 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[40]$4415 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[41]$4417 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[42]$4419 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[43]$4421 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[44]$4423 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[45]$4425 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[46]$4427 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[47]$4429 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[48]$4431 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[49]$4433 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[50]$4435 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[51]$4437 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[52]$4439 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[53]$4441 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[54]$4443 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[55]$4445 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[56]$4447 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[57]$4449 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[58]$4451 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[59]$4453 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[60]$4455 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[61]$4457 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[62]$4459 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1379[63]$4461 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[0]$4652 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[1]$4654 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[2]$4656 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[3]$4658 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[4]$4660 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[5]$4662 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[6]$4664 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[7]$4666 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[8]$4668 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[9]$4670 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[10]$4672 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[11]$4674 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[12]$4676 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[13]$4678 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[14]$4680 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[15]$4682 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[16]$4684 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[17]$4686 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[18]$4688 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[19]$4690 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[20]$4692 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[21]$4694 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[22]$4696 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[23]$4698 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[24]$4700 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[25]$4702 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[26]$4704 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[27]$4706 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[28]$4708 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[29]$4710 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[30]$4712 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[31]$4714 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[32]$4716 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[33]$4718 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[34]$4720 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[35]$4722 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[36]$4724 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[37]$4726 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[38]$4728 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[39]$4730 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[40]$4732 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[41]$4734 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[42]$4736 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[43]$4738 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[44]$4740 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[45]$4742 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[46]$4744 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[47]$4746 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[48]$4748 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[49]$4750 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[50]$4752 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[51]$4754 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[52]$4756 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[53]$4758 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[54]$4760 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[55]$4762 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[56]$4764 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[57]$4766 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[58]$4768 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[59]$4770 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[60]$4772 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[61]$4774 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[62]$4776 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1382[63]$4778 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[0]$4969 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[1]$4971 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[2]$4973 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[3]$4975 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[4]$4977 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[5]$4979 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[6]$4981 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[7]$4983 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[8]$4985 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[9]$4987 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[10]$4989 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[11]$4991 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[12]$4993 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[13]$4995 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[14]$4997 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[15]$4999 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[16]$5001 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[17]$5003 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[18]$5005 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[19]$5007 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[20]$5009 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[21]$5011 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[22]$5013 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[23]$5015 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[24]$5017 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[25]$5019 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[26]$5021 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[27]$5023 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[28]$5025 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[29]$5027 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[30]$5029 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[31]$5031 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[32]$5033 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[33]$5035 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[34]$5037 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[35]$5039 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[36]$5041 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[37]$5043 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[38]$5045 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[39]$5047 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[40]$5049 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[41]$5051 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[42]$5053 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[43]$5055 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[44]$5057 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[45]$5059 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[46]$5061 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[47]$5063 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[48]$5065 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[49]$5067 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[50]$5069 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[51]$5071 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[52]$5073 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[53]$5075 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[54]$5077 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[55]$5079 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[56]$5081 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[57]$5083 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[58]$5085 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[59]$5087 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[60]$5089 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[61]$5091 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[62]$5093 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1385[63]$5095 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[0]$5286 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[1]$5288 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[2]$5290 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[3]$5292 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[4]$5294 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[5]$5296 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[6]$5298 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[7]$5300 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[8]$5302 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[9]$5304 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[10]$5306 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[11]$5308 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[12]$5310 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[13]$5312 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[14]$5314 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[15]$5316 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[16]$5318 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[17]$5320 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[18]$5322 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[19]$5324 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[20]$5326 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[21]$5328 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[22]$5330 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[23]$5332 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[24]$5334 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[25]$5336 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[26]$5338 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[27]$5340 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[28]$5342 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[29]$5344 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[30]$5346 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[31]$5348 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[32]$5350 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[33]$5352 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[34]$5354 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[35]$5356 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[36]$5358 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[37]$5360 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[38]$5362 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[39]$5364 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[40]$5366 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[41]$5368 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[42]$5370 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[43]$5372 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[44]$5374 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[45]$5376 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[46]$5378 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[47]$5380 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[48]$5382 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[49]$5384 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[50]$5386 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[51]$5388 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[52]$5390 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[53]$5392 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[54]$5394 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[55]$5396 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[56]$5398 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[57]$5400 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[58]$5402 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[59]$5404 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[60]$5406 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[61]$5408 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[62]$5410 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1388[63]$5412 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[0]$5603 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[1]$5605 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[2]$5607 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[3]$5609 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[4]$5611 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[5]$5613 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[6]$5615 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[7]$5617 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[8]$5619 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[9]$5621 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[10]$5623 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[11]$5625 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[12]$5627 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[13]$5629 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[14]$5631 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[15]$5633 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[16]$5635 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[17]$5637 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[18]$5639 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[19]$5641 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[20]$5643 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[21]$5645 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[22]$5647 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[23]$5649 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[24]$5651 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[25]$5653 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[26]$5655 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[27]$5657 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[28]$5659 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[29]$5661 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[30]$5663 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[31]$5665 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[32]$5667 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[33]$5669 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[34]$5671 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[35]$5673 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[36]$5675 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[37]$5677 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[38]$5679 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[39]$5681 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[40]$5683 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[41]$5685 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[42]$5687 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[43]$5689 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[44]$5691 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[45]$5693 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[46]$5695 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[47]$5697 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[48]$5699 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[49]$5701 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[50]$5703 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[51]$5705 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[52]$5707 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[53]$5709 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[54]$5711 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[55]$5713 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[56]$5715 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[57]$5717 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[58]$5719 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[59]$5721 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[60]$5723 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[61]$5725 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[62]$5727 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1391[63]$5729 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[0]$5920 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[1]$5922 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[2]$5924 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[3]$5926 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[4]$5928 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[5]$5930 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[6]$5932 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[7]$5934 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[8]$5936 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[9]$5938 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[10]$5940 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[11]$5942 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[12]$5944 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[13]$5946 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[14]$5948 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[15]$5950 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[16]$5952 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[17]$5954 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[18]$5956 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[19]$5958 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[20]$5960 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[21]$5962 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[22]$5964 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[23]$5966 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[24]$5968 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[25]$5970 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[26]$5972 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[27]$5974 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[28]$5976 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[29]$5978 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[30]$5980 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[31]$5982 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[32]$5984 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[33]$5986 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[34]$5988 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[35]$5990 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[36]$5992 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[37]$5994 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[38]$5996 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[39]$5998 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[40]$6000 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[41]$6002 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[42]$6004 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[43]$6006 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[44]$6008 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[45]$6010 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[46]$6012 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[47]$6014 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[48]$6016 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[49]$6018 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[50]$6020 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[51]$6022 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[52]$6024 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[53]$6026 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[54]$6028 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[55]$6030 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[56]$6032 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[57]$6034 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[58]$6036 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[59]$6038 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[60]$6040 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[61]$6042 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[62]$6044 ($dff) from module des_top (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$1394[63]$6046 ($dff) from module des_top (removing D path).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 1536 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.30.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce -full

3.30.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][0]$3922:
      Old ports: A=4'1110, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$a$3875
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$a$3875 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$a$3875 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$a$3875 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$a$3875 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$a$3875 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][10]$3952:
      Old ports: A=4'0110, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][5]$a$3890
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][5]$a$3890 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][5]$a$3890 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][5]$a$3890 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][5]$a$3890 [0] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][11]$3955:
      Old ports: A=4'1100, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][5]$b$3891
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][5]$b$3891 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][5]$b$3891 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][5]$b$3891 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][5]$b$3891 [1] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][5]$b$3891 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][12]$3958:
      Old ports: A=4'0101, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][6]$a$3893
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][6]$a$3893 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][6]$a$3893 [1:0] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][13]$3961:
      Old ports: A=4'1001, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][6]$b$3894
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][6]$b$3894 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][6]$b$3894 [1:0] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][14]$3964:
      Old ports: A=4'0000, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$a$3896
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$a$3896 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$a$3896 [3:1] = { 2'00 $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$a$3896 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][15]$3967:
      Old ports: A=4'0111, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$b$3897
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$b$3897 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$b$3897 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$b$3897 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$b$3897 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$b$3897 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][16]$3970:
      Old ports: A=4'0100, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][8]$a$3899
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][8]$a$3899 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][8]$a$3899 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][8]$a$3899 [0] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][8]$a$3899 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][17]$3973:
      Old ports: A=4'0001, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][8]$b$3900
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][8]$b$3900 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][8]$b$3900 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][8]$b$3900 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][8]$b$3900 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][8]$b$3900 [2] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][18]$3976:
      Old ports: A=4'1110, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$a$3902
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$a$3902 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$a$3902 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$a$3902 [0] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$a$3902 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][19]$3979:
      Old ports: A=4'1000, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$b$3903
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$b$3903 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$b$3903 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$b$3903 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$b$3903 [0] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][1]$3925:
      Old ports: A=4'0100, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$b$3876
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$b$3876 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$b$3876 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$b$3876 [0] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$b$3876 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][20]$3982:
      Old ports: A=4'1101, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$a$3905
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$a$3905 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$a$3905 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$a$3905 [0] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][21]$3985:
      Old ports: A=4'0110, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$b$3906
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$b$3906 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$b$3906 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$b$3906 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$b$3906 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][22]$3988:
      Old ports: A=4'0010, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][11]$a$3908
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][11]$a$3908 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][11]$a$3908 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][23]$3991:
      Old ports: A=4'1011, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][11]$b$3909
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][11]$b$3909 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][11]$b$3909 [1:0] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][24]$3994:
      Old ports: A=4'1111, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][12]$a$3911
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][12]$a$3911 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][12]$a$3911 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][12]$a$3911 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][12]$a$3911 [1] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][25]$3997:
      Old ports: A=4'1100, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][12]$b$3912
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][12]$b$3912 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][12]$b$3912 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][12]$b$3912 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][12]$b$3912 [1] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][12]$b$3912 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][26]$4000:
      Old ports: A=4'1001, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][13]$a$3914
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][13]$a$3914 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][13]$a$3914 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][13]$a$3914 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][13]$a$3914 [0] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][27]$4003:
      Old ports: A=4'0111, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][13]$b$3915
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][13]$b$3915 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][13]$b$3915 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][13]$b$3915 [2:1] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][28]$4006:
      Old ports: A=4'0011, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$a$3917
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$a$3917 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$a$3917 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$a$3917 [2:1] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][29]$4009:
      Old ports: A=4'1010, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$b$3918
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$b$3918 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$b$3918 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$b$3918 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$b$3918 [1] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][2]$3928:
      Old ports: A=4'1101, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][1]$a$3878
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][1]$a$3878 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][1]$a$3878 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][1]$a$3878 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][1]$a$3878 [0] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][30]$4012:
      Old ports: A=4'0101, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][15]$a$3920
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][15]$a$3920 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][15]$a$3920 [3:2] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][31]$4015:
      Old ports: A=4'0000, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][15]$b$3921
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][15]$b$3921 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][15]$b$3921 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][15]$b$3921 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][15]$b$3921 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][3]$3931:
      Old ports: A=4'0001, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][1]$b$3879
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][1]$b$3879 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][1]$b$3879 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][1]$b$3879 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][1]$b$3879 [1] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][4]$3934:
      Old ports: A=4'0010, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$a$3881
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$a$3881 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$a$3881 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$a$3881 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$a$3881 [2] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][5]$3937:
      Old ports: A=4'1111, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$b$3882
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$b$3882 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$b$3882 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$b$3882 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$b$3882 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][6]$3940:
      Old ports: A=4'1011, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][3]$a$3884
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][3]$a$3884 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][3]$a$3884 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][3]$a$3884 [0] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][7]$3943:
      Old ports: A=4'1000, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][3]$b$3885
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][3]$b$3885 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][3]$b$3885 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][3]$b$3885 [2:1] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][8]$3946:
      Old ports: A=4'0011, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][4]$a$3887
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][4]$a$3887 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][4]$a$3887 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][4]$a$3887 [2:1] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][5][9]$3949:
      Old ports: A=4'1010, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][4]$b$3888
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][4]$b$3888 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][4]$b$3888 [1:0] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][0]$4239:
      Old ports: A=4'1111, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$a$4192
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$a$4192 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$a$4192 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$a$4192 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$a$4192 [2] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][10]$4269:
      Old ports: A=4'0010, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][5]$a$4207
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][5]$a$4207 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][5]$a$4207 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][11]$4272:
      Old ports: A=4'1101, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][5]$b$4208
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][5]$b$4208 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][5]$b$4208 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][5]$b$4208 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][12]$4275:
      Old ports: A=4'1100, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][6]$a$4210
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][6]$a$4210 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][6]$a$4210 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][6]$a$4210 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][6]$a$4210 [0] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][13]$4278:
      Old ports: A=4'0000, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][6]$b$4211
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][6]$b$4211 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][6]$b$4211 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][6]$b$4211 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][14]$4281:
      Old ports: A=4'0101, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$a$4213
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$a$4213 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$a$4213 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$a$4213 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$a$4213 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][15]$4284:
      Old ports: A=4'1010, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$b$4214
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$b$4214 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$b$4214 [3:2] = $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$b$4214 [1:0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][16]$4287:
      Old ports: A=4'0000, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][8]$a$4216
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][8]$a$4216 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][8]$a$4216 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][8]$a$4216 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][8]$a$4216 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][17]$4290:
      Old ports: A=4'1110, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][8]$b$4217
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][8]$b$4217 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][8]$b$4217 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][8]$b$4217 [0] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][8]$b$4217 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][18]$4293:
      Old ports: A=4'0111, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][9]$a$4219
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][9]$a$4219 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][9]$a$4219 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][9]$a$4219 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][9]$a$4219 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][19]$4296:
      Old ports: A=4'1011, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][9]$b$4220
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][9]$b$4220 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][9]$b$4220 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][9]$b$4220 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][9]$b$4220 [1] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][1]$4242:
      Old ports: A=4'0001, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$b$4193
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$b$4193 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$b$4193 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$b$4193 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$b$4193 [2] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][20]$4299:
      Old ports: A=4'1010, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [2:1] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][21]$4302:
      Old ports: A=4'0100, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$b$4223
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$b$4223 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$b$4223 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$b$4223 [0] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$b$4223 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][22]$4305:
      Old ports: A=4'1101, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][11]$a$4225
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][11]$a$4225 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][11]$a$4225 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][11]$a$4225 [0] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][23]$4308:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][11]$b$4226
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][11]$b$4226 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][11]$b$4226 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][24]$4311:
      Old ports: A=4'0101, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][12]$a$4228
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][12]$a$4228 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][12]$a$4228 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][12]$a$4228 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][12]$a$4228 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][25]$4314:
      Old ports: A=4'1000, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][12]$b$4229
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][12]$b$4229 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][12]$b$4229 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][12]$b$4229 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][12]$b$4229 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][12]$b$4229 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][26]$4317:
      Old ports: A=4'1100, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$a$4231
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$a$4231 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$a$4231 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$a$4231 [2:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$a$4231 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][27]$4320:
      Old ports: A=4'0110, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$b$4232
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$b$4232 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$b$4232 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$b$4232 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$b$4232 [0] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][28]$4323:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][14]$a$4234
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][14]$a$4234 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][14]$a$4234 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][14]$a$4234 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][29]$4326:
      Old ports: A=4'0011, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][14]$b$4235
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][14]$b$4235 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][14]$b$4235 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][14]$b$4235 [0] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][2]$4245:
      Old ports: A=4'1000, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][1]$a$4195
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][1]$a$4195 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][1]$a$4195 [1:0] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][30]$4329:
      Old ports: A=4'0010, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][15]$a$4237
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][15]$a$4237 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][15]$a$4237 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][15]$a$4237 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][15]$a$4237 [2] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][31]$4332:
      Old ports: A=4'1111, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][15]$b$4238
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][15]$b$4238 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][15]$b$4238 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][15]$b$4238 [0] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][15]$b$4238 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][3]$4248:
      Old ports: A=4'1110, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][1]$b$4196
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][1]$b$4196 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][1]$b$4196 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][1]$b$4196 [2:1] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][4]$4251:
      Old ports: A=4'0110, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][2]$a$4198
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][2]$a$4198 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][2]$a$4198 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][2]$a$4198 [0] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][5]$4254:
      Old ports: A=4'1011, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][2]$b$4199
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][2]$b$4199 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][2]$b$4199 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][2]$b$4199 [0] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][6]$4257:
      Old ports: A=4'0011, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][3]$a$4201
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][3]$a$4201 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][3]$a$4201 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][3]$a$4201 [2:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][3]$a$4201 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][7]$4260:
      Old ports: A=4'0100, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][3]$b$4202
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][3]$b$4202 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][3]$b$4202 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][3]$b$4202 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][3]$b$4202 [1] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][8]$4263:
      Old ports: A=4'1001, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][4]$a$4204
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][4]$a$4204 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][4]$a$4204 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][4]$a$4204 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][4]$a$4204 [1] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][5][9]$4266:
      Old ports: A=4'0111, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][4]$b$4205
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][4]$b$4205 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][4]$b$4205 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][4]$b$4205 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][4]$b$4205 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][0]$4556:
      Old ports: A=4'1010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$a$4509
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$a$4509 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$a$4509 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$a$4509 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][10]$4586:
      Old ports: A=4'1100, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$a$4524
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$a$4524 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$a$4524 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$a$4524 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][11]$4589:
      Old ports: A=4'0111, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$b$4525
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$b$4525 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$b$4525 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$b$4525 [2:1] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][12]$4592:
      Old ports: A=4'1011, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$a$4527
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$a$4527 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$a$4527 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$a$4527 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$a$4527 [1] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$a$4527 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][13]$4595:
      Old ports: A=4'0100, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$b$4528
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$b$4528 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$b$4528 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$b$4528 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$b$4528 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$b$4528 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$b$4528 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][14]$4598:
      Old ports: A=4'0010, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][7]$a$4530
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][7]$a$4530 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][7]$a$4530 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][7]$a$4530 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][7]$a$4530 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][15]$4601:
      Old ports: A=4'1000, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][7]$b$4531
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][7]$b$4531 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][7]$b$4531 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][7]$b$4531 [2:1] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][16]$4604:
      Old ports: A=4'1101, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][8]$a$4533
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][8]$a$4533 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][8]$a$4533 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][8]$a$4533 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][8]$a$4533 [2] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][17]$4607:
      Old ports: A=4'0110, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][8]$b$4534
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][8]$b$4534 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][8]$b$4534 [1:0] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][18]$4610:
      Old ports: A=4'0100, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][9]$a$4536
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][9]$a$4536 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][9]$a$4536 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][9]$a$4536 [0] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][19]$4613:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][9]$b$4537
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][9]$b$4537 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][9]$b$4537 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][9]$b$4537 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][1]$4559:
      Old ports: A=4'0000, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$b$4510
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$b$4510 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$b$4510 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$b$4510 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$b$4510 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][20]$4616:
      Old ports: A=4'1000, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$a$4539
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$a$4539 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$a$4539 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$a$4539 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$a$4539 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$a$4539 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][21]$4619:
      Old ports: A=4'1111, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$b$4540
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$b$4540 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$b$4540 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$b$4540 [0] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$b$4540 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][22]$4622:
      Old ports: A=4'0011, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$a$4542
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$a$4542 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$a$4542 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$a$4542 [2:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$a$4542 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][23]$4625:
      Old ports: A=4'0000, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$b$4543
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$b$4543 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$b$4543 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$b$4543 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$b$4543 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][24]$4628:
      Old ports: A=4'1011, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$a$4545
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$a$4545 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$a$4545 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$a$4545 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$a$4545 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$a$4545 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$a$4545 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][25]$4631:
      Old ports: A=4'0001, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$b$4546
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$b$4546 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$b$4546 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$b$4546 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$b$4546 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$b$4546 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][26]$4634:
      Old ports: A=4'0010, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$a$4548
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$a$4548 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$a$4548 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$a$4548 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$a$4548 [2] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][27]$4637:
      Old ports: A=4'1100, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$b$4549
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$b$4549 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$b$4549 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$b$4549 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$b$4549 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$b$4549 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$b$4549 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][28]$4640:
      Old ports: A=4'0101, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$a$4551
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$a$4551 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$a$4551 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$a$4551 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$a$4551 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][29]$4643:
      Old ports: A=4'1010, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$b$4552
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$b$4552 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$b$4552 [3:2] = $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$b$4552 [1:0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][2]$4562:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$a$4512
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$a$4512 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$a$4512 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$a$4512 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][30]$4646:
      Old ports: A=4'1110, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][15]$a$4554
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][15]$a$4554 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][15]$a$4554 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][15]$a$4554 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][15]$a$4554 [2] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][31]$4649:
      Old ports: A=4'0111, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][15]$b$4555
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][15]$b$4555 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][15]$b$4555 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][15]$b$4555 [2:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][15]$b$4555 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][3]$4565:
      Old ports: A=4'1110, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$b$4513
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$b$4513 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$b$4513 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$b$4513 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][4]$4568:
      Old ports: A=4'0110, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$a$4515
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$a$4515 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$a$4515 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$a$4515 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$a$4515 [1] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][5]$4571:
      Old ports: A=4'0011, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$b$4516
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$b$4516 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$b$4516 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$b$4516 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$b$4516 [1] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$b$4516 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][6]$4574:
      Old ports: A=4'1111, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][3]$a$4518
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][3]$a$4518 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][3]$a$4518 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][3]$a$4518 [0] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][7]$4577:
      Old ports: A=4'0101, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][3]$b$4519
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][3]$b$4519 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][3]$b$4519 [3:2] = $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][3]$b$4519 [1:0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][8]$4580:
      Old ports: A=4'0001, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][4]$a$4521
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][4]$a$4521 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][4]$a$4521 [3:2] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][5][9]$4583:
      Old ports: A=4'1101, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][4]$b$4522
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][4]$b$4522 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][4]$b$4522 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][4]$b$4522 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][0]$4873:
      Old ports: A=4'0111, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$a$4826
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$a$4826 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$a$4826 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$a$4826 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$a$4826 [0] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][10]$4903:
      Old ports: A=4'1000, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][5]$a$4841
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][5]$a$4841 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][5]$a$4841 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][5]$a$4841 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][5]$a$4841 [0] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][11]$4906:
      Old ports: A=4'0101, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][5]$b$4842
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][5]$b$4842 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][5]$b$4842 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][5]$b$4842 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][12]$4909:
      Old ports: A=4'1011, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][6]$a$4844
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][6]$a$4844 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][6]$a$4844 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][6]$a$4844 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][6]$a$4844 [1] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][13]$4912:
      Old ports: A=4'1100, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][6]$b$4845
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][6]$b$4845 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][6]$b$4845 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][6]$b$4845 [0] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][14]$4915:
      Old ports: A=4'0100, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][7]$a$4847
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][7]$a$4847 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][7]$a$4847 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][7]$a$4847 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][7]$a$4847 [1] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][15]$4918:
      Old ports: A=4'1111, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][7]$b$4848
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][7]$b$4848 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][7]$b$4848 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][7]$b$4848 [0] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][7]$b$4848 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][16]$4921:
      Old ports: A=4'1010, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$a$4850
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$a$4850 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$a$4850 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$a$4850 [2:1] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][17]$4924:
      Old ports: A=4'0110, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$b$4851
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$b$4851 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$b$4851 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$b$4851 [0] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][18]$4927:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$a$4853
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$a$4853 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$a$4853 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$a$4853 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][19]$4930:
      Old ports: A=4'0000, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$b$4854
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$b$4854 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$b$4854 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$b$4854 [0] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$b$4854 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][1]$4876:
      Old ports: A=4'1101, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$b$4827
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$b$4827 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$b$4827 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$b$4827 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][20]$4933:
      Old ports: A=4'1100, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][10]$a$4856
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][10]$a$4856 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][10]$a$4856 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][10]$a$4856 [0] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][21]$4936:
      Old ports: A=4'1011, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][10]$b$4857
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][10]$b$4857 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][10]$b$4857 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][10]$b$4857 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][10]$b$4857 [1] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][22]$4939:
      Old ports: A=4'0111, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$a$4859
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$a$4859 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$a$4859 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$a$4859 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$a$4859 [0] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][23]$4942:
      Old ports: A=4'1101, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$b$4860
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$b$4860 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$b$4860 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$b$4860 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][24]$4945:
      Old ports: A=4'1111, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][12]$a$4862
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][12]$a$4862 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][12]$a$4862 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][12]$a$4862 [0] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][12]$a$4862 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][25]$4948:
      Old ports: A=4'0001, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][12]$b$4863
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][12]$b$4863 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][12]$b$4863 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][12]$b$4863 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][12]$b$4863 [1] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][26]$4951:
      Old ports: A=4'0011, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][13]$a$4865
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][13]$a$4865 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][13]$a$4865 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][13]$a$4865 [0] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][27]$4954:
      Old ports: A=4'1110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][13]$b$4866
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][13]$b$4866 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][13]$b$4866 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][13]$b$4866 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][13]$b$4866 [1] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][28]$4957:
      Old ports: A=4'0101, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][14]$a$4868
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][14]$a$4868 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][14]$a$4868 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][14]$a$4868 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][29]$4960:
      Old ports: A=4'0010, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][14]$b$4869
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][14]$b$4869 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][14]$b$4869 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][14]$b$4869 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][2]$4879:
      Old ports: A=4'1110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][1]$a$4829
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][1]$a$4829 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][1]$a$4829 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][1]$a$4829 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][1]$a$4829 [1] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][30]$4963:
      Old ports: A=4'1000, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$a$4871
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$a$4871 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$a$4871 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$a$4871 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$a$4871 [0] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][31]$4966:
      Old ports: A=4'0100, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$b$4872
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$b$4872 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$b$4872 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$b$4872 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$b$4872 [1] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][3]$4882:
      Old ports: A=4'0011, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][1]$b$4830
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][1]$b$4830 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][1]$b$4830 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][1]$b$4830 [0] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][4]$4885:
      Old ports: A=4'0000, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$a$4832
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$a$4832 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$a$4832 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$a$4832 [0] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$a$4832 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][5]$4888:
      Old ports: A=4'0110, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$b$4833
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$b$4833 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$b$4833 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$b$4833 [0] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][6]$4891:
      Old ports: A=4'1001, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$a$4835
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$a$4835 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$a$4835 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$a$4835 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][7]$4894:
      Old ports: A=4'1010, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$b$4836
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$b$4836 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$b$4836 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$b$4836 [2:1] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][8]$4897:
      Old ports: A=4'0001, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$a$4838
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$a$4838 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$a$4838 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$a$4838 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$a$4838 [1] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][5][9]$4900:
      Old ports: A=4'0010, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$b$4839
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$b$4839 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$b$4839 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$b$4839 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][0]$5190:
      Old ports: A=4'0010, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][0]$a$5143
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][0]$a$5143 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][0]$a$5143 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][0]$a$5143 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][0]$a$5143 [2] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][10]$5220:
      Old ports: A=4'0011, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$a$5158
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$a$5158 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$a$5158 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$a$5158 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$a$5158 [2] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][11]$5223:
      Old ports: A=4'1111, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$b$5159
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$b$5159 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$b$5159 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$b$5159 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][12]$5226:
      Old ports: A=4'1101, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][6]$a$5161
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][6]$a$5161 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][6]$a$5161 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][6]$a$5161 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][6]$a$5161 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][13]$5229:
      Old ports: A=4'0000, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][6]$b$5162
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][6]$b$5162 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][6]$b$5162 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][6]$b$5162 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][14]$5232:
      Old ports: A=4'1110, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$a$5164
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$a$5164 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$a$5164 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$a$5164 [0] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$a$5164 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][15]$5235:
      Old ports: A=4'1001, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$b$5165
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$b$5165 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$b$5165 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$b$5165 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$b$5165 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][16]$5238:
      Old ports: A=4'0100, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][8]$a$5167
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][8]$a$5167 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][8]$a$5167 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][8]$a$5167 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][8]$a$5167 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][8]$a$5167 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][8]$a$5167 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][17]$5241:
      Old ports: A=4'0010, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][8]$b$5168
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][8]$b$5168 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][8]$b$5168 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][8]$b$5168 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][8]$b$5168 [0] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][18]$5244:
      Old ports: A=4'0001, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][9]$a$5170
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][9]$a$5170 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][9]$a$5170 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][9]$a$5170 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][9]$a$5170 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][9]$a$5170 [2] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][19]$5247:
      Old ports: A=4'1011, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][9]$b$5171
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][9]$b$5171 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][9]$b$5171 [1:0] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][1]$5193:
      Old ports: A=4'1100, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][0]$b$5144
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][0]$b$5144 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][0]$b$5144 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][0]$b$5144 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][0]$b$5144 [1] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][0]$b$5144 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][20]$5250:
      Old ports: A=4'1010, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][10]$a$5173
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][10]$a$5173 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][10]$a$5173 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][10]$a$5173 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][21]$5253:
      Old ports: A=4'1101, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][10]$b$5174
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][10]$b$5174 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][10]$b$5174 [3:2] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][22]$5256:
      Old ports: A=4'0111, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][11]$a$5176
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][11]$a$5176 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][11]$a$5176 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][11]$a$5176 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][23]$5259:
      Old ports: A=4'1000, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][11]$b$5177
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][11]$b$5177 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][11]$b$5177 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][11]$b$5177 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][24]$5262:
      Old ports: A=4'1111, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$a$5179
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$a$5179 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$a$5179 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$a$5179 [0] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][25]$5265:
      Old ports: A=4'1001, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$b$5180
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$b$5180 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$b$5180 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$b$5180 [0] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$b$5180 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][26]$5268:
      Old ports: A=4'1100, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$a$5182
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$a$5182 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$a$5182 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$a$5182 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$a$5182 [2] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][27]$5271:
      Old ports: A=4'0101, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$b$5183
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$b$5183 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$b$5183 [1:0] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][28]$5274:
      Old ports: A=4'0110, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][14]$a$5185
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][14]$a$5185 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][14]$a$5185 [1:0] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][29]$5277:
      Old ports: A=4'0011, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][14]$b$5186
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][14]$b$5186 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][14]$b$5186 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][14]$b$5186 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][14]$b$5186 [1] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][14]$b$5186 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][2]$5196:
      Old ports: A=4'0100, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][1]$a$5146
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][1]$a$5146 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][1]$a$5146 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][1]$a$5146 [0] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][30]$5280:
      Old ports: A=4'0000, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][15]$a$5188
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][15]$a$5188 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][15]$a$5188 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][15]$a$5188 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][31]$5283:
      Old ports: A=4'1110, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][15]$b$5189
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][15]$b$5189 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][15]$b$5189 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][15]$b$5189 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][15]$b$5189 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][15]$b$5189 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][3]$5199:
      Old ports: A=4'0001, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][1]$b$5147
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][1]$b$5147 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][1]$b$5147 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][1]$b$5147 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][1]$b$5147 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][1]$b$5147 [2] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][4]$5202:
      Old ports: A=4'0111, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][2]$a$5149
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][2]$a$5149 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][2]$a$5149 [3:1] = { 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][2]$a$5149 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][5]$5205:
      Old ports: A=4'1010, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][2]$b$5150
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][2]$b$5150 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][2]$b$5150 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][2]$b$5150 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][2]$b$5150 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][6]$5208:
      Old ports: A=4'1011, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][3]$a$5152
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][3]$a$5152 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][3]$a$5152 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][3]$a$5152 [0] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][7]$5211:
      Old ports: A=4'0110, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][3]$b$5153
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][3]$b$5153 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][3]$b$5153 [3:2] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][3]$b$5153 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][8]$5214:
      Old ports: A=4'1000, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$a$5155
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$a$5155 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$a$5155 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$a$5155 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$a$5155 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][5][9]$5217:
      Old ports: A=4'0101, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$b$5156
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$b$5156 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$b$5156 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$b$5156 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][0]$5507:
      Old ports: A=4'1100, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [0] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][10]$5537:
      Old ports: A=4'0011, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][5]$a$5475
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][5]$a$5475 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][5]$a$5475 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][5]$a$5475 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][5]$a$5475 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][11]$5540:
      Old ports: A=4'0100, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][5]$b$5476
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][5]$b$5476 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][5]$b$5476 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][5]$b$5476 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][5]$b$5476 [1] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][12]$5543:
      Old ports: A=4'1110, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][6]$a$5478
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][6]$a$5478 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][6]$a$5478 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][6]$a$5478 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][6]$a$5478 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][6]$a$5478 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][13]$5546:
      Old ports: A=4'0111, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][6]$b$5479
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][6]$b$5479 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][6]$b$5479 [1:0] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][14]$5549:
      Old ports: A=4'0101, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][7]$a$5481
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][7]$a$5481 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][7]$a$5481 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][7]$a$5481 [0] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][15]$5552:
      Old ports: A=4'1011, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][7]$b$5482
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][7]$b$5482 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][7]$b$5482 [3:1] = { 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][7]$b$5482 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][16]$5555:
      Old ports: A=4'1001, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][8]$a$5484
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][8]$a$5484 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][8]$a$5484 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][8]$a$5484 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][8]$a$5484 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][8]$a$5484 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][17]$5558:
      Old ports: A=4'1110, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][8]$b$5485
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][8]$b$5485 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][8]$b$5485 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][8]$b$5485 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][8]$b$5485 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][8]$b$5485 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][18]$5561:
      Old ports: A=4'1111, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][9]$a$5487
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][9]$a$5487 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][9]$a$5487 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][9]$a$5487 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][9]$a$5487 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][19]$5564:
      Old ports: A=4'0101, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][9]$b$5488
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][9]$b$5488 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][9]$b$5488 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][9]$b$5488 [2:1] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][1]$5510:
      Old ports: A=4'0001, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$b$5461
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$b$5461 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$b$5461 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$b$5461 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$b$5461 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$b$5461 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][20]$5567:
      Old ports: A=4'0010, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][10]$a$5490
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][10]$a$5490 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][10]$a$5490 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][10]$a$5490 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][21]$5570:
      Old ports: A=4'1000, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][10]$b$5491
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][10]$b$5491 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][10]$b$5491 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][10]$b$5491 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][10]$b$5491 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][22]$5573:
      Old ports: A=4'1100, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][11]$a$5493
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][11]$a$5493 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][11]$a$5493 [3:1] = { 2'11 $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][11]$a$5493 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][23]$5576:
      Old ports: A=4'0011, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][11]$b$5494
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][11]$b$5494 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][11]$b$5494 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][11]$b$5494 [2:1] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][24]$5579:
      Old ports: A=4'0111, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][12]$a$5496
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][12]$a$5496 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][12]$a$5496 [1:0] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][25]$5582:
      Old ports: A=4'0000, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][12]$b$5497
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][12]$b$5497 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][12]$b$5497 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][12]$b$5497 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][12]$b$5497 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][12]$b$5497 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][26]$5585:
      Old ports: A=4'0100, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][13]$a$5499
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][13]$a$5499 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][13]$a$5499 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][13]$a$5499 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][13]$a$5499 [1] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][27]$5588:
      Old ports: A=4'1010, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][13]$b$5500
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][13]$b$5500 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][13]$b$5500 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][13]$b$5500 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][13]$b$5500 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][28]$5591:
      Old ports: A=4'0001, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][14]$a$5502
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][14]$a$5502 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][14]$a$5502 [3:2] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][14]$a$5502 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][29]$5594:
      Old ports: A=4'1101, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][14]$b$5503
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][14]$b$5503 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][14]$b$5503 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][14]$b$5503 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][14]$b$5503 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][2]$5513:
      Old ports: A=4'1010, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][1]$a$5463
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][1]$a$5463 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][1]$a$5463 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][1]$a$5463 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][1]$a$5463 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][30]$5597:
      Old ports: A=4'1011, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][15]$a$5505
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][15]$a$5505 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][15]$a$5505 [3:1] = { 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][15]$a$5505 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][31]$5600:
      Old ports: A=4'0110, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][15]$b$5506
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][15]$b$5506 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][15]$b$5506 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][15]$b$5506 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][3]$5516:
      Old ports: A=4'1111, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][1]$b$5464
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][1]$b$5464 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][1]$b$5464 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][1]$b$5464 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][1]$b$5464 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][4]$5519:
      Old ports: A=4'1001, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][2]$a$5466
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][2]$a$5466 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][2]$a$5466 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][2]$a$5466 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][2]$a$5466 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][2]$a$5466 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][5]$5522:
      Old ports: A=4'0010, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][2]$b$5467
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][2]$b$5467 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][2]$b$5467 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][2]$b$5467 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][2]$b$5467 [2] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][6]$5525:
      Old ports: A=4'0110, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][3]$a$5469
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][3]$a$5469 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][3]$a$5469 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][3]$a$5469 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][3]$a$5469 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][7]$5528:
      Old ports: A=4'1000, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][3]$b$5470
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][3]$b$5470 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][3]$b$5470 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][3]$b$5470 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][3]$b$5470 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][8]$5531:
      Old ports: A=4'0000, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][4]$a$5472
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][4]$a$5472 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][4]$a$5472 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][4]$a$5472 [0] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][4]$a$5472 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][5][9]$5534:
      Old ports: A=4'1101, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][4]$b$5473
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][4]$b$5473 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][4]$b$5473 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][4]$b$5473 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][4]$b$5473 [2] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][0]$5824:
      Old ports: A=4'0100, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$a$5777
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$a$5777 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$a$5777 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$a$5777 [0] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][10]$5854:
      Old ports: A=4'1001, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][5]$a$5792
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][5]$a$5792 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][5]$a$5792 [1:0] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][11]$5857:
      Old ports: A=4'0111, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][5]$b$5793
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][5]$b$5793 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][5]$b$5793 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][5]$b$5793 [2:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][5]$b$5793 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][12]$5860:
      Old ports: A=4'0101, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][6]$a$5795
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][6]$a$5795 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][6]$a$5795 [3:2] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][6]$a$5795 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][13]$5863:
      Old ports: A=4'1010, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][6]$b$5796
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][6]$b$5796 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][6]$b$5796 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][6]$b$5796 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][14]$5866:
      Old ports: A=4'0110, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$a$5798
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$a$5798 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$a$5798 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$a$5798 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$a$5798 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$a$5798 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][15]$5869:
      Old ports: A=4'0001, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$b$5799
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$b$5799 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$b$5799 [3:2] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$b$5799 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][16]$5872:
      Old ports: A=4'0001, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][8]$a$5801
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][8]$a$5801 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][8]$a$5801 [3:2] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][8]$a$5801 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][17]$5875:
      Old ports: A=4'0100, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][8]$b$5802
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][8]$b$5802 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][8]$b$5802 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][8]$b$5802 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][8]$b$5802 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][8]$b$5802 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][8]$b$5802 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][18]$5878:
      Old ports: A=4'1011, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$a$5804
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$a$5804 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$a$5804 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$a$5804 [0] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][19]$5881:
      Old ports: A=4'1101, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$b$5805
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$b$5805 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$b$5805 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$b$5805 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][1]$5827:
      Old ports: A=4'1011, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$b$5778
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$b$5778 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$b$5778 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$b$5778 [0] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$b$5778 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][20]$5884:
      Old ports: A=4'1100, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][10]$a$5807
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][10]$a$5807 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][10]$a$5807 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][10]$a$5807 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][10]$a$5807 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][10]$a$5807 [2] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][21]$5887:
      Old ports: A=4'0011, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][10]$b$5808
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][10]$b$5808 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][10]$b$5808 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][10]$b$5808 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][10]$b$5808 [1] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][10]$b$5808 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][22]$5890:
      Old ports: A=4'0111, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$a$5810
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$a$5810 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$a$5810 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$a$5810 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$a$5810 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][23]$5893:
      Old ports: A=4'1110, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$b$5811
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$b$5811 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$b$5811 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$b$5811 [2:1] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][24]$5896:
      Old ports: A=4'1010, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][12]$a$5813
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][12]$a$5813 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][12]$a$5813 [3:2] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][25]$5899:
      Old ports: A=4'1111, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][12]$b$5814
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][12]$b$5814 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][12]$b$5814 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][12]$b$5814 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][12]$b$5814 [1] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][26]$5902:
      Old ports: A=4'0110, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$a$5816
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$a$5816 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$a$5816 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$a$5816 [0] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$a$5816 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][27]$5905:
      Old ports: A=4'1000, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$b$5817
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$b$5817 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$b$5817 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$b$5817 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$b$5817 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][28]$5908:
      Old ports: A=4'0000, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][14]$a$5819
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][14]$a$5819 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][14]$a$5819 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][14]$a$5819 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][14]$a$5819 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][14]$a$5819 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][29]$5911:
      Old ports: A=4'0101, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][14]$b$5820
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][14]$b$5820 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][14]$b$5820 [3:2] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][14]$b$5820 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][2]$5830:
      Old ports: A=4'0010, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$a$5780
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$a$5780 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$a$5780 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$a$5780 [0] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][30]$5914:
      Old ports: A=4'1001, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][15]$a$5822
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][15]$a$5822 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][15]$a$5822 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][15]$a$5822 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][15]$a$5822 [0] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][31]$5917:
      Old ports: A=4'0010, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][15]$b$5823
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][15]$b$5823 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][15]$b$5823 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][15]$b$5823 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][15]$b$5823 [2] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][3]$5833:
      Old ports: A=4'1110, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$b$5781
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$b$5781 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$b$5781 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$b$5781 [2:1] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][4]$5836:
      Old ports: A=4'1111, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$a$5783
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$a$5783 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$a$5783 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$a$5783 [0] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$a$5783 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][5]$5839:
      Old ports: A=4'0000, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$b$5784
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$b$5784 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$b$5784 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$b$5784 [0] 2'00 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][6]$5842:
      Old ports: A=4'1000, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][3]$a$5786
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][3]$a$5786 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][3]$a$5786 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][3]$a$5786 [2:1] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][7]$5845:
      Old ports: A=4'1101, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][3]$b$5787
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][3]$b$5787 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][3]$b$5787 [3:2] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][3]$b$5787 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][8]$5848:
      Old ports: A=4'0011, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$a$5789
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$a$5789 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$a$5789 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$a$5789 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$a$5789 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$a$5789 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][5][9]$5851:
      Old ports: A=4'1100, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$b$5790
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$b$5790 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$b$5790 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$b$5790 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$b$5790 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$b$5790 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$b$5790 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][0]$6141:
      Old ports: A=4'1101, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$a$6094
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$a$6094 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$a$6094 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$a$6094 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$a$6094 [2] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][10]$6171:
      Old ports: A=4'0011, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$a$6109
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$a$6109 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$a$6109 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$a$6109 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$a$6109 [1] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][11]$6174:
      Old ports: A=4'1110, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$b$6110
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$b$6110 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$b$6110 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$b$6110 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$b$6110 [1] } = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][12]$6177:
      Old ports: A=4'0101, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$a$6112
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$a$6112 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$a$6112 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$a$6112 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][13]$6180:
      Old ports: A=4'0000, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$b$6113
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$b$6113 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$b$6113 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$b$6113 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$b$6113 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$b$6113 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][14]$6183:
      Old ports: A=4'1100, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][7]$a$6115
      New ports: A=2'10, B=2'01, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][7]$a$6115 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][7]$a$6115 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][7]$a$6115 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][7]$a$6115 [1] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][15]$6186:
      Old ports: A=4'0111, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][7]$b$6116
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][7]$b$6116 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][7]$b$6116 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][7]$b$6116 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][16]$6189:
      Old ports: A=4'0111, B=4'0010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][8]$a$6118
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][8]$a$6118 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][8]$a$6118 [3:1] = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][8]$a$6118 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][17]$6192:
      Old ports: A=4'1011, B=4'0001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][8]$b$6119
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][8]$b$6119 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][8]$b$6119 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][8]$b$6119 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][8]$b$6119 [1] 2'01 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][18]$6195:
      Old ports: A=4'0100, B=4'1110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][9]$a$6121
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][9]$a$6121 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][9]$a$6121 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][9]$a$6121 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][9]$a$6121 [1] 2'10 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][19]$6198:
      Old ports: A=4'0001, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][9]$b$6122
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][9]$b$6122 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][9]$b$6122 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][9]$b$6122 [0] } = { 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][9]$b$6122 [1] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][1]$6144:
      Old ports: A=4'0010, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$b$6095
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$b$6095 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$b$6095 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$b$6095 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$b$6095 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][20]$6201:
      Old ports: A=4'1001, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][10]$a$6124
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][10]$a$6124 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][10]$a$6124 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][10]$a$6124 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][10]$a$6124 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][10]$a$6124 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][21]$6204:
      Old ports: A=4'1100, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][10]$b$6125
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][10]$b$6125 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][10]$b$6125 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][10]$b$6125 [0] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][22]$6207:
      Old ports: A=4'1110, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][11]$a$6127
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][11]$a$6127 [1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][11]$a$6127 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][11]$a$6127 [0] } = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][11]$a$6127 [1] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][23]$6210:
      Old ports: A=4'0010, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][11]$b$6128
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][11]$b$6128 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][11]$b$6128 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][11]$b$6128 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][11]$b$6128 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][24]$6213:
      Old ports: A=4'0000, B=4'1111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][12]$a$6130
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][12]$a$6130 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][12]$a$6130 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][12]$a$6130 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][12]$a$6130 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][12]$a$6130 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][25]$6216:
      Old ports: A=4'0110, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][12]$b$6131
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][12]$b$6131 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][12]$b$6131 [1] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][12]$b$6131 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][12]$b$6131 [0] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][26]$6219:
      Old ports: A=4'1010, B=4'1001, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][13]$a$6133
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][13]$a$6133 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][13]$a$6133 [3:2] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][27]$6222:
      Old ports: A=4'1101, B=4'0000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][13]$b$6134
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][13]$b$6134 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][13]$b$6134 [3:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][13]$b$6134 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][13]$b$6134 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][28]$6225:
      Old ports: A=4'1111, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$a$6136
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$a$6136 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$a$6136 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$a$6136 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$a$6136 [2] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][29]$6228:
      Old ports: A=4'0011, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$b$6137
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$b$6137 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$b$6137 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$b$6137 [0] } = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][2]$6147:
      Old ports: A=4'1000, B=4'1101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][1]$a$6097
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][1]$a$6097 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][1]$a$6097 [3:1] = { 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][1]$a$6097 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][30]$6231:
      Old ports: A=4'0101, B=4'0110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][15]$a$6139
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][15]$a$6139 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][15]$a$6139 [3:2] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][31]$6234:
      Old ports: A=4'1000, B=4'1011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][15]$b$6140
      New ports: A=1'0, B=1'1, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][15]$b$6140 [0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][15]$b$6140 [3:1] = { 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][15]$b$6140 [0] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][3]$6150:
      Old ports: A=4'0100, B=4'1000, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][1]$b$6098
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][1]$b$6098 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][1]$b$6098 [1:0] = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][4]$6153:
      Old ports: A=4'0110, B=4'1010, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$a$6100
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$a$6100 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$a$6100 [1:0] = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][5]$6156:
      Old ports: A=4'1111, B=4'0011, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$b$6101
      New ports: A=1'1, B=1'0, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$b$6101 [2]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$b$6101 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$b$6101 [1:0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$b$6101 [2] 2'11 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][6]$6159:
      Old ports: A=4'1011, B=4'0111, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][3]$a$6103
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][3]$a$6103 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][3]$a$6103 [1:0] = 2'11
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][7]$6162:
      Old ports: A=4'0001, B=4'0100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][3]$b$6104
      New ports: A=2'01, B=2'10, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][3]$b$6104 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][3]$b$6104 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][3]$b$6104 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][3]$b$6104 [1] } = 2'00
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][8]$6165:
      Old ports: A=4'1010, B=4'1100, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][4]$a$6106
      New ports: A=2'01, B=2'10, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][4]$a$6106 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][4]$a$6106 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][4]$a$6106 [0] } = 2'10
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][5][9]$6168:
      Old ports: A=4'1001, B=4'0101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][4]$b$6107
      New ports: A=2'10, B=2'01, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][4]$b$6107 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][4]$b$6107 [1:0] = 2'01
  Optimizing cells in module \des_top.
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$3874:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$a$3875, B=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$b$3876, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][0]$a$3851
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$a$3875 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$a$3875 [1] 1'0 }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$b$3876 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][0]$b$3876 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][0]$a$3851 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][0]$a$3851 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][0]$a$3851 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$3904:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$a$3905, B=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$b$3906, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][5]$a$3866
      New ports: A={ 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$a$3905 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$b$3906 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][10]$b$3906 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][5]$a$3866 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][5]$a$3866 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][5]$a$3866 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$3916:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$a$3917, B=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$b$3918, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][7]$a$3872
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$a$3917 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$a$3917 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$b$3918 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][14]$b$3918 [1] 1'0 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][7]$a$3872 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][7]$a$3872 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][7]$a$3872 [2] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$3880:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$a$3881, B=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$b$3882, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][1]$a$3854
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$a$3881 [2] 1'0 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$b$3882 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][2]$b$3882 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][1]$a$3854 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][1]$a$3854 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][1]$a$3854 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][1]$a$3854 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][1]$a$3854 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][4]$3886:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][4]$a$3887, B=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][4]$b$3888, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][2]$a$3857
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][4]$a$3887 [3] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][4]$a$3887 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][4]$b$3888 [3:2] 1'0 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][2]$a$3857 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][2]$a$3857 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][2]$a$3857 [1] = 1'1
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][6]$3892:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][6]$a$3893, B=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][6]$b$3894, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][3]$a$3860
      New ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][6]$a$3893 [3:2], B=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][6]$b$3894 [3:2], Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][3]$a$3860 [3:2]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][3]$a$3860 [1:0] = 2'01
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$3895:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$a$3896, B=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$b$3897, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][3]$b$3861
      New ports: A={ 2'00 $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$a$3896 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$b$3897 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$b$3897 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][7]$b$3897 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][3]$b$3861 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][3]$b$3861 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][3]$b$3861 [1] = $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][3]$b$3861 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$3901:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$a$3902, B=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$b$3903, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][4]$b$3864
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$a$3902 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$a$3902 [1] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$b$3903 [3] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][4][9]$b$3903 [1] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][4]$b$3864 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1373$rdmux[0][3][4]$b$3864 [0] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$4191:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$a$4192, B=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$b$4193, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][0]$a$4168
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$a$4192 [2] 1'1 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][0]$b$4193 [2] 1'0 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][0]$a$4168 [2:1]
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][0]$a$4168 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][0]$a$4168 [0] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][0]$a$4168 [2] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$4230:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$a$4231, B=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$b$4232, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][6]$b$4187
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$a$4231 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$a$4231 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$a$4231 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$b$4232 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][13]$b$4232 [1] 1'0 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][6]$b$4187 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][6]$b$4187 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][6]$b$4187 [2] = 1'1
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][2]$4197:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][2]$a$4198, B=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][2]$b$4199, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][1]$a$4171
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][2]$a$4198 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][2]$b$4199 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][1]$a$4171 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][1]$a$4171 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][1]$a$4171 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][1]$a$4171 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][1]$a$4171 [0] 1'1 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$4212:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$a$4213, B=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$b$4214, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][3]$b$4178
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$a$4213 [2:1] 1'1 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$b$4214 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][7]$b$4214 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][3]$b$4178 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][3]$b$4178 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][3]$b$4178 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$4508:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$a$4509, B=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$b$4510, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][0]$a$4485
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$a$4509 [1:0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$b$4510 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][0]$b$4510 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][0]$a$4485 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][0]$a$4485 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][0]$a$4485 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][0]$a$4485 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$4538:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$a$4539, B=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$b$4540, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][5]$a$4500
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$a$4539 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$a$4539 [1] 1'0 }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][10]$b$4540 [1] 1'1 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][5]$a$4500 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][5]$a$4500 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][5]$a$4500 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][5]$a$4500 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$4541:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$a$4542, B=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$b$4543, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][5]$b$4501
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$a$4542 [3] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$a$4542 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$b$4543 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][11]$b$4543 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][5]$b$4501 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][5]$b$4501 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][5]$b$4501 [1] = $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][5]$b$4501 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$4544:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$a$4545, B=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$b$4546, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][6]$a$4503
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$a$4545 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$a$4545 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$a$4545 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$b$4546 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][12]$b$4546 [1] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][6]$a$4503 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][6]$a$4503 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][6]$a$4503 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$4547:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$a$4548, B=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$b$4549, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][6]$b$4504
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$a$4548 [2] 2'10 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$b$4549 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$b$4549 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][13]$b$4549 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][6]$b$4504 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][6]$b$4504 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][6]$b$4504 [2]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$4550:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$a$4551, B=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$b$4552, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][7]$a$4506
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$a$4551 [2:1] 1'1 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$b$4552 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][14]$b$4552 [1:0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][7]$a$4506 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][7]$a$4506 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][7]$a$4506 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$4511:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$a$4512, B=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$b$4513, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][0]$b$4486
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$a$4512 [0] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$a$4512 [0] }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][1]$b$4513 [1:0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][0]$b$4486 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][0]$b$4486 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][0]$b$4486 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][0]$b$4486 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$4514:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$a$4515, B=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$b$4516, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][1]$a$4488
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$a$4515 [2] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$a$4515 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$b$4516 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$b$4516 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][2]$b$4516 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][1]$a$4488 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][1]$a$4488 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$4523:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$a$4524, B=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$b$4525, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][2]$b$4492
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$a$4524 [3] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$a$4524 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$b$4525 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][5]$b$4525 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][2]$b$4492 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][2]$b$4492 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][2]$b$4492 [2] = 1'1
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$4526:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$a$4527, B=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$b$4528, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][3]$a$4494
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$a$4527 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$a$4527 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$b$4528 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$b$4528 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][6]$b$4528 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][3]$a$4494 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][3]$a$4494 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][3]$a$4494 [1] = $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][3]$a$4494 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][9]$4535:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][9]$a$4536, B=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][9]$b$4537, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][4]$b$4498
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][9]$a$4536 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][4][9]$b$4537 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][4]$b$4498 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][4]$b$4498 [0] }
      New connections: { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][4]$b$4498 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][4]$b$4498 [1] } = { $memory$auto$memory_bmux2rom.cc:63:execute$1379$rdmux[0][3][4]$b$4498 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$4825:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$a$4826, B=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$b$4827, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][0]$a$4802
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$a$4826 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$a$4826 [1] 1'1 }, B={ 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][0]$b$4827 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][0]$a$4802 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][0]$a$4802 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][0]$a$4802 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][0]$a$4802 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$4858:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$a$4859, B=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$b$4860, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][5]$b$4818
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$a$4859 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$a$4859 [1] 1'1 }, B={ 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][11]$b$4860 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][5]$b$4818 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][5]$b$4818 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][5]$b$4818 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][5]$b$4818 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$4870:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$a$4871, B=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$b$4872, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][7]$b$4824
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$a$4871 [3] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$a$4871 [1] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$b$4872 [1] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][15]$b$4872 [1] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][7]$b$4824 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][7]$b$4824 [0] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$4831:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$a$4832, B=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$b$4833, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][1]$a$4805
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$a$4832 [1] 1'0 }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][2]$b$4833 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][1]$a$4805 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][1]$a$4805 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][1]$a$4805 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][1]$a$4805 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$4834:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$a$4835, B=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$b$4836, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][1]$b$4806
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$a$4835 [0] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$a$4835 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$b$4836 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][3]$b$4836 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][1]$b$4806 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][1]$b$4806 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][1]$b$4806 [2] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$4837:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$a$4838, B=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$b$4839, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][2]$a$4808
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$a$4838 [2] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$a$4838 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$b$4839 [0] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][4]$b$4839 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][2]$a$4808 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][2]$a$4808 [3] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$4849:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$a$4850, B=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$b$4851, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][4]$a$4814
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$a$4850 [3] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$a$4850 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$b$4851 [0] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][8]$b$4851 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][4]$a$4814 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][4]$a$4814 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][4]$a$4814 [1] = 1'1
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$4852:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$a$4853, B=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$b$4854, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][4]$b$4815
      New ports: A={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$a$4853 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][4][9]$b$4854 [1] 1'0 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][4]$b$4815 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][4]$b$4815 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][4]$b$4815 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1382$rdmux[0][3][4]$b$4815 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][11]$5175:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][11]$a$5176, B=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][11]$b$5177, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][5]$b$5135
      New ports: A={ 2'01 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][11]$a$5176 [0] }, B={ 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][11]$b$5177 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][5]$b$5135 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][5]$b$5135 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][5]$b$5135 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][5]$b$5135 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$5178:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$a$5179, B=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$b$5180, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][6]$a$5137
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$a$5179 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][12]$b$5180 [1] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][6]$a$5137 [1:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][6]$a$5137 [3:2] = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][6]$a$5137 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][6]$a$5137 [1] }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$5181:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$a$5182, B=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$b$5183, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][6]$b$5138
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$a$5182 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$a$5182 [2] 1'0 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][13]$b$5183 [3:2] 1'1 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][6]$b$5138 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][6]$b$5138 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][6]$b$5138 [1] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$5154:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$a$5155, B=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$b$5156, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][2]$a$5125
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$a$5155 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$a$5155 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][4]$b$5156 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][2]$a$5125 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][2]$a$5125 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][2]$a$5125 [2:1] = { $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][2]$a$5125 [0] 1'0 }
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$5157:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$a$5158, B=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$b$5159, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][2]$b$5126
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$a$5158 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$a$5158 [2] 1'1 }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$b$5159 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][5]$b$5159 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][2]$b$5126 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][2]$b$5126 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][2]$b$5126 [1] = 1'1
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$5163:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$a$5164, B=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$b$5165, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][3]$b$5129
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$a$5164 [1] 1'0 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$b$5165 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][4][7]$b$5165 [1:0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][3]$b$5129 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][3]$b$5129 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][3]$b$5129 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$1385$rdmux[0][3][3]$b$5129 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$5776:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$a$5777, B=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$b$5778, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][0]$a$5753
      New ports: A={ 2'10 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$a$5777 [0] }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$b$5778 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][0]$b$5778 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][0]$a$5753 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][0]$a$5753 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][0]$a$5753 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$5809:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$a$5810, B=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$b$5811, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][5]$b$5769
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$a$5810 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$a$5810 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$a$5810 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$b$5811 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][11]$b$5811 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][5]$b$5769 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][5]$b$5769 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][5]$b$5769 [1] = 1'1
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$5815:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$a$5816, B=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$b$5817, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][6]$b$5772
      New ports: A={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$a$5816 [1] 1'0 }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$b$5817 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][13]$b$5817 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][6]$b$5772 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][6]$b$5772 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][6]$b$5772 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][6]$b$5772 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$5779:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$a$5780, B=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$b$5781, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][0]$b$5754
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$a$5780 [0] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$a$5780 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$b$5781 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][1]$b$5781 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][0]$b$5754 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][0]$b$5754 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][0]$b$5754 [1] = 1'1
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$5782:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$a$5783, B=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$b$5784, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][1]$a$5756
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$a$5783 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$a$5783 [0] }, B={ 2'00 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][2]$b$5784 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][1]$a$5756 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][1]$a$5756 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][1]$a$5756 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$5788:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$a$5789, B=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$b$5790, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][2]$a$5759
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$a$5789 [2] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$a$5789 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$b$5790 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$b$5790 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][4]$b$5790 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][2]$a$5759 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][2]$a$5759 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][2]$a$5759 [2]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][6]$5794:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][6]$a$5795, B=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][6]$b$5796, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][3]$a$5762
      New ports: A={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][6]$a$5795 [1:0] }, B={ 2'11 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][6]$b$5796 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][3]$a$5762 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][3]$a$5762 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][3]$a$5762 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][3]$a$5762 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$5797:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$a$5798, B=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$b$5799, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][3]$b$5763
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$a$5798 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$a$5798 [1] 1'0 }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][7]$b$5799 [1:0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][3]$b$5763 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][3]$b$5763 [1:0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][3]$b$5763 [2] = $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][3]$b$5763 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$5803:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$a$5804, B=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$b$5805, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][4]$b$5766
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$a$5804 [2:1] 1'1 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$b$5805 [0] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][4][9]$b$5805 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][4]$b$5766 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1391$rdmux[0][3][4]$b$5766 [3] = 1'1
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$6093:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$a$6094, B=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$b$6095, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][0]$a$6070
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$a$6094 [2] 2'01 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$b$6095 [0] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$b$6095 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][0]$a$6070 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][0]$a$6070 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][0]$a$6070 [2]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$6135:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$a$6136, B=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$b$6137, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][7]$a$6091
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$a$6136 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$a$6136 [2] 1'1 }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][14]$b$6137 [2:1] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][7]$a$6091 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][7]$a$6091 [0] = 1'1
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][1]$6096:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][1]$a$6097, B=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][1]$b$6098, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][0]$b$6071
      New ports: A={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][1]$a$6097 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][1]$a$6097 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][1]$b$6098 [3:2] 1'0 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][0]$b$6071 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][0]$b$6071 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][0]$b$6071 [1] = 1'0
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$6099:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$a$6100, B=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$b$6101, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][1]$a$6073
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$a$6100 [3:2] 1'0 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$b$6101 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][2]$b$6101 [2] 1'1 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][1]$a$6073 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][1]$a$6073 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][1]$a$6073 [1] = 1'1
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$6108:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$a$6109, B=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$b$6110, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][2]$b$6077
      New ports: A={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$a$6109 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$a$6109 [0] }, B={ 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$b$6110 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][5]$b$6110 [0] }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][2]$b$6077 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][2]$b$6077 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][2]$b$6077 [1] = 1'1
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$6111:
      Old ports: A=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$a$6112, B=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$b$6113, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][3]$a$6079
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$a$6112 [0] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$a$6112 [0] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$b$6113 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][6]$b$6113 [1] 1'0 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][3]$a$6079 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][3]$a$6079 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][3]$a$6079 [1]
  Optimizing cells in module \des_top.
Performed a total of 308 changes.

yosys> opt_merge

3.30.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~678 debug messages>
Removed a total of 226 cells.

yosys> opt_share

3.30.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 226 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~16 debug messages>

3.30.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~26 debug messages>

yosys> opt_reduce -full

3.30.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][12]$4227:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [0] 1'1 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [0] 1'0 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][6]$a$4186
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [0] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [3] 1'1 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [0] 1'0 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][6]$a$4186 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][6]$a$4186 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][6]$a$4186 [1] = $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [0]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][1]$4194:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [0] 2'00 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [3] 2'11 $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][0]$b$4169
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [0] 2'00 }, B={ 2'11 $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [0] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][0]$b$4169 [2:0]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][3][0]$b$4169 [3] = $memory$auto$memory_bmux2rom.cc:63:execute$1376$rdmux[0][4][10]$a$4222 [3]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][10]$5489:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [1] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2:1] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2:1] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [1] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][3][5]$a$5451
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [1] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2:1] 1'0 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][3][5]$a$5451 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][3][5]$a$5451 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][13]$5498:
      Old ports: A={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [1] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2:1] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [1] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][3][6]$b$5455
      New ports: A={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2] 1'0 }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2:1] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][3][6]$b$5455 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][3][6]$b$5455 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][3]$5468:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2:1] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2:1] 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [1] }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][3][1]$b$5440
      New ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [1] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2] $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2] }, B={ $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [2:1] 1'0 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][3][1]$b$5440 [3:1]
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][3][1]$b$5440 [0] = $memory$auto$memory_bmux2rom.cc:63:execute$1388$rdmux[0][4][0]$a$5460 [1]
    Consolidated identical input bits for $mux cell $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][9]$6120:
      Old ports: A={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$b$6095 [3] 1'1 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$b$6095 [3] 1'0 }, B={ 1'0 $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$b$6095 [3] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][4][0]$b$6095 [3] 1'1 }, Y=$memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][4]$b$6083
      New ports: A={ \des.rd1.KER [0] 2'10 }, B={ 1'0 \des.rd1.KER [0] 1'1 }, Y={ $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][4]$b$6083 [3:2] $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][4]$b$6083 [0] }
      New connections: $memory$auto$memory_bmux2rom.cc:63:execute$1394$rdmux[0][3][4]$b$6083 [1] = \des.rd1.KER [0]
  Optimizing cells in module \des_top.
Performed a total of 6 changes.

yosys> opt_merge

3.30.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.30.22. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 9 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.30.26. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~26 debug messages>

yosys> opt_reduce -full

3.30.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.30.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.30.30. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr -full

3.30.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.30.34. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $not.
No more expansions possible.
<suppressed ~341 debug messages>

yosys> opt -sat

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~80 debug messages>

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~987 debug messages>
Removed a total of 329 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 88 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~11 debug messages>

3.32.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.32.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.32.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 6 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.32.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.32.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.32.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.32.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.32.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.32.23. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  4 cells in clk=\clk, en=!$auto$rtlil.cc:2547:NotGate$3694, arst=\control_reg [0], srst={ }
  350 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1275, arst=\reset, srst={ }
  1172 cells in clk=\clk, en={ }, arst=\control_reg [0], srst={ }
  74 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1239, arst=\reset, srst={ }
  68 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1253, arst=\reset, srst={ }
  74 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1267, arst=\reset, srst={ }
  10 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1282, arst=\reset, srst={ }
  105 cells in clk=\clk, en=\des.ready_o, arst=\reset, srst={ }
  69 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1260, arst=\reset, srst={ }
  24 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$1271, arst=\control_reg [0], srst={ }
  65 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1246, arst=\reset, srst={ }
  20 cells in clk=\clk, en={ }, arst=\reset, srst={ }

3.33.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$auto$rtlil.cc:2547:NotGate$3694, asynchronously reset by \control_reg [0]
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.2.1. Executing ABC.

3.33.3. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1275, asynchronously reset by \reset
Extracted 350 gates and 419 wires to a netlist network with 68 inputs and 60 outputs.

3.33.3.1. Executing ABC.

3.33.4. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$7278$lo0
Extracted 1172 gates and 1359 wires to a netlist network with 185 inputs and 123 outputs.

3.33.4.1. Executing ABC.

3.33.5. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1239, asynchronously reset by \reset
Extracted 74 gates and 144 wires to a netlist network with 70 inputs and 34 outputs.

3.33.5.1. Executing ABC.

3.33.6. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1253, asynchronously reset by \reset
Extracted 68 gates and 106 wires to a netlist network with 37 inputs and 33 outputs.

3.33.6.1. Executing ABC.

3.33.7. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1267, asynchronously reset by \reset
Extracted 74 gates and 117 wires to a netlist network with 42 inputs and 38 outputs.

3.33.7.1. Executing ABC.

3.33.8. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1282, asynchronously reset by \reset
Extracted 10 gates and 19 wires to a netlist network with 8 inputs and 6 outputs.

3.33.8.1. Executing ABC.

3.33.9. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7911$lo184, asynchronously reset by \reset
Extracted 105 gates and 182 wires to a netlist network with 76 inputs and 70 outputs.

3.33.9.1. Executing ABC.

3.33.10. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1260, asynchronously reset by \reset
Extracted 69 gates and 107 wires to a netlist network with 38 inputs and 35 outputs.

3.33.10.1. Executing ABC.

3.33.11. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1271, asynchronously reset by $abc$7278$lo0
Extracted 24 gates and 30 wires to a netlist network with 5 inputs and 10 outputs.

3.33.11.1. Executing ABC.

3.33.12. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1246, asynchronously reset by \reset
Extracted 65 gates and 102 wires to a netlist network with 37 inputs and 33 outputs.

3.33.12.1. Executing ABC.

3.33.13. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 20 gates and 32 wires to a netlist network with 11 inputs and 8 outputs.

3.33.13.1. Executing ABC.

yosys> abc -dff

3.34. Executing ABC pass (technology mapping using ABC).

3.34.1. Summary of detected clock domains:
  16 cells in clk=\clk, en=$abc$9697$auto$opt_dff.cc:219:make_patterns_logic$1282, arst=\reset, srst={ }
  86 cells in clk=\clk, en=$abc$9496$auto$opt_dff.cc:219:make_patterns_logic$1253, arst=\reset, srst={ }
  24 cells in clk=\clk, en=$abc$10014$auto$opt_dff.cc:194:make_patterns_logic$1271, arst=$abc$7278$lo0, srst={ }
  97 cells in clk=\clk, en=$abc$9590$auto$opt_dff.cc:219:make_patterns_logic$1267, arst=\reset, srst={ }
  92 cells in clk=\clk, en=$abc$9912$auto$opt_dff.cc:219:make_patterns_logic$1260, arst=\reset, srst={ }
  121 cells in clk=\clk, en=$abc$7911$lo184, arst=\reset, srst={ }
  2 cells in clk=\clk, en=!$abc$7273$auto$rtlil.cc:2547:NotGate$3694, arst=$abc$7278$lo0, srst={ }
  54 cells in clk=\clk, en=$abc$9392$auto$opt_dff.cc:219:make_patterns_logic$1239, arst=\reset, srst={ }
  293 cells in clk=\clk, en=$abc$7278$auto$opt_dff.cc:219:make_patterns_logic$1275, arst=\reset, srst={ }
  1560 cells in clk=\clk, en={ }, arst=$abc$7278$lo0, srst={ }
  71 cells in clk=\clk, en=$abc$10040$auto$opt_dff.cc:219:make_patterns_logic$1246, arst=\reset, srst={ }
  15 cells in clk=\clk, en={ }, arst=\reset, srst={ }

3.34.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9697$auto$opt_dff.cc:219:make_patterns_logic$1282, asynchronously reset by \reset
Extracted 16 gates and 28 wires to a netlist network with 12 inputs and 10 outputs.

3.34.2.1. Executing ABC.

3.34.3. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9496$auto$opt_dff.cc:219:make_patterns_logic$1253, asynchronously reset by \reset
Extracted 86 gates and 140 wires to a netlist network with 54 inputs and 36 outputs.

3.34.3.1. Executing ABC.

3.34.4. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10014$auto$opt_dff.cc:194:make_patterns_logic$1271, asynchronously reset by $abc$7278$lo0
Extracted 24 gates and 29 wires to a netlist network with 5 inputs and 10 outputs.

3.34.4.1. Executing ABC.

3.34.5. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9590$auto$opt_dff.cc:219:make_patterns_logic$1267, asynchronously reset by \reset
Extracted 97 gates and 161 wires to a netlist network with 64 inputs and 37 outputs.

3.34.5.1. Executing ABC.

3.34.6. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9912$auto$opt_dff.cc:219:make_patterns_logic$1260, asynchronously reset by \reset
Extracted 92 gates and 153 wires to a netlist network with 61 inputs and 34 outputs.

3.34.6.1. Executing ABC.

3.34.7. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7911$lo184, asynchronously reset by \reset
Extracted 121 gates and 199 wires to a netlist network with 78 inputs and 51 outputs.

3.34.7.1. Executing ABC.

3.34.8. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$abc$7273$auto$rtlil.cc:2547:NotGate$3694, asynchronously reset by $abc$7278$lo0
Extracted 2 gates and 5 wires to a netlist network with 3 inputs and 2 outputs.

3.34.8.1. Executing ABC.

3.34.9. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9392$auto$opt_dff.cc:219:make_patterns_logic$1239, asynchronously reset by \reset
Extracted 54 gates and 108 wires to a netlist network with 54 inputs and 37 outputs.

3.34.9.1. Executing ABC.

3.34.10. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7278$auto$opt_dff.cc:219:make_patterns_logic$1275, asynchronously reset by \reset
Extracted 293 gates and 362 wires to a netlist network with 69 inputs and 177 outputs.

3.34.10.1. Executing ABC.

3.34.11. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$10850$lo0
Extracted 1560 gates and 1831 wires to a netlist network with 271 inputs and 167 outputs.

3.34.11.1. Executing ABC.

3.34.12. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10040$auto$opt_dff.cc:219:make_patterns_logic$1246, asynchronously reset by \reset
Extracted 71 gates and 115 wires to a netlist network with 44 inputs and 29 outputs.

3.34.12.1. Executing ABC.

3.34.13. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 15 gates and 26 wires to a netlist network with 11 inputs and 7 outputs.

3.34.13.1. Executing ABC.

yosys> abc -dff

3.35. Executing ABC pass (technology mapping using ABC).

3.35.1. Summary of detected clock domains:
  4 cells in clk=\clk, en=!$abc$10741$abc$7273$auto$rtlil.cc:2547:NotGate$3694, arst=$abc$10850$lo0, srst={ }
  181 cells in clk=\clk, en=$abc$10850$abc$7278$auto$opt_dff.cc:219:make_patterns_logic$1275, arst=\reset, srst={ }
  15 cells in clk=\clk, en=$abc$10157$abc$9697$auto$opt_dff.cc:219:make_patterns_logic$1282, arst=\reset, srst={ }
  129 cells in clk=\clk, en=$abc$11093$lo136, arst=\reset, srst={ }
  23 cells in clk=\clk, en=$abc$10271$abc$10014$auto$opt_dff.cc:194:make_patterns_logic$1271, arst=$abc$10850$lo0, srst={ }
  91 cells in clk=\clk, en=$abc$10173$abc$9496$auto$opt_dff.cc:219:make_patterns_logic$1253, arst=\reset, srst={ }
  105 cells in clk=\clk, en=$abc$10296$abc$9590$auto$opt_dff.cc:219:make_patterns_logic$1267, arst=\reset, srst={ }
  74 cells in clk=\clk, en=$abc$10401$abc$9912$auto$opt_dff.cc:219:make_patterns_logic$1260, arst=\reset, srst={ }
  80 cells in clk=\clk, en=$abc$10746$abc$9392$auto$opt_dff.cc:219:make_patterns_logic$1239, arst=\reset, srst={ }
  1638 cells in clk=\clk, en={ }, arst=$abc$10850$lo0, srst={ }
  73 cells in clk=\clk, en=$abc$12875$abc$10040$auto$opt_dff.cc:219:make_patterns_logic$1246, arst=\reset, srst={ }
  14 cells in clk=\clk, en={ }, arst=\reset, srst={ }

3.35.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$abc$10741$abc$7273$auto$rtlil.cc:2547:NotGate$3694, asynchronously reset by $abc$10850$lo0
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.35.2.1. Executing ABC.

3.35.3. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10850$abc$7278$auto$opt_dff.cc:219:make_patterns_logic$1275, asynchronously reset by \reset
Extracted 181 gates and 249 wires to a netlist network with 68 inputs and 175 outputs.

3.35.3.1. Executing ABC.

3.35.4. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10157$abc$9697$auto$opt_dff.cc:219:make_patterns_logic$1282, asynchronously reset by \reset
Extracted 15 gates and 26 wires to a netlist network with 11 inputs and 10 outputs.

3.35.4.1. Executing ABC.

3.35.5. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$11093$lo136, asynchronously reset by \reset
Extracted 129 gates and 207 wires to a netlist network with 78 inputs and 61 outputs.

3.35.5.1. Executing ABC.

3.35.6. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12982$abc$10271$abc$10014$auto$opt_dff.cc:194:make_patterns_logic$1271, asynchronously reset by $abc$12988$lo1
Extracted 23 gates and 26 wires to a netlist network with 3 inputs and 9 outputs.

3.35.6.1. Executing ABC.

3.35.7. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10173$abc$9496$auto$opt_dff.cc:219:make_patterns_logic$1253, asynchronously reset by \reset
Extracted 91 gates and 154 wires to a netlist network with 63 inputs and 35 outputs.

3.35.7.1. Executing ABC.

3.35.8. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10296$abc$9590$auto$opt_dff.cc:219:make_patterns_logic$1267, asynchronously reset by \reset
Extracted 105 gates and 179 wires to a netlist network with 74 inputs and 38 outputs.

3.35.8.1. Executing ABC.

3.35.9. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10401$abc$9912$auto$opt_dff.cc:219:make_patterns_logic$1260, asynchronously reset by \reset
Extracted 74 gates and 115 wires to a netlist network with 41 inputs and 36 outputs.

3.35.9.1. Executing ABC.

3.35.10. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10746$abc$9392$auto$opt_dff.cc:219:make_patterns_logic$1239, asynchronously reset by \reset
Extracted 80 gates and 144 wires to a netlist network with 64 inputs and 36 outputs.

3.35.10.1. Executing ABC.

3.35.11. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$12988$lo1
Extracted 1638 gates and 1898 wires to a netlist network with 260 inputs and 155 outputs.

3.35.11.1. Executing ABC.

3.35.12. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12875$abc$10040$auto$opt_dff.cc:219:make_patterns_logic$1246, asynchronously reset by \reset
Extracted 73 gates and 119 wires to a netlist network with 46 inputs and 30 outputs.

3.35.12.1. Executing ABC.

3.35.13. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 14 gates and 23 wires to a netlist network with 9 inputs and 6 outputs.

3.35.13.1. Executing ABC.

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  4 cells in clk=\clk, en=!$abc$12982$abc$10741$abc$7273$auto$rtlil.cc:2547:NotGate$3694, arst=$abc$12988$lo1, srst={ }
  102 cells in clk=\clk, en=$abc$13617$abc$10401$abc$9912$auto$opt_dff.cc:219:make_patterns_logic$1260, arst=\reset, srst={ }
  180 cells in clk=\clk, en=$abc$12988$abc$10850$abc$7278$auto$opt_dff.cc:219:make_patterns_logic$1275, arst=\reset, srst={ }
  91 cells in clk=\clk, en=$abc$13510$abc$10296$abc$9590$auto$opt_dff.cc:219:make_patterns_logic$1267, arst=\reset, srst={ }
  14 cells in clk=\clk, en=$abc$13173$abc$10157$abc$9697$auto$opt_dff.cc:219:make_patterns_logic$1282, arst=\reset, srst={ }
  128 cells in clk=\clk, en=$abc$13844$lo066, arst=\reset, srst={ }
  81 cells in clk=\clk, en=$abc$13723$abc$10746$abc$9392$auto$opt_dff.cc:219:make_patterns_logic$1239, arst=\reset, srst={ }
  23 cells in clk=\clk, en=$abc$12982$abc$10271$abc$10014$auto$opt_dff.cc:194:make_patterns_logic$1271, arst=$abc$12988$lo1, srst={ }
  95 cells in clk=\clk, en=$abc$13414$abc$10173$abc$9496$auto$opt_dff.cc:219:make_patterns_logic$1253, arst=\reset, srst={ }
  1618 cells in clk=\clk, en={ }, arst=$abc$12988$lo1, srst={ }
  75 cells in clk=\clk, en=$abc$15679$abc$12875$abc$10040$auto$opt_dff.cc:219:make_patterns_logic$1246, arst=\reset, srst={ }
  14 cells in clk=\clk, en={ }, arst=\reset, srst={ }

3.36.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$abc$12982$abc$10741$abc$7273$auto$rtlil.cc:2547:NotGate$3694, asynchronously reset by $abc$12988$lo1
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.36.2.1. Executing ABC.

3.36.3. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$13617$abc$10401$abc$9912$auto$opt_dff.cc:219:make_patterns_logic$1260, asynchronously reset by \reset
Extracted 102 gates and 174 wires to a netlist network with 72 inputs and 34 outputs.

3.36.3.1. Executing ABC.

3.36.4. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12988$abc$10850$abc$7278$auto$opt_dff.cc:219:make_patterns_logic$1275, asynchronously reset by \reset
Extracted 180 gates and 248 wires to a netlist network with 68 inputs and 175 outputs.

3.36.4.1. Executing ABC.

3.36.5. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$13510$abc$10296$abc$9590$auto$opt_dff.cc:219:make_patterns_logic$1267, asynchronously reset by \reset
Extracted 91 gates and 149 wires to a netlist network with 58 inputs and 38 outputs.

3.36.5.1. Executing ABC.

3.36.6. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$13173$abc$10157$abc$9697$auto$opt_dff.cc:219:make_patterns_logic$1282, asynchronously reset by \reset
Extracted 14 gates and 25 wires to a netlist network with 11 inputs and 10 outputs.

3.36.6.1. Executing ABC.

3.36.7. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$13844$lo066, asynchronously reset by \reset
Extracted 128 gates and 204 wires to a netlist network with 76 inputs and 61 outputs.

3.36.7.1. Executing ABC.

3.36.8. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$13723$abc$10746$abc$9392$auto$opt_dff.cc:219:make_patterns_logic$1239, asynchronously reset by \reset
Extracted 81 gates and 146 wires to a netlist network with 65 inputs and 36 outputs.

3.36.8.1. Executing ABC.

3.36.9. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$15785$abc$12982$abc$10271$abc$10014$auto$opt_dff.cc:194:make_patterns_logic$1271, asynchronously reset by $abc$15895$lo1
Extracted 23 gates and 26 wires to a netlist network with 3 inputs and 9 outputs.

3.36.9.1. Executing ABC.

3.36.10. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$13414$abc$10173$abc$9496$auto$opt_dff.cc:219:make_patterns_logic$1253, asynchronously reset by \reset
Extracted 95 gates and 161 wires to a netlist network with 66 inputs and 35 outputs.

3.36.10.1. Executing ABC.

3.36.11. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$15895$lo1
Extracted 1618 gates and 1875 wires to a netlist network with 257 inputs and 171 outputs.

3.36.11.1. Executing ABC.

3.36.12. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$15679$abc$12875$abc$10040$auto$opt_dff.cc:219:make_patterns_logic$1246, asynchronously reset by \reset
Extracted 75 gates and 122 wires to a netlist network with 47 inputs and 30 outputs.

3.36.12.1. Executing ABC.

3.36.13. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 14 gates and 23 wires to a netlist network with 9 inputs and 6 outputs.

3.36.13.1. Executing ABC.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~2 debug messages>

yosys> opt_merge -nomux

3.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 1 unused cells and 12129 unused wires.
<suppressed ~80 debug messages>

yosys> opt_expr

3.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.38.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_cv9VgC/abc_tmp_1.scr

3.39. Executing ABC pass (technology mapping using ABC).

3.39.1. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Extracted 2022 gates and 2380 wires to a netlist network with 358 inputs and 289 outputs.

3.39.1.1. Executing ABC.
DE:   #PIs = 358  #Luts =   554  Max Lvl =   7  Avg Lvl =   3.48  [   0.09 sec. at Pass 0]
DE:   #PIs = 358  #Luts =   501  Max Lvl =   8  Avg Lvl =   3.90  [   3.05 sec. at Pass 1]
DE:   #PIs = 358  #Luts =   493  Max Lvl =   8  Avg Lvl =   3.77  [   0.62 sec. at Pass 2]
DE:   #PIs = 358  #Luts =   492  Max Lvl =   8  Avg Lvl =   3.75  [   0.91 sec. at Pass 3]
DE:   #PIs = 358  #Luts =   489  Max Lvl =   8  Avg Lvl =   3.78  [   0.67 sec. at Pass 4]
DE:   #PIs = 358  #Luts =   489  Max Lvl =   8  Avg Lvl =   3.78  [   1.57 sec. at Pass 5]
DE:   #PIs = 358  #Luts =   488  Max Lvl =   8  Avg Lvl =   3.76  [   0.71 sec. at Pass 6]
DE:   #PIs = 358  #Luts =   487  Max Lvl =   8  Avg Lvl =   3.70  [   1.47 sec. at Pass 7]
DE:   #PIs = 358  #Luts =   487  Max Lvl =   8  Avg Lvl =   3.70  [   0.68 sec. at Pass 8]
DE:   #PIs = 358  #Luts =   487  Max Lvl =   8  Avg Lvl =   3.70  [   1.25 sec. at Pass 9]
DE:   #PIs = 358  #Luts =   487  Max Lvl =   8  Avg Lvl =   3.70  [   0.79 sec. at Pass 10]
DE:   #PIs = 358  #Luts =   482  Max Lvl =   8  Avg Lvl =   3.57  [   9.38 sec. at Pass 11]
DE:   #PIs = 358  #Luts =   482  Max Lvl =   8  Avg Lvl =   3.57  [   1.83 sec. at Pass 12]
DE:   #PIs = 358  #Luts =   482  Max Lvl =   8  Avg Lvl =   3.57  [   0.74 sec. at Pass 13]
DE:   #PIs = 358  #Luts =   482  Max Lvl =   8  Avg Lvl =   3.57  [   1.75 sec. at Pass 14]
DE:   #PIs = 358  #Luts =   481  Max Lvl =   8  Avg Lvl =   3.54  [  12.29 sec. at Pass 15]
DE:   #PIs = 358  #Luts =   481  Max Lvl =   8  Avg Lvl =   3.54  [   0.67 sec. at Pass 16]
DE:   #PIs = 358  #Luts =   481  Max Lvl =   8  Avg Lvl =   3.54  [   1.69 sec. at Pass 17]
DE:   #PIs = 358  #Luts =   481  Max Lvl =   8  Avg Lvl =   3.54  [   0.66 sec. at Pass 18]
DE:   #PIs = 358  #Luts =   481  Max Lvl =   8  Avg Lvl =   3.54  [   9.70 sec. at Pass 19]
DE:   #PIs = 358  #Luts =   481  Max Lvl =   8  Avg Lvl =   3.54  [   0.12 sec. at Pass 20]

yosys> opt

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 2334 unused wires.
<suppressed ~11 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.42. Printing statistics.

=== des_top ===

   Number of wires:                820
   Number of wire bits:           1579
   Number of public wires:          32
   Number of public wire bits:     791
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                892
     $_DFFE_PP0N_                    1
     $_DFFE_PP0P_                  223
     $_DFF_PP0_                    187
     $lut                          481


yosys> shregmap -minlen 8 -maxlen 20

3.43. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.45. Printing statistics.

=== des_top ===

   Number of wires:                820
   Number of wire bits:           1579
   Number of public wires:          32
   Number of public wire bits:     791
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                892
     $_DFFE_PP0N_                    1
     $_DFFE_PP0P_                  223
     $_DFF_PP0_                    187
     $lut                          481


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.46. Executing TECHMAP pass (map to technology primitives).

3.46.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.46.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.46.3. Continuing TECHMAP pass.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using template \$_DFFE_PP0N_ for cells of type $_DFFE_PP0N_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~1440 debug messages>

yosys> opt_expr -mux_undef

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~8111 debug messages>

yosys> simplemap

3.48. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge

3.50. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~4704 debug messages>
Removed a total of 1568 cells.

yosys> opt_dff -nodffe -nosdff

3.51. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 3233 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.53. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.53.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~304 debug messages>

yosys> opt_merge -nomux

3.53.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.53.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.53.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 90 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.53.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.53.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.53.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.53.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.53.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.53.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_cv9VgC/abc_tmp_2.scr

3.54. Executing ABC pass (technology mapping using ABC).

3.54.1. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Extracted 2014 gates and 2375 wires to a netlist network with 359 inputs and 291 outputs.

3.54.1.1. Executing ABC.
DE:   #PIs = 359  #Luts =   483  Max Lvl =   8  Avg Lvl =   3.52  [   0.10 sec. at Pass 0]
DE:   #PIs = 359  #Luts =   483  Max Lvl =   8  Avg Lvl =   3.52  [   3.40 sec. at Pass 1]
DE:   #PIs = 359  #Luts =   483  Max Lvl =   8  Avg Lvl =   3.52  [   0.69 sec. at Pass 2]
DE:   #PIs = 359  #Luts =   483  Max Lvl =   8  Avg Lvl =   3.52  [   1.61 sec. at Pass 3]
DE:   #PIs = 359  #Luts =   483  Max Lvl =   8  Avg Lvl =   3.52  [   0.73 sec. at Pass 4]
DE:   #PIs = 359  #Luts =   483  Max Lvl =   8  Avg Lvl =   3.52  [   2.01 sec. at Pass 5]
DE:   #PIs = 359  #Luts =   483  Max Lvl =   8  Avg Lvl =   3.52  [  12.74 sec. at Pass 6]
DE:   #PIs = 359  #Luts =   483  Max Lvl =   8  Avg Lvl =   3.52  [   0.19 sec. at Pass 7]

yosys> opt

3.55. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.55.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.55.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.55.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.55.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 1608 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.55.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.55.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.55.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.55.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.55.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

3.55.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.56. Executing HIERARCHY pass (managing design hierarchy).

3.56.1. Analyzing design hierarchy..
Top module:  \des_top

3.56.2. Analyzing design hierarchy..
Top module:  \des_top
Removed 0 unused modules.

yosys> stat

3.57. Printing statistics.

=== des_top ===

   Number of wires:                822
   Number of wire bits:           1581
   Number of public wires:          32
   Number of public wire bits:     791
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                894
     $lut                          483
     dffsre                        411


yosys> opt_clean -purge

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 16 unused wires.
<suppressed ~16 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.59. Executing Verilog backend.

yosys> bmuxmap

3.59.1. Executing BMUXMAP pass.

yosys> demuxmap

3.59.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\des_top'.

Warnings: 23 unique messages, 23 total
End of script. Logfile hash: e32da524bc, CPU: user 7.31s system 0.18s, MEM: 49.77 MB peak
Yosys 0.17+76 (git sha1 035496b50, gcc 9.1.0 -fPIC -Os)
Time spent: 99% 6x abc (856 sec), 0% 40x opt_expr (2 sec), ...
real 88.22
user 828.02
sys 34.88
