
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.64
 Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 00:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k cf_fir_24_16_16.v

yosys> verific -vlog2k cf_fir_24_16_16.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 00:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'cf_fir_24_16_16.v'

yosys> synth_rs -top cf_fir_24_16_16 -tech genesis -goal area -de -verilog synthesized.v

3. Executing synth_rs pass: v0.4.65

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top cf_fir_24_16_16

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:94: compiling module 'cf_fir_24_16_16'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:129: compiling module 'cf_fir_24_16_16_1'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:168: compiling module 'cf_fir_24_16_16_2'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1833: compiling module 'cf_fir_24_16_16_24'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1949: compiling module 'cf_fir_24_16_16_25'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:2044: compiling module 'cf_fir_24_16_16_26'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1180: compiling module 'cf_fir_24_16_16_18'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1339: compiling module 'cf_fir_24_16_16_19'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1478: compiling module 'cf_fir_24_16_16_20'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1597: compiling module 'cf_fir_24_16_16_21'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1696: compiling module 'cf_fir_24_16_16_22'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1775: compiling module 'cf_fir_24_16_16_23'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:283: compiling module 'cf_fir_24_16_16_3'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:749: compiling module 'cf_fir_24_16_16_12'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:847: compiling module 'cf_fir_24_16_16_13'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:935: compiling module 'cf_fir_24_16_16_14'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1013: compiling module 'cf_fir_24_16_16_15'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1081: compiling module 'cf_fir_24_16_16_16'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:1139: compiling module 'cf_fir_24_16_16_17'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:348: compiling module 'cf_fir_24_16_16_4'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:582: compiling module 'cf_fir_24_16_16_9'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:650: compiling module 'cf_fir_24_16_16_10'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:708: compiling module 'cf_fir_24_16_16_11'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:395: compiling module 'cf_fir_24_16_16_5'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:534: compiling module 'cf_fir_24_16_16_8'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:435: compiling module 'cf_fir_24_16_16_6'
VERIFIC-INFO [VERI-1018] cf_fir_24_16_16.v:493: compiling module 'cf_fir_24_16_16_7'
Importing module cf_fir_24_16_16.
Importing module cf_fir_24_16_16_1.
Importing module cf_fir_24_16_16_2.
Importing module cf_fir_24_16_16_18.
Importing module cf_fir_24_16_16_19.
Importing module cf_fir_24_16_16_20.
Importing module cf_fir_24_16_16_21.
Importing module cf_fir_24_16_16_22.
Importing module cf_fir_24_16_16_23.
Importing module cf_fir_24_16_16_24.
Importing module cf_fir_24_16_16_25.
Importing module cf_fir_24_16_16_26.
Importing module cf_fir_24_16_16_3.
Importing module cf_fir_24_16_16_12.
Importing module cf_fir_24_16_16_13.
Importing module cf_fir_24_16_16_14.
Importing module cf_fir_24_16_16_15.
Importing module cf_fir_24_16_16_16.
Importing module cf_fir_24_16_16_17.
Importing module cf_fir_24_16_16_4.
Importing module cf_fir_24_16_16_5.
Importing module cf_fir_24_16_16_6.
Importing module cf_fir_24_16_16_7.
Importing module cf_fir_24_16_16_8.
Importing module cf_fir_24_16_16_9.
Importing module cf_fir_24_16_16_10.
Importing module cf_fir_24_16_16_11.

3.4.1. Analyzing design hierarchy..
Top module:  \cf_fir_24_16_16
Used module:     \cf_fir_24_16_16_1
Used module:         \cf_fir_24_16_16_2
Used module:             \cf_fir_24_16_16_3
Used module:                 \cf_fir_24_16_16_4
Used module:                     \cf_fir_24_16_16_5
Used module:                         \cf_fir_24_16_16_6
Used module:                             \cf_fir_24_16_16_7
Used module:                         \cf_fir_24_16_16_8
Used module:                     \cf_fir_24_16_16_9
Used module:                         \cf_fir_24_16_16_10
Used module:                             \cf_fir_24_16_16_11
Used module:                 \cf_fir_24_16_16_12
Used module:                     \cf_fir_24_16_16_13
Used module:                         \cf_fir_24_16_16_14
Used module:                             \cf_fir_24_16_16_15
Used module:                                 \cf_fir_24_16_16_16
Used module:                                     \cf_fir_24_16_16_17
Used module:             \cf_fir_24_16_16_18
Used module:                 \cf_fir_24_16_16_19
Used module:                     \cf_fir_24_16_16_20
Used module:                         \cf_fir_24_16_16_21
Used module:                             \cf_fir_24_16_16_22
Used module:                                 \cf_fir_24_16_16_23
Used module:             \cf_fir_24_16_16_24
Used module:                 \cf_fir_24_16_16_25
Used module:                     \cf_fir_24_16_16_26

3.4.2. Analyzing design hierarchy..
Top module:  \cf_fir_24_16_16
Used module:     \cf_fir_24_16_16_1
Used module:         \cf_fir_24_16_16_2
Used module:             \cf_fir_24_16_16_3
Used module:                 \cf_fir_24_16_16_4
Used module:                     \cf_fir_24_16_16_5
Used module:                         \cf_fir_24_16_16_6
Used module:                             \cf_fir_24_16_16_7
Used module:                         \cf_fir_24_16_16_8
Used module:                     \cf_fir_24_16_16_9
Used module:                         \cf_fir_24_16_16_10
Used module:                             \cf_fir_24_16_16_11
Used module:                 \cf_fir_24_16_16_12
Used module:                     \cf_fir_24_16_16_13
Used module:                         \cf_fir_24_16_16_14
Used module:                             \cf_fir_24_16_16_15
Used module:                                 \cf_fir_24_16_16_16
Used module:                                     \cf_fir_24_16_16_17
Used module:             \cf_fir_24_16_16_18
Used module:                 \cf_fir_24_16_16_19
Used module:                     \cf_fir_24_16_16_20
Used module:                         \cf_fir_24_16_16_21
Used module:                             \cf_fir_24_16_16_22
Used module:                                 \cf_fir_24_16_16_23
Used module:             \cf_fir_24_16_16_24
Used module:                 \cf_fir_24_16_16_25
Used module:                     \cf_fir_24_16_16_26
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16_11.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_10.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_9.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_8.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_7.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_6.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_5.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_4.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_17.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_16.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_15.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_14.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_13.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_12.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_3.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_26.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_25.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_24.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_23.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_22.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_21.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_20.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_19.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_18.
<suppressed ~1 debug messages>
Optimizing module cf_fir_24_16_16_2.
<suppressed ~2 debug messages>
Optimizing module cf_fir_24_16_16_1.
Optimizing module cf_fir_24_16_16.

yosys> demuxmap

3.6. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.7. Executing FLATTEN pass (flatten design).
Deleting now unused module cf_fir_24_16_16_1.
Deleting now unused module cf_fir_24_16_16_10.
Deleting now unused module cf_fir_24_16_16_11.
Deleting now unused module cf_fir_24_16_16_12.
Deleting now unused module cf_fir_24_16_16_13.
Deleting now unused module cf_fir_24_16_16_14.
Deleting now unused module cf_fir_24_16_16_15.
Deleting now unused module cf_fir_24_16_16_16.
Deleting now unused module cf_fir_24_16_16_17.
Deleting now unused module cf_fir_24_16_16_18.
Deleting now unused module cf_fir_24_16_16_19.
Deleting now unused module cf_fir_24_16_16_2.
Deleting now unused module cf_fir_24_16_16_20.
Deleting now unused module cf_fir_24_16_16_21.
Deleting now unused module cf_fir_24_16_16_22.
Deleting now unused module cf_fir_24_16_16_23.
Deleting now unused module cf_fir_24_16_16_24.
Deleting now unused module cf_fir_24_16_16_25.
Deleting now unused module cf_fir_24_16_16_26.
Deleting now unused module cf_fir_24_16_16_3.
Deleting now unused module cf_fir_24_16_16_4.
Deleting now unused module cf_fir_24_16_16_5.
Deleting now unused module cf_fir_24_16_16_6.
Deleting now unused module cf_fir_24_16_16_7.
Deleting now unused module cf_fir_24_16_16_8.
Deleting now unused module cf_fir_24_16_16_9.
<suppressed ~26 debug messages>

yosys> demuxmap

3.8. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.9. Executing TRIBUF pass.

yosys> deminout

3.10. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.

yosys> opt_clean

3.12. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..
Removed 0 unused cells and 14655 unused wires.
<suppressed ~428 debug messages>

yosys> check

3.13. Executing CHECK pass (checking for obvious problems).
Checking module cf_fir_24_16_16...
Found and reported 0 problems.

yosys> opt_expr

3.14. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.
<suppressed ~129 debug messages>

yosys> opt_merge -nomux

3.15. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.16. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_fir_24_16_16..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~25 debug messages>

yosys> opt_reduce

3.17. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_fir_24_16_16.
Performed a total of 0 changes.

yosys> opt_merge

3.18. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_share

3.19. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.20. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$n9_reg$cf_fir_24_16_16.v:529$14907 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$n6_reg$cf_fir_24_16_16.v:521$14901 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.$verific$n6_reg$cf_fir_24_16_16.v:1447$5103 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.$verific$n8_reg$cf_fir_24_16_16.v:1454$5109 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$n6_reg$cf_fir_24_16_16.v:474$14689 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$n12_reg$cf_fir_24_16_16.v:485$14699 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$n6_reg$cf_fir_24_16_16.v:566$14933 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$n12_reg$cf_fir_24_16_16.v:577$14943 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n6_reg$cf_fir_24_16_16.v:1917$7976 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n5_reg$cf_fir_24_16_16.v:1911$7972 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n7_reg$cf_fir_24_16_16.v:1923$7980 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s8.$verific$n6_reg$cf_fir_24_16_16.v:429$14068 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.$verific$n4_reg$cf_fir_24_16_16.v:1440$5097 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$n9_reg$cf_fir_24_16_16.v:744$15592 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$n6_reg$cf_fir_24_16_16.v:736$15586 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n5_reg$cf_fir_24_16_16.v:2013$8308 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n4_reg$cf_fir_24_16_16.v:2007$8304 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n3_reg$cf_fir_24_16_16.v:2001$8300 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n2_reg$cf_fir_24_16_16.v:1995$8296 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$n6_reg$cf_fir_24_16_16.v:689$15379 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$n12_reg$cf_fir_24_16_16.v:700$15389 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.$verific$n2_reg$cf_fir_24_16_16.v:1433$5091 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n1_reg$cf_fir_24_16_16.v:1989$8292 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s7.$verific$n6_reg$cf_fir_24_16_16.v:629$14969 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.\s7.$verific$n12_reg$cf_fir_24_16_16.v:640$14979 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n7_reg$cf_fir_24_16_16.v:2025$8316 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.$verific$n6_reg$cf_fir_24_16_16.v:2019$8312 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s8.$verific$n6_reg$cf_fir_24_16_16.v:389$13199 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n4_reg$cf_fir_24_16_16.v:1905$7968 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n3_reg$cf_fir_24_16_16.v:1899$7964 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.\s13.$verific$n9_reg$cf_fir_24_16_16.v:1175$13177 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.\s13.$verific$n6_reg$cf_fir_24_16_16.v:1167$13171 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.$verific$n6_reg$cf_fir_24_16_16.v:1570$6196 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.$verific$n4_reg$cf_fir_24_16_16.v:1563$6190 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$n6_reg$cf_fir_24_16_16.v:1120$12969 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$n12_reg$cf_fir_24_16_16.v:1131$12979 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.$verific$n2_reg$cf_fir_24_16_16.v:1556$6184 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$n6_reg$cf_fir_24_16_16.v:1060$12570 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$n12_reg$cf_fir_24_16_16.v:1071$12580 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.$verific$n8_reg$cf_fir_24_16_16.v:1577$6202 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$n6_reg$cf_fir_24_16_16.v:990$11975 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$n12_reg$cf_fir_24_16_16.v:1001$11985 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.$verific$n2_reg$cf_fir_24_16_16.v:263$948 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.$verific$n1_reg$cf_fir_24_16_16.v:257$944 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.$verific$n5_reg$cf_fir_24_16_16.v:276$959 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.$verific$n3_reg$cf_fir_24_16_16.v:269$952 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.$verific$n6_reg$cf_fir_24_16_16.v:910$11184 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.\s13.$verific$n12_reg$cf_fir_24_16_16.v:921$11194 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n2_reg$cf_fir_24_16_16.v:1893$7960 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.$verific$n1_reg$cf_fir_24_16_16.v:1887$7956 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.$verific$n6_reg$cf_fir_24_16_16.v:820$10197 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.\s7.$verific$n12_reg$cf_fir_24_16_16.v:831$10207 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s8.$verific$n6_reg$cf_fir_24_16_16.v:342$8568 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.$verific$n2_reg$cf_fir_24_16_16.v:1290$3738 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$n8_reg$cf_fir_24_16_16.v:1826$7921 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$n6_reg$cf_fir_24_16_16.v:1819$7915 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$n4_reg$cf_fir_24_16_16.v:1812$7909 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.\s9.$verific$n2_reg$cf_fir_24_16_16.v:1805$7903 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n6_reg$cf_fir_24_16_16.v:2100$8532 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n5_reg$cf_fir_24_16_16.v:2094$8528 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n8_reg$cf_fir_24_16_16.v:2112$8540 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n7_reg$cf_fir_24_16_16.v:2106$8536 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$n8_reg$cf_fir_24_16_16.v:1763$7608 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$n6_reg$cf_fir_24_16_16.v:1756$7602 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$n4_reg$cf_fir_24_16_16.v:1749$7596 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.\s9.$verific$n2_reg$cf_fir_24_16_16.v:1742$7590 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.$verific$n4_reg$cf_fir_24_16_16.v:1297$3744 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.$verific$n6_reg$cf_fir_24_16_16.v:1304$3750 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.$verific$n8_reg$cf_fir_24_16_16.v:1311$3756 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$n8_reg$cf_fir_24_16_16.v:1680$7035 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$n6_reg$cf_fir_24_16_16.v:1673$7029 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$n4_reg$cf_fir_24_16_16.v:1666$7023 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s7.\s9.\s9.\s9.$verific$n2_reg$cf_fir_24_16_16.v:1659$7017 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n2_reg$cf_fir_24_16_16.v:2076$8516 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n1_reg$cf_fir_24_16_16.v:2070$8512 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n4_reg$cf_fir_24_16_16.v:2088$8524 ($aldff) from module cf_fir_24_16_16.
Removing never-active async load on $flatten\s1.\s3.\s6.\s8.\s8.$verific$n3_reg$cf_fir_24_16_16.v:2082$8520 ($aldff) from module cf_fir_24_16_16.

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..
Removed 0 unused cells and 129 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.23. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.23.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.23.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.23.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.23.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..

yosys> fsm_opt

3.23.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.23.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.23.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.23.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.

yosys> opt_merge -nomux

3.25. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.26. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_fir_24_16_16..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~25 debug messages>

yosys> opt_reduce

3.27. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_fir_24_16_16.
Performed a total of 0 changes.

yosys> opt_merge

3.28. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_share

3.29. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.30. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..

yosys> opt_expr

3.32. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.33. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 34) from FF cell cf_fir_24_16_16.$flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$n9_reg$cf_fir_24_16_16.v:744$15592 ($dff).
Removed top 1 bits (of 33) from FF cell cf_fir_24_16_16.$flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.\s13.$verific$n9_reg$cf_fir_24_16_16.v:1175$13177 ($dff).
Removed top 2 bits (of 35) from FF cell cf_fir_24_16_16.$flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$n9_reg$cf_fir_24_16_16.v:529$14907 ($dff).
Removed top 1 bits (of 33) from FF cell cf_fir_24_16_16.$flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$n9_reg$cf_fir_24_16_16.v:744$15592 ($dff).
Removed top 1 bits (of 33) from FF cell cf_fir_24_16_16.$flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$n9_reg$cf_fir_24_16_16.v:529$14907 ($dff).

yosys> peepopt

3.34. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.35. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..

yosys> demuxmap

3.36. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> stat

3.37. Printing statistics.

=== cf_fir_24_16_16 ===

   Number of wires:               1135
   Number of wire bits:          26488
   Number of public wires:        1110
   Number of public wire bits:   26088
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                151
     $add                           24
     $dff                           77
     $mul                           25
     $mux                           25


yosys> wreduce t:$mul

3.38. Executing WREDUCE pass (reducing word size of cells).

yosys> rs_dsp_macc

3.39. Executing RS_DSP_MACC pass.

yosys> techmap -map +/mul2dsp.v -D DSP_A_MAXWIDTH=20 -D DSP_B_MAXWIDTH=18 -D DSP_A_MINWIDTH=11 -D DSP_B_MINWIDTH=10 -D DSP_NAME=$__RS_MUL20X18

3.40. Executing TECHMAP pass (map to technology primitives).

3.40.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

3.40.2. Continuing TECHMAP pass.
Using template $paramod$0918209bb5c6f08b2ecd7ae36d3d7f82c80ec9f5\_80_mul for cells of type $mul.
No more expansions possible.
<suppressed ~152 debug messages>

yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/mul2dsp.v -D DSP_A_MAXWIDTH=10 -D DSP_B_MAXWIDTH=9 -D DSP_A_MINWIDTH=4 -D DSP_B_MINWIDTH=4 -D DSP_NAME=$__RS_MUL10X9

3.41. Executing TECHMAP pass (map to technology primitives).

3.41.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

3.41.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/rapidsilicon/genesis/dsp_map.v -D USE_DSP_CFG_PARAMS=0

3.42. Executing TECHMAP pass (map to technology primitives).

3.42.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_MUL20X18'.
Generating RTLIL representation for module `\$__RS_MUL10X9'.
Successfully finished Verilog frontend.

3.42.2. Continuing TECHMAP pass.
Using template $paramod$3f5ce01024a32f04a4f044c926b5414a98b95ed7\$__RS_MUL20X18 for cells of type $__RS_MUL20X18.
No more expansions possible.
<suppressed ~48 debug messages>

yosys> rs_dsp_simd

3.43. Executing RS_DSP_SIMD pass.

yosys> techmap -map +/rapidsilicon/genesis/dsp_final_map.v

3.44. Executing TECHMAP pass (map to technology primitives).

3.44.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_final_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_final_map.v' to AST representation.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Successfully finished Verilog frontend.

3.44.2. Continuing TECHMAP pass.
Using template dsp_t1_20x18x64_cfg_ports for cells of type dsp_t1_20x18x64_cfg_ports.
No more expansions possible.
<suppressed ~31 debug messages>

yosys> rs_dsp_io_regs

3.45. Executing RS_DSP_IO_REGS pass.

yosys> alumacc

3.46. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module cf_fir_24_16_16:
  creating $macc model for $flatten\s1.\s3.\s8.$verific$add_7$cf_fir_24_16_16.v:336$8562 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.$verific$add_21$cf_fir_24_16_16.v:825$10202 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:814$10191 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.$verific$add_21$cf_fir_24_16_16.v:915$11189 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.$verific$add_7$cf_fir_24_16_16.v:904$11178 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$add_21$cf_fir_24_16_16.v:995$11980 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:984$11969 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$add_21$cf_fir_24_16_16.v:1065$12575 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1054$12564 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$add_21$cf_fir_24_16_16.v:1125$12974 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1114$12963 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1161$13165 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:383$13193 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s7.$verific$add_21$cf_fir_24_16_16.v:634$14974 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:623$14963 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$add_21$cf_fir_24_16_16.v:694$15384 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$add_7$cf_fir_24_16_16.v:683$15373 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:730$15580 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:423$14062 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$add_21$cf_fir_24_16_16.v:571$14938 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:560$14927 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$add_21$cf_fir_24_16_16.v:479$14694 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:468$14683 ($add).
  creating $macc model for $flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$add_7$cf_fir_24_16_16.v:515$14895 ($add).
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$add_7$cf_fir_24_16_16.v:515$14895.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:468$14683.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$add_21$cf_fir_24_16_16.v:479$14694.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:560$14927.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$add_21$cf_fir_24_16_16.v:571$14938.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:423$14062.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:730$15580.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$add_7$cf_fir_24_16_16.v:683$15373.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$add_21$cf_fir_24_16_16.v:694$15384.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:623$14963.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.\s7.$verific$add_21$cf_fir_24_16_16.v:634$14974.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:383$13193.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1161$13165.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1114$12963.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$add_21$cf_fir_24_16_16.v:1125$12974.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1054$12564.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$add_21$cf_fir_24_16_16.v:1065$12575.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:984$11969.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$add_21$cf_fir_24_16_16.v:995$11980.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.$verific$add_7$cf_fir_24_16_16.v:904$11178.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.\s13.$verific$add_21$cf_fir_24_16_16.v:915$11189.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:814$10191.
  creating $alu model for $macc $flatten\s1.\s3.\s8.\s7.$verific$add_21$cf_fir_24_16_16.v:825$10202.
  creating $alu model for $macc $flatten\s1.\s3.\s8.$verific$add_7$cf_fir_24_16_16.v:336$8562.
  creating $alu cell for $flatten\s1.\s3.\s8.$verific$add_7$cf_fir_24_16_16.v:336$8562: $auto$alumacc.cc:485:replace_alu$15670
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.$verific$add_21$cf_fir_24_16_16.v:825$10202: $auto$alumacc.cc:485:replace_alu$15673
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:814$10191: $auto$alumacc.cc:485:replace_alu$15676
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.$verific$add_21$cf_fir_24_16_16.v:915$11189: $auto$alumacc.cc:485:replace_alu$15679
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.$verific$add_7$cf_fir_24_16_16.v:904$11178: $auto$alumacc.cc:485:replace_alu$15682
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$add_21$cf_fir_24_16_16.v:995$11980: $auto$alumacc.cc:485:replace_alu$15685
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:984$11969: $auto$alumacc.cc:485:replace_alu$15688
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$add_21$cf_fir_24_16_16.v:1065$12575: $auto$alumacc.cc:485:replace_alu$15691
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1054$12564: $auto$alumacc.cc:485:replace_alu$15694
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$add_21$cf_fir_24_16_16.v:1125$12974: $auto$alumacc.cc:485:replace_alu$15697
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1114$12963: $auto$alumacc.cc:485:replace_alu$15700
  creating $alu cell for $flatten\s1.\s3.\s8.\s7.\s13.\s13.\s13.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:1161$13165: $auto$alumacc.cc:485:replace_alu$15703
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:383$13193: $auto$alumacc.cc:485:replace_alu$15706
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s7.$verific$add_21$cf_fir_24_16_16.v:634$14974: $auto$alumacc.cc:485:replace_alu$15709
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:623$14963: $auto$alumacc.cc:485:replace_alu$15712
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$add_21$cf_fir_24_16_16.v:694$15384: $auto$alumacc.cc:485:replace_alu$15715
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s7.\s13.$verific$add_7$cf_fir_24_16_16.v:683$15373: $auto$alumacc.cc:485:replace_alu$15718
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s7.\s13.\s13.$verific$add_7$cf_fir_24_16_16.v:730$15580: $auto$alumacc.cc:485:replace_alu$15721
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:423$14062: $auto$alumacc.cc:485:replace_alu$15724
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$add_21$cf_fir_24_16_16.v:571$14938: $auto$alumacc.cc:485:replace_alu$15727
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s8.\s7.$verific$add_7$cf_fir_24_16_16.v:560$14927: $auto$alumacc.cc:485:replace_alu$15730
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$add_21$cf_fir_24_16_16.v:479$14694: $auto$alumacc.cc:485:replace_alu$15733
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s8.\s8.$verific$add_7$cf_fir_24_16_16.v:468$14683: $auto$alumacc.cc:485:replace_alu$15736
  creating $alu cell for $flatten\s1.\s3.\s8.\s8.\s8.\s8.\s13.$verific$add_7$cf_fir_24_16_16.v:515$14895: $auto$alumacc.cc:485:replace_alu$15739
  created 24 $alu and 0 $macc cells.

yosys> opt_expr

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.

yosys> opt_merge -nomux

3.48. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.49. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_fir_24_16_16..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~25 debug messages>

yosys> opt_reduce

3.50. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_fir_24_16_16.
Performed a total of 0 changes.

yosys> opt_merge

3.51. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_share

3.52. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.53. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..
Removed 0 unused cells and 675 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.55. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.
MAX OPT ITERATION = 1

yosys> stat

3.56. Printing statistics.

=== cf_fir_24_16_16 ===

   Number of wires:               1233
   Number of wire bits:          29091
   Number of public wires:        1110
   Number of public wire bits:   26088
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                151
     $alu                           24
     $dff                           77
     $mux                           25
     RS_DSP2_MULT                   25


yosys> memory -nomap

3.57. Executing MEMORY pass.

yosys> opt_mem

3.57.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.57.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.57.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.57.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.57.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.57.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..

yosys> memory_share

3.57.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.57.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.57.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..

yosys> memory_collect

3.57.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.58. Printing statistics.

=== cf_fir_24_16_16 ===

   Number of wires:               1233
   Number of wire bits:          29091
   Number of public wires:        1110
   Number of public wire bits:   26088
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                151
     $alu                           24
     $dff                           77
     $mux                           25
     RS_DSP2_MULT                   25


yosys> muxpack

3.59. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~25 debug messages>

yosys> opt_clean

3.60. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..

yosys> memory_bram -rules +/rapidsilicon/genesis/brams.txt

3.61. Executing MEMORY_BRAM pass (mapping $mem cells to block memories).

yosys> techmap -map +/rapidsilicon/genesis/brams_map.v

3.62. Executing TECHMAP pass (map to technology primitives).

3.62.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/brams_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/brams_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_TDP'.
/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/brams_map.v:236: Warning: Range [2:0] select out of bounds on signal `\DOP': Setting 1 MSB bits to undef.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_SDP'.
Successfully finished Verilog frontend.

3.62.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~5 debug messages>

yosys> pmuxtree

3.63. Executing PMUXTREE pass.

yosys> muxpack

3.64. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~25 debug messages>

yosys> memory_map

3.65. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.66. Printing statistics.

=== cf_fir_24_16_16 ===

   Number of wires:               1233
   Number of wire bits:          29091
   Number of public wires:        1110
   Number of public wire bits:   26088
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                151
     $alu                           24
     $dff                           77
     $mux                           25
     RS_DSP2_MULT                   25


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.67. Executing TECHMAP pass (map to technology primitives).

3.67.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.67.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.67.3. Continuing TECHMAP pass.
Using template $paramod$5030a10823ed71fc93d30a8f70ad7915e2e2ef92\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $mux.
Using template $paramod$a2ca127b29d90cb5185f64ad52e7d585239d0c49\_80_rs_alu for cells of type $alu.
Using template $paramod$672b960779eb221571e928cb5b2e3f12c11445d6\_80_rs_alu for cells of type $alu.
Using template $paramod$7d53733be90b4f6decda9d83b89a52b4cd1ea488\_80_rs_alu for cells of type $alu.
Using template $paramod$7ff9b7d2c704977b3beff47161e1598672161854\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $pos.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $xor.
No more expansions possible.
<suppressed ~568 debug messages>

yosys> stat

3.68. Printing statistics.

=== cf_fir_24_16_16 ===

   Number of wires:               1761
   Number of wire bits:          40703
   Number of public wires:        1110
   Number of public wire bits:   26088
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               5887
     $_DFF_P_                     2110
     $_MUX_                       1262
     $_NOT_                        814
     $_XOR_                        862
     RS_DSP2_MULT                   25
     adder_carry                   814


yosys> opt_expr

3.69. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.
<suppressed ~814 debug messages>

yosys> opt_merge -nomux

3.70. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
<suppressed ~153 debug messages>
Removed a total of 51 cells.

yosys> opt_muxtree

3.71. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_fir_24_16_16..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.72. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_fir_24_16_16.
Performed a total of 0 changes.

yosys> opt_merge

3.73. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_share

3.74. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.75. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.76. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..
Removed 811 unused cells and 504 unused wires.
<suppressed ~812 debug messages>

yosys> opt_expr

3.77. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.

yosys> opt_muxtree

3.78. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_fir_24_16_16..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.79. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_fir_24_16_16.
Performed a total of 0 changes.

yosys> opt_merge

3.80. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_share

3.81. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.82. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.83. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..

yosys> opt_expr

3.84. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.85. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.
<suppressed ~25 debug messages>

yosys> techmap -map +/techmap.v

3.86. Executing TECHMAP pass (map to technology primitives).

3.86.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.86.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.87. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.

yosys> opt_merge -nomux

3.88. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.89. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_fir_24_16_16..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.90. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_fir_24_16_16.
Performed a total of 0 changes.

yosys> opt_merge

3.91. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.92. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.93. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..
Removed 0 unused cells and 25 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.94. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.
MAX OPT ITERATION = 1

yosys> abc -dff

3.95. Executing ABC pass (technology mapping using ABC).

3.95.1. Summary of detected clock domains:
  4211 cells in clk=\clock_c, en={ }, arst={ }, srst={ }

3.95.2. Extracting gate netlist of module `\cf_fir_24_16_16' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock_c
Extracted 3372 gates and 4980 wires to a netlist network with 1607 inputs and 1969 outputs.

3.95.2.1. Executing ABC.

yosys> abc -dff

3.96. Executing ABC pass (technology mapping using ABC).

3.96.1. Summary of detected clock domains:
  4235 cells in clk=\clock_c, en={ }, arst={ }, srst={ }

3.96.2. Extracting gate netlist of module `\cf_fir_24_16_16' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock_c
Extracted 3396 gates and 5003 wires to a netlist network with 1607 inputs and 1969 outputs.

3.96.2.1. Executing ABC.

yosys> abc -dff

3.97. Executing ABC pass (technology mapping using ABC).

3.97.1. Summary of detected clock domains:
  4235 cells in clk=\clock_c, en={ }, arst={ }, srst={ }

3.97.2. Extracting gate netlist of module `\cf_fir_24_16_16' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock_c
Extracted 3396 gates and 5003 wires to a netlist network with 1607 inputs and 1969 outputs.

3.97.2.1. Executing ABC.

yosys> abc -dff

3.98. Executing ABC pass (technology mapping using ABC).

3.98.1. Summary of detected clock domains:
  4235 cells in clk=\clock_c, en={ }, arst={ }, srst={ }

3.98.2. Extracting gate netlist of module `\cf_fir_24_16_16' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock_c
Extracted 3396 gates and 5003 wires to a netlist network with 1607 inputs and 1969 outputs.

3.98.2.1. Executing ABC.

yosys> opt_ffinv

3.99. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.100. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.

yosys> opt_merge -nomux

3.101. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.102. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_fir_24_16_16..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.103. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_fir_24_16_16.
Performed a total of 0 changes.

yosys> opt_merge

3.104. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_share

3.105. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.106. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.107. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..
Removed 0 unused cells and 30361 unused wires.
<suppressed ~292 debug messages>

yosys> opt_expr

3.108. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.109. Executing BMUXMAP pass.

yosys> demuxmap

3.110. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_zLIX9h/abc_tmp_1.scr

3.111. Executing ABC pass (technology mapping using ABC).

3.111.1. Extracting gate netlist of module `\cf_fir_24_16_16' to `<abc-temp-dir>/input.blif'..
Extracted 1286 gates and 3288 wires to a netlist network with 2002 inputs and 1214 outputs.

3.111.1.1. Executing ABC.
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.04 sec. at Pass 0]
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.48 sec. at Pass 1]
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.16 sec. at Pass 2]
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.22 sec. at Pass 3]
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.18 sec. at Pass 4]
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.23 sec. at Pass 5]
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.13 sec. at Pass 6]

yosys> opt_expr

3.112. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.

yosys> opt_merge -nomux

3.113. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.114. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_fir_24_16_16..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.115. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_fir_24_16_16.
Performed a total of 0 changes.

yosys> opt_merge

3.116. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_share

3.117. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.118. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.119. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..
Removed 0 unused cells and 3288 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.120. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.121. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.122. Printing statistics.

=== cf_fir_24_16_16 ===

   Number of wires:               2271
   Number of wire bits:          21364
   Number of public wires:         819
   Number of public wire bits:   17383
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               4163
     $_DFF_P_                     2110
     $lut                         1214
     RS_DSP2_MULT                   25
     adder_carry                   814


yosys> shregmap -minlen 8 -maxlen 20

3.123. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.124. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.125. Printing statistics.

=== cf_fir_24_16_16 ===

   Number of wires:               2271
   Number of wire bits:          21364
   Number of public wires:         819
   Number of public wire bits:   17383
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               4163
     $_DFF_P_                     2110
     $lut                         1214
     RS_DSP2_MULT                   25
     adder_carry                   814


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.126. Executing TECHMAP pass (map to technology primitives).

3.126.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.126.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.126.3. Continuing TECHMAP pass.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~3460 debug messages>

yosys> opt_expr -mux_undef

3.127. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.
<suppressed ~1310 debug messages>

yosys> simplemap

3.128. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.129. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.

yosys> opt_merge

3.130. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
<suppressed ~1275 debug messages>
Removed a total of 425 cells.

yosys> opt_dff -nodffe -nosdff

3.131. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.132. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..
Removed 0 unused cells and 7969 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.133. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.

yosys> opt_merge -nomux

3.134. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.135. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_fir_24_16_16..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.136. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_fir_24_16_16.
Performed a total of 0 changes.

yosys> opt_merge

3.137. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_share

3.138. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.139. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.140. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..

yosys> opt_expr

3.141. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_zLIX9h/abc_tmp_2.scr

3.142. Executing ABC pass (technology mapping using ABC).

3.142.1. Extracting gate netlist of module `\cf_fir_24_16_16' to `<abc-temp-dir>/input.blif'..
Extracted 2099 gates and 4103 wires to a netlist network with 2002 inputs and 1214 outputs.

3.142.1.1. Executing ABC.
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.04 sec. at Pass 0]
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.48 sec. at Pass 1]
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.16 sec. at Pass 2]
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.22 sec. at Pass 3]
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.17 sec. at Pass 4]
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.24 sec. at Pass 5]
DE:   #PIs = 2002  #Luts =  1214  Max Lvl =   1  Avg Lvl =   1.00  [   0.06 sec. at Pass 6]

yosys> opt_expr

3.143. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.

yosys> opt_merge -nomux

3.144. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.145. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_fir_24_16_16..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.146. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_fir_24_16_16.
Performed a total of 0 changes.

yosys> opt_merge

3.147. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_fir_24_16_16'.
Removed a total of 0 cells.

yosys> opt_share

3.148. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.149. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.150. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..
Removed 0 unused cells and 4053 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.151. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_fir_24_16_16.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.152. Executing HIERARCHY pass (managing design hierarchy).

3.152.1. Analyzing design hierarchy..
Top module:  \cf_fir_24_16_16

3.152.2. Analyzing design hierarchy..
Top module:  \cf_fir_24_16_16
Removed 0 unused modules.

yosys> stat

3.153. Printing statistics.

=== cf_fir_24_16_16 ===

   Number of wires:               2271
   Number of wire bits:          21364
   Number of public wires:         819
   Number of public wire bits:   17383
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               4163
     $lut                         1214
     RS_DSP2_MULT                   25
     adder_carry                   814
     dffsre                       2110


yosys> opt_clean -purge

3.154. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_fir_24_16_16..
Removed 0 unused cells and 692 unused wires.
<suppressed ~692 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.155. Executing Verilog backend.
Dumping module `\cf_fir_24_16_16'.

Warnings: 1 unique messages, 1 total
End of script. Logfile hash: cb694cc1dc, CPU: user 9.37s system 0.15s, MEM: 94.65 MB peak
Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)
Time spent: 64% 6x abc (15 sec), 7% 18x opt_clean (1 sec), ...
real 18.67
user 20.34
sys 3.54
