
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.14+36 (git sha1 15a4e900b, gcc 7.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k demux.v io_reg_max.v io_reg_max_2.v mux.v

yosys> verific -vlog2k demux.v io_reg_max.v io_reg_max_2.v mux.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'demux.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'io_reg_max.v'
VERIFIC-INFO [VERI-2561] io_reg_max.v:14: undeclared symbol 'mux_out', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'io_reg_max_2.v'
VERIFIC-INFO [VERI-2561] io_reg_max_2.v:14: undeclared symbol 'mux_out', assumed default net type 'wire'
VERIFIC-WARNING [VERI-1206] io_reg_max_2.v:18: overwriting previous definition of module 'io_reg_max'
VERIFIC-INFO [VERI-2142] io_reg_max.v:18: previous definition of design element 'io_reg_max' is here
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'mux.v'

yosys> synth_rs -top io_reg_max -tech generic -goal area -no_dsp -no_bram -verilog io_reg_max.verilog

3. Executing synth_rs pass.

yosys> hierarchy -check -top io_reg_max

3.1. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] io_reg_max_2.v:1: compiling module 'io_reg_max'
VERIFIC-INFO [VERI-1018] mux.v:2: compiling module 'mux_512x1'
VERIFIC-INFO [VERI-1018] mux.v:16: compiling module 'mux_256x1'
VERIFIC-INFO [VERI-1018] mux.v:30: compiling module 'mux_128x1'
VERIFIC-INFO [VERI-1018] mux.v:44: compiling module 'mux_64x1'
VERIFIC-INFO [VERI-1018] mux.v:58: compiling module 'mux_32x1'
VERIFIC-INFO [VERI-1018] mux.v:72: compiling module 'mux_16x1'
VERIFIC-INFO [VERI-1018] mux.v:86: compiling module 'mux_8x1'
VERIFIC-INFO [VERI-1018] mux.v:100: compiling module 'mux_4x1'
VERIFIC-INFO [VERI-1018] mux.v:114: compiling module 'mux_2x1_reg'
VERIFIC-INFO [VERI-1018] mux.v:132: compiling module 'mux_2x1'
VERIFIC-WARNING [VERI-1330] io_reg_max_2.v:14: actual bit length 502 differs from formal bit length 512 for port 'in'
VERIFIC-WARNING [VERI-1330] io_reg_max_2.v:14: actual bit length 10 differs from formal bit length 9 for port 'sel'
VERIFIC-INFO [VERI-1018] demux.v:2: compiling module 'demux_1x512'
VERIFIC-INFO [VERI-1018] demux.v:116: compiling module 'demux_1x2'
VERIFIC-INFO [VERI-1018] demux.v:16: compiling module 'demux_1x256'
VERIFIC-INFO [VERI-1018] demux.v:30: compiling module 'demux_1x128'
VERIFIC-INFO [VERI-1018] demux.v:44: compiling module 'demux_1x64'
VERIFIC-INFO [VERI-1018] demux.v:58: compiling module 'demux_1x32'
VERIFIC-INFO [VERI-1018] demux.v:73: compiling module 'demux_1x16'
VERIFIC-INFO [VERI-1018] demux.v:87: compiling module 'demux_1x8'
VERIFIC-INFO [VERI-1018] demux.v:101: compiling module 'demux_1x4'
VERIFIC-INFO [VERI-1018] demux.v:125: compiling module 'demux_1x2_reg'
VERIFIC-WARNING [VERI-1330] io_reg_max_2.v:15: actual bit length 10 differs from formal bit length 9 for port 'sel'
VERIFIC-WARNING [VERI-1330] io_reg_max_2.v:15: actual bit length 502 differs from formal bit length 512 for port 'out'
Importing module io_reg_max.
Importing module mux_512x1.
Importing module mux_256x1.
Importing module mux_128x1.
Importing module mux_64x1.
Importing module mux_32x1.
Importing module mux_16x1.
Importing module mux_8x1.
Importing module mux_4x1.
Importing module mux_2x1_reg.
Importing module mux_2x1.
Importing module demux_1x512.
Importing module demux_1x2.
Importing module demux_1x256.
Importing module demux_1x128.
Importing module demux_1x64.
Importing module demux_1x32.
Importing module demux_1x16.
Importing module demux_1x8.
Importing module demux_1x4.
Importing module demux_1x2_reg.

3.1.1. Analyzing design hierarchy..
Top module:  \io_reg_max
Used module:     \demux_1x512
Used module:         \demux_1x256
Used module:             \demux_1x128
Used module:                 \demux_1x64
Used module:                     \demux_1x32
Used module:                         \demux_1x16
Used module:                             \demux_1x8
Used module:                                 \demux_1x4
Used module:                                     \demux_1x2_reg
Used module:                                     \demux_1x2
Used module:     \mux_512x1
Used module:         \mux_2x1
Used module:         \mux_256x1
Used module:             \mux_128x1
Used module:                 \mux_64x1
Used module:                     \mux_32x1
Used module:                         \mux_16x1
Used module:                             \mux_8x1
Used module:                                 \mux_4x1
Used module:                                     \mux_2x1_reg

3.1.2. Analyzing design hierarchy..
Top module:  \io_reg_max
Used module:     \demux_1x512
Used module:         \demux_1x256
Used module:             \demux_1x128
Used module:                 \demux_1x64
Used module:                     \demux_1x32
Used module:                         \demux_1x16
Used module:                             \demux_1x8
Used module:                                 \demux_1x4
Used module:                                     \demux_1x2_reg
Used module:                                     \demux_1x2
Used module:     \mux_512x1
Used module:         \mux_2x1
Used module:         \mux_256x1
Used module:             \mux_128x1
Used module:                 \mux_64x1
Used module:                     \mux_32x1
Used module:                         \mux_16x1
Used module:                             \mux_8x1
Used module:                                 \mux_4x1
Used module:                                     \mux_2x1_reg
Removed 0 unused modules.
Warning: Resizing cell port io_reg_max.demux0.out from 502 bits to 512 bits.

yosys> proc

3.2. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.2.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.2.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.2.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.2.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.2.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.2.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.2.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.2.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.2.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.2.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.2.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module demux_1x2_reg.
Optimizing module demux_1x4.
Optimizing module demux_1x8.
Optimizing module demux_1x16.
Optimizing module demux_1x32.
Optimizing module demux_1x64.
Optimizing module demux_1x128.
Optimizing module demux_1x256.
Optimizing module demux_1x2.
Optimizing module demux_1x512.
Optimizing module mux_2x1.
Optimizing module mux_2x1_reg.
Optimizing module mux_4x1.
Optimizing module mux_8x1.
Optimizing module mux_16x1.
Optimizing module mux_32x1.
Optimizing module mux_64x1.
Optimizing module mux_128x1.
Optimizing module mux_256x1.
Optimizing module mux_512x1.
Optimizing module io_reg_max.

yosys> flatten

3.3. Executing FLATTEN pass (flatten design).
Deleting now unused module demux_1x2_reg.
Deleting now unused module demux_1x4.
Deleting now unused module demux_1x8.
Deleting now unused module demux_1x16.
Deleting now unused module demux_1x32.
Deleting now unused module demux_1x64.
Deleting now unused module demux_1x128.
Deleting now unused module demux_1x256.
Deleting now unused module demux_1x2.
Deleting now unused module demux_1x512.
Deleting now unused module mux_2x1.
Deleting now unused module mux_2x1_reg.
Deleting now unused module mux_4x1.
Deleting now unused module mux_8x1.
Deleting now unused module mux_16x1.
Deleting now unused module mux_32x1.
Deleting now unused module mux_64x1.
Deleting now unused module mux_128x1.
Deleting now unused module mux_256x1.
Deleting now unused module mux_512x1.
<suppressed ~50 debug messages>

yosys> tribuf -logic

3.4. Executing TRIBUF pass.

yosys> opt_expr

3.5. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

yosys> opt_clean

3.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..
Removed 25 unused cells and 18399 unused wires.
<suppressed ~1828 debug messages>

yosys> check

3.7. Executing CHECK pass (checking for obvious problems).
Checking module io_reg_max...
Found and reported 0 problems.

yosys> deminout

3.8. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt -nodffe -nosdff

3.9. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.9.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

yosys> opt_merge -nomux

3.9.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
<suppressed ~27 debug messages>
Removed a total of 9 cells.

yosys> opt_muxtree

3.9.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_max..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~548 debug messages>

yosys> opt_reduce

3.9.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_max.
  Optimizing cells in module \io_reg_max.
Performed a total of 8 changes.

yosys> opt_merge

3.9.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.9.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Removing never-active async load on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($aldff) from module io_reg_max.
Setting constant 0-bit at position 0 on $flatten\mux0.\m512_1.\m256_1.\m128_1.\m64_1.\m32_1.\m16_0.\m8_1.\m4_1.$verific$a_out_reg$mux.v:124$2210 ($dff) from module io_reg_max.

yosys> opt_clean

3.9.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..
Removed 0 unused cells and 37 unused wires.
<suppressed ~37 debug messages>

yosys> opt_expr

3.9.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

3.9.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.9.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_max..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~553 debug messages>

yosys> opt_reduce

3.9.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_max.
Performed a total of 0 changes.

yosys> opt_merge

3.9.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.9.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.9.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

yosys> opt_expr

3.9.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

3.9.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

3.10. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.10.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.10.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.10.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.10.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

yosys> fsm_opt

3.10.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode

3.10.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.10.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.10.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_max..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~553 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_max.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_2.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_2.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_2.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_2.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_2.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_2.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_2.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_2.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_2.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_2.d16_1.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_2.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_2.d8_1.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_2.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_2.d4_1.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_2.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [1], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_2.out [0], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [1], rval = 1'0).
Adding SRST signal on $flatten\demux0.\d512_1.\d256_1.\d128_1.\d64_1.\d32_1.\d16_1.\d8_1.\d4_1.$verific$out_reg$demux.v:136$3386 ($dff) from module io_reg_max (D = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_0.out [0], Q = \demux0.d512_1.d256_1.d128_1.d64_1.d32_1.d16_1.d8_1.d4_1.out [0], rval = 1'0).

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..
Removed 246 unused cells and 246 unused wires.
<suppressed ~492 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_max..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~277 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_max.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.12. Executing WREDUCE pass (reducing word size of cells).
Removed top 7 bits (of 10) from port B of cell io_reg_max.$verific$xor_3$io_reg_max_2.v:12$5 ($xor).
Removed top 1 bits (of 10) from port Y of cell io_reg_max.$verific$xor_3$io_reg_max_2.v:12$5 ($xor).
Removed top 1 bits (of 10) from port A of cell io_reg_max.$verific$xor_3$io_reg_max_2.v:12$5 ($xor).
Removed top 488 bits (of 490) from port B of cell io_reg_max.$verific$xor_5$io_reg_max_2.v:16$1043 ($xor).
Removed top 1 bits (of 2) from mux cell io_reg_max.$flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_1.\d8_2.\d4_0.$verific$mux_10$demux.v:121$2756 ($mux).
Removed top 1 bits (of 2) from mux cell io_reg_max.$flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_0.$verific$mux_10$demux.v:121$2756 ($mux).
Removed top 1 bits (of 2) from mux cell io_reg_max.$flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_1.\d16_2.\d8_1.\d4_0.$verific$mux_10$demux.v:121$2756 ($mux).
Removed top 1 bits (of 2) from mux cell io_reg_max.$flatten\demux0.\d512_2.\d256_2.\d128_2.\d64_2.\d32_2.\d16_0.$verific$mux_10$demux.v:121$2756 ($mux).

yosys> peepopt

3.13. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.14. Executing PMUXTREE pass.

yosys> opt_clean

3.15. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

yosys> techmap

3.16. Executing TECHMAP pass (map to technology primitives).

3.16.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.16.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $sdff.
No more expansions possible.
<suppressed ~1820 debug messages>

yosys> alumacc

3.17. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module io_reg_max:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.18. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.18.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.
<suppressed ~494 debug messages>

yosys> opt_merge -nomux

3.18.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.18.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_max..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_max.
Performed a total of 0 changes.

yosys> opt_merge

3.18.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_dff

3.18.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.18.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..
Removed 1 unused cells and 0 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.18.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

3.18.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.18.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_max..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_max.
Performed a total of 0 changes.

yosys> opt_merge

3.18.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_dff

3.18.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.18.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

yosys> opt_expr

3.18.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

3.18.16. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.19. Executing MEMORY pass.

yosys> opt_mem

3.19.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.19.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.19.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.19.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.19.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

yosys> memory_share

3.19.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.19.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.19.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

yosys> memory_collect

3.19.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.20. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

yosys> opt_expr -mux_undef

3.21. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

yosys> simplemap

3.22. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

yosys> opt_merge

3.24. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.25. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

yosys> opt -nodffe -nosdff

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_max..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_max.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

3.27.9. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.
<suppressed ~394 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_max..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_max.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

3.30.10. Finished OPT passes. (There is nothing left to do.)

yosys> techmap

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_max..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_max.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_dff

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

3.32.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Extracting gate netlist of module `\io_reg_max' to `<abc-temp-dir>/input.blif'..
Extracted 1003 gates and 1530 wires to a netlist network with 526 inputs and 248 outputs.

3.33.1.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/yosys_verific_rs/result_09-03-2022T20-36-44/All_lut_synth_rs_area.json/io_reg_max/abc_tmp.scr 
ABC: netlist  : i/o =    526/    248  and =    2155  lev =   28 (27.14)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    549  edge =    2051  lev =   14 (13.56)  mem = 0.02 MB
ABC: netlist  : i/o =    526/    248  and =    2322  lev =   28 (22.97)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    455  edge =    2108  lev =    8 (7.07)  mem = 0.02 MB
ABC: netlist  : i/o =    526/    248  and =    2758  lev =   25 (22.63)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    443  edge =    2531  lev =    8 (7.05)  mem = 0.03 MB
ABC: netlist  : i/o =    526/    248  and =    2706  lev =   22 (20.94)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    444  edge =    2466  lev =    8 (7.05)  mem = 0.03 MB
ABC: netlist  : i/o =    526/    248  and =    2502  lev =   28 (25.78)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    449  edge =    2282  lev =    9 (8.94)  mem = 0.02 MB
ABC: netlist  : i/o =    526/    248  and =    2267  lev =   25 (22.53)  mem = 0.06 MB
ABC: Mapping (K=6)  :  lut =    451  edge =    2048  lev =    8 (7.94)  mem = 0.02 MB
ABC: netlist  : i/o =    526/    248  and =    2798  lev =   25 (24.81)  mem = 0.07 MB
ABC: Mapping (K=6)  :  lut =    438  edge =    2563  lev =    8 (7.94)  mem = 0.03 MB
ABC: netlist  : i/o =    526/    248  and =    2798  lev =   25 (24.81)  mem = 0.07 MB
ABC: Mapping (K=6)  :  lut =    439  edge =    2567  lev =    8 (7.94)  mem = 0.03 MB
ABC: netlist  : i/o =    526/    248  and =    2122  lev =   24 (23.19)  mem = 0.06 MB
ABC: Mapping (K=6)  :  lut =    455  edge =    1910  lev =   11 (10.00)  mem = 0.02 MB
ABC: netlist  : i/o =    526/    248  and =    2431  lev =   25 (23.75)  mem = 0.06 MB
ABC: Mapping (K=6)  :  lut =    448  edge =    2206  lev =    9 (7.57)  mem = 0.02 MB
ABC: netlist  : i/o =    526/    248  and =    2563  lev =   25 (23.92)  mem = 0.06 MB
ABC: Mapping (K=6)  :  lut =    443  edge =    2333  lev =   10 (8.38)  mem = 0.03 MB
ABC: netlist  : i/o =    526/    248  and =    2563  lev =   25 (22.62)  mem = 0.06 MB
ABC: Mapping (K=6)  :  lut =    442  edge =    2330  lev =   10 (8.38)  mem = 0.02 MB
ABC: netlist  : i/o =    526/    248  and =    2563  lev =   25 (22.62)  mem = 0.06 MB
ABC: Mapping (K=6)  :  lut =    442  edge =    2330  lev =   10 (8.38)  mem = 0.02 MB
ABC: netlist  : i/o =    526/    248  and =    2798  lev =   25 (24.81)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    438  edge =    2563  lev =    8 (7.94)  mem = 0.03 MB
ABC: netlist  : i/o =    526/    248  and =    2798  lev =   25 (24.81)  mem = 0.07 MB
ABC: Mapping (K=6)  :  lut =    438  edge =    2563  lev =    8 (7.94)  mem = 0.03 MB
ABC: netlist  : i/o =    526/    248  and =    2798  lev =   25 (23.72)  mem = 0.05 MB
ABC: Mapping (K=6)  :  lut =    438  edge =    2563  lev =    8 (7.94)  mem = 0.03 MB
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      438
ABC RESULTS:        internal signals:      756
ABC RESULTS:           input signals:      526
ABC RESULTS:          output signals:      248
Removing temp directory.

yosys> opt

3.34. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.34.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

yosys> opt_merge -nomux

3.34.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.34.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_max..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.34.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_max.
Performed a total of 0 changes.

yosys> opt_merge

3.34.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_dff

3.34.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.34.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..
Removed 0 unused cells and 3914 unused wires.
<suppressed ~3141 debug messages>

yosys> opt_expr

3.34.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

3.34.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.34.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \io_reg_max..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.34.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \io_reg_max.
Performed a total of 0 changes.

yosys> opt_merge

3.34.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\io_reg_max'.
Removed a total of 0 cells.

yosys> opt_dff

3.34.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.34.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..

yosys> opt_expr

3.34.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module io_reg_max.

3.34.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.35. Executing HIERARCHY pass (managing design hierarchy).

3.35.1. Analyzing design hierarchy..
Top module:  \io_reg_max

3.35.2. Analyzing design hierarchy..
Top module:  \io_reg_max
Removed 0 unused modules.

yosys> stat

3.36. Printing statistics.

=== io_reg_max ===

   Number of wires:               4428
   Number of wire bits:          14859
   Number of public wires:        4238
   Number of public wire bits:   14669
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1432
     $_DFF_P_                      502
     $_SDFF_PN0_                   246
     $_SDFF_PP0_                   246
     $lut                          438


yosys> opt_clean -purge

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \io_reg_max..
Removed 0 unused cells and 3482 unused wires.
<suppressed ~3482 debug messages>

yosys> write_verilog -noattr -nohex io_reg_max.verilog

3.38. Executing Verilog backend.

yosys> bmuxmap

3.38.1. Executing BMUXMAP pass.

yosys> demuxmap

3.38.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\io_reg_max'.

Warnings: 6 unique messages, 6 total
End of script. Logfile hash: 0831946078, CPU: user 8.54s system 0.07s, MEM: 72.09 MB peak
Yosys 0.14+36 (git sha1 15a4e900b, gcc 7.1.0 -fPIC -Os)
Time spent: 56% 1x abc (11 sec), 14% 20x opt_clean (2 sec), ...
