
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.40
 Yosys 0.17+76 (git sha1 035496b50, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 08:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl aes_lib.vhd dual_mem.vhd aes_enc.vhd aes_fsm_enc.vhd

yosys> verific -vhdl aes_lib.vhd dual_mem.vhd aes_enc.vhd aes_fsm_enc.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 08:08:21 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'aes_lib.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_1164' from file '/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_1164.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.textio' from file '/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/textio.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_arith' from file '/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_arith.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_unsigned' from file '/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_unsigned.vdb'
VERIFIC-INFO [VHDL-1014] aes_lib.vhd:11: analyzing package 'aes_lib'
VERIFIC-INFO [VHDL-1013] aes_lib.vhd:25: analyzing package body 'aes_lib'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'dual_mem.vhd'
VERIFIC-INFO [VHDL-1012] dual_mem.vhd:20: analyzing entity 'dual_mem'
VERIFIC-INFO [VHDL-1010] dual_mem.vhd:33: analyzing architecture 'rtl'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'aes_enc.vhd'
VERIFIC-INFO [VHDL-1012] aes_enc.vhd:24: analyzing entity 'aes_enc'
VERIFIC-INFO [VHDL-1010] aes_enc.vhd:36: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'aes_fsm_enc.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.numeric_std' from file '/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/numeric_std.vdb'
VERIFIC-INFO [VHDL-1012] aes_fsm_enc.vhd:26: analyzing entity 'aes_fsm_enc'
VERIFIC-INFO [VHDL-1010] aes_fsm_enc.vhd:37: analyzing architecture 'behavioral'

yosys> synth_rs -top aes_fsm_enc -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.55

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top aes_fsm_enc

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] aes_fsm_enc.vhd:26: processing 'aes_fsm_enc(Behavioral)'
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:98: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:133: 'key_data_1' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1251] aes_fsm_enc.vhd:136: 'count' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1613] aes_fsm_enc.vhd:183: incomplete sensitivity list specified; assuming completeness
VERIFIC-WARNING [VHDL-1840] aes_fsm_enc.vhd:183: latch inferred for net 'rst_cnt'
VERIFIC-INFO [VHDL-1067] aes_enc.vhd:24: processing 'aes_enc(Behavioral)'
VERIFIC-INFO [VHDL-1067] dual_mem.vhd:20: processing 'dual_mem(rtl)'
VERIFIC-INFO [VHDL-1754] dual_mem.vhd:36: extracting RAM for identifier 'RAM'
VERIFIC-INFO [VHDL-1067] dual_mem.vhd:20: processing 'dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl)'
VERIFIC-INFO [VHDL-1754] dual_mem.vhd:36: extracting RAM for identifier 'RAM'
Importing module aes_fsm_enc.
Importing module aes_enc(Behavioral).
Importing module dual_mem(rtl).
Importing module dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl).

3.3.1. Analyzing design hierarchy..
Top module:  \aes_fsm_enc
Used module:     \dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl)
Used module:     \aes_enc(Behavioral)
Used module:         \dual_mem(rtl)

3.3.2. Analyzing design hierarchy..
Top module:  \aes_fsm_enc
Used module:     \dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl)
Used module:     \aes_enc(Behavioral)
Used module:         \dual_mem(rtl)
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl).
Optimizing module dual_mem(rtl).
Optimizing module aes_enc(Behavioral).
<suppressed ~4 debug messages>
Optimizing module aes_fsm_enc.
<suppressed ~5 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module dual_mem(addr_length=4,data_length=128,n_addr=10)(rtl).
Deleting now unused module dual_mem(rtl).
Deleting now unused module aes_enc(Behavioral).
<suppressed ~4 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~3 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 4 unused cells and 130 unused wires.
<suppressed ~66 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module aes_fsm_enc...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~10 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$state_reg$aes_fsm_enc.vhd:63$51 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $verific$count_reg$aes_fsm_enc.vhd:197$83 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\SUB_KEYS_DRAM.$verific$read_a_reg$dual_mem.vhd:52$295 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_2.$verific$read_dpra_reg$dual_mem.vhd:52$271 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_2.$verific$read_a_reg$dual_mem.vhd:52$270 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_1.$verific$read_dpra_reg$dual_mem.vhd:52$271 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.\S_BOX_DUAL_1.$verific$read_a_reg$dual_mem.vhd:52$270 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.$verific$sum_proc_1.reg_v_reg$aes_enc.vhd:88$194 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.$verific$sum_proc_1.key_reg_v_reg$aes_enc.vhd:88$195 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.$verific$key_reg_delayed_reg$aes_enc.vhd:122$246 ($aldff) from module aes_fsm_enc.
Removing never-active async load on $flatten\AES_ROUND_N.$verific$gen_output.out_buffer_v_reg$aes_enc.vhd:133$250 ($aldff) from module aes_fsm_enc.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~10 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~10 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $verific$count_reg$aes_fsm_enc.vhd:197$83 ($dff) from module aes_fsm_enc (D = $verific$n1680$42, Q = \count, rval = 4'0000).
Adding EN signal on $auto$ff.cc:262:slice$303 ($sdff) from module aes_fsm_enc (D = $verific$n1675$41, Q = \count).
Adding SRST signal on $flatten\AES_ROUND_N.$verific$sum_proc_1.reg_v_reg$aes_enc.vhd:88$194 ($dff) from module aes_fsm_enc (D = $flatten\AES_ROUND_N.$verific$n736$113, Q = \AES_ROUND_N.sum_proc_1.reg_v, rval = 128'00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000).
Adding EN signal on $auto$ff.cc:262:slice$305 ($sdff) from module aes_fsm_enc (D = $flatten\AES_ROUND_N.$verific$n736$113, Q = \AES_ROUND_N.sum_proc_1.reg_v).
Adding SRST signal on $flatten\AES_ROUND_N.$verific$sum_proc_1.key_reg_v_reg$aes_enc.vhd:88$195 ($dff) from module aes_fsm_enc (D = $flatten\AES_ROUND_N.$verific$n1123$116, Q = \AES_ROUND_N.sum_proc_1.key_reg_v, rval = 128'00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000).
Adding EN signal on $auto$ff.cc:262:slice$309 ($sdff) from module aes_fsm_enc (D = $flatten\AES_ROUND_N.$verific$n1123$116, Q = \AES_ROUND_N.sum_proc_1.key_reg_v).
Adding EN signal on $flatten\AES_ROUND_N.$verific$gen_output.out_buffer_v_reg$aes_enc.vhd:133$250 ($dff) from module aes_fsm_enc (D = { \AES_ROUND_N.sub_tmp_key_3 \AES_ROUND_N.sub_tmp_key_2 \AES_ROUND_N.sub_tmp_key_1 \AES_ROUND_N.sub_tmp_key_0 \AES_ROUND_N.gen_output.out_buffer_v [127:32] }, Q = \AES_ROUND_N.gen_output.out_buffer_v).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 5 unused cells and 5 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~2 debug messages>

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~9 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.13.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~9 debug messages>

yosys> opt_reduce

3.13.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.13.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.13.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.13.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 4) from mux cell aes_fsm_enc.$verific$mux_303$aes_fsm_enc.vhd:140$63 ($mux).
Removed top 3 bits (of 4) from port A of cell aes_fsm_enc.$verific$equal_350$aes_fsm_enc.vhd:190$77 ($eq).
Removed top 3 bits (of 4) from port B of cell aes_fsm_enc.$verific$add_354$aes_fsm_enc.vhd:194$79 ($add).
Removed top 96 bits (of 128) from FF cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$key_reg_delayed_reg$aes_enc.vhd:122$246 ($dff).
Removed top 1 bits (of 2) from port A of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_107$aes_lib.vhd:32$218 ($and).
Removed top 1 bits (of 2) from port B of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_107$aes_lib.vhd:32$218 ($and).
Removed top 1 bits (of 2) from port Y of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_107$aes_lib.vhd:32$218 ($and).
Removed top 1 bits (of 2) from port A of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_105$aes_lib.vhd:32$209 ($and).
Removed top 1 bits (of 2) from port B of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_105$aes_lib.vhd:32$209 ($and).
Removed top 1 bits (of 2) from port Y of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_105$aes_lib.vhd:32$209 ($and).
Removed top 1 bits (of 2) from port A of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_103$aes_lib.vhd:32$199 ($and).
Removed top 1 bits (of 2) from port B of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_103$aes_lib.vhd:32$199 ($and).
Removed top 1 bits (of 2) from port Y of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_103$aes_lib.vhd:32$199 ($and).
Removed top 1 bits (of 2) from port A of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_102$aes_lib.vhd:32$183 ($and).
Removed top 1 bits (of 2) from port B of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_102$aes_lib.vhd:32$183 ($and).
Removed top 1 bits (of 2) from port Y of cell aes_fsm_enc.$flatten\AES_ROUND_N.$verific$and_102$aes_lib.vhd:32$183 ($and).
Removed top 3 bits (of 8) from wire aes_fsm_enc.$flatten\AES_ROUND_N.$verific$n1898$118.
Removed top 3 bits (of 8) from wire aes_fsm_enc.$flatten\AES_ROUND_N.$verific$n1925$121.
Removed top 3 bits (of 8) from wire aes_fsm_enc.$flatten\AES_ROUND_N.$verific$n2042$131.
Removed top 3 bits (of 8) from wire aes_fsm_enc.$flatten\AES_ROUND_N.$verific$n2159$141.
Removed top 1 bits (of 4) from wire aes_fsm_enc.$verific$n1132$30.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 5 unused wires.
<suppressed ~1 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module aes_fsm_enc:
  creating $macc model for $verific$add_354$aes_fsm_enc.vhd:194$79 ($add).
  creating $alu model for $macc $verific$add_354$aes_fsm_enc.vhd:194$79.
  creating $alu cell for $verific$add_354$aes_fsm_enc.vhd:194$79: $auto$alumacc.cc:485:replace_alu$319
  created 1 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~4 debug messages>

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~9 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~9 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                108
   Number of wire bits:           3393
   Number of public wires:          72
   Number of public wire bits:    2564
   Number of memories:               3
   Number of memory bits:         5376
   Number of processes:              0
   Number of cells:                 69
     $adff                           1
     $alu                            1
     $bmux                           9
     $dff                            6
     $dffe                           1
     $dlatch                         1
     $eq                             2
     $memrd                          5
     $memwr                          3
     $mux                           11
     $reduce_bool                    1
     $sdffe                          3
     $xor                           25


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_1.RAM: removing const-x lane 7
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 0
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 1
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 2
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 3
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 4
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 5
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 6
aes_fsm_enc.AES_ROUND_N.S_BOX_DUAL_2.RAM: removing const-x lane 7
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 0
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 1
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 2
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 3
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 4
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 5
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 6
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 7
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 8
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 9
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 10
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 11
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 12
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 13
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 14
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 15
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 16
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 17
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 18
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 19
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 20
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 21
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 22
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 23
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 24
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 25
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 26
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 27
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 28
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 29
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 30
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 31
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 32
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 33
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 34
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 35
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 36
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 37
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 38
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 39
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 40
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 41
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 42
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 43
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 44
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 45
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 46
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 47
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 48
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 49
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 50
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 51
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 52
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 53
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 54
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 55
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 56
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 57
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 58
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 59
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 60
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 61
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 62
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 63
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 64
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 65
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 66
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 67
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 68
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 69
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 70
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 71
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 72
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 73
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 74
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 75
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 76
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 77
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 78
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 79
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 80
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 81
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 82
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 83
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 84
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 85
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 86
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 87
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 88
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 89
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 90
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 91
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 92
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 93
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 94
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 95
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 96
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 97
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 98
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 99
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 100
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 101
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 102
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 103
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 104
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 105
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 106
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 107
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 108
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 109
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 110
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 111
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 112
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 113
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 114
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 115
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 116
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 117
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 118
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 119
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 120
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 121
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 122
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 123
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 124
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 125
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 126
aes_fsm_enc.SUB_KEYS_DRAM.RAM: removing const-x lane 127
Performed a total of 6 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.21.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.21.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `$auto$memory_bmux2rom.cc:63:execute$337'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$334'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$331'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$328'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$325'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port `$auto$memory_bmux2rom.cc:63:execute$322'[0] in module `\aes_fsm_enc': no output FF found.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$337'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$334'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$331'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$328'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$325'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.
Checking read port address `$auto$memory_bmux2rom.cc:63:execute$322'[0] in module `\aes_fsm_enc': address FF has async set and/or reset, not supported.

yosys> opt_clean

3.21.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 10 unused cells and 16 unused wires.
<suppressed ~24 debug messages>

yosys> memory_share

3.21.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> memory_collect

3.21.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                 92
   Number of wire bits:           2429
   Number of public wires:          59
   Number of public wire bits:    1984
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 51
     $adff                           1
     $alu                            1
     $bmux                           2
     $dff                            1
     $dffe                           1
     $dlatch                         1
     $eq                             2
     $mem_v2                         6
     $mux                            9
     $reduce_bool                    1
     $sdffe                          2
     $xor                           24


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> stat

3.24. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                 92
   Number of wire bits:           2429
   Number of public wires:          59
   Number of public wire bits:    1984
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 51
     $adff                           1
     $alu                            1
     $bmux                           2
     $dff                            1
     $dffe                           1
     $dlatch                         1
     $eq                             2
     $mem_v2                         6
     $mux                            9
     $reduce_bool                    1
     $sdffe                          2
     $xor                           24


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $reduce_bool.
Using template $paramod$32a7b7b86c07519b7537abc18e96f0331f97914d\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $dlatch.
Using extmapper simplemap for cells of type $sdffe.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~349 debug messages>

yosys> stat

3.26. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                141
   Number of wire bits:           5598
   Number of public wires:          59
   Number of public wire bits:    1984
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2823
     $_AND_                         10
     $_DFFE_PP_                    128
     $_DFF_PP0_                      4
     $_DFF_P_                       32
     $_DLATCH_P_                     1
     $_MUX_                       2283
     $_NOT_                          6
     $_OR_                          12
     $_SDFFE_PP0P_                 132
     $_XOR_                        209
     $mem_v2                         6


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~1250 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~2820 debug messages>
Removed a total of 940 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 5 unused cells and 64 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~1 debug messages>

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$578 ($_DFF_PP0_) from module aes_fsm_enc (D = \next_state [0], Q = \state [0]).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~4 debug messages>

3.27.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.27.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.27.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.27.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.27.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.27.30. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~205 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 1 unused cells and 6 unused wires.
<suppressed ~4 debug messages>

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory $auto$memory_bmux2rom.cc:63:execute$322 in module \aes_fsm_enc:
  created 16 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$325 in module \aes_fsm_enc:
  created 16 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$331 in module \aes_fsm_enc:
  created 8 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 7 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$334 in module \aes_fsm_enc:
  created 16 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.
Mapping memory $auto$memory_bmux2rom.cc:63:execute$337 in module \aes_fsm_enc:
  created 16 $dff cells and 0 static cells of width 1.
  read interface: 0 $dff and 15 $mux cells.
  write interface: 0 write mux blocks.

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[0]$3328 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[1]$3330 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[2]$3332 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[3]$3334 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[4]$3336 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[5]$3338 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[6]$3340 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[7]$3342 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[8]$3344 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[9]$3346 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[10]$3348 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[11]$3350 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[12]$3352 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[13]$3354 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[14]$3356 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$322[15]$3358 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[0]$3405 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[1]$3407 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[2]$3409 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[3]$3411 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[4]$3413 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[5]$3415 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[6]$3417 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[7]$3419 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[8]$3421 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[9]$3423 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[10]$3425 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[11]$3427 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[12]$3429 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[13]$3431 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[14]$3433 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$325[15]$3435 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$331[0]$3482 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$331[1]$3484 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$331[2]$3486 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$331[3]$3488 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$331[4]$3490 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$331[5]$3492 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$331[6]$3494 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$331[7]$3496 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[0]$3519 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[1]$3521 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[2]$3523 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[3]$3525 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[4]$3527 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[5]$3529 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[6]$3531 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[7]$3533 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[8]$3535 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[9]$3537 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[10]$3539 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[11]$3541 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[12]$3543 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[13]$3545 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[14]$3547 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$334[15]$3549 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[0]$3596 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[1]$3598 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[2]$3600 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[3]$3602 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[4]$3604 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[5]$3606 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[6]$3608 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[7]$3610 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[8]$3612 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[9]$3614 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[10]$3616 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[11]$3618 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[12]$3620 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[13]$3622 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[14]$3624 ($dff) from module aes_fsm_enc (removing D path).
Handling const CLK on $memory$auto$memory_bmux2rom.cc:63:execute$337[15]$3626 ($dff) from module aes_fsm_enc (removing D path).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 216 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~48 debug messages>

3.30.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce -full

3.30.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.30.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_share

3.30.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 47 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~15 debug messages>

3.30.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce -full

3.30.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.30.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.30.22. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $mux $memory$auto$memory_bmux2rom.cc:63:execute$322$rdmux[0][0][0]$3360 in front of them:
        $memory$auto$memory_bmux2rom.cc:63:execute$322$rdmux[0][1][1]$3366
        $memory$auto$memory_bmux2rom.cc:63:execute$322$rdmux[0][1][0]$3363


yosys> opt_dff

3.30.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 7 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~2 debug messages>

3.30.26. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce -full

3.30.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.30.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.30.30. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.30.34. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.35. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce -full

3.30.36. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.30.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.30.38. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.39. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.40. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr -full

3.30.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.30.42. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~85 debug messages>

yosys> opt -sat

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~9 debug messages>
Removed a total of 3 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.32.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.32.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.32.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.32.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.32.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  36 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  128 cells in clk=\clk, en=\AES_ROUND_N.enc, arst={ }, srst={ }
  6 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$3312, arst=\rst, srst={ }
  257 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$307, arst={ }, srst=\rst
  32 cells in clk=\clk, en={ }, arst={ }, srst={ }
  20 cells in clk=\clk, en=!$auto$simplemap.cc:257:simplemap_eqne$2599, arst={ }, srst=\rst_cnt

3.33.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 36 gates and 42 wires to a netlist network with 4 inputs and 10 outputs.

3.33.2.1. Executing ABC.

3.33.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$3767$AES_ROUND_N.enc
Extracted 128 gates and 160 wires to a netlist network with 32 inputs and 128 outputs.

3.33.3.1. Executing ABC.

3.33.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$3312, asynchronously reset by \rst
Extracted 6 gates and 12 wires to a netlist network with 5 inputs and 5 outputs.

3.33.4.1. Executing ABC.

3.33.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$307, synchronously reset by \rst
Extracted 257 gates and 260 wires to a netlist network with 2 inputs and 33 outputs.

3.33.5.1. Executing ABC.

3.33.6. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 32 gates and 33 wires to a netlist network with 0 inputs and 32 outputs.

3.33.6.1. Executing ABC.

3.33.7. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$auto$simplemap.cc:257:simplemap_eqne$2599, synchronously reset by \rst_cnt
Extracted 19 gates and 21 wires to a netlist network with 2 inputs and 2 outputs.

3.33.7.1. Executing ABC.

yosys> abc -dff

3.34. Executing ABC pass (technology mapping using ABC).

3.34.1. Summary of detected clock domains:
  1 cells in clk=\clk, en={ }, arst={ }, srst={ }
  33 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  9 cells in clk=\clk, en=$abc$4191$auto$opt_dff.cc:194:make_patterns_logic$3312, arst=\rst, srst={ }
  130 cells in clk=\clk, en=$abc$3767$AES_ROUND_N.enc, arst={ }, srst={ }
  18 cells in clk=\clk, en=!$abc$4268$auto$simplemap.cc:257:simplemap_eqne$2599, arst={ }, srst=\rst_cnt

3.34.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1 gates and 2 wires to a netlist network with 0 inputs and 1 outputs.

3.34.2.1. Executing ABC.

3.34.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 33 gates and 39 wires to a netlist network with 6 inputs and 10 outputs.

3.34.3.1. Executing ABC.

3.34.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$4191$auto$opt_dff.cc:194:make_patterns_logic$3312, asynchronously reset by \rst
Extracted 9 gates and 15 wires to a netlist network with 6 inputs and 6 outputs.

3.34.4.1. Executing ABC.

3.34.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$3767$AES_ROUND_N.enc
Extracted 130 gates and 135 wires to a netlist network with 5 inputs and 129 outputs.

3.34.5.1. Executing ABC.

3.34.6. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$abc$4268$auto$simplemap.cc:257:simplemap_eqne$2599, synchronously reset by \rst_cnt
Extracted 17 gates and 19 wires to a netlist network with 2 inputs and 2 outputs.

3.34.6.1. Executing ABC.

yosys> abc -dff

3.35. Executing ABC pass (technology mapping using ABC).

3.35.1. Summary of detected clock domains:
  1 cells in clk=\clk, en={ }, arst={ }, srst={ }
  11 cells in clk=\clk, en=$abc$4323$abc$4191$auto$opt_dff.cc:194:make_patterns_logic$3312, arst=\rst, srst={ }
  30 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  6 cells in clk=\clk, en=$abc$4334$abc$3767$AES_ROUND_N.enc, arst={ }, srst={ }
  18 cells in clk=\clk, en=!$abc$4473$abc$4268$auto$simplemap.cc:257:simplemap_eqne$2599, arst={ }, srst=\rst_cnt

3.35.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1 gates and 2 wires to a netlist network with 0 inputs and 1 outputs.

3.35.2.1. Executing ABC.

3.35.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$4323$abc$4191$auto$opt_dff.cc:194:make_patterns_logic$3312, asynchronously reset by \rst
Extracted 11 gates and 17 wires to a netlist network with 6 inputs and 7 outputs.

3.35.3.1. Executing ABC.

3.35.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 30 gates and 35 wires to a netlist network with 5 inputs and 10 outputs.

3.35.4.1. Executing ABC.

3.35.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$4334$abc$3767$AES_ROUND_N.enc
Extracted 6 gates and 11 wires to a netlist network with 5 inputs and 5 outputs.

3.35.5.1. Executing ABC.

3.35.6. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$abc$4473$abc$4268$auto$simplemap.cc:257:simplemap_eqne$2599, synchronously reset by \rst_cnt
Extracted 17 gates and 19 wires to a netlist network with 2 inputs and 2 outputs.

3.35.6.1. Executing ABC.

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  9 cells in clk=\clk, en=$abc$4495$abc$4323$abc$4191$auto$opt_dff.cc:194:make_patterns_logic$3312, arst=\rst, srst={ }
  6 cells in clk=\clk, en=$abc$4538$abc$4334$abc$3767$AES_ROUND_N.enc, arst={ }, srst={ }
  31 cells in clk=\clk, en={ }, arst=\rst, srst={ }
  1 cells in clk=\clk, en={ }, arst={ }, srst={ }
  18 cells in clk=\clk, en=!$abc$4553$abc$4473$abc$4268$auto$simplemap.cc:257:simplemap_eqne$2599, arst={ }, srst=\rst_cnt

3.36.2. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$4495$abc$4323$abc$4191$auto$opt_dff.cc:194:make_patterns_logic$3312, asynchronously reset by \rst
Extracted 9 gates and 14 wires to a netlist network with 5 inputs and 6 outputs.

3.36.2.1. Executing ABC.

3.36.3. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$4538$abc$4334$abc$3767$AES_ROUND_N.enc
Extracted 6 gates and 11 wires to a netlist network with 5 inputs and 5 outputs.

3.36.3.1. Executing ABC.

3.36.4. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \rst
Extracted 31 gates and 35 wires to a netlist network with 4 inputs and 9 outputs.

3.36.4.1. Executing ABC.

3.36.5. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1 gates and 2 wires to a netlist network with 0 inputs and 1 outputs.

3.36.5.1. Executing ABC.

3.36.6. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$abc$4553$abc$4473$abc$4268$auto$simplemap.cc:257:simplemap_eqne$2599, synchronously reset by \rst_cnt
Extracted 17 gates and 19 wires to a netlist network with 2 inputs and 2 outputs.

3.36.6.1. Executing ABC.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.6. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $abc$4628$auto$blifparse.cc:362:parse_blif$4629 ($_DFF_P_) from module aes_fsm_enc.

yosys> opt_clean

3.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 945 unused wires.
<suppressed ~10 debug messages>

yosys> opt_expr

3.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.13. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $abc$4582$auto$blifparse.cc:362:parse_blif$4583 ($_DFFE_PP_) from module aes_fsm_enc.

yosys> opt_clean

3.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.38.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.38.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.20. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $abc$4582$auto$blifparse.cc:362:parse_blif$4584 ($_DFFE_PP_) from module aes_fsm_enc.

yosys> opt_clean

3.38.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.38.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.38.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.38.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.27. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $abc$4582$auto$blifparse.cc:362:parse_blif$4585 ($_DFFE_PP_) from module aes_fsm_enc.

yosys> opt_clean

3.38.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.38.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.38.30. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.31. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.32. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.38.33. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.34. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $abc$4582$auto$blifparse.cc:362:parse_blif$4586 ($_DFFE_PP_) from module aes_fsm_enc.

yosys> opt_clean

3.38.35. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 3 unused cells and 4 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.38.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.38.37. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.38. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.39. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.38.40. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.41. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.42. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.38.43. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.38.44. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_x6kawu/abc_tmp_1.scr

3.39. Executing ABC pass (technology mapping using ABC).

3.39.1. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Extracted 47 gates and 56 wires to a netlist network with 9 inputs and 13 outputs.

3.39.1.1. Executing ABC.
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.08  [   0.03 sec. at Pass 0]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.08  [   0.14 sec. at Pass 1]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.08  [   0.04 sec. at Pass 2]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.08  [   0.08 sec. at Pass 3]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.08  [   0.06 sec. at Pass 4]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.08  [   0.58 sec. at Pass 5]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.08  [   0.53 sec. at Pass 6]
DE:   #PIs =   9  #Luts =    14  Max Lvl =   2  Avg Lvl =   1.08  [   1.54 sec. at Pass 7]

yosys> opt

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 56 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.42. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                 67
   Number of wire bits:           1971
   Number of public wires:          46
   Number of public wire bits:    1950
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 23
     $_DFFE_PP0P_                    1
     $_DFF_PP0_                      3
     $_DLATCH_P_                     1
     $_SDFFE_PP0N_                   4
     $lut                           14


yosys> shregmap -minlen 8 -maxlen 20

3.43. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.45. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                 75
   Number of wire bits:           1979
   Number of public wires:          46
   Number of public wire bits:    1950
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 31
     $_DFFE_PP0P_                    1
     $_DFF_PP0_                      3
     $_DFF_P_                        4
     $_DLATCHSR_PPP_                 1
     $_MUX_                          8
     $lut                           14


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.46. Executing TECHMAP pass (map to technology primitives).

3.46.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.46.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.46.3. Continuing TECHMAP pass.
Using template \$_DLATCHSR_PPP_ for cells of type $_DLATCHSR_PPP_.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using extmapper simplemap for cells of type $lut.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~165 debug messages>

yosys> opt_expr -mux_undef

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.
<suppressed ~185 debug messages>

yosys> simplemap

3.48. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge

3.50. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
<suppressed ~33 debug messages>
Removed a total of 11 cells.

yosys> opt_dff -nodffe -nosdff

3.51. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 63 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.53. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.53.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.53.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.53.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.53.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.53.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.53.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_x6kawu/abc_tmp_2.scr

3.54. Executing ABC pass (technology mapping using ABC).

3.54.1. Extracting gate netlist of module `\aes_fsm_enc' to `<abc-temp-dir>/input.blif'..
Extracted 64 gates and 77 wires to a netlist network with 11 inputs and 13 outputs.

3.54.1.1. Executing ABC.
DE:   #PIs =  11  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.10 sec. at Pass 0]
DE:   #PIs =  11  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.22 sec. at Pass 1]
DE:   #PIs =  11  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.06 sec. at Pass 2]
DE:   #PIs =  11  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.10 sec. at Pass 3]
DE:   #PIs =  11  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.05 sec. at Pass 4]
DE:   #PIs =  11  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.14 sec. at Pass 5]
DE:   #PIs =  11  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   0.77 sec. at Pass 6]
DE:   #PIs =  11  #Luts =    15  Max Lvl =   2  Avg Lvl =   1.31  [   1.11 sec. at Pass 7]

yosys> opt

3.55. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.55.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

yosys> opt_merge -nomux

3.55.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.55.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.55.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 61 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.55.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.55.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.55.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes_fsm_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes_fsm_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.55.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes_fsm_enc'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..

yosys> opt_expr

3.55.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes_fsm_enc.

3.55.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.56. Executing HIERARCHY pass (managing design hierarchy).

3.56.1. Analyzing design hierarchy..
Top module:  \aes_fsm_enc

3.56.2. Analyzing design hierarchy..
Top module:  \aes_fsm_enc
Removed 0 unused modules.

yosys> stat

3.57. Printing statistics.

=== aes_fsm_enc ===

   Number of wires:                 68
   Number of wire bits:           1972
   Number of public wires:          46
   Number of public wire bits:    1950
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 24
     $lut                           15
     dffsre                          8
     latchsre                        1


yosys> opt_clean -purge

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes_fsm_enc..
Removed 0 unused cells and 38 unused wires.
<suppressed ~38 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.59. Executing Verilog backend.

yosys> bmuxmap

3.59.1. Executing BMUXMAP pass.

yosys> demuxmap

3.59.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\aes_fsm_enc'.

Warnings: 5 unique messages, 5 total
End of script. Logfile hash: 7b3c9ec740, CPU: user 2.82s system 0.12s, MEM: 38.18 MB peak
Yosys 0.17+76 (git sha1 035496b50, gcc 9.1.0 -fPIC -Os)
Time spent: 94% 6x abc (48 sec), 2% 32x opt_dff (1 sec), ...
real 15.46
user 31.57
sys 19.50
