
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.140
 Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k clock_tree_design.v

yosys> verific -vlog2k clock_tree_design.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'clock_tree_design.v'

yosys> synth_rs -top clock_tree_design -tech genesis2 -goal area -de -verilog synthesized.v

3. Executing synth_rs pass: v0.4.116

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis2/cells_sim.v +/rapidsilicon/genesis2/dsp_sim.v +/rapidsilicon/genesis2/brams_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dff'.
Generating RTLIL representation for module `\dffn'.
Generating RTLIL representation for module `\sdff'.
Generating RTLIL representation for module `\sdffn'.
Generating RTLIL representation for module `\dffr'.
Generating RTLIL representation for module `\dffnr'.
Generating RTLIL representation for module `\dffe'.
Generating RTLIL representation for module `\dffne'.
Generating RTLIL representation for module `\sdffre'.
Generating RTLIL representation for module `\sdffnre'.
Generating RTLIL representation for module `\dffre'.
Generating RTLIL representation for module `\dffnre'.
Generating RTLIL representation for module `\latch'.
Generating RTLIL representation for module `\latchn'.
Generating RTLIL representation for module `\latchr'.
Generating RTLIL representation for module `\latchnr'.
Generating RTLIL representation for module `\fa_1bit'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP'.
Generating RTLIL representation for module `\RS_DSP_MULT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Successfully finished Verilog frontend.

3.4. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v' to AST representation.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\RS_TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top clock_tree_design

3.5. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] clock_tree_design.v:5: compiling module 'clock_tree_design'
VERIFIC-INFO [VERI-1018] clock_tree_design.v:305: compiling module 'T_ff'
Importing module clock_tree_design.
Importing module T_ff.

3.5.1. Analyzing design hierarchy..
Top module:  \clock_tree_design
Used module:     \T_ff

3.5.2. Analyzing design hierarchy..
Top module:  \clock_tree_design
Used module:     \T_ff
Removed 0 unused modules.

yosys> proc

3.6. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.6.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.6.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.6.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.6.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.6.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.6.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.6.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.6.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.6.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.6.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.6.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.6.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module T_ff.
<suppressed ~1 debug messages>
Optimizing module clock_tree_design.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module T_ff.
<suppressed ~80 debug messages>

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 80 unused cells and 724 unused wires.
<suppressed ~322 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module clock_tree_design...
Found and reported 0 problems.

yosys> opt_expr

3.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.16. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_share

3.20. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.21. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\I9.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I8.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I79.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I78.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I77.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I76.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I75.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I74.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I73.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I72.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I71.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I70.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I7.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I69.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I68.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I67.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I66.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I65.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I64.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I63.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I62.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I61.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I60.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I6.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I59.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I58.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I57.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I56.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I55.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I54.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I53.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I52.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I51.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I50.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I5.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I49.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I48.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I47.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I46.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I45.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I44.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I43.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I42.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I41.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I40.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I4.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I39.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I38.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I37.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I36.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I35.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I34.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I33.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I32.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I31.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I30.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I3.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I29.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I28.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I27.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I26.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I25.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I24.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I23.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I22.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I21.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I20.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I2.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I19.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I18.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I17.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I16.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I15.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I14.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I13.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I12.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I11.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I10.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I1.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.
Changing const-value async load to async reset on $flatten\I0.$verific$Q_reg$clock_tree_design.v:328$353 ($aldff) from module clock_tree_design.

yosys> opt_clean

3.22. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.24. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.24.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.24.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.24.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> fsm_opt

3.24.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.24.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.24.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.24.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_share

3.30. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.34. Executing WREDUCE pass (reducing word size of cells).
Removed top 20 bits (of 80) from wire clock_tree_design.$verific$n365$2.

yosys> peepopt

3.35. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.36. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> demuxmap

3.37. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> stat

3.38. Printing statistics.

=== clock_tree_design ===

   Number of wires:                433
   Number of wire bits:            710
   Number of public wires:         426
   Number of public wire bits:     510
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                170
     $adff                          80
     $and                            3
     $bmux                           1
     $or                             3
     $xor                           83


yosys> wreduce t:$mul

3.39. Executing WREDUCE pass (reducing word size of cells).

yosys> rs_dsp_macc -genesis2 -max_dsp 154

3.40. Executing RS_DSP_MACC pass.

yosys> techmap -map +/mul2dsp_check_maxwidth.v -D DSP_A_MAXWIDTH=20 -D DSP_B_MAXWIDTH=18 -D DSP_A_MINWIDTH=11 -D DSP_B_MINWIDTH=10 -D DSP_NAME=$__RS_MUL20X18 a:valid_map

3.41. Executing TECHMAP pass (map to technology primitives).

3.41.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

3.41.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> stat

3.42. Printing statistics.

=== clock_tree_design ===

   Number of wires:                433
   Number of wire bits:            710
   Number of public wires:         426
   Number of public wire bits:     510
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                170
     $adff                          80
     $and                            3
     $bmux                           1
     $or                             3
     $xor                           83


yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/rapidsilicon/genesis2/dsp_map.v -D USE_DSP_CFG_PARAMS=0

3.43. Executing TECHMAP pass (map to technology primitives).

3.43.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_MUL20X18'.
Successfully finished Verilog frontend.

3.43.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/dsp_final_map.v

3.44. Executing TECHMAP pass (map to technology primitives).

3.44.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v' to AST representation.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Successfully finished Verilog frontend.

3.44.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> rs-pack-dsp-regs

3.45. Executing rs_pack_dsp_regs pass.

yosys> rs_dsp_io_regs

3.46. Executing RS_DSP_IO_REGS pass.

yosys> alumacc

3.47. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module clock_tree_design:
  created 0 $alu and 0 $macc cells.

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.49. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.50. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.51. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.52. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_share

3.53. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.54. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr

3.56. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.
MAX OPT ITERATION = 1

yosys> stat

3.57. Printing statistics.

=== clock_tree_design ===

   Number of wires:                433
   Number of wire bits:            710
   Number of public wires:         426
   Number of public wire bits:     510
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                170
     $adff                          80
     $and                            3
     $bmux                           1
     $or                             3
     $xor                           83


yosys> memory -nomap

3.58. Executing MEMORY pass.

yosys> opt_mem

3.58.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.58.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.58.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.58.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.58.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.58.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> memory_share

3.58.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.58.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.58.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> memory_collect

3.58.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.59. Printing statistics.

=== clock_tree_design ===

   Number of wires:                433
   Number of wire bits:            710
   Number of public wires:         426
   Number of public wire bits:     510
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                170
     $adff                          80
     $and                            3
     $bmux                           1
     $or                             3
     $xor                           83


yosys> muxpack

3.60. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> opt_clean

3.61. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new_swap.txt -limit 150 a:read_swapped

3.62. Executing MEMORY_LIBMAP pass (mapping memories to cells).

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new.txt -limit 150

3.63. Executing MEMORY_LIBMAP pass (mapping memories to cells).

yosys> rs_bram_split -new_mapping

3.64. Executing Rs_BRAM_Split pass.

yosys> techmap -autoproc -map +/rapidsilicon/genesis2/brams_map_new.v

3.65. Executing TECHMAP pass (map to technology primitives).

3.65.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v' to AST representation.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_SDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_SDP'.
Successfully finished Verilog frontend.

3.65.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~6 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/brams_final_map_new.v

3.66. Executing TECHMAP pass (map to technology primitives).

3.66.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v' to AST representation.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Successfully finished Verilog frontend.

3.66.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> pmuxtree

3.67. Executing PMUXTREE pass.

yosys> muxpack

3.68. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> memory_map

3.69. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.70. Printing statistics.

=== clock_tree_design ===

   Number of wires:                433
   Number of wire bits:            710
   Number of public wires:         426
   Number of public wire bits:     510
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                170
     $adff                          80
     $and                            3
     $bmux                           1
     $or                             3
     $xor                           83


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/arith_map.v

3.71. Executing TECHMAP pass (map to technology primitives).

3.71.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.71.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.71.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $adff.
No more expansions possible.
<suppressed ~241 debug messages>

yosys> stat

3.72. Printing statistics.

=== clock_tree_design ===

   Number of wires:                435
   Number of wire bits:            770
   Number of public wires:         426
   Number of public wire bits:     510
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                400
     $_AND_                         60
     $_DFF_PN0_                     80
     $_MUX_                         60
     $_OR_                          60
     $_XOR_                        140


yosys> opt_expr

3.73. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.74. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.75. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.76. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.77. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_share

3.78. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.79. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.80. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.81. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.
MAX OPT ITERATION = 1

yosys> opt_expr -full

3.82. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> techmap -map +/techmap.v

3.83. Executing TECHMAP pass (map to technology primitives).

3.83.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.83.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> stat

3.84. Printing statistics.

=== clock_tree_design ===

   Number of wires:                434
   Number of wire bits:            750
   Number of public wires:         426
   Number of public wire bits:     510
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                400
     $_AND_                         60
     $_DFF_PN0_                     80
     $_MUX_                         60
     $_OR_                          60
     $_XOR_                        140


yosys> dfflegalize -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 t:$_SDFFCE_*

3.85. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.86. Printing statistics.

=== clock_tree_design ===

   Number of wires:                434
   Number of wire bits:            750
   Number of public wires:         426
   Number of public wire bits:     510
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                400
     $_AND_                         60
     $_DFF_PN0_                     80
     $_MUX_                         60
     $_OR_                          60
     $_XOR_                        140


yosys> opt_expr

3.87. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.88. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.89. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.90. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.91. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -sat

3.92. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.93. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr

3.94. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.
MAX OPT ITERATION = 1

yosys> abc -dff -keepff

3.95. Executing ABC pass (technology mapping using ABC).

3.95.1. Summary of detected clock domains:
  78 cells in clk=\clk1, en={ }, arst=!\clr_n, srst={ }
  78 cells in clk=\clk2, en={ }, arst=!\clr_n, srst={ }
  78 cells in clk=\clk3, en={ }, arst=!\clr_n, srst={ }
  10 cells in clk=\clk6, en={ }, arst=!\clr_n, srst={ }
  78 cells in clk=\clk4, en={ }, arst=!\clr_n, srst={ }
  78 cells in clk=\clk5, en={ }, arst=!\clr_n, srst={ }

3.95.2. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk1, asynchronously reset by !\clr_n
Extracted 78 gates and 83 wires to a netlist network with 4 inputs and 19 outputs.

3.95.2.1. Executing ABC.

3.95.3. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk2, asynchronously reset by !\clr_n
Extracted 78 gates and 83 wires to a netlist network with 4 inputs and 19 outputs.

3.95.3.1. Executing ABC.

3.95.4. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk3, asynchronously reset by !\clr_n
Extracted 78 gates and 83 wires to a netlist network with 4 inputs and 19 outputs.

3.95.4.1. Executing ABC.

3.95.5. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk6, asynchronously reset by !\clr_n
Extracted 10 gates and 11 wires to a netlist network with 1 inputs and 5 outputs.

3.95.5.1. Executing ABC.

3.95.6. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk4, asynchronously reset by !\clr_n
Extracted 78 gates and 83 wires to a netlist network with 4 inputs and 19 outputs.

3.95.6.1. Executing ABC.

3.95.7. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk5, asynchronously reset by !\clr_n
Extracted 78 gates and 83 wires to a netlist network with 4 inputs and 19 outputs.

3.95.7.1. Executing ABC.

yosys> abc -dff -keepff

3.96. Executing ABC pass (technology mapping using ABC).

3.96.1. Summary of detected clock domains:
  12 cells in clk=\clk6, en={ }, arst=!\clr_n, srst={ }
  17 cells in clk=\clk1, en={ }, arst=!\clr_n, srst={ }
  7 cells in clk=\clk2, en={ }, arst=!\clr_n, srst={ }
  7 cells in clk=\clk4, en={ }, arst=!\clr_n, srst={ }
  7 cells in clk=\clk3, en={ }, arst=!\clr_n, srst={ }
  7 cells in clk=\clk5, en={ }, arst=!\clr_n, srst={ }

3.96.2. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk6, asynchronously reset by !\clr_n
Extracted 12 gates and 19 wires to a netlist network with 7 inputs and 11 outputs.

3.96.2.1. Executing ABC.

3.96.3. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk1, asynchronously reset by !\clr_n
Extracted 17 gates and 30 wires to a netlist network with 13 inputs and 9 outputs.

3.96.3.1. Executing ABC.

3.96.4. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk2, asynchronously reset by !\clr_n
Extracted 7 gates and 11 wires to a netlist network with 4 inputs and 5 outputs.

3.96.4.1. Executing ABC.

3.96.5. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk4, asynchronously reset by !\clr_n
Extracted 7 gates and 11 wires to a netlist network with 4 inputs and 5 outputs.

3.96.5.1. Executing ABC.

3.96.6. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk3, asynchronously reset by !\clr_n
Extracted 7 gates and 11 wires to a netlist network with 4 inputs and 5 outputs.

3.96.6.1. Executing ABC.

3.96.7. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk5, asynchronously reset by !\clr_n
Extracted 7 gates and 11 wires to a netlist network with 4 inputs and 5 outputs.

3.96.7.1. Executing ABC.

yosys> abc -dff -keepff

3.97. Executing ABC pass (technology mapping using ABC).

3.97.1. Summary of detected clock domains:
  17 cells in clk=\clk3, en={ }, arst=!\clr_n, srst={ }
  11 cells in clk=\clk6, en={ }, arst=!\clr_n, srst={ }
  7 cells in clk=\clk4, en={ }, arst=!\clr_n, srst={ }
  7 cells in clk=\clk1, en={ }, arst=!\clr_n, srst={ }
  9 cells in clk=\clk2, en={ }, arst=!\clr_n, srst={ }
  9 cells in clk=\clk5, en={ }, arst=!\clr_n, srst={ }

3.97.2. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk3, asynchronously reset by !\clr_n
Extracted 17 gates and 30 wires to a netlist network with 13 inputs and 9 outputs.

3.97.2.1. Executing ABC.

3.97.3. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk6, asynchronously reset by !\clr_n
Extracted 11 gates and 17 wires to a netlist network with 6 inputs and 10 outputs.

3.97.3.1. Executing ABC.

3.97.4. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk4, asynchronously reset by !\clr_n
Extracted 7 gates and 11 wires to a netlist network with 4 inputs and 5 outputs.

3.97.4.1. Executing ABC.

3.97.5. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk1, asynchronously reset by !\clr_n
Extracted 7 gates and 11 wires to a netlist network with 4 inputs and 5 outputs.

3.97.5.1. Executing ABC.

3.97.6. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk2, asynchronously reset by !\clr_n
Extracted 9 gates and 14 wires to a netlist network with 5 inputs and 6 outputs.

3.97.6.1. Executing ABC.

3.97.7. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk5, asynchronously reset by !\clr_n
Extracted 9 gates and 14 wires to a netlist network with 5 inputs and 6 outputs.

3.97.7.1. Executing ABC.

yosys> abc -dff -keepff

3.98. Executing ABC pass (technology mapping using ABC).

3.98.1. Summary of detected clock domains:
  15 cells in clk=\clk2, en={ }, arst=!\clr_n, srst={ }
  10 cells in clk=\clk3, en={ }, arst=!\clr_n, srst={ }
  10 cells in clk=\clk6, en={ }, arst=!\clr_n, srst={ }
  9 cells in clk=\clk4, en={ }, arst=!\clr_n, srst={ }
  9 cells in clk=\clk1, en={ }, arst=!\clr_n, srst={ }
  8 cells in clk=\clk5, en={ }, arst=!\clr_n, srst={ }

3.98.2. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk2, asynchronously reset by !\clr_n
Extracted 15 gates and 27 wires to a netlist network with 12 inputs and 10 outputs.

3.98.2.1. Executing ABC.

3.98.3. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk3, asynchronously reset by !\clr_n
Extracted 10 gates and 17 wires to a netlist network with 7 inputs and 6 outputs.

3.98.3.1. Executing ABC.

3.98.4. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk6, asynchronously reset by !\clr_n
Extracted 10 gates and 15 wires to a netlist network with 5 inputs and 9 outputs.

3.98.4.1. Executing ABC.

3.98.5. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk4, asynchronously reset by !\clr_n
Extracted 9 gates and 14 wires to a netlist network with 5 inputs and 6 outputs.

3.98.5.1. Executing ABC.

3.98.6. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk1, asynchronously reset by !\clr_n
Extracted 9 gates and 14 wires to a netlist network with 5 inputs and 6 outputs.

3.98.6.1. Executing ABC.

3.98.7. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk5, asynchronously reset by !\clr_n
Extracted 8 gates and 13 wires to a netlist network with 5 inputs and 6 outputs.

3.98.7.1. Executing ABC.

yosys> opt_ffinv

3.99. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.100. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.101. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
<suppressed ~54 debug messages>
Removed a total of 18 cells.

yosys> opt_muxtree

3.102. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.103. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.104. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_share

3.105. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.106. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.107. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 0 unused cells and 495 unused wires.
<suppressed ~81 debug messages>

yosys> opt_expr

3.108. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.109. Executing BMUXMAP pass.

yosys> demuxmap

3.110. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_AMlqGh/abc_tmp_1.scr

3.111. Executing ABC pass (technology mapping using ABC).

3.111.1. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Extracted 37 gates and 46 wires to a netlist network with 9 inputs and 16 outputs.

3.111.1.1. Executing ABC.
DE:   #PIs =   9  #Luts =    16  Max Lvl =   1  Avg Lvl =   1.00  [   0.07 sec. at Pass 0]{firstMap}[1]
DE:   #PIs =   9  #Luts =    16  Max Lvl =   1  Avg Lvl =   1.00  [   0.32 sec. at Pass 1]{initMapFlow}[3]
DE:   #PIs =   9  #Luts =    16  Max Lvl =   1  Avg Lvl =   1.00  [   0.54 sec. at Pass 2]{map}[2]
DE:   #PIs =   9  #Luts =    16  Max Lvl =   1  Avg Lvl =   1.00  [   0.32 sec. at Pass 3]{postMap}[6]
DE:   #PIs =   9  #Luts =    16  Max Lvl =   1  Avg Lvl =   1.00  [   0.34 sec. at Pass 4]{map}[12]
DE:   #PIs =   9  #Luts =    16  Max Lvl =   1  Avg Lvl =   1.00  [   0.68 sec. at Pass 5]{postMap}[36]
DE:   #PIs =   9  #Luts =    16  Max Lvl =   1  Avg Lvl =   1.00  [   1.63 sec. at Pass 6]{pushMap}[100]
DE:   #PIs =   9  #Luts =    16  Max Lvl =   1  Avg Lvl =   1.00  [   1.14 sec. at Pass 7]{finalMap}[100]

yosys> opt_expr

3.112. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.113. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.114. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.115. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.116. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_share

3.117. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.118. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.119. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 0 unused cells and 46 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.120. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.121. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.122. Printing statistics.

=== clock_tree_design ===

   Number of wires:                370
   Number of wire bits:            454
   Number of public wires:         346
   Number of public wire bits:     430
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 22
     $_DFF_PN0_                      6
     $lut                           16


yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFFE_??_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 -cell $_DLATCH_?_ 0 -cell $_DLATCH_???_ 0

3.123. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.124. Printing statistics.

=== clock_tree_design ===

   Number of wires:                370
   Number of wire bits:            454
   Number of public wires:         346
   Number of public wire bits:     430
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 22
     $_DFF_PN0_                      6
     $lut                           16


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/ffs_map.v

3.125. Executing TECHMAP pass (map to technology primitives).

3.125.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.125.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Generating RTLIL representation for module `\$_SDFFE_PP0P_'.
Generating RTLIL representation for module `\$_SDFFE_PP0N_'.
Generating RTLIL representation for module `\$_SDFFE_PN0P_'.
Generating RTLIL representation for module `\$_SDFFE_PN0N_'.
Generating RTLIL representation for module `\$_SDFFE_PP1P_'.
Generating RTLIL representation for module `\$_SDFFE_PP1N_'.
Generating RTLIL representation for module `\$_SDFFE_PN1P_'.
Generating RTLIL representation for module `\$_SDFFE_PN1N_'.
Generating RTLIL representation for module `\$_SDFFE_NP0P_'.
Generating RTLIL representation for module `\$_SDFFE_NP0N_'.
Generating RTLIL representation for module `\$_SDFFE_NN0P_'.
Generating RTLIL representation for module `\$_SDFFE_NN0N_'.
Generating RTLIL representation for module `\$_SDFFE_NP1P_'.
Generating RTLIL representation for module `\$_SDFFE_NP1N_'.
Generating RTLIL representation for module `\$_SDFFE_NN1P_'.
Generating RTLIL representation for module `\$_SDFFE_NN1N_'.
Generating RTLIL representation for module `\$_DLATCH_P_'.
Generating RTLIL representation for module `\$_DLATCH_N_'.
Generating RTLIL representation for module `\$_DLATCH_PP0_'.
Generating RTLIL representation for module `\$_DLATCH_NP0_'.
Generating RTLIL representation for module `\$_DLATCH_PN0_'.
Generating RTLIL representation for module `\$_DLATCH_NN0_'.
Generating RTLIL representation for module `\$_DLATCH_PP1_'.
Generating RTLIL representation for module `\$_DLATCH_NP1_'.
Generating RTLIL representation for module `\$_DLATCH_PN1_'.
Generating RTLIL representation for module `\$_DLATCH_NN1_'.
Successfully finished Verilog frontend.

3.125.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~163 debug messages>

yosys> opt_expr -mux_undef

3.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.
<suppressed ~71 debug messages>

yosys> simplemap

3.127. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.128. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge

3.129. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
<suppressed ~96 debug messages>
Removed a total of 32 cells.

yosys> opt_dff -nodffe -nosdff

3.130. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.131. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 0 unused cells and 66 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.132. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.133. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.134. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.135. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.136. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_share

3.137. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.138. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.139. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..

yosys> opt_expr

3.140. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_AMlqGh/abc_tmp_2.scr

3.141. Executing ABC pass (technology mapping using ABC).

3.141.1. Extracting gate netlist of module `\clock_tree_design' to `<abc-temp-dir>/input.blif'..
Extracted 31 gates and 43 wires to a netlist network with 10 inputs and 17 outputs.

3.141.1.1. Executing ABC.
DE:   #PIs =  10  #Luts =    17  Max Lvl =   1  Avg Lvl =   0.94  [   0.37 sec. at Pass 0]{firstMap}[1]
DE:   #PIs =  10  #Luts =    17  Max Lvl =   1  Avg Lvl =   0.94  [   0.44 sec. at Pass 1]{initMapFlow}[3]
DE:   #PIs =  10  #Luts =    17  Max Lvl =   1  Avg Lvl =   0.94  [   0.75 sec. at Pass 2]{map}[2]
DE:   #PIs =  10  #Luts =    17  Max Lvl =   1  Avg Lvl =   0.94  [   0.58 sec. at Pass 3]{postMap}[6]
DE:   #PIs =  10  #Luts =    17  Max Lvl =   1  Avg Lvl =   0.94  [   1.17 sec. at Pass 4]{map}[12]
DE:   #PIs =  10  #Luts =    17  Max Lvl =   1  Avg Lvl =   0.94  [   0.71 sec. at Pass 5]{postMap}[36]
DE:   #PIs =  10  #Luts =    17  Max Lvl =   1  Avg Lvl =   0.94  [   1.35 sec. at Pass 6]{pushMap}[100]
DE:   #PIs =  10  #Luts =    17  Max Lvl =   1  Avg Lvl =   0.94  [   0.99 sec. at Pass 7]{finalMap}[100]

yosys> opt_expr

3.142. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.

yosys> opt_merge -nomux

3.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.144. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \clock_tree_design..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.145. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \clock_tree_design.
Performed a total of 0 changes.

yosys> opt_merge

3.146. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\clock_tree_design'.
Removed a total of 0 cells.

yosys> opt_share

3.147. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.148. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.149. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 0 unused cells and 37 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.150. Executing OPT_EXPR pass (perform const folding).
Optimizing module clock_tree_design.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.151. Executing HIERARCHY pass (managing design hierarchy).

3.151.1. Analyzing design hierarchy..
Top module:  \clock_tree_design

3.151.2. Analyzing design hierarchy..
Top module:  \clock_tree_design
Removed 0 unused modules.

yosys> stat

3.152. Printing statistics.

=== clock_tree_design ===

   Number of wires:                371
   Number of wire bits:            455
   Number of public wires:         346
   Number of public wire bits:     430
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 23
     $lut                           17
     dffr                            6


yosys> opt_clean -purge

3.153. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \clock_tree_design..
Removed 0 unused cells and 256 unused wires.
<suppressed ~256 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.154. Executing Verilog backend.
Dumping module `\clock_tree_design'.

End of script. Logfile hash: a995b746cf, CPU: user 0.90s system 0.09s, MEM: 26.96 MB peak
Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)
Time spent: 99% 6x abc (89 sec), 0% 15x read_verilog (0 sec), ...
real 27.29
user 39.22
sys 51.57
