
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.140
 Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k ud_cnt.v atahost_pio_tctrl.v atahost_controller.v ro_cnt.v atahost_wb_slave.v timescale.v atahost.v atahost_top.v

yosys> verific -vlog2k ud_cnt.v atahost_pio_tctrl.v atahost_controller.v ro_cnt.v atahost_wb_slave.v timescale.v atahost.v atahost_top.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'ud_cnt.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_pio_tctrl.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_controller.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'ro_cnt.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_wb_slave.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'timescale.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost.v'
VERIFIC-INFO [VERI-2561] atahost.v:192: undeclared symbol 'PIOsel', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_top.v'
VERIFIC-INFO [VERI-2561] atahost_top.v:191: undeclared symbol 'PIOsel', assumed default net type 'wire'

yosys> synth_rs -top atahost_top -tech genesis2 -goal area -de -verilog synthesized.v

3. Executing synth_rs pass: v0.4.116

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis2/cells_sim.v +/rapidsilicon/genesis2/dsp_sim.v +/rapidsilicon/genesis2/brams_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dff'.
Generating RTLIL representation for module `\dffn'.
Generating RTLIL representation for module `\sdff'.
Generating RTLIL representation for module `\sdffn'.
Generating RTLIL representation for module `\dffr'.
Generating RTLIL representation for module `\dffnr'.
Generating RTLIL representation for module `\dffe'.
Generating RTLIL representation for module `\dffne'.
Generating RTLIL representation for module `\sdffre'.
Generating RTLIL representation for module `\sdffnre'.
Generating RTLIL representation for module `\dffre'.
Generating RTLIL representation for module `\dffnre'.
Generating RTLIL representation for module `\latch'.
Generating RTLIL representation for module `\latchn'.
Generating RTLIL representation for module `\latchr'.
Generating RTLIL representation for module `\latchnr'.
Generating RTLIL representation for module `\fa_1bit'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP'.
Generating RTLIL representation for module `\RS_DSP_MULT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Successfully finished Verilog frontend.

3.4. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v' to AST representation.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\RS_TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top atahost_top

3.5. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] atahost_top.v:83: compiling module 'atahost_top'
VERIFIC-INFO [VERI-1018] atahost_wb_slave.v:52: compiling module 'atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0)'
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:241: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:265: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:266: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:270: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:271: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:274: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:297: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:298: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:302: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:303: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:307: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:308: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:330: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:331: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:332: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:333: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:337: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:338: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:339: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:340: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:344: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:345: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:346: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:347: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:354: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:355: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:356: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:357: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:361: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:362: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:363: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:364: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:368: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:369: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:370: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:371: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:378: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:379: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:380: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:381: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:385: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:386: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:387: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:388: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:392: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:393: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:394: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:395: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:402: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:403: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:404: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:408: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:409: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:410: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:414: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:415: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:416: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:423: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:424: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:425: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:429: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:430: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:431: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:435: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:436: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:437: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] atahost_controller.v:63: compiling module 'atahost_controller'
VERIFIC-WARNING [VERI-2371] atahost_controller.v:161: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:162: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:164: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:165: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:172: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:173: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:174: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:175: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:176: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:177: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:178: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:179: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:183: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:184: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:185: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:186: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:187: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:188: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:189: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:190: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:194: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:195: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:196: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:197: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:199: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:200: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:201: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:202: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:214: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:220: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:221: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:225: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:226: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:230: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:231: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] atahost_pio_tctrl.v:91: compiling module 'atahost_pio_tctrl'
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:156: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:157: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:161: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:162: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:166: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:167: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:57: compiling module 'ro_cnt(ID=6)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:89: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:55: compiling module 'ud_cnt(RESD=6)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:91: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:189: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:190: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:191: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:195: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:196: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:197: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:201: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:202: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:203: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:57: compiling module 'ro_cnt(ID=28)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:89: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:55: compiling module 'ud_cnt(RESD=28)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:91: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:223: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:225: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:227: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:233: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:57: compiling module 'ro_cnt(ID=2)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:89: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:55: compiling module 'ud_cnt(RESD=2)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:91: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:57: compiling module 'ro_cnt(ID=23)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:89: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:55: compiling module 'ud_cnt(RESD=23)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:91: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:263: delay control is not supported for synthesis
Importing module atahost_top.
Importing module atahost_controller.
Importing module atahost_pio_tctrl.
Importing module atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0).
Importing module ro_cnt(ID=2).
Importing module ro_cnt(ID=23).
Importing module ro_cnt(ID=28).
Importing module ro_cnt(ID=6).
Importing module ud_cnt(RESD=2).
Importing module ud_cnt(RESD=23).
Importing module ud_cnt(RESD=28).
Importing module ud_cnt(RESD=6).

3.5.1. Analyzing design hierarchy..
Top module:  \atahost_top
Used module:     \atahost_controller
Used module:         \atahost_pio_tctrl
Used module:             \ro_cnt(ID=23)
Used module:                 \ud_cnt(RESD=23)
Used module:             \ro_cnt(ID=2)
Used module:                 \ud_cnt(RESD=2)
Used module:             \ro_cnt(ID=28)
Used module:                 \ud_cnt(RESD=28)
Used module:             \ro_cnt(ID=6)
Used module:                 \ud_cnt(RESD=6)
Used module:     \atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0)

3.5.2. Analyzing design hierarchy..
Top module:  \atahost_top
Used module:     \atahost_controller
Used module:         \atahost_pio_tctrl
Used module:             \ro_cnt(ID=23)
Used module:                 \ud_cnt(RESD=23)
Used module:             \ro_cnt(ID=2)
Used module:                 \ud_cnt(RESD=2)
Used module:             \ro_cnt(ID=28)
Used module:                 \ud_cnt(RESD=28)
Used module:             \ro_cnt(ID=6)
Used module:                 \ud_cnt(RESD=6)
Used module:     \atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0)
Removed 0 unused modules.

yosys> proc

3.6. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.6.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.6.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.6.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.6.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.6.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.6.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.6.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.6.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.6.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.6.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.6.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.6.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module ud_cnt(RESD=6).
<suppressed ~2 debug messages>
Optimizing module ud_cnt(RESD=28).
<suppressed ~2 debug messages>
Optimizing module ud_cnt(RESD=23).
<suppressed ~2 debug messages>
Optimizing module ud_cnt(RESD=2).
<suppressed ~2 debug messages>
Optimizing module ro_cnt(ID=6).
<suppressed ~1 debug messages>
Optimizing module ro_cnt(ID=28).
<suppressed ~1 debug messages>
Optimizing module ro_cnt(ID=23).
<suppressed ~1 debug messages>
Optimizing module ro_cnt(ID=2).
<suppressed ~1 debug messages>
Optimizing module atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0).
<suppressed ~28 debug messages>
Optimizing module atahost_pio_tctrl.
<suppressed ~10 debug messages>
Optimizing module atahost_controller.
<suppressed ~12 debug messages>
Optimizing module atahost_top.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module atahost_controller.
Deleting now unused module atahost_pio_tctrl.
Deleting now unused module atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0).
Deleting now unused module ro_cnt(ID=2).
Deleting now unused module ro_cnt(ID=23).
Deleting now unused module ro_cnt(ID=28).
Deleting now unused module ro_cnt(ID=6).
Deleting now unused module ud_cnt(RESD=2).
Deleting now unused module ud_cnt(RESD=23).
Deleting now unused module ud_cnt(RESD=28).
Deleting now unused module ud_cnt(RESD=6).
<suppressed ~11 debug messages>

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~9 debug messages>

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 19 unused cells and 694 unused wires.
<suppressed ~136 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module atahost_top...
Found and reported 0 problems.

yosys> opt_expr

3.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~4 debug messages>

yosys> opt_merge -nomux

3.16. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~18 debug messages>
Removed a total of 6 cells.

yosys> opt_muxtree

3.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~49 debug messages>

yosys> opt_reduce

3.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
    New ctrl vector for $pmux cell $flatten\u0.$verific$select_313$atahost_wb_slave.v:476$949: { $flatten\u0.$verific$n37$653 $flatten\u0.$verific$n41$655 $flatten\u0.$verific$n45$657 $flatten\u0.$verific$n49$659 $flatten\u0.$verific$n53$661 $flatten\u0.$verific$n57$663 $flatten\u0.$verific$n61$665 }
  Optimizing cells in module \atahost_top.
Performed a total of 1 changes.

yosys> opt_merge

3.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.20. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.21. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:91$1216 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\t2_cnt.$verific$rci_reg$ro_cnt.v:89$1059 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev1_Teoc_reg$atahost_wb_slave.v:438$938 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:91$1245 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\t1_cnt.$verific$rci_reg$ro_cnt.v:89$1104 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev1_Td_reg$atahost_wb_slave.v:438$937 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:91$1187 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\eoc_cnt.$verific$rci_reg$ro_cnt.v:89$1014 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev0_Tm_reg$atahost_wb_slave.v:417$927 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev0_Teoc_reg$atahost_wb_slave.v:417$929 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:91$1158 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\dhold_cnt.$verific$rci_reg$ro_cnt.v:89$969 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev0_Td_reg$atahost_wb_slave.v:417$928 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$CtrlReg_reg$atahost_wb_slave.v:274$848 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$oe_reg$atahost_pio_tctrl.v:204$574 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$hold_go_reg$atahost_pio_tctrl.v:168$535 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$hT2done_reg$atahost_pio_tctrl.v:227$593 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$busy_reg$atahost_pio_tctrl.v:168$534 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$DIOW_reg$atahost_pio_tctrl.v:204$573 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$DIOR_reg$atahost_pio_tctrl.v:204$572 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$dPIOreq_reg$atahost_controller.v:232$412 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$RESETn_reg$atahost_controller.v:203$392 ($aldff) from module atahost_top.
Removing never-active async load on $flatten\u1.$verific$PIOq_reg$atahost_controller.v:214$402 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$PIOgo_reg$atahost_controller.v:232$413 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DIOWn_reg$atahost_controller.v:203$394 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DIORn_reg$atahost_controller.v:203$393 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DDoe_reg$atahost_controller.v:203$399 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DDo_reg$atahost_controller.v:203$398 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DA_reg$atahost_controller.v:203$395 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$CS1n_reg$atahost_controller.v:203$397 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$CS0n_reg$atahost_controller.v:203$396 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$inti_reg$atahost_wb_slave.v:309$873 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$dirq_reg$atahost_wb_slave.v:309$874 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_Teoc_reg$atahost_wb_slave.v:396$919 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_T4_reg$atahost_wb_slave.v:396$918 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_T2_reg$atahost_wb_slave.v:396$917 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_T1_reg$atahost_wb_slave.v:396$916 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_Teoc_reg$atahost_wb_slave.v:372$907 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_T4_reg$atahost_wb_slave.v:372$906 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_T2_reg$atahost_wb_slave.v:372$905 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_T1_reg$atahost_wb_slave.v:372$904 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_Teoc_reg$atahost_wb_slave.v:348$895 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_T4_reg$atahost_wb_slave.v:348$894 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_T2_reg$atahost_wb_slave.v:348$893 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_T1_reg$atahost_wb_slave.v:348$892 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev1_Tm_reg$atahost_wb_slave.v:438$936 ($aldff) from module atahost_top.

yosys> opt_clean

3.22. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 3 unused cells and 8 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_muxtree

3.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~49 debug messages>

yosys> opt_reduce

3.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.27. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.28. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.29. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.30. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 2

yosys> fsm -encoding binary

3.31. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.31.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.31.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.31.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.31.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> fsm_opt

3.31.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.31.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.31.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.31.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.32. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.33. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.34. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~49 debug messages>

yosys> opt_reduce

3.35. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.36. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.37. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.38. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\u1.$verific$PIOq_reg$atahost_controller.v:214$402 ($dff) from module atahost_top (D = \dd_pad_i, Q = \u1.PIOq).
Adding EN signal on $flatten\u0.$verific$store_pp_full_reg$atahost_wb_slave.v:241$816 ($dff) from module atahost_top (D = 1'0, Q = \u0.store_pp_full).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_Teoc_reg$atahost_wb_slave.v:396$919 ($adff) from module atahost_top (D = $flatten\u0.$verific$n946$768, Q = \u0.PIO_dport1_Teoc).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_T4_reg$atahost_wb_slave.v:396$918 ($adff) from module atahost_top (D = $flatten\u0.$verific$n937$767, Q = \u0.PIO_dport1_T4).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_T2_reg$atahost_wb_slave.v:396$917 ($adff) from module atahost_top (D = $flatten\u0.$verific$n928$766, Q = \u0.PIO_dport1_T2).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_T1_reg$atahost_wb_slave.v:396$916 ($adff) from module atahost_top (D = $flatten\u0.$verific$n919$765, Q = \u0.PIO_dport1_T1).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_Teoc_reg$atahost_wb_slave.v:372$907 ($adff) from module atahost_top (D = $flatten\u0.$verific$n727$760, Q = \u0.PIO_dport0_Teoc).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_T4_reg$atahost_wb_slave.v:372$906 ($adff) from module atahost_top (D = $flatten\u0.$verific$n718$759, Q = \u0.PIO_dport0_T4).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_T2_reg$atahost_wb_slave.v:372$905 ($adff) from module atahost_top (D = $flatten\u0.$verific$n709$758, Q = \u0.PIO_dport0_T2).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_T1_reg$atahost_wb_slave.v:372$904 ($adff) from module atahost_top (D = $flatten\u0.$verific$n700$757, Q = \u0.PIO_dport0_T1).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_Teoc_reg$atahost_wb_slave.v:348$895 ($adff) from module atahost_top (D = $flatten\u0.$verific$n508$752, Q = \u0.PIO_cmdport_Teoc).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_T4_reg$atahost_wb_slave.v:348$894 ($adff) from module atahost_top (D = $flatten\u0.$verific$n499$751, Q = \u0.PIO_cmdport_T4).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_T2_reg$atahost_wb_slave.v:348$893 ($adff) from module atahost_top (D = $flatten\u0.$verific$n490$750, Q = \u0.PIO_cmdport_T2).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_T1_reg$atahost_wb_slave.v:348$892 ($adff) from module atahost_top (D = $flatten\u0.$verific$n481$749, Q = \u0.PIO_cmdport_T1).
Adding EN signal on $flatten\u0.$verific$DMA_dev1_Tm_reg$atahost_wb_slave.v:438$936 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1267$779, Q = \u0.DMA_dev1_Tm).
Adding EN signal on $flatten\u0.$verific$DMA_dev1_Teoc_reg$atahost_wb_slave.v:438$938 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1285$781, Q = \u0.DMA_dev1_Teoc).
Adding EN signal on $flatten\u0.$verific$DMA_dev1_Td_reg$atahost_wb_slave.v:438$937 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1276$780, Q = \u0.DMA_dev1_Td).
Adding EN signal on $flatten\u0.$verific$DMA_dev0_Tm_reg$atahost_wb_slave.v:417$927 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1102$773, Q = \u0.DMA_dev0_Tm).
Adding EN signal on $flatten\u0.$verific$DMA_dev0_Teoc_reg$atahost_wb_slave.v:417$929 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1120$775, Q = \u0.DMA_dev0_Teoc).
Adding EN signal on $flatten\u0.$verific$DMA_dev0_Td_reg$atahost_wb_slave.v:417$928 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1111$774, Q = \u0.DMA_dev0_Td).
Adding EN signal on $flatten\u0.$verific$CtrlReg_reg$atahost_wb_slave.v:274$848 ($adff) from module atahost_top (D = $flatten\u0.$verific$n199$736, Q = \u0.CtrlReg).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$1249 ($dffe) from module atahost_top.

yosys> opt_clean

3.39. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 2 unused cells and 2 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.40. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~21 debug messages>

yosys> opt_muxtree

3.41. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~47 debug messages>

yosys> opt_reduce

3.42. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.43. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~39 debug messages>
Removed a total of 13 cells.

yosys> opt_share

3.44. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.45. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.46. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 15 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_muxtree

3.48. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~47 debug messages>

yosys> opt_reduce

3.49. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.50. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.51. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.52. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.54. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 3

yosys> wreduce -keepdc

3.55. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1235 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1235 ($sub).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1177 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1177 ($sub).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1148 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1148 ($sub).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1206 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1206 ($sub).
Removed top 3 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_40$atahost_wb_slave.v:251$824 ($eq).
Removed top 2 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_44$atahost_wb_slave.v:252$827 ($eq).
Removed top 2 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_48$atahost_wb_slave.v:253$830 ($eq).
Removed top 1 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_52$atahost_wb_slave.v:254$833 ($eq).
Removed top 1 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_56$atahost_wb_slave.v:255$836 ($eq).
Removed top 1 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_60$atahost_wb_slave.v:256$839 ($eq).

yosys> peepopt

3.56. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.57. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> demuxmap

3.58. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> stat

3.59. Printing statistics.

=== atahost_top ===

   Number of wires:                415
   Number of wire bits:           1629
   Number of public wires:         272
   Number of public wire bits:    1099
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                220
     $adff                          26
     $adffe                         19
     $and                           39
     $dff                            6
     $dffe                           1
     $eq                             6
     $logic_not                      1
     $mux                           70
     $not                           24
     $or                            15
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    6
     $sub                            4


yosys> wreduce t:$mul

3.60. Executing WREDUCE pass (reducing word size of cells).

yosys> rs_dsp_macc -genesis2 -max_dsp 154

3.61. Executing RS_DSP_MACC pass.

yosys> techmap -map +/mul2dsp_check_maxwidth.v -D DSP_A_MAXWIDTH=20 -D DSP_B_MAXWIDTH=18 -D DSP_A_MINWIDTH=11 -D DSP_B_MINWIDTH=10 -D DSP_NAME=$__RS_MUL20X18 a:valid_map

3.62. Executing TECHMAP pass (map to technology primitives).

3.62.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

3.62.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> stat

3.63. Printing statistics.

=== atahost_top ===

   Number of wires:                415
   Number of wire bits:           1629
   Number of public wires:         272
   Number of public wire bits:    1099
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                220
     $adff                          26
     $adffe                         19
     $and                           39
     $dff                            6
     $dffe                           1
     $eq                             6
     $logic_not                      1
     $mux                           70
     $not                           24
     $or                            15
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    6
     $sub                            4


yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/rapidsilicon/genesis2/dsp_map.v -D USE_DSP_CFG_PARAMS=0

3.64. Executing TECHMAP pass (map to technology primitives).

3.64.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_MUL20X18'.
Successfully finished Verilog frontend.

3.64.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/dsp_final_map.v

3.65. Executing TECHMAP pass (map to technology primitives).

3.65.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v' to AST representation.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Successfully finished Verilog frontend.

3.65.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> rs-pack-dsp-regs

3.66. Executing rs_pack_dsp_regs pass.

yosys> rs_dsp_io_regs

3.67. Executing RS_DSP_IO_REGS pass.

yosys> alumacc

3.68. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module atahost_top:
  creating $macc model for $flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1148 ($sub).
  creating $macc model for $flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1177 ($sub).
  creating $macc model for $flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1235 ($sub).
  creating $macc model for $flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1206 ($sub).
  creating $alu model for $macc $flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1206.
  creating $alu model for $macc $flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1235.
  creating $alu model for $macc $flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1177.
  creating $alu model for $macc $flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1148.
  creating $alu cell for $flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1148: $auto$alumacc.cc:485:replace_alu$1307
  creating $alu cell for $flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1177: $auto$alumacc.cc:485:replace_alu$1310
  creating $alu cell for $flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1235: $auto$alumacc.cc:485:replace_alu$1313
  creating $alu cell for $flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1206: $auto$alumacc.cc:485:replace_alu$1316
  created 4 $alu and 0 $macc cells.

yosys> opt_expr

3.69. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.70. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.71. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~47 debug messages>

yosys> opt_reduce

3.72. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.73. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.74. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.75. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.76. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.77. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 1

yosys> stat

3.78. Printing statistics.

=== atahost_top ===

   Number of wires:                423
   Number of wire bits:           1701
   Number of public wires:         272
   Number of public wire bits:    1099
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                220
     $adff                          26
     $adffe                         19
     $alu                            4
     $and                           39
     $dff                            6
     $dffe                           1
     $eq                             6
     $logic_not                      1
     $mux                           70
     $not                           24
     $or                            15
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    6


yosys> memory -nomap

3.79. Executing MEMORY pass.

yosys> opt_mem

3.79.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.79.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.79.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.79.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.79.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.79.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> memory_share

3.79.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.79.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.79.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> memory_collect

3.79.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.80. Printing statistics.

=== atahost_top ===

   Number of wires:                423
   Number of wire bits:           1701
   Number of public wires:         272
   Number of public wire bits:    1099
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                220
     $adff                          26
     $adffe                         19
     $alu                            4
     $and                           39
     $dff                            6
     $dffe                           1
     $eq                             6
     $logic_not                      1
     $mux                           70
     $not                           24
     $or                            15
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    6


yosys> muxpack

3.81. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~57 debug messages>

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new_swap.txt -limit 150 a:read_swapped

3.83. Executing MEMORY_LIBMAP pass (mapping memories to cells).

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new.txt -limit 150

3.84. Executing MEMORY_LIBMAP pass (mapping memories to cells).

yosys> rs_bram_split -new_mapping

3.85. Executing Rs_BRAM_Split pass.

yosys> techmap -autoproc -map +/rapidsilicon/genesis2/brams_map_new.v

3.86. Executing TECHMAP pass (map to technology primitives).

3.86.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v' to AST representation.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_SDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_SDP'.
Successfully finished Verilog frontend.

3.86.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~6 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/brams_final_map_new.v

3.87. Executing TECHMAP pass (map to technology primitives).

3.87.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v' to AST representation.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Successfully finished Verilog frontend.

3.87.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> pmuxtree

3.88. Executing PMUXTREE pass.

yosys> muxpack

3.89. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~63 debug messages>

yosys> memory_map

3.90. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.91. Printing statistics.

=== atahost_top ===

   Number of wires:                435
   Number of wire bits:           1930
   Number of public wires:         272
   Number of public wire bits:    1099
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                231
     $adff                          26
     $adffe                         19
     $alu                            4
     $and                           39
     $dff                            6
     $dffe                           1
     $eq                             6
     $logic_not                      1
     $mux                           77
     $not                           25
     $or                            17
     $reduce_and                     2
     $reduce_bool                    6
     $reduce_or                      2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/arith_map.v

3.92. Executing TECHMAP pass (map to technology primitives).

3.92.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.92.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.92.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $reduce_bool.
Using template $paramod$19189243523493d505a4933d1bad417c570ea8a6\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
Using extmapper simplemap for cells of type $xor.
No more expansions possible.
<suppressed ~671 debug messages>

yosys> stat

3.93. Printing statistics.

=== atahost_top ===

   Number of wires:                659
   Number of wire bits:           7099
   Number of public wires:         272
   Number of public wire bits:    1099
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1436
     $_AND_                        147
     $_DFFE_PN0P_                  145
     $_DFFE_PN1P_                   31
     $_DFFE_PP_                     16
     $_DFF_PN0_                     57
     $_DFF_PN1_                     14
     $_DFF_P_                        6
     $_MUX_                        748
     $_NOT_                         68
     $_OR_                         104
     $_XOR_                        100


yosys> opt_expr

3.94. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~328 debug messages>

yosys> opt_merge -nomux

3.95. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~57 debug messages>
Removed a total of 19 cells.

yosys> opt_muxtree

3.96. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.97. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.98. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.99. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.100. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.101. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 4 unused cells and 179 unused wires.
<suppressed ~9 debug messages>

yosys> opt_expr

3.102. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_muxtree

3.103. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.104. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.105. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.106. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.107. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.108. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.109. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.110. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~223 debug messages>

yosys> techmap -map +/techmap.v

3.111. Executing TECHMAP pass (map to technology primitives).

3.111.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.111.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> stat

3.112. Printing statistics.

=== atahost_top ===

   Number of wires:                525
   Number of wire bits:           2058
   Number of public wires:         268
   Number of public wire bits:    1095
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1090
     $_AND_                        106
     $_DFFE_PN0P_                  145
     $_DFFE_PN1P_                   31
     $_DFFE_PP_                     16
     $_DFF_PN0_                     57
     $_DFF_PN1_                     14
     $_DFF_P_                        6
     $_MUX_                        482
     $_NOT_                         69
     $_OR_                         132
     $_XOR_                         32


yosys> dfflegalize -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 t:$_SDFFCE_*

3.113. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.114. Printing statistics.

=== atahost_top ===

   Number of wires:                525
   Number of wire bits:           2058
   Number of public wires:         268
   Number of public wire bits:    1095
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1090
     $_AND_                        106
     $_DFFE_PN0P_                  145
     $_DFFE_PN1P_                   31
     $_DFFE_PP_                     16
     $_DFF_PN0_                     57
     $_DFF_PN1_                     14
     $_DFF_P_                        6
     $_MUX_                        482
     $_NOT_                         69
     $_OR_                         132
     $_XOR_                         32


yosys> opt_expr

3.115. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.116. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~447 debug messages>
Removed a total of 149 cells.

yosys> opt_muxtree

3.117. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.118. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.119. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -sat

3.120. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.121. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 31 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.122. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 1

yosys> abc -dff -keepff

3.123. Executing ABC pass (technology mapping using ABC).

3.123.1. Summary of detected clock domains:
  104 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1251, arst=!\arst_i, srst={ }
  37 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1263, arst=!\arst_i, srst={ }
  162 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1275, arst=!\arst_i, srst={ }
  61 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1287, arst=!\arst_i, srst={ }
  30 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1296, arst=!\arst_i, srst={ }
  95 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1305, arst=!\arst_i, srst={ }
  23 cells in clk=\wb_clk_i, en={ }, arst={ }, srst={ }
  295 cells in clk=\wb_clk_i, en={ }, arst=!\arst_i, srst={ }
  134 cells in clk=\wb_clk_i, en=\u1.PIO_timing_controller.dstrb, arst={ }, srst={ }

3.123.2. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1251, asynchronously reset by !\arst_i
Extracted 104 gates and 176 wires to a netlist network with 71 inputs and 101 outputs.

3.123.2.1. Executing ABC.

3.123.3. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1263, asynchronously reset by !\arst_i
Extracted 37 gates and 74 wires to a netlist network with 37 inputs and 34 outputs.

3.123.3.1. Executing ABC.

3.123.4. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1275, asynchronously reset by !\arst_i
Extracted 162 gates and 264 wires to a netlist network with 101 inputs and 117 outputs.

3.123.4.1. Executing ABC.

3.123.5. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1287, asynchronously reset by !\arst_i
Extracted 61 gates and 114 wires to a netlist network with 52 inputs and 59 outputs.

3.123.5.1. Executing ABC.

3.123.6. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1296, asynchronously reset by !\arst_i
Extracted 30 gates and 59 wires to a netlist network with 29 inputs and 28 outputs.

3.123.6.1. Executing ABC.

3.123.7. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1305, asynchronously reset by !\arst_i
Extracted 95 gates and 154 wires to a netlist network with 58 inputs and 87 outputs.

3.123.7.1. Executing ABC.

3.123.8. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i
Extracted 23 gates and 38 wires to a netlist network with 15 inputs and 15 outputs.

3.123.8.1. Executing ABC.

3.123.9. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by !\arst_i
Extracted 295 gates and 378 wires to a netlist network with 82 inputs and 138 outputs.

3.123.9.1. Executing ABC.

3.123.10. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3839$u1.PIO_timing_controller.dstrb
Extracted 134 gates and 279 wires to a netlist network with 144 inputs and 49 outputs.

3.123.10.1. Executing ABC.

yosys> abc -dff -keepff

3.124. Executing ABC pass (technology mapping using ABC).

3.124.1. Summary of detected clock domains:
  81 cells in clk=\wb_clk_i, en=$abc$3300$auto$opt_dff.cc:194:make_patterns_logic$1263, arst=!\arst_i, srst={ }
  143 cells in clk=\wb_clk_i, en=$abc$3369$auto$opt_dff.cc:194:make_patterns_logic$1275, arst=!\arst_i, srst={ }
  46 cells in clk=\wb_clk_i, en=$abc$3574$auto$opt_dff.cc:194:make_patterns_logic$1287, arst=!\arst_i, srst={ }
  55 cells in clk=\wb_clk_i, en=$abc$3659$auto$opt_dff.cc:194:make_patterns_logic$1296, arst=!\arst_i, srst={ }
  82 cells in clk=\wb_clk_i, en=$abc$3713$auto$opt_dff.cc:194:make_patterns_logic$1305, arst=!\arst_i, srst={ }
  55 cells in clk=\wb_clk_i, en={ }, arst={ }, srst={ }
  272 cells in clk=\wb_clk_i, en={ }, arst=!\arst_i, srst={ }
  86 cells in clk=\wb_clk_i, en=$abc$3155$auto$opt_dff.cc:194:make_patterns_logic$1251, arst=!\arst_i, srst={ }
  186 cells in clk=\wb_clk_i, en=$abc$3839$u1.PIO_timing_controller.dstrb, arst={ }, srst={ }

3.124.2. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3300$auto$opt_dff.cc:194:make_patterns_logic$1263, asynchronously reset by !\arst_i
Extracted 81 gates and 142 wires to a netlist network with 61 inputs and 67 outputs.

3.124.2.1. Executing ABC.

3.124.3. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3369$auto$opt_dff.cc:194:make_patterns_logic$1275, asynchronously reset by !\arst_i
Extracted 143 gates and 229 wires to a netlist network with 86 inputs and 106 outputs.

3.124.3.1. Executing ABC.

3.124.4. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3574$auto$opt_dff.cc:194:make_patterns_logic$1287, asynchronously reset by !\arst_i
Extracted 46 gates and 82 wires to a netlist network with 36 inputs and 36 outputs.

3.124.4.1. Executing ABC.

3.124.5. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3659$auto$opt_dff.cc:194:make_patterns_logic$1296, asynchronously reset by !\arst_i
Extracted 55 gates and 102 wires to a netlist network with 47 inputs and 54 outputs.

3.124.5.1. Executing ABC.

3.124.6. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3713$auto$opt_dff.cc:194:make_patterns_logic$1305, asynchronously reset by !\arst_i
Extracted 82 gates and 121 wires to a netlist network with 39 inputs and 77 outputs.

3.124.6.1. Executing ABC.

3.124.7. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i
Extracted 55 gates and 106 wires to a netlist network with 51 inputs and 47 outputs.

3.124.7.1. Executing ABC.

3.124.8. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by !\arst_i
Extracted 272 gates and 346 wires to a netlist network with 74 inputs and 130 outputs.

3.124.8.1. Executing ABC.

3.124.9. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3155$auto$opt_dff.cc:194:make_patterns_logic$1251, asynchronously reset by !\arst_i
Extracted 86 gates and 131 wires to a netlist network with 45 inputs and 63 outputs.

3.124.9.1. Executing ABC.

3.124.10. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4856$abc$3839$u1.PIO_timing_controller.dstrb
Extracted 186 gates and 344 wires to a netlist network with 158 inputs and 63 outputs.

3.124.10.1. Executing ABC.

yosys> abc -dff -keepff

3.125. Executing ABC pass (technology mapping using ABC).

3.125.1. Summary of detected clock domains:
  90 cells in clk=\wb_clk_i, en=$abc$4329$abc$3300$auto$opt_dff.cc:194:make_patterns_logic$1263, arst=!\arst_i, srst={ }
  142 cells in clk=\wb_clk_i, en=$abc$4432$abc$3369$auto$opt_dff.cc:194:make_patterns_logic$1275, arst=!\arst_i, srst={ }
  58 cells in clk=\wb_clk_i, en=$abc$4600$abc$3574$auto$opt_dff.cc:194:make_patterns_logic$1287, arst=!\arst_i, srst={ }
  55 cells in clk=\wb_clk_i, en=$abc$4662$abc$3659$auto$opt_dff.cc:194:make_patterns_logic$1296, arst=!\arst_i, srst={ }
  86 cells in clk=\wb_clk_i, en=$abc$4744$abc$3713$auto$opt_dff.cc:194:make_patterns_logic$1305, arst=!\arst_i, srst={ }
  25 cells in clk=\wb_clk_i, en={ }, arst={ }, srst={ }
  299 cells in clk=\wb_clk_i, en={ }, arst=!\arst_i, srst={ }
  86 cells in clk=\wb_clk_i, en=$abc$5193$abc$3155$auto$opt_dff.cc:194:make_patterns_logic$1251, arst=!\arst_i, srst={ }
  195 cells in clk=\wb_clk_i, en=$abc$4856$abc$3839$u1.PIO_timing_controller.dstrb, arst={ }, srst={ }

3.125.2. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4329$abc$3300$auto$opt_dff.cc:194:make_patterns_logic$1263, asynchronously reset by !\arst_i
Extracted 90 gates and 152 wires to a netlist network with 62 inputs and 64 outputs.

3.125.2.1. Executing ABC.

3.125.3. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4432$abc$3369$auto$opt_dff.cc:194:make_patterns_logic$1275, asynchronously reset by !\arst_i
Extracted 142 gates and 230 wires to a netlist network with 88 inputs and 105 outputs.

3.125.3.1. Executing ABC.

3.125.4. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4600$abc$3574$auto$opt_dff.cc:194:make_patterns_logic$1287, asynchronously reset by !\arst_i
Extracted 58 gates and 101 wires to a netlist network with 43 inputs and 46 outputs.

3.125.4.1. Executing ABC.

3.125.5. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4662$abc$3659$auto$opt_dff.cc:194:make_patterns_logic$1296, asynchronously reset by !\arst_i
Extracted 55 gates and 93 wires to a netlist network with 38 inputs and 41 outputs.

3.125.5.1. Executing ABC.

3.125.6. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4744$abc$3713$auto$opt_dff.cc:194:make_patterns_logic$1305, asynchronously reset by !\arst_i
Extracted 86 gates and 123 wires to a netlist network with 37 inputs and 74 outputs.

3.125.6.1. Executing ABC.

3.125.7. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i
Extracted 25 gates and 45 wires to a netlist network with 20 inputs and 16 outputs.

3.125.7.1. Executing ABC.

3.125.8. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by !\arst_i
Extracted 299 gates and 404 wires to a netlist network with 105 inputs and 168 outputs.

3.125.8.1. Executing ABC.

3.125.9. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5193$abc$3155$auto$opt_dff.cc:194:make_patterns_logic$1251, asynchronously reset by !\arst_i
Extracted 86 gates and 130 wires to a netlist network with 44 inputs and 53 outputs.

3.125.9.1. Executing ABC.

3.125.10. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$6014$abc$4856$abc$3839$u1.PIO_timing_controller.dstrb
Extracted 195 gates and 353 wires to a netlist network with 158 inputs and 63 outputs.

3.125.10.1. Executing ABC.

yosys> abc -dff -keepff

3.126. Executing ABC pass (technology mapping using ABC).

3.126.1. Summary of detected clock domains:
  87 cells in clk=\wb_clk_i, en=$abc$5502$abc$4329$abc$3300$auto$opt_dff.cc:194:make_patterns_logic$1263, arst=!\arst_i, srst={ }
  148 cells in clk=\wb_clk_i, en=$abc$5601$abc$4432$abc$3369$auto$opt_dff.cc:194:make_patterns_logic$1275, arst=!\arst_i, srst={ }
  61 cells in clk=\wb_clk_i, en=$abc$5766$abc$4600$abc$3574$auto$opt_dff.cc:194:make_patterns_logic$1287, arst=!\arst_i, srst={ }
  52 cells in clk=\wb_clk_i, en=$abc$5838$abc$4662$abc$3659$auto$opt_dff.cc:194:make_patterns_logic$1296, arst=!\arst_i, srst={ }
  91 cells in clk=\wb_clk_i, en=$abc$5905$abc$4744$abc$3713$auto$opt_dff.cc:194:make_patterns_logic$1305, arst=!\arst_i, srst={ }
  24 cells in clk=\wb_clk_i, en={ }, arst={ }, srst={ }
  300 cells in clk=\wb_clk_i, en={ }, arst=!\arst_i, srst={ }
  88 cells in clk=\wb_clk_i, en=$abc$6356$abc$5193$abc$3155$auto$opt_dff.cc:194:make_patterns_logic$1251, arst=!\arst_i, srst={ }
  196 cells in clk=\wb_clk_i, en=$abc$6014$abc$4856$abc$3839$u1.PIO_timing_controller.dstrb, arst={ }, srst={ }

3.126.2. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5502$abc$4329$abc$3300$auto$opt_dff.cc:194:make_patterns_logic$1263, asynchronously reset by !\arst_i
Extracted 87 gates and 147 wires to a netlist network with 60 inputs and 62 outputs.

3.126.2.1. Executing ABC.

3.126.3. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5601$abc$4432$abc$3369$auto$opt_dff.cc:194:make_patterns_logic$1275, asynchronously reset by !\arst_i
Extracted 148 gates and 236 wires to a netlist network with 88 inputs and 102 outputs.

3.126.3.1. Executing ABC.

3.126.4. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5766$abc$4600$abc$3574$auto$opt_dff.cc:194:make_patterns_logic$1287, asynchronously reset by !\arst_i
Extracted 61 gates and 106 wires to a netlist network with 45 inputs and 45 outputs.

3.126.4.1. Executing ABC.

3.126.5. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5838$abc$4662$abc$3659$auto$opt_dff.cc:194:make_patterns_logic$1296, asynchronously reset by !\arst_i
Extracted 52 gates and 88 wires to a netlist network with 36 inputs and 34 outputs.

3.126.5.1. Executing ABC.

3.126.6. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5905$abc$4744$abc$3713$auto$opt_dff.cc:194:make_patterns_logic$1305, asynchronously reset by !\arst_i
Extracted 91 gates and 128 wires to a netlist network with 37 inputs and 69 outputs.

3.126.6.1. Executing ABC.

3.126.7. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i
Extracted 24 gates and 44 wires to a netlist network with 20 inputs and 16 outputs.

3.126.7.1. Executing ABC.

3.126.8. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by !\arst_i
Extracted 300 gates and 405 wires to a netlist network with 105 inputs and 161 outputs.

3.126.8.1. Executing ABC.

3.126.9. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$6356$abc$5193$abc$3155$auto$opt_dff.cc:194:make_patterns_logic$1251, asynchronously reset by !\arst_i
Extracted 88 gates and 136 wires to a netlist network with 48 inputs and 55 outputs.

3.126.9.1. Executing ABC.

3.126.10. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$7149$abc$6014$abc$4856$abc$3839$u1.PIO_timing_controller.dstrb
Extracted 196 gates and 354 wires to a netlist network with 158 inputs and 63 outputs.

3.126.10.1. Executing ABC.

yosys> opt_ffinv

3.127. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.128. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~4 debug messages>

yosys> opt_merge -nomux

3.129. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~372 debug messages>
Removed a total of 124 cells.

yosys> opt_muxtree

3.130. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.131. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.132. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.133. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.134. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.135. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 5849 unused wires.
<suppressed ~39 debug messages>

yosys> opt_expr

3.136. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.137. Executing BMUXMAP pass.

yosys> demuxmap

3.138. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_holaAe/abc_tmp_1.scr

3.139. Executing ABC pass (technology mapping using ABC).

3.139.1. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Extracted 668 gates and 954 wires to a netlist network with 286 inputs and 140 outputs.

3.139.1.1. Executing ABC.
DE:   #PIs = 286  #Luts =   260  Max Lvl =   3  Avg Lvl =   2.03  [   0.11 sec. at Pass 0]{firstMap}[1]
DE:   #PIs = 286  #Luts =   224  Max Lvl =   6  Avg Lvl =   2.59  [   0.79 sec. at Pass 1]{initMapFlow}[2]
DE:   #PIs = 286  #Luts =   222  Max Lvl =   5  Avg Lvl =   2.57  [   0.28 sec. at Pass 2]{map}[2]
DE:   #PIs = 286  #Luts =   222  Max Lvl =   5  Avg Lvl =   2.57  [   0.98 sec. at Pass 3]{postMap}[6]
DE:   #PIs = 286  #Luts =   219  Max Lvl =   6  Avg Lvl =   2.60  [   0.96 sec. at Pass 4]{map}[12]
DE:   #PIs = 286  #Luts =   219  Max Lvl =   6  Avg Lvl =   2.60  [   1.45 sec. at Pass 5]{postMap}[16]
DE:   #PIs = 286  #Luts =   218  Max Lvl =   6  Avg Lvl =   2.49  [   2.24 sec. at Pass 6]{map}[16]
DE:   #PIs = 286  #Luts =   218  Max Lvl =   6  Avg Lvl =   2.49  [   2.66 sec. at Pass 7]{postMap}[16]
DE:   #PIs = 286  #Luts =   218  Max Lvl =   6  Avg Lvl =   2.49  [   0.88 sec. at Pass 8]{map}[16]
DE:   #PIs = 286  #Luts =   218  Max Lvl =   6  Avg Lvl =   2.49  [   0.42 sec. at Pass 9]{postMap}[16]
DE:   #PIs = 286  #Luts =   218  Max Lvl =   5  Avg Lvl =   2.48  [   0.38 sec. at Pass 10]{pushMap}[16]
DE:   #PIs = 286  #Luts =   218  Max Lvl =   5  Avg Lvl =   2.48  [   0.23 sec. at Pass 11]{map}[16]
DE:   #PIs = 286  #Luts =   218  Max Lvl =   5  Avg Lvl =   2.48  [   0.27 sec. at Pass 12]{postMap}[16]
DE:   #PIs = 286  #Luts =   218  Max Lvl =   5  Avg Lvl =   2.48  [   0.26 sec. at Pass 13]{map}[16]
DE:   #PIs = 286  #Luts =   218  Max Lvl =   5  Avg Lvl =   2.48  [   0.49 sec. at Pass 14]{pushMap}[16]
DE:   #PIs = 286  #Luts =   218  Max Lvl =   5  Avg Lvl =   2.48  [   0.25 sec. at Pass 15]{finalMap}[16]

yosys> opt_expr

3.140. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.141. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.142. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.143. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.144. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.145. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.146. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.147. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 905 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.148. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.149. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.150. Printing statistics.

=== atahost_top ===

   Number of wires:               1216
   Number of wire bits:           1988
   Number of public wires:         225
   Number of public wire bits:     997
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                487
     $_DFFE_PN0P_                  176
     $_DFFE_PP_                     16
     $_DFF_PN0_                     71
     $_DFF_P_                        6
     $lut                          218


yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFFE_??_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 -cell $_DLATCH_?_ 0 -cell $_DLATCH_???_ 0

3.151. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.152. Printing statistics.

=== atahost_top ===

   Number of wires:               1216
   Number of wire bits:           1988
   Number of public wires:         225
   Number of public wire bits:     997
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                487
     $_DFFE_PN0P_                  176
     $_DFFE_PP_                     16
     $_DFF_PN0_                     71
     $_DFF_P_                        6
     $lut                          218


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/ffs_map.v

3.153. Executing TECHMAP pass (map to technology primitives).

3.153.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.153.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Generating RTLIL representation for module `\$_SDFFE_PP0P_'.
Generating RTLIL representation for module `\$_SDFFE_PP0N_'.
Generating RTLIL representation for module `\$_SDFFE_PN0P_'.
Generating RTLIL representation for module `\$_SDFFE_PN0N_'.
Generating RTLIL representation for module `\$_SDFFE_PP1P_'.
Generating RTLIL representation for module `\$_SDFFE_PP1N_'.
Generating RTLIL representation for module `\$_SDFFE_PN1P_'.
Generating RTLIL representation for module `\$_SDFFE_PN1N_'.
Generating RTLIL representation for module `\$_SDFFE_NP0P_'.
Generating RTLIL representation for module `\$_SDFFE_NP0N_'.
Generating RTLIL representation for module `\$_SDFFE_NN0P_'.
Generating RTLIL representation for module `\$_SDFFE_NN0N_'.
Generating RTLIL representation for module `\$_SDFFE_NP1P_'.
Generating RTLIL representation for module `\$_SDFFE_NP1N_'.
Generating RTLIL representation for module `\$_SDFFE_NN1P_'.
Generating RTLIL representation for module `\$_SDFFE_NN1N_'.
Generating RTLIL representation for module `\$_DLATCH_P_'.
Generating RTLIL representation for module `\$_DLATCH_N_'.
Generating RTLIL representation for module `\$_DLATCH_PP0_'.
Generating RTLIL representation for module `\$_DLATCH_NP0_'.
Generating RTLIL representation for module `\$_DLATCH_PN0_'.
Generating RTLIL representation for module `\$_DLATCH_NN0_'.
Generating RTLIL representation for module `\$_DLATCH_PP1_'.
Generating RTLIL representation for module `\$_DLATCH_NP1_'.
Generating RTLIL representation for module `\$_DLATCH_PN1_'.
Generating RTLIL representation for module `\$_DLATCH_NN1_'.
Successfully finished Verilog frontend.

3.153.3. Continuing TECHMAP pass.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_DFFE_PP_ for cells of type $_DFFE_PP_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~869 debug messages>

yosys> opt_expr -mux_undef

3.154. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~5130 debug messages>

yosys> simplemap

3.155. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.156. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge

3.157. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~2598 debug messages>
Removed a total of 866 cells.

yosys> opt_dff -nodffe -nosdff

3.158. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.159. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 1867 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.160. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~230 debug messages>

yosys> opt_merge -nomux

3.161. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.162. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.163. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.164. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.165. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.166. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.167. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 34 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.168. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_holaAe/abc_tmp_2.scr

3.169. Executing ABC pass (technology mapping using ABC).

3.169.1. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Extracted 919 gates and 1208 wires to a netlist network with 287 inputs and 141 outputs.

3.169.1.1. Executing ABC.
DE:   #PIs = 287  #Luts =   221  Max Lvl =   3  Avg Lvl =   1.95  [   0.87 sec. at Pass 0]{firstMap}[1]
DE:   #PIs = 287  #Luts =   219  Max Lvl =   5  Avg Lvl =   2.43  [   0.66 sec. at Pass 1]{initMapFlow}[2]
DE:   #PIs = 287  #Luts =   219  Max Lvl =   5  Avg Lvl =   2.43  [   0.20 sec. at Pass 2]{map}[2]
DE:   #PIs = 287  #Luts =   219  Max Lvl =   5  Avg Lvl =   2.43  [   0.51 sec. at Pass 3]{postMap}[6]
DE:   #PIs = 287  #Luts =   219  Max Lvl =   5  Avg Lvl =   2.43  [   1.23 sec. at Pass 4]{map}[12]
DE:   #PIs = 287  #Luts =   219  Max Lvl =   5  Avg Lvl =   2.43  [   0.60 sec. at Pass 5]{postMap}[16]
DE:   #PIs = 287  #Luts =   219  Max Lvl =   5  Avg Lvl =   2.43  [   0.44 sec. at Pass 6]{pushMap}[16]
DE:   #PIs = 287  #Luts =   219  Max Lvl =   5  Avg Lvl =   2.43  [   0.26 sec. at Pass 7]{finalMap}[16]

yosys> opt_expr

3.170. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.171. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.172. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.173. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.174. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.175. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.176. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.177. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 1046 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.178. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.179. Executing HIERARCHY pass (managing design hierarchy).

3.179.1. Analyzing design hierarchy..
Top module:  \atahost_top

3.179.2. Analyzing design hierarchy..
Top module:  \atahost_top
Removed 0 unused modules.

yosys> stat

3.180. Printing statistics.

=== atahost_top ===

   Number of wires:               1217
   Number of wire bits:           1989
   Number of public wires:         225
   Number of public wire bits:     997
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                488
     $lut                          219
     dff                             6
     dffe                           16
     dffr                           71
     dffre                         176


yosys> opt_clean -purge

3.181. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 137 unused wires.
<suppressed ~137 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.182. Executing Verilog backend.
Dumping module `\atahost_top'.

Warnings: 128 unique messages, 149 total
End of script. Logfile hash: 4a7c092a18, CPU: user 3.77s system 0.15s, MEM: 42.61 MB peak
Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)
Time spent: 95% 6x abc (73 sec), 1% 29x opt_expr (0 sec), ...
real 38.40
user 56.28
sys 20.50
