
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.24
 Yosys 0.16+65 (git sha1 03bd62bb8, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl b21.vhd

yosys> verific -vhdl b21.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'b21.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_1164' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_1164.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.textio' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/textio.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_arith' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_arith.vdb'
VERIFIC-INFO [VHDL-1012] b21.vhd:5: analyzing entity 'b14'
VERIFIC-INFO [VHDL-1010] b21.vhd:15: analyzing architecture 'behav'
VERIFIC-INFO [VHDL-1012] b21.vhd:515: analyzing entity 'b14_1'
VERIFIC-INFO [VHDL-1010] b21.vhd:525: analyzing architecture 'behav'
VERIFIC-INFO [VHDL-1012] b21.vhd:1026: analyzing entity 'b21'
VERIFIC-INFO [VHDL-1010] b21.vhd:1034: analyzing architecture 'behav'

yosys> synth_rs -top b21 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.47

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top b21

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] b21.vhd:1026: processing 'b21(BEHAV)'
VERIFIC-INFO [VHDL-1067] b21.vhd:5: processing 'b14(BEHAV)'
VERIFIC-INFO [VHDL-1172] b21.vhd:482: 'others' clause is never selected
VERIFIC-INFO [VHDL-1067] b21.vhd:515: processing 'b14_1(BEHAV)'
VERIFIC-INFO [VHDL-1172] b21.vhd:992: 'others' clause is never selected
Importing module b21.
Importing module b14(BEHAV).
Importing module b14_1(BEHAV).

3.3.1. Analyzing design hierarchy..
Top module:  \b21
Used module:     \b14_1(BEHAV)
Used module:     \b14(BEHAV)

3.3.2. Analyzing design hierarchy..
Top module:  \b21
Used module:     \b14_1(BEHAV)
Used module:     \b14(BEHAV)
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module b14_1(BEHAV).
<suppressed ~26 debug messages>
Optimizing module b14(BEHAV).
<suppressed ~26 debug messages>
Optimizing module b21.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module b14_1(BEHAV).
Deleting now unused module b14(BEHAV).
<suppressed ~2 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~13 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 14 unused cells and 347 unused wires.
<suppressed ~113 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module b21...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
    dead port 2/2 on $mux $flatten\P1.$verific$i684$b21.vhd:505$524.
    dead port 2/2 on $mux $flatten\P1.$verific$mux_672$b21.vhd:505$515.
    dead port 2/2 on $mux $flatten\P1.$verific$mux_685$b21.vhd:505$526.
    dead port 2/2 on $mux $flatten\P2.$verific$i683$b21.vhd:1015$1030.
    dead port 2/2 on $mux $flatten\P2.$verific$mux_671$b21.vhd:1015$1021.
    dead port 2/2 on $mux $flatten\P2.$verific$mux_684$b21.vhd:1015$1032.
Removed 6 multiplexer ports.
<suppressed ~40 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_746$b21.vhd:490$477: { $flatten\P1.$verific$n2255$108 $auto$opt_reduce.cc:134:opt_pmux$1074 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_750$b21.vhd:490$418: { $flatten\P1.$verific$n2256$109 $auto$opt_reduce.cc:134:opt_pmux$1076 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_751$b21.vhd:490$495: { $flatten\P1.$verific$n2257$110 $auto$opt_reduce.cc:134:opt_pmux$1078 }
    New ctrl vector for $pmux cell $flatten\P1.$verific$select_752$b21.vhd:490$496: { $flatten\P1.$verific$n2258$111 $auto$opt_reduce.cc:134:opt_pmux$1080 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_746$b21.vhd:1000$981: { $flatten\P2.$verific$n2255$611 $auto$opt_reduce.cc:134:opt_pmux$1082 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_750$b21.vhd:1000$922: { $flatten\P2.$verific$n2256$612 $auto$opt_reduce.cc:134:opt_pmux$1084 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_751$b21.vhd:1000$999: { $flatten\P2.$verific$n2257$613 $auto$opt_reduce.cc:134:opt_pmux$1086 }
    New ctrl vector for $pmux cell $flatten\P2.$verific$select_752$b21.vhd:1000$1000: { $flatten\P2.$verific$n2258$614 $auto$opt_reduce.cc:134:opt_pmux$1088 }
  Optimizing cells in module \b21.
Performed a total of 8 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\P2.$verific$wr_reg$b21.vhd:1019$1067 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P2.$verific$state_reg$b21.vhd:1019$1069 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P2.$verific$reg3_reg$b21.vhd:1019$1064 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P2.$verific$reg2_reg$b21.vhd:1019$1063 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P2.$verific$reg1_reg$b21.vhd:1019$1062 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P2.$verific$reg0_reg$b21.vhd:1019$1061 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P2.$verific$rd_reg$b21.vhd:1019$1066 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P2.$verific$datao_reg$b21.vhd:1019$1068 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P2.$verific$addr_reg$b21.vhd:1019$1065 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P2.$verific$IR_reg$b21.vhd:1019$1058 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P2.$verific$B_reg$b21.vhd:1019$1060 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P1.$verific$wr_reg$b21.vhd:509$561 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P1.$verific$state_reg$b21.vhd:509$563 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P1.$verific$reg3_reg$b21.vhd:509$558 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P1.$verific$reg2_reg$b21.vhd:509$557 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P1.$verific$reg1_reg$b21.vhd:509$556 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P1.$verific$reg0_reg$b21.vhd:509$555 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P1.$verific$rd_reg$b21.vhd:509$560 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P1.$verific$IR_reg$b21.vhd:509$552 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P1.$verific$B_reg$b21.vhd:509$554 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P1.$verific$datao_reg$b21.vhd:509$562 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($aldff) from module b21.
Changing const-value async load to async reset on $flatten\P1.$verific$addr_reg$b21.vhd:509$559 ($aldff) from module b21.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 6 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~40 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).
Found FSM state register b21.P1.d.
Found FSM state register b21.P2.d.

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).
Extracting FSM `\P1.d' from module `\b21'.
  found $adff cell for state register: $flatten\P1.$verific$d_reg$b21.vhd:509$553
  root of input selection tree: $flatten\P1.$verific$n11472$358
  found reset state: 0 (from async reset)
  found ctrl input: \P1.state
  found ctrl input: $flatten\P1.$verific$n341$204 [0]
  found ctrl input: $flatten\P1.$verific$n10346$175
  found ctrl input: $flatten\P1.$verific$n1405$102
  found ctrl input: $flatten\P1.$verific$n1440$103
  found ctrl input: $flatten\P1.$verific$n1474$104
  found ctrl input: $flatten\P1.$verific$n1475$105
  found ctrl input: $flatten\P1.$verific$n1476$106
  found ctrl input: $flatten\P1.$verific$n1477$107
  found state code: 1
  found state code: 2
  found state code: 3
  found ctrl input: \P1.B
  ctrl inputs: { \P1.B \P1.state $flatten\P1.$verific$n1405$102 $flatten\P1.$verific$n1440$103 $flatten\P1.$verific$n1474$104 $flatten\P1.$verific$n1475$105 $flatten\P1.$verific$n1476$106 $flatten\P1.$verific$n1477$107 $flatten\P1.$verific$n10346$175 $flatten\P1.$verific$n341$204 [0] }
  ctrl outputs: $flatten\P1.$verific$n11472$358
  transition:          0 10'-0-------- ->          0 0
  transition:          0 10'-100000000 ->          0 0
  transition:          0 10'-100000100 ->          0 0
  transition:          0 10'-100001-00 ->          1 1
  transition:          0 10'-10001--00 ->          2 2
  transition:          0 10'-1001---00 ->          3 3
  transition:          0 10'0101----00 ->          0 0
  transition:          0 10'1101----00 ->          3 3
  transition:          0 10'011-----00 ->          3 3
  transition:          0 10'111-----00 ->          0 0
  transition:          0 10'-1------10 ->          0 0
  transition:          0 10'-1-------1 ->          0 0
  transition:          2 10'-0-------- ->          2 2
  transition:          2 10'-100000000 ->          2 2
  transition:          2 10'-100000100 ->          0 0
  transition:          2 10'-100001-00 ->          1 1
  transition:          2 10'-10001--00 ->          2 2
  transition:          2 10'-1001---00 ->          3 3
  transition:          2 10'0101----00 ->          2 2
  transition:          2 10'1101----00 ->          3 3
  transition:          2 10'011-----00 ->          3 3
  transition:          2 10'111-----00 ->          2 2
  transition:          2 10'-1------10 ->          2 2
  transition:          2 10'-1-------1 ->          2 2
  transition:          1 10'-0-------- ->          1 1
  transition:          1 10'-100000000 ->          1 1
  transition:          1 10'-100000100 ->          0 0
  transition:          1 10'-100001-00 ->          1 1
  transition:          1 10'-10001--00 ->          2 2
  transition:          1 10'-1001---00 ->          3 3
  transition:          1 10'0101----00 ->          1 1
  transition:          1 10'1101----00 ->          3 3
  transition:          1 10'011-----00 ->          3 3
  transition:          1 10'111-----00 ->          1 1
  transition:          1 10'-1------10 ->          1 1
  transition:          1 10'-1-------1 ->          1 1
  transition:          3 10'-0-------- ->          3 3
  transition:          3 10'-100000000 ->          3 3
  transition:          3 10'-100000100 ->          0 0
  transition:          3 10'-100001-00 ->          1 1
  transition:          3 10'-10001--00 ->          2 2
  transition:          3 10'-1001---00 ->          3 3
  transition:          3 10'0101----00 ->          3 3
  transition:          3 10'1101----00 ->          3 3
  transition:          3 10'011-----00 ->          3 3
  transition:          3 10'111-----00 ->          3 3
  transition:          3 10'-1------10 ->          3 3
  transition:          3 10'-1-------1 ->          3 3
Extracting FSM `\P2.d' from module `\b21'.
  found $adff cell for state register: $flatten\P2.$verific$d_reg$b21.vhd:1019$1059
  root of input selection tree: $flatten\P2.$verific$n11479$862
  found reset state: 0 (from async reset)
  found ctrl input: \P2.state
  found ctrl input: $flatten\P2.$verific$n341$707 [0]
  found ctrl input: $flatten\P2.$verific$n10346$678
  found ctrl input: $flatten\P2.$verific$n1405$605
  found ctrl input: $flatten\P2.$verific$n1440$606
  found ctrl input: $flatten\P2.$verific$n1474$607
  found ctrl input: $flatten\P2.$verific$n1475$608
  found ctrl input: $flatten\P2.$verific$n1476$609
  found ctrl input: $flatten\P2.$verific$n1477$610
  found state code: 1
  found state code: 2
  found state code: 3
  found ctrl input: \P2.B
  ctrl inputs: { \P2.B \P2.state $flatten\P2.$verific$n1405$605 $flatten\P2.$verific$n1440$606 $flatten\P2.$verific$n1474$607 $flatten\P2.$verific$n1475$608 $flatten\P2.$verific$n1476$609 $flatten\P2.$verific$n1477$610 $flatten\P2.$verific$n10346$678 $flatten\P2.$verific$n341$707 [0] }
  ctrl outputs: $flatten\P2.$verific$n11479$862
  transition:          0 10'-0-------- ->          0 0
  transition:          0 10'-100000000 ->          0 0
  transition:          0 10'-100000100 ->          0 0
  transition:          0 10'-100001-00 ->          1 1
  transition:          0 10'-10001--00 ->          2 2
  transition:          0 10'-1001---00 ->          3 3
  transition:          0 10'0101----00 ->          0 0
  transition:          0 10'1101----00 ->          3 3
  transition:          0 10'011-----00 ->          3 3
  transition:          0 10'111-----00 ->          0 0
  transition:          0 10'-1------10 ->          0 0
  transition:          0 10'-1-------1 ->          0 0
  transition:          2 10'-0-------- ->          2 2
  transition:          2 10'-100000000 ->          2 2
  transition:          2 10'-100000100 ->          0 0
  transition:          2 10'-100001-00 ->          1 1
  transition:          2 10'-10001--00 ->          2 2
  transition:          2 10'-1001---00 ->          3 3
  transition:          2 10'0101----00 ->          2 2
  transition:          2 10'1101----00 ->          3 3
  transition:          2 10'011-----00 ->          3 3
  transition:          2 10'111-----00 ->          2 2
  transition:          2 10'-1------10 ->          2 2
  transition:          2 10'-1-------1 ->          2 2
  transition:          1 10'-0-------- ->          1 1
  transition:          1 10'-100000000 ->          1 1
  transition:          1 10'-100000100 ->          0 0
  transition:          1 10'-100001-00 ->          1 1
  transition:          1 10'-10001--00 ->          2 2
  transition:          1 10'-1001---00 ->          3 3
  transition:          1 10'0101----00 ->          1 1
  transition:          1 10'1101----00 ->          3 3
  transition:          1 10'011-----00 ->          3 3
  transition:          1 10'111-----00 ->          1 1
  transition:          1 10'-1------10 ->          1 1
  transition:          1 10'-1-------1 ->          1 1
  transition:          3 10'-0-------- ->          3 3
  transition:          3 10'-100000000 ->          3 3
  transition:          3 10'-100000100 ->          0 0
  transition:          3 10'-100001-00 ->          1 1
  transition:          3 10'-10001--00 ->          2 2
  transition:          3 10'-1001---00 ->          3 3
  transition:          3 10'0101----00 ->          3 3
  transition:          3 10'1101----00 ->          3 3
  transition:          3 10'011-----00 ->          3 3
  transition:          3 10'111-----00 ->          3 3
  transition:          3 10'-1------10 ->          3 3
  transition:          3 10'-1-------1 ->          3 3

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\P2.d$1091' from module `\b21'.
  Merging pattern 10'-100000000 and 10'-100000100 from group (0 0 0).
  Merging pattern 10'-100000100 and 10'-100000000 from group (0 0 0).
  Merging pattern 10'0101----00 and 10'1101----00 from group (3 3 3).
  Merging pattern 10'1101----00 and 10'0101----00 from group (3 3 3).
  Merging pattern 10'011-----00 and 10'111-----00 from group (3 3 3).
  Merging pattern 10'111-----00 and 10'011-----00 from group (3 3 3).
Optimizing FSM `$fsm$\P1.d$1089' from module `\b21'.
  Merging pattern 10'-100000000 and 10'-100000100 from group (0 0 0).
  Merging pattern 10'-100000100 and 10'-100000000 from group (0 0 0).
  Merging pattern 10'0101----00 and 10'1101----00 from group (3 3 3).
  Merging pattern 10'1101----00 and 10'0101----00 from group (3 3 3).
  Merging pattern 10'011-----00 and 10'111-----00 from group (3 3 3).
  Merging pattern 10'111-----00 and 10'011-----00 from group (3 3 3).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 6 unused cells and 6 unused wires.
<suppressed ~7 debug messages>

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\P1.d$1089' from module `\b21'.
Optimizing FSM `$fsm$\P2.d$1091' from module `\b21'.

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).
Recoding FSM `$fsm$\P1.d$1089' from module `\b21' using `auto' encoding:
  mapping auto encoding to `binary` for this FSM.
  00000000000000000000000000000000 -> 00
  00000000000000000000000000000010 -> 01
  00000000000000000000000000000001 -> 10
  00000000000000000000000000000011 -> 11
Recoding FSM `$fsm$\P2.d$1091' from module `\b21' using `auto' encoding:
  mapping auto encoding to `binary` for this FSM.
  00000000000000000000000000000000 -> 00
  00000000000000000000000000000010 -> 01
  00000000000000000000000000000001 -> 10
  00000000000000000000000000000011 -> 11

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

FSM `$fsm$\P1.d$1089' from module `b21':
-------------------------------------

  Information on FSM $fsm$\P1.d$1089 (\P1.d):

  Number of input signals:   10
  Number of output signals:  32
  Number of state bits:       2

  Input signals:
    0: $flatten\P1.$verific$n341$204 [0]
    1: $flatten\P1.$verific$n10346$175
    2: $flatten\P1.$verific$n1477$107
    3: $flatten\P1.$verific$n1476$106
    4: $flatten\P1.$verific$n1475$105
    5: $flatten\P1.$verific$n1474$104
    6: $flatten\P1.$verific$n1440$103
    7: $flatten\P1.$verific$n1405$102
    8: \P1.state
    9: \P1.B

  Output signals:
    0: $flatten\P1.$verific$n11472$358 [0]
    1: $flatten\P1.$verific$n11472$358 [1]
    2: $flatten\P1.$verific$n11472$358 [2]
    3: $flatten\P1.$verific$n11472$358 [3]
    4: $flatten\P1.$verific$n11472$358 [4]
    5: $flatten\P1.$verific$n11472$358 [5]
    6: $flatten\P1.$verific$n11472$358 [6]
    7: $flatten\P1.$verific$n11472$358 [7]
    8: $flatten\P1.$verific$n11472$358 [8]
    9: $flatten\P1.$verific$n11472$358 [9]
   10: $flatten\P1.$verific$n11472$358 [10]
   11: $flatten\P1.$verific$n11472$358 [11]
   12: $flatten\P1.$verific$n11472$358 [12]
   13: $flatten\P1.$verific$n11472$358 [13]
   14: $flatten\P1.$verific$n11472$358 [14]
   15: $flatten\P1.$verific$n11472$358 [15]
   16: $flatten\P1.$verific$n11472$358 [16]
   17: $flatten\P1.$verific$n11472$358 [17]
   18: $flatten\P1.$verific$n11472$358 [18]
   19: $flatten\P1.$verific$n11472$358 [19]
   20: $flatten\P1.$verific$n11472$358 [20]
   21: $flatten\P1.$verific$n11472$358 [21]
   22: $flatten\P1.$verific$n11472$358 [22]
   23: $flatten\P1.$verific$n11472$358 [23]
   24: $flatten\P1.$verific$n11472$358 [24]
   25: $flatten\P1.$verific$n11472$358 [25]
   26: $flatten\P1.$verific$n11472$358 [26]
   27: $flatten\P1.$verific$n11472$358 [27]
   28: $flatten\P1.$verific$n11472$358 [28]
   29: $flatten\P1.$verific$n11472$358 [29]
   30: $flatten\P1.$verific$n11472$358 [30]
   31: $flatten\P1.$verific$n11472$358 [31]

  State encoding:
    0:       2'00  <RESET STATE>
    1:       2'01
    2:       2'10
    3:       2'11

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 10'-100000-00   ->     0 0
      1:     0 10'0101----00   ->     0 0
      2:     0 10'111-----00   ->     0 0
      3:     0 10'-1------10   ->     0 0
      4:     0 10'-1-------1   ->     0 0
      5:     0 10'-0--------   ->     0 0
      6:     0 10'-10001--00   ->     1 2
      7:     0 10'-100001-00   ->     2 1
      8:     0 10'-1001---00   ->     3 3
      9:     0 10'1101----00   ->     3 3
     10:     0 10'011-----00   ->     3 3
     11:     1 10'-100000100   ->     0 0
     12:     1 10'-100000000   ->     1 2
     13:     1 10'-10001--00   ->     1 2
     14:     1 10'0101----00   ->     1 2
     15:     1 10'111-----00   ->     1 2
     16:     1 10'-1------10   ->     1 2
     17:     1 10'-1-------1   ->     1 2
     18:     1 10'-0--------   ->     1 2
     19:     1 10'-100001-00   ->     2 1
     20:     1 10'-1001---00   ->     3 3
     21:     1 10'1101----00   ->     3 3
     22:     1 10'011-----00   ->     3 3
     23:     2 10'-100000100   ->     0 0
     24:     2 10'-10001--00   ->     1 2
     25:     2 10'-100000000   ->     2 1
     26:     2 10'-100001-00   ->     2 1
     27:     2 10'0101----00   ->     2 1
     28:     2 10'111-----00   ->     2 1
     29:     2 10'-1------10   ->     2 1
     30:     2 10'-1-------1   ->     2 1
     31:     2 10'-0--------   ->     2 1
     32:     2 10'-1001---00   ->     3 3
     33:     2 10'1101----00   ->     3 3
     34:     2 10'011-----00   ->     3 3
     35:     3 10'-100000100   ->     0 0
     36:     3 10'-10001--00   ->     1 2
     37:     3 10'-100001-00   ->     2 1
     38:     3 10'-100000000   ->     3 3
     39:     3 10'-1001---00   ->     3 3
     40:     3 10'-101----00   ->     3 3
     41:     3 10'-11-----00   ->     3 3
     42:     3 10'-1------10   ->     3 3
     43:     3 10'-1-------1   ->     3 3
     44:     3 10'-0--------   ->     3 3

-------------------------------------

FSM `$fsm$\P2.d$1091' from module `b21':
-------------------------------------

  Information on FSM $fsm$\P2.d$1091 (\P2.d):

  Number of input signals:   10
  Number of output signals:  32
  Number of state bits:       2

  Input signals:
    0: $flatten\P2.$verific$n341$707 [0]
    1: $flatten\P2.$verific$n10346$678
    2: $flatten\P2.$verific$n1477$610
    3: $flatten\P2.$verific$n1476$609
    4: $flatten\P2.$verific$n1475$608
    5: $flatten\P2.$verific$n1474$607
    6: $flatten\P2.$verific$n1440$606
    7: $flatten\P2.$verific$n1405$605
    8: \P2.state
    9: \P2.B

  Output signals:
    0: $flatten\P2.$verific$n11479$862 [0]
    1: $flatten\P2.$verific$n11479$862 [1]
    2: $flatten\P2.$verific$n11479$862 [2]
    3: $flatten\P2.$verific$n11479$862 [3]
    4: $flatten\P2.$verific$n11479$862 [4]
    5: $flatten\P2.$verific$n11479$862 [5]
    6: $flatten\P2.$verific$n11479$862 [6]
    7: $flatten\P2.$verific$n11479$862 [7]
    8: $flatten\P2.$verific$n11479$862 [8]
    9: $flatten\P2.$verific$n11479$862 [9]
   10: $flatten\P2.$verific$n11479$862 [10]
   11: $flatten\P2.$verific$n11479$862 [11]
   12: $flatten\P2.$verific$n11479$862 [12]
   13: $flatten\P2.$verific$n11479$862 [13]
   14: $flatten\P2.$verific$n11479$862 [14]
   15: $flatten\P2.$verific$n11479$862 [15]
   16: $flatten\P2.$verific$n11479$862 [16]
   17: $flatten\P2.$verific$n11479$862 [17]
   18: $flatten\P2.$verific$n11479$862 [18]
   19: $flatten\P2.$verific$n11479$862 [19]
   20: $flatten\P2.$verific$n11479$862 [20]
   21: $flatten\P2.$verific$n11479$862 [21]
   22: $flatten\P2.$verific$n11479$862 [22]
   23: $flatten\P2.$verific$n11479$862 [23]
   24: $flatten\P2.$verific$n11479$862 [24]
   25: $flatten\P2.$verific$n11479$862 [25]
   26: $flatten\P2.$verific$n11479$862 [26]
   27: $flatten\P2.$verific$n11479$862 [27]
   28: $flatten\P2.$verific$n11479$862 [28]
   29: $flatten\P2.$verific$n11479$862 [29]
   30: $flatten\P2.$verific$n11479$862 [30]
   31: $flatten\P2.$verific$n11479$862 [31]

  State encoding:
    0:       2'00  <RESET STATE>
    1:       2'01
    2:       2'10
    3:       2'11

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 10'-100000-00   ->     0 0
      1:     0 10'0101----00   ->     0 0
      2:     0 10'111-----00   ->     0 0
      3:     0 10'-1------10   ->     0 0
      4:     0 10'-1-------1   ->     0 0
      5:     0 10'-0--------   ->     0 0
      6:     0 10'-10001--00   ->     1 2
      7:     0 10'-100001-00   ->     2 1
      8:     0 10'-1001---00   ->     3 3
      9:     0 10'1101----00   ->     3 3
     10:     0 10'011-----00   ->     3 3
     11:     1 10'-100000100   ->     0 0
     12:     1 10'-100000000   ->     1 2
     13:     1 10'-10001--00   ->     1 2
     14:     1 10'0101----00   ->     1 2
     15:     1 10'111-----00   ->     1 2
     16:     1 10'-1------10   ->     1 2
     17:     1 10'-1-------1   ->     1 2
     18:     1 10'-0--------   ->     1 2
     19:     1 10'-100001-00   ->     2 1
     20:     1 10'-1001---00   ->     3 3
     21:     1 10'1101----00   ->     3 3
     22:     1 10'011-----00   ->     3 3
     23:     2 10'-100000100   ->     0 0
     24:     2 10'-10001--00   ->     1 2
     25:     2 10'-100000000   ->     2 1
     26:     2 10'-100001-00   ->     2 1
     27:     2 10'0101----00   ->     2 1
     28:     2 10'111-----00   ->     2 1
     29:     2 10'-1------10   ->     2 1
     30:     2 10'-1-------1   ->     2 1
     31:     2 10'-0--------   ->     2 1
     32:     2 10'-1001---00   ->     3 3
     33:     2 10'1101----00   ->     3 3
     34:     2 10'011-----00   ->     3 3
     35:     3 10'-100000100   ->     0 0
     36:     3 10'-10001--00   ->     1 2
     37:     3 10'-100001-00   ->     2 1
     38:     3 10'-100000000   ->     3 3
     39:     3 10'-1001---00   ->     3 3
     40:     3 10'-101----00   ->     3 3
     41:     3 10'-11-----00   ->     3 3
     42:     3 10'-1------10   ->     3 3
     43:     3 10'-1-------1   ->     3 3
     44:     3 10'-0--------   ->     3 3

-------------------------------------

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).
Mapping FSM `$fsm$\P1.d$1089' from module `\b21'.
Mapping FSM `$fsm$\P2.d$1091' from module `\b21'.

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~14 debug messages>

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
<suppressed ~324 debug messages>
Removed a total of 108 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~40 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\P2.$verific$reg3_reg$b21.vhd:1019$1064 ($adff) from module b21 (D = $flatten\P2.$verific$n10312$831 [2:0], Q = \P2.reg3 [2:0]).
Adding EN signal on $flatten\P2.$verific$reg3_reg$b21.vhd:1019$1064 ($adff) from module b21 (D = $flatten\P2.$verific$n11185$857 [31:3], Q = \P2.reg3 [31:3]).
Adding EN signal on $flatten\P2.$verific$reg2_reg$b21.vhd:1019$1063 ($adff) from module b21 (D = $flatten\P2.$verific$n10279$830, Q = \P2.reg2).
Adding EN signal on $flatten\P2.$verific$reg1_reg$b21.vhd:1019$1062 ($adff) from module b21 (D = $flatten\P2.$verific$n10246$829, Q = \P2.reg1).
Adding EN signal on $flatten\P2.$verific$reg0_reg$b21.vhd:1019$1061 ($adff) from module b21 (D = $flatten\P2.$verific$n10213$828, Q = \P2.reg0).
Adding EN signal on $flatten\P2.$verific$datao_reg$b21.vhd:1019$1068 ($adff) from module b21 (D = { $flatten\P2.$verific$add_570$b21.vhd:980$990 $flatten\P2.$verific$n10521$840 [0] }, Q = \P2.datao).
Adding EN signal on $flatten\P2.$verific$B_reg$b21.vhd:1019$1060 ($adff) from module b21 (D = $flatten\P2.$verific$n10986$686, Q = \P2.B).
Adding EN signal on $flatten\P1.$verific$reg3_reg$b21.vhd:509$558 ($adff) from module b21 (D = $flatten\P1.$verific$n10312$328 [2:0], Q = \P1.reg3 [2:0]).
Adding EN signal on $flatten\P1.$verific$reg3_reg$b21.vhd:509$558 ($adff) from module b21 (D = $flatten\P1.$verific$n11178$353 [31:3], Q = \P1.reg3 [31:3]).
Adding EN signal on $flatten\P1.$verific$reg2_reg$b21.vhd:509$557 ($adff) from module b21 (D = $flatten\P1.$verific$n10279$327, Q = \P1.reg2).
Adding EN signal on $flatten\P1.$verific$reg1_reg$b21.vhd:509$556 ($adff) from module b21 (D = $flatten\P1.$verific$n10246$326, Q = \P1.reg1).
Adding EN signal on $flatten\P1.$verific$reg0_reg$b21.vhd:509$555 ($adff) from module b21 (D = $flatten\P1.$verific$n10213$325, Q = \P1.reg0).
Adding EN signal on $flatten\P1.$verific$datao_reg$b21.vhd:509$562 ($adff) from module b21 (D = { $flatten\P1.$verific$add_570$b21.vhd:470$486 $flatten\P1.$verific$n10514$336 [0] }, Q = \P1.datao).
Adding EN signal on $flatten\P1.$verific$B_reg$b21.vhd:509$554 ($adff) from module b21 (D = $flatten\P1.$verific$n10979$183, Q = \P1.B).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 48 unused cells and 152 unused wires.
<suppressed ~49 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~32 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
<suppressed ~60 debug messages>
Removed a total of 20 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 2 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 3 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 4 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 5 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 6 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 7 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 8 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 9 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 10 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 11 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 12 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 13 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 14 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 15 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 16 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 17 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 18 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 19 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 20 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 21 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 22 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 23 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 24 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 25 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 26 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 27 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 28 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 29 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 30 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 31 on $flatten\P1.$verific$d_reg$b21.vhd:509$553 ($adff) from module b21.
Setting constant 0-bit at position 2 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 3 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 4 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 5 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 6 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 7 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 8 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 9 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 10 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 11 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 12 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 13 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 14 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 15 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 16 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 17 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 18 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 19 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 20 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 21 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 22 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 23 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 24 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 25 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 26 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 27 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 28 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 29 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 30 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.
Setting constant 0-bit at position 31 on $flatten\P2.$verific$d_reg$b21.vhd:1019$1059 ($adff) from module b21.

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 20 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.13.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~32 debug messages>

yosys> opt_reduce

3.13.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.13.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..

yosys> opt_expr

3.13.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.13.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 20) from port A of cell b21.$verific$LessThan_16$b21.vhd:1080$53 ($lt).
Removed top 1 bits (of 20) from port A of cell b21.$verific$LessThan_17$b21.vhd:1080$54 ($lt).
Removed top 3 bits (of 29) from FF cell b21.$auto$ff.cc:262:slice$1538 ($adffe).
Removed top 1 bits (of 2) from port B of cell b21.$auto$fsm_map.cc:215:map_fsm$1097 ($eq).
Removed top 1 bits (of 2) from port B of cell b21.$auto$fsm_map.cc:215:map_fsm$1316 ($eq).
Removed top 1 bits (of 5) from port B of cell b21.$auto$fsm_map.cc:77:implement_pattern_cache$1284 ($eq).
Removed top 1 bits (of 6) from port B of cell b21.$auto$fsm_map.cc:77:implement_pattern_cache$1274 ($eq).
Removed top 3 bits (of 33) from port Y of cell b21.$flatten\P1.$verific$sub_365$b21.vhd:362$480 ($sub).
Removed top 3 bits (of 33) from port A of cell b21.$flatten\P1.$verific$sub_365$b21.vhd:362$480 ($sub).
Removed top 3 bits (of 33) from port B of cell b21.$flatten\P1.$verific$sub_365$b21.vhd:362$480 ($sub).
Removed top 2 bits (of 32) from port Y of cell b21.$flatten\P1.$verific$add_283$b21.vhd:322$478 ($add).
Removed top 2 bits (of 32) from port A of cell b21.$flatten\P1.$verific$add_283$b21.vhd:322$478 ($add).
Removed top 2 bits (of 32) from port B of cell b21.$flatten\P1.$verific$add_283$b21.vhd:322$478 ($add).
Removed top 30 bits (of 32) from port A of cell b21.$flatten\P1.$verific$equal_179$b21.vhd:250$472 ($eq).
Removed top 30 bits (of 32) from port A of cell b21.$flatten\P1.$verific$equal_178$b21.vhd:249$471 ($eq).
Removed top 31 bits (of 32) from port A of cell b21.$flatten\P1.$verific$equal_177$b21.vhd:248$470 ($eq).
Removed top 32 bits (of 33) from port A of cell b21.$flatten\P1.$verific$sub_168$b21.vhd:247$467 ($sub).
Removed top 1 bits (of 33) from port Y of cell b21.$flatten\P1.$verific$sub_168$b21.vhd:247$467 ($sub).
Removed top 1 bits (of 33) from port B of cell b21.$flatten\P1.$verific$sub_168$b21.vhd:247$467 ($sub).
Removed top 30 bits (of 32) from mux cell b21.$flatten\P1.$verific$mux_145$b21.vhd:230$461 ($mux).
Removed top 2 bits (of 3) from port A of cell b21.$flatten\P1.$verific$equal_143$b21.vhd:228$459 ($eq).
Removed top 1 bits (of 3) from port A of cell b21.$flatten\P1.$verific$equal_142$b21.vhd:227$458 ($eq).
Removed top 1 bits (of 3) from port A of cell b21.$flatten\P1.$verific$equal_141$b21.vhd:225$457 ($eq).
Removed top 30 bits (of 32) from mux cell b21.$flatten\P1.$verific$mux_140$b21.vhd:224$456 ($mux).
Removed top 30 bits (of 32) from mux cell b21.$flatten\P1.$verific$mux_138$b21.vhd:220$454 ($mux).
Removed top 2 bits (of 33) from port B of cell b21.$flatten\P1.$verific$sub_84$b21.vhd:153$436 ($sub).
Removed top 1 bits (of 33) from port Y of cell b21.$flatten\P1.$verific$sub_84$b21.vhd:153$436 ($sub).
Removed top 1 bits (of 33) from port A of cell b21.$flatten\P1.$verific$sub_84$b21.vhd:153$436 ($sub).
Removed top 1 bits (of 32) from port B of cell b21.$flatten\P1.$verific$LessThan_83$b21.vhd:152$435 ($lt).
Removed top 12 bits (of 32) from port A of cell b21.$flatten\P1.$verific$add_61$b21.vhd:117$423 ($add).
Removed top 12 bits (of 32) from port Y of cell b21.$flatten\P1.$verific$add_61$b21.vhd:117$423 ($add).
Removed top 12 bits (of 32) from port B of cell b21.$flatten\P1.$verific$add_61$b21.vhd:117$423 ($add).
Removed top 12 bits (of 32) from port A of cell b21.$flatten\P1.$verific$add_56$b21.vhd:114$421 ($add).
Removed top 12 bits (of 32) from port Y of cell b21.$flatten\P1.$verific$add_56$b21.vhd:114$421 ($add).
Removed top 12 bits (of 32) from port B of cell b21.$flatten\P1.$verific$add_56$b21.vhd:114$421 ($add).
Removed top 1 bits (of 3) from port Y of cell b21.$flatten\P1.$verific$add_44$b21.vhd:100$413 ($add).
Removed top 1 bits (of 3) from port A of cell b21.$flatten\P1.$verific$add_44$b21.vhd:100$413 ($add).
Removed top 25 bits (of 26) from port B of cell b21.$flatten\P1.$verific$add_39$b21.vhd:99$409 ($add).
Removed top 8 bits (of 9) from port Y of cell b21.$flatten\P1.$verific$add_36$b21.vhd:96$403 ($add).
Removed top 8 bits (of 9) from port A of cell b21.$flatten\P1.$verific$add_36$b21.vhd:96$403 ($add).
Removed top 9 bits (of 13) from port Y of cell b21.$flatten\P1.$verific$add_31$b21.vhd:94$396 ($add).
Removed top 9 bits (of 13) from port A of cell b21.$flatten\P1.$verific$add_31$b21.vhd:94$396 ($add).
Removed top 5 bits (of 8) from port Y of cell b21.$flatten\P1.$verific$add_26$b21.vhd:92$389 ($add).
Removed top 5 bits (of 8) from port A of cell b21.$flatten\P1.$verific$add_26$b21.vhd:92$389 ($add).
Removed top 3 bits (of 5) from port Y of cell b21.$flatten\P1.$verific$add_21$b21.vhd:90$382 ($add).
Removed top 3 bits (of 5) from port A of cell b21.$flatten\P1.$verific$add_21$b21.vhd:90$382 ($add).
Removed top 1 bits (of 33) from port Y of cell b21.$flatten\P1.$verific$unary_minus_15$b21.vhd:88$376 ($neg).
Removed top 1 bits (of 33) from port A of cell b21.$flatten\P1.$verific$unary_minus_15$b21.vhd:88$376 ($neg).
Removed top 1 bits (of 32) from port A of cell b21.$flatten\P1.$verific$LessThan_14$b21.vhd:87$375 ($lt).
Removed top 1 bits (of 6) from port B of cell b21.$auto$fsm_map.cc:77:implement_pattern_cache$1493 ($eq).
Removed top 3 bits (of 29) from FF cell b21.$auto$ff.cc:262:slice$1577 ($adffe).
Removed top 3 bits (of 32) from mux cell b21.$flatten\P2.$verific$mux_697$b21.vhd:1016$1042 ($mux).
Removed top 3 bits (of 32) from mux cell b21.$flatten\P2.$verific$mux_678$b21.vhd:1015$1028 ($mux).
Removed top 1 bits (of 5) from port B of cell b21.$auto$fsm_map.cc:77:implement_pattern_cache$1503 ($eq).
Removed top 3 bits (of 33) from port Y of cell b21.$flatten\P2.$verific$sub_365$b21.vhd:872$984 ($sub).
Removed top 3 bits (of 33) from port A of cell b21.$flatten\P2.$verific$sub_365$b21.vhd:872$984 ($sub).
Removed top 3 bits (of 33) from port B of cell b21.$flatten\P2.$verific$sub_365$b21.vhd:872$984 ($sub).
Removed top 2 bits (of 32) from port Y of cell b21.$flatten\P2.$verific$add_283$b21.vhd:832$982 ($add).
Removed top 2 bits (of 32) from port A of cell b21.$flatten\P2.$verific$add_283$b21.vhd:832$982 ($add).
Removed top 2 bits (of 32) from port B of cell b21.$flatten\P2.$verific$add_283$b21.vhd:832$982 ($add).
Removed top 30 bits (of 32) from port A of cell b21.$flatten\P2.$verific$equal_179$b21.vhd:760$976 ($eq).
Removed top 30 bits (of 32) from port A of cell b21.$flatten\P2.$verific$equal_178$b21.vhd:759$975 ($eq).
Removed top 31 bits (of 32) from port A of cell b21.$flatten\P2.$verific$equal_177$b21.vhd:758$974 ($eq).
Removed top 32 bits (of 33) from port A of cell b21.$flatten\P2.$verific$sub_168$b21.vhd:757$971 ($sub).
Removed top 1 bits (of 33) from port Y of cell b21.$flatten\P2.$verific$sub_168$b21.vhd:757$971 ($sub).
Removed top 1 bits (of 33) from port B of cell b21.$flatten\P2.$verific$sub_168$b21.vhd:757$971 ($sub).
Removed top 30 bits (of 32) from mux cell b21.$flatten\P2.$verific$mux_145$b21.vhd:740$965 ($mux).
Removed top 2 bits (of 3) from port A of cell b21.$flatten\P2.$verific$equal_143$b21.vhd:738$963 ($eq).
Removed top 1 bits (of 3) from port A of cell b21.$flatten\P2.$verific$equal_142$b21.vhd:737$962 ($eq).
Removed top 1 bits (of 3) from port A of cell b21.$flatten\P2.$verific$equal_141$b21.vhd:735$961 ($eq).
Removed top 30 bits (of 32) from mux cell b21.$flatten\P2.$verific$mux_140$b21.vhd:734$960 ($mux).
Removed top 30 bits (of 32) from mux cell b21.$flatten\P2.$verific$mux_138$b21.vhd:730$958 ($mux).
Removed top 2 bits (of 33) from port B of cell b21.$flatten\P2.$verific$sub_84$b21.vhd:663$940 ($sub).
Removed top 1 bits (of 33) from port Y of cell b21.$flatten\P2.$verific$sub_84$b21.vhd:663$940 ($sub).
Removed top 1 bits (of 33) from port A of cell b21.$flatten\P2.$verific$sub_84$b21.vhd:663$940 ($sub).
Removed top 1 bits (of 32) from port B of cell b21.$flatten\P2.$verific$LessThan_83$b21.vhd:662$939 ($lt).
Removed top 12 bits (of 32) from port A of cell b21.$flatten\P2.$verific$add_61$b21.vhd:627$927 ($add).
Removed top 12 bits (of 32) from port Y of cell b21.$flatten\P2.$verific$add_61$b21.vhd:627$927 ($add).
Removed top 12 bits (of 32) from port B of cell b21.$flatten\P2.$verific$add_61$b21.vhd:627$927 ($add).
Removed top 12 bits (of 32) from port A of cell b21.$flatten\P2.$verific$add_56$b21.vhd:624$925 ($add).
Removed top 12 bits (of 32) from port Y of cell b21.$flatten\P2.$verific$add_56$b21.vhd:624$925 ($add).
Removed top 12 bits (of 32) from port B of cell b21.$flatten\P2.$verific$add_56$b21.vhd:624$925 ($add).
Removed top 1 bits (of 3) from port Y of cell b21.$flatten\P2.$verific$add_44$b21.vhd:610$917 ($add).
Removed top 1 bits (of 3) from port A of cell b21.$flatten\P2.$verific$add_44$b21.vhd:610$917 ($add).
Removed top 25 bits (of 26) from port B of cell b21.$flatten\P2.$verific$add_39$b21.vhd:609$913 ($add).
Removed top 8 bits (of 9) from port Y of cell b21.$flatten\P2.$verific$add_36$b21.vhd:606$907 ($add).
Removed top 8 bits (of 9) from port A of cell b21.$flatten\P2.$verific$add_36$b21.vhd:606$907 ($add).
Removed top 9 bits (of 13) from port Y of cell b21.$flatten\P2.$verific$add_31$b21.vhd:604$900 ($add).
Removed top 9 bits (of 13) from port A of cell b21.$flatten\P2.$verific$add_31$b21.vhd:604$900 ($add).
Removed top 5 bits (of 8) from port Y of cell b21.$flatten\P2.$verific$add_26$b21.vhd:602$893 ($add).
Removed top 5 bits (of 8) from port A of cell b21.$flatten\P2.$verific$add_26$b21.vhd:602$893 ($add).
Removed top 3 bits (of 5) from port Y of cell b21.$flatten\P2.$verific$add_21$b21.vhd:600$886 ($add).
Removed top 3 bits (of 5) from port A of cell b21.$flatten\P2.$verific$add_21$b21.vhd:600$886 ($add).
Removed top 1 bits (of 33) from port Y of cell b21.$flatten\P2.$verific$unary_minus_15$b21.vhd:598$880 ($neg).
Removed top 1 bits (of 33) from port A of cell b21.$flatten\P2.$verific$unary_minus_15$b21.vhd:598$880 ($neg).
Removed top 1 bits (of 32) from port A of cell b21.$flatten\P2.$verific$LessThan_14$b21.vhd:597$879 ($lt).
Removed top 3 bits (of 32) from mux cell b21.$flatten\P1.$verific$mux_698$b21.vhd:506$536 ($mux).
Removed top 3 bits (of 32) from mux cell b21.$flatten\P1.$verific$mux_679$b21.vhd:505$522 ($mux).
Removed top 20 bits (of 21) from wire b21.$flatten\P1.$verific$n10477$333.
Removed top 3 bits (of 32) from wire b21.$flatten\P1.$verific$n10755$344.
Removed top 3 bits (of 32) from wire b21.$flatten\P1.$verific$n11178$353.
Removed top 30 bits (of 32) from wire b21.$flatten\P1.$verific$n11472$358.
Removed top 30 bits (of 32) from wire b21.$flatten\P1.$verific$n1407$226.
Removed top 30 bits (of 32) from wire b21.$flatten\P1.$verific$n1441$227.
Removed top 30 bits (of 32) from wire b21.$flatten\P1.$verific$n1478$228.
Removed top 1 bits (of 33) from wire b21.$flatten\P1.$verific$n184$195.
Removed top 1 bits (of 33) from wire b21.$flatten\P1.$verific$n1987$239.
Removed top 3 bits (of 5) from wire b21.$flatten\P1.$verific$n288$198.
Removed top 5 bits (of 8) from wire b21.$flatten\P1.$verific$n301$200.
Removed top 9 bits (of 13) from wire b21.$flatten\P1.$verific$n318$202.
Removed top 8 bits (of 9) from wire b21.$flatten\P1.$verific$n341$204.
Removed top 2 bits (of 32) from wire b21.$flatten\P1.$verific$n4241$272.
Removed top 1 bits (of 3) from wire b21.$flatten\P1.$verific$n436$208.
Removed top 3 bits (of 33) from wire b21.$flatten\P1.$verific$n5666$286.
Removed top 1 bits (of 32) from wire b21.$flatten\P1.$verific$n862$221.
Removed top 1 bits (of 33) from wire b21.$flatten\P1.$verific$n933$223.
Removed top 1 bits (of 21) from wire b21.$flatten\P2.$verific$n10477$838.
Removed top 3 bits (of 32) from wire b21.$flatten\P2.$verific$n10762$848.
Removed top 3 bits (of 32) from wire b21.$flatten\P2.$verific$n11185$857.
Removed top 30 bits (of 32) from wire b21.$flatten\P2.$verific$n11479$862.
Removed top 30 bits (of 32) from wire b21.$flatten\P2.$verific$n1407$729.
Removed top 30 bits (of 32) from wire b21.$flatten\P2.$verific$n1441$730.
Removed top 30 bits (of 32) from wire b21.$flatten\P2.$verific$n1478$731.
Removed top 1 bits (of 33) from wire b21.$flatten\P2.$verific$n184$698.
Removed top 1 bits (of 33) from wire b21.$flatten\P2.$verific$n1987$742.
Removed top 8 bits (of 32) from wire b21.$flatten\P2.$verific$n2260$744.
Removed top 8 bits (of 32) from wire b21.$flatten\P2.$verific$n2293$745.
Removed top 2 bits (of 32) from wire b21.$flatten\P2.$verific$n4241$775.
Removed top 1 bits (of 3) from wire b21.$flatten\P2.$verific$n436$711.
Removed top 13 bits (of 32) from wire b21.$flatten\P2.$verific$n4511$777.
Removed top 3 bits (of 33) from wire b21.$flatten\P2.$verific$n5666$789.
Removed top 1 bits (of 32) from wire b21.$flatten\P2.$verific$n862$724.
Removed top 1 bits (of 33) from wire b21.$flatten\P2.$verific$n933$726.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 20 unused cells and 121 unused wires.
<suppressed ~21 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module b21:
  creating $macc model for $flatten\P1.$verific$add_21$b21.vhd:90$382 ($add).
  creating $macc model for $flatten\P1.$verific$add_26$b21.vhd:92$389 ($add).
  creating $macc model for $flatten\P1.$verific$add_283$b21.vhd:322$478 ($add).
  creating $macc model for $flatten\P1.$verific$add_31$b21.vhd:94$396 ($add).
  creating $macc model for $flatten\P1.$verific$add_36$b21.vhd:96$403 ($add).
  creating $macc model for $flatten\P1.$verific$add_39$b21.vhd:99$409 ($add).
  creating $macc model for $flatten\P1.$verific$add_44$b21.vhd:100$413 ($add).
  creating $macc model for $flatten\P1.$verific$add_56$b21.vhd:114$421 ($add).
  creating $macc model for $flatten\P1.$verific$add_570$b21.vhd:470$485 ($add).
  creating $macc model for $flatten\P1.$verific$add_61$b21.vhd:117$423 ($add).
  creating $macc model for $flatten\P1.$verific$add_662$b21.vhd:497$505 ($add).
  creating $macc model for $flatten\P1.$verific$add_664$b21.vhd:498$507 ($add).
  creating $macc model for $flatten\P1.$verific$mult_667$b21.vhd:501$511 ($mul).
  creating $macc model for $flatten\P1.$verific$sub_168$b21.vhd:247$467 ($sub).
  creating $macc model for $flatten\P1.$verific$sub_365$b21.vhd:362$480 ($sub).
  creating $macc model for $flatten\P1.$verific$sub_84$b21.vhd:153$436 ($sub).
  creating $macc model for $flatten\P1.$verific$unary_minus_15$b21.vhd:88$376 ($neg).
  creating $macc model for $flatten\P2.$verific$add_21$b21.vhd:600$886 ($add).
  creating $macc model for $flatten\P2.$verific$add_26$b21.vhd:602$893 ($add).
  creating $macc model for $flatten\P2.$verific$add_283$b21.vhd:832$982 ($add).
  creating $macc model for $flatten\P2.$verific$add_31$b21.vhd:604$900 ($add).
  creating $macc model for $flatten\P2.$verific$add_36$b21.vhd:606$907 ($add).
  creating $macc model for $flatten\P2.$verific$add_39$b21.vhd:609$913 ($add).
  creating $macc model for $flatten\P2.$verific$add_44$b21.vhd:610$917 ($add).
  creating $macc model for $flatten\P2.$verific$add_56$b21.vhd:624$925 ($add).
  creating $macc model for $flatten\P2.$verific$add_570$b21.vhd:980$989 ($add).
  creating $macc model for $flatten\P2.$verific$add_61$b21.vhd:627$927 ($add).
  creating $macc model for $flatten\P2.$verific$add_662$b21.vhd:1007$1010 ($add).
  creating $macc model for $flatten\P2.$verific$add_664$b21.vhd:1008$1013 ($add).
  creating $macc model for $flatten\P2.$verific$sub_168$b21.vhd:757$971 ($sub).
  creating $macc model for $flatten\P2.$verific$sub_365$b21.vhd:872$984 ($sub).
  creating $macc model for $flatten\P2.$verific$sub_84$b21.vhd:663$940 ($sub).
  creating $macc model for $flatten\P2.$verific$unary_minus_15$b21.vhd:598$880 ($neg).
  creating $macc model for $verific$add_24$b21.vhd:1081$58 ($add).
  creating $macc model for $verific$add_3$b21.vhd:1071$40 ($add).
  creating $macc model for $verific$add_30$b21.vhd:1085$60 ($add).
  creating $alu model for $macc $verific$add_30$b21.vhd:1085$60.
  creating $alu model for $macc $verific$add_3$b21.vhd:1071$40.
  creating $alu model for $macc $verific$add_24$b21.vhd:1081$58.
  creating $alu model for $macc $flatten\P2.$verific$unary_minus_15$b21.vhd:598$880.
  creating $alu model for $macc $flatten\P2.$verific$sub_84$b21.vhd:663$940.
  creating $alu model for $macc $flatten\P2.$verific$sub_365$b21.vhd:872$984.
  creating $alu model for $macc $flatten\P2.$verific$sub_168$b21.vhd:757$971.
  creating $alu model for $macc $flatten\P2.$verific$add_664$b21.vhd:1008$1013.
  creating $alu model for $macc $flatten\P2.$verific$add_662$b21.vhd:1007$1010.
  creating $alu model for $macc $flatten\P2.$verific$add_61$b21.vhd:627$927.
  creating $alu model for $macc $flatten\P2.$verific$add_570$b21.vhd:980$989.
  creating $alu model for $macc $flatten\P2.$verific$add_56$b21.vhd:624$925.
  creating $alu model for $macc $flatten\P2.$verific$add_44$b21.vhd:610$917.
  creating $alu model for $macc $flatten\P2.$verific$add_39$b21.vhd:609$913.
  creating $alu model for $macc $flatten\P2.$verific$add_36$b21.vhd:606$907.
  creating $alu model for $macc $flatten\P2.$verific$add_31$b21.vhd:604$900.
  creating $alu model for $macc $flatten\P2.$verific$add_283$b21.vhd:832$982.
  creating $alu model for $macc $flatten\P2.$verific$add_26$b21.vhd:602$893.
  creating $alu model for $macc $flatten\P2.$verific$add_21$b21.vhd:600$886.
  creating $alu model for $macc $flatten\P1.$verific$unary_minus_15$b21.vhd:88$376.
  creating $alu model for $macc $flatten\P1.$verific$sub_84$b21.vhd:153$436.
  creating $alu model for $macc $flatten\P1.$verific$sub_365$b21.vhd:362$480.
  creating $alu model for $macc $flatten\P1.$verific$sub_168$b21.vhd:247$467.
  creating $alu model for $macc $flatten\P1.$verific$add_664$b21.vhd:498$507.
  creating $alu model for $macc $flatten\P1.$verific$add_662$b21.vhd:497$505.
  creating $alu model for $macc $flatten\P1.$verific$add_61$b21.vhd:117$423.
  creating $alu model for $macc $flatten\P1.$verific$add_570$b21.vhd:470$485.
  creating $alu model for $macc $flatten\P1.$verific$add_56$b21.vhd:114$421.
  creating $alu model for $macc $flatten\P1.$verific$add_44$b21.vhd:100$413.
  creating $alu model for $macc $flatten\P1.$verific$add_39$b21.vhd:99$409.
  creating $alu model for $macc $flatten\P1.$verific$add_36$b21.vhd:96$403.
  creating $alu model for $macc $flatten\P1.$verific$add_31$b21.vhd:94$396.
  creating $alu model for $macc $flatten\P1.$verific$add_283$b21.vhd:322$478.
  creating $alu model for $macc $flatten\P1.$verific$add_26$b21.vhd:92$389.
  creating $alu model for $macc $flatten\P1.$verific$add_21$b21.vhd:90$382.
  creating $macc cell for $flatten\P1.$verific$mult_667$b21.vhd:501$511: $auto$alumacc.cc:365:replace_macc$1734
  creating $alu model for $flatten\P1.$verific$LessThan_14$b21.vhd:87$375 ($lt): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_68$b21.vhd:122$429 ($lt): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_78$b21.vhd:142$433 ($lt): merged with $flatten\P1.$verific$LessThan_68$b21.vhd:122$429.
  creating $alu model for $flatten\P1.$verific$LessThan_83$b21.vhd:152$435 ($lt): new $alu
  creating $alu model for $flatten\P1.$verific$LessThan_87$b21.vhd:155$440 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_14$b21.vhd:597$879 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_68$b21.vhd:632$933 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_78$b21.vhd:652$937 ($lt): merged with $flatten\P2.$verific$LessThan_68$b21.vhd:632$933.
  creating $alu model for $flatten\P2.$verific$LessThan_83$b21.vhd:662$939 ($lt): new $alu
  creating $alu model for $flatten\P2.$verific$LessThan_87$b21.vhd:665$944 ($lt): new $alu
  creating $alu model for $verific$LessThan_11$b21.vhd:1079$48 ($lt): new $alu
  creating $alu model for $verific$LessThan_12$b21.vhd:1079$49 ($lt): new $alu
  creating $alu model for $verific$LessThan_16$b21.vhd:1080$53 ($lt): new $alu
  creating $alu model for $verific$LessThan_17$b21.vhd:1080$54 ($lt): new $alu
  creating $alu cell for $verific$LessThan_17$b21.vhd:1080$54: $auto$alumacc.cc:485:replace_alu$1747
  creating $alu cell for $verific$LessThan_16$b21.vhd:1080$53: $auto$alumacc.cc:485:replace_alu$1752
  creating $alu cell for $verific$LessThan_12$b21.vhd:1079$49: $auto$alumacc.cc:485:replace_alu$1757
  creating $alu cell for $verific$LessThan_11$b21.vhd:1079$48: $auto$alumacc.cc:485:replace_alu$1762
  creating $alu cell for $flatten\P2.$verific$LessThan_87$b21.vhd:665$944: $auto$alumacc.cc:485:replace_alu$1767
  creating $alu cell for $flatten\P2.$verific$LessThan_83$b21.vhd:662$939: $auto$alumacc.cc:485:replace_alu$1772
  creating $alu cell for $flatten\P2.$verific$LessThan_68$b21.vhd:632$933, $flatten\P2.$verific$LessThan_78$b21.vhd:652$937: $auto$alumacc.cc:485:replace_alu$1783
  creating $alu cell for $flatten\P2.$verific$LessThan_14$b21.vhd:597$879: $auto$alumacc.cc:485:replace_alu$1794
  creating $alu cell for $flatten\P1.$verific$LessThan_87$b21.vhd:155$440: $auto$alumacc.cc:485:replace_alu$1799
  creating $alu cell for $flatten\P1.$verific$LessThan_83$b21.vhd:152$435: $auto$alumacc.cc:485:replace_alu$1804
  creating $alu cell for $flatten\P1.$verific$LessThan_68$b21.vhd:122$429, $flatten\P1.$verific$LessThan_78$b21.vhd:142$433: $auto$alumacc.cc:485:replace_alu$1815
  creating $alu cell for $flatten\P1.$verific$LessThan_14$b21.vhd:87$375: $auto$alumacc.cc:485:replace_alu$1826
  creating $alu cell for $flatten\P1.$verific$add_21$b21.vhd:90$382: $auto$alumacc.cc:485:replace_alu$1831
  creating $alu cell for $flatten\P1.$verific$add_26$b21.vhd:92$389: $auto$alumacc.cc:485:replace_alu$1834
  creating $alu cell for $flatten\P1.$verific$add_283$b21.vhd:322$478: $auto$alumacc.cc:485:replace_alu$1837
  creating $alu cell for $flatten\P1.$verific$add_31$b21.vhd:94$396: $auto$alumacc.cc:485:replace_alu$1840
  creating $alu cell for $flatten\P1.$verific$add_36$b21.vhd:96$403: $auto$alumacc.cc:485:replace_alu$1843
  creating $alu cell for $flatten\P1.$verific$add_39$b21.vhd:99$409: $auto$alumacc.cc:485:replace_alu$1846
  creating $alu cell for $flatten\P1.$verific$add_44$b21.vhd:100$413: $auto$alumacc.cc:485:replace_alu$1849
  creating $alu cell for $flatten\P1.$verific$add_570$b21.vhd:470$485: $auto$alumacc.cc:485:replace_alu$1852
  creating $alu cell for $flatten\P1.$verific$add_56$b21.vhd:114$421: $auto$alumacc.cc:485:replace_alu$1855
  creating $alu cell for $flatten\P1.$verific$add_662$b21.vhd:497$505: $auto$alumacc.cc:485:replace_alu$1858
  creating $alu cell for $flatten\P1.$verific$add_61$b21.vhd:117$423: $auto$alumacc.cc:485:replace_alu$1861
  creating $alu cell for $flatten\P1.$verific$add_664$b21.vhd:498$507: $auto$alumacc.cc:485:replace_alu$1864
  creating $alu cell for $flatten\P1.$verific$sub_168$b21.vhd:247$467: $auto$alumacc.cc:485:replace_alu$1867
  creating $alu cell for $flatten\P1.$verific$sub_365$b21.vhd:362$480: $auto$alumacc.cc:485:replace_alu$1870
  creating $alu cell for $flatten\P1.$verific$sub_84$b21.vhd:153$436: $auto$alumacc.cc:485:replace_alu$1873
  creating $alu cell for $flatten\P1.$verific$unary_minus_15$b21.vhd:88$376: $auto$alumacc.cc:485:replace_alu$1876
  creating $alu cell for $flatten\P2.$verific$add_21$b21.vhd:600$886: $auto$alumacc.cc:485:replace_alu$1879
  creating $alu cell for $flatten\P2.$verific$add_26$b21.vhd:602$893: $auto$alumacc.cc:485:replace_alu$1882
  creating $alu cell for $flatten\P2.$verific$add_283$b21.vhd:832$982: $auto$alumacc.cc:485:replace_alu$1885
  creating $alu cell for $flatten\P2.$verific$add_31$b21.vhd:604$900: $auto$alumacc.cc:485:replace_alu$1888
  creating $alu cell for $flatten\P2.$verific$add_36$b21.vhd:606$907: $auto$alumacc.cc:485:replace_alu$1891
  creating $alu cell for $flatten\P2.$verific$add_39$b21.vhd:609$913: $auto$alumacc.cc:485:replace_alu$1894
  creating $alu cell for $flatten\P2.$verific$add_44$b21.vhd:610$917: $auto$alumacc.cc:485:replace_alu$1897
  creating $alu cell for $flatten\P2.$verific$add_570$b21.vhd:980$989: $auto$alumacc.cc:485:replace_alu$1900
  creating $alu cell for $flatten\P2.$verific$add_56$b21.vhd:624$925: $auto$alumacc.cc:485:replace_alu$1903
  creating $alu cell for $flatten\P2.$verific$add_662$b21.vhd:1007$1010: $auto$alumacc.cc:485:replace_alu$1906
  creating $alu cell for $flatten\P2.$verific$add_61$b21.vhd:627$927: $auto$alumacc.cc:485:replace_alu$1909
  creating $alu cell for $flatten\P2.$verific$add_664$b21.vhd:1008$1013: $auto$alumacc.cc:485:replace_alu$1912
  creating $alu cell for $flatten\P2.$verific$sub_168$b21.vhd:757$971: $auto$alumacc.cc:485:replace_alu$1915
  creating $alu cell for $flatten\P2.$verific$sub_365$b21.vhd:872$984: $auto$alumacc.cc:485:replace_alu$1918
  creating $alu cell for $flatten\P2.$verific$sub_84$b21.vhd:663$940: $auto$alumacc.cc:485:replace_alu$1921
  creating $alu cell for $flatten\P2.$verific$unary_minus_15$b21.vhd:598$880: $auto$alumacc.cc:485:replace_alu$1924
  creating $alu cell for $verific$add_24$b21.vhd:1081$58: $auto$alumacc.cc:485:replace_alu$1927
  creating $alu cell for $verific$add_3$b21.vhd:1071$40: $auto$alumacc.cc:485:replace_alu$1930
  creating $alu cell for $verific$add_30$b21.vhd:1085$60: $auto$alumacc.cc:485:replace_alu$1933
  created 47 $alu and 1 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~10 debug messages>

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~32 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 4 unused cells and 24 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~32 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== b21 ===

   Number of wires:                539
   Number of wire bits:           9123
   Number of public wires:          46
   Number of public wire bits:     732
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                400
     $adff                          14
     $adffe                         14
     $alu                           47
     $and                           68
     $bmux                          32
     $eq                            50
     $logic_not                      4
     $macc                           1
     $mux                           74
     $ne                             2
     $not                           25
     $or                            23
     $reduce_and                    10
     $reduce_or                     34
     $xor                            2


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.21.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..

yosys> memory_share

3.21.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..

yosys> memory_collect

3.21.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== b21 ===

   Number of wires:                539
   Number of wire bits:           9123
   Number of public wires:          46
   Number of public wire bits:     732
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                400
     $adff                          14
     $adffe                         14
     $alu                           47
     $and                           68
     $bmux                          32
     $eq                            50
     $logic_not                      4
     $macc                           1
     $mux                           74
     $ne                             2
     $not                           25
     $or                            23
     $reduce_and                    10
     $reduce_or                     34
     $xor                            2


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..

yosys> stat

3.24. Printing statistics.

=== b21 ===

   Number of wires:                539
   Number of wire bits:           9123
   Number of public wires:          46
   Number of public wire bits:     732
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                400
     $adff                          14
     $adffe                         14
     $alu                           47
     $and                           68
     $bmux                          32
     $eq                            50
     $logic_not                      4
     $macc                           1
     $mux                           74
     $ne                             2
     $not                           25
     $or                            23
     $reduce_and                    10
     $reduce_or                     34
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $reduce_or.
Using template $paramod$be80489e44a49c29884f59fd81c31ed03229cfc1\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $xor.
Using template $paramod$79fc87901d7fd8aaad689b5406671422f5fa25b9\_80_rs_alu for cells of type $alu.
Using template $paramod$6fc37af1c109ae54e8aed83fcd995c12d378ce93\_90_alu for cells of type $alu.
Using template $paramod$51c80ded93a30cabdd6a720b4f0ed1d8c51829dd\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $or.
Using template $paramod$43e6bdbb0e8a6b23dfd3962c0280737d54f8e2be\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $ne.
Using extmapper maccmap for cells of type $macc.
  add 3'101 * $auto$wreduce.cc:454:run$1611 [0] (3x1 bits, unsigned)
Using extmapper simplemap for cells of type $bmux.
Using template $paramod$6a42b6fefed750f8a1c58eab59479d960557103c\_90_alu for cells of type $alu.
Using template $paramod$c32aaa9fd758c6ea2b382f4327253b21b576e597\_90_alu for cells of type $alu.
Using template $paramod$6bf3afcadde450e76c699a4da1838452ccdf24c7\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $logic_not.
Using template $paramod$83fc07d9557d32477a9ece9e4e82efd3bbe82ab8\_80_rs_alu for cells of type $alu.
Using template $paramod$e891e6b399cf52748460a311fafe476815d24bd7\_90_alu for cells of type $alu.
Using template $paramod$63a3f1ffa662be02d3403b533885c56d18ebe02a\_80_rs_alu for cells of type $alu.
Using template $paramod$8027eda61d95ddd4d4dd7b5cb21f3830552ebe4e\_80_rs_alu for cells of type $alu.
Using template $paramod$ee932b0f27f4b110ee21c85da6e79a9925243db9\_80_rs_alu for cells of type $alu.
Using template $paramod$175e67c02b86e96b1288b9dc100122520d7240d8\_90_alu for cells of type $alu.
Using template $paramod$83784888def4f70dbbded37c6d05d2ea1157c936\_90_alu for cells of type $alu.
/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v:80: Warning: Range [-1:-1] select out of bounds on signal `\C': Setting 1 LSB bits to undef.
/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v:88: Warning: Range [-1:-1] select out of bounds on signal `\Y': Setting 1 LSB bits to undef.
/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v:88: Warning: Range [-1:-1] select out of bounds on signal `\S': Setting 1 LSB bits to undef.
/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v:88: Warning: Ignoring assignment to constant bits:
    old assignment: 1'x = $xor$/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v:88$9280_Y
    new assignment: { } = { }.
/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v:89: Warning: Range [-1:-1] select out of bounds on signal `\S': Setting 1 LSB bits to undef.
/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v:89: Warning: Range [-1:-1] select out of bounds on signal `\AA': Setting 1 LSB bits to undef.
Using template $paramod$fc972a7a46956c1788f3cb5257b53c8f1df2d0cc\_90_alu for cells of type $alu.
Using template $paramod$9e7011427f22271c0942bd67000ef26931352ace\_80_rs_alu for cells of type $alu.
Using template $paramod$172f2253883621b746ed3e405a5e271c8c312010\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010100 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011011 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000001 for cells of type $lcu.
No more expansions possible.
<suppressed ~4320 debug messages>

yosys> stat

3.26. Printing statistics.

=== b21 ===

   Number of wires:               3428
   Number of wire bits:          57106
   Number of public wires:          46
   Number of public wire bits:     732
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              18812
     $_AND_                       1610
     $_DFFE_PP0P_                  316
     $_DFF_PP0_                    118
     $_MUX_                      11534
     $_NOT_                       1115
     $_OR_                        1531
     $_XOR_                       1952
     adder_carry                   636


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~7134 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
<suppressed ~9408 debug messages>
Removed a total of 3136 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$10386 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [19], Q = \P2.addr [19]).
Adding EN signal on $auto$ff.cc:262:slice$4776 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [19], Q = \P1.addr [19]).
Adding EN signal on $auto$ff.cc:262:slice$4754 ($_DFFE_PP0P_) from module b21 (D = $flatten\P1.$verific$n10979$183, Q = \P1.B).
Adding EN signal on $auto$ff.cc:262:slice$10364 ($_DFFE_PP0P_) from module b21 (D = $flatten\P2.$verific$n10986$686, Q = \P2.B).
Adding EN signal on $auto$ff.cc:262:slice$4757 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [0], Q = \P1.addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$4758 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [1], Q = \P1.addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$4759 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [2], Q = \P1.addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$4760 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [3], Q = \P1.addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$4761 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [4], Q = \P1.addr [4]).
Adding EN signal on $auto$ff.cc:262:slice$4762 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [5], Q = \P1.addr [5]).
Adding EN signal on $auto$ff.cc:262:slice$4763 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [6], Q = \P1.addr [6]).
Adding EN signal on $auto$ff.cc:262:slice$4764 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [7], Q = \P1.addr [7]).
Adding EN signal on $auto$ff.cc:262:slice$4765 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [8], Q = \P1.addr [8]).
Adding EN signal on $auto$ff.cc:262:slice$4766 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [9], Q = \P1.addr [9]).
Adding EN signal on $auto$ff.cc:262:slice$4767 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [10], Q = \P1.addr [10]).
Adding EN signal on $auto$ff.cc:262:slice$4768 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [11], Q = \P1.addr [11]).
Adding EN signal on $auto$ff.cc:262:slice$4769 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [12], Q = \P1.addr [12]).
Adding EN signal on $auto$ff.cc:262:slice$4770 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [13], Q = \P1.addr [13]).
Adding EN signal on $auto$ff.cc:262:slice$4771 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [14], Q = \P1.addr [14]).
Adding EN signal on $auto$ff.cc:262:slice$4772 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [15], Q = \P1.addr [15]).
Adding EN signal on $auto$ff.cc:262:slice$4773 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [16], Q = \P1.addr [16]).
Adding EN signal on $auto$ff.cc:262:slice$4774 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [17], Q = \P1.addr [17]).
Adding EN signal on $auto$ff.cc:262:slice$4775 ($_DFF_PP0_) from module b21 (D = $flatten\P1.$verific$n11246$355 [18], Q = \P1.addr [18]).
Adding EN signal on $auto$ff.cc:262:slice$10367 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [0], Q = \P2.addr [0]).
Adding EN signal on $auto$ff.cc:262:slice$10368 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [1], Q = \P2.addr [1]).
Adding EN signal on $auto$ff.cc:262:slice$10369 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [2], Q = \P2.addr [2]).
Adding EN signal on $auto$ff.cc:262:slice$10370 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [3], Q = \P2.addr [3]).
Adding EN signal on $auto$ff.cc:262:slice$10371 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [4], Q = \P2.addr [4]).
Adding EN signal on $auto$ff.cc:262:slice$10372 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [5], Q = \P2.addr [5]).
Adding EN signal on $auto$ff.cc:262:slice$10373 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [6], Q = \P2.addr [6]).
Adding EN signal on $auto$ff.cc:262:slice$10374 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [7], Q = \P2.addr [7]).
Adding EN signal on $auto$ff.cc:262:slice$10375 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [8], Q = \P2.addr [8]).
Adding EN signal on $auto$ff.cc:262:slice$10376 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [9], Q = \P2.addr [9]).
Adding EN signal on $auto$ff.cc:262:slice$10377 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [10], Q = \P2.addr [10]).
Adding EN signal on $auto$ff.cc:262:slice$10378 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [11], Q = \P2.addr [11]).
Adding EN signal on $auto$ff.cc:262:slice$10379 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [12], Q = \P2.addr [12]).
Adding EN signal on $auto$ff.cc:262:slice$10380 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [13], Q = \P2.addr [13]).
Adding EN signal on $auto$ff.cc:262:slice$10381 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [14], Q = \P2.addr [14]).
Adding EN signal on $auto$ff.cc:262:slice$10382 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [15], Q = \P2.addr [15]).
Adding EN signal on $auto$ff.cc:262:slice$10383 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [16], Q = \P2.addr [16]).
Adding EN signal on $auto$ff.cc:262:slice$10384 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [17], Q = \P2.addr [17]).
Adding EN signal on $auto$ff.cc:262:slice$10385 ($_DFF_PP0_) from module b21 (D = $flatten\P2.$verific$n11253$859 [18], Q = \P2.addr [18]).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 865 unused cells and 2448 unused wires.
<suppressed ~866 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~660 debug messages>

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
<suppressed ~1059 debug messages>
Removed a total of 353 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$10408 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [21], Q = \P2.reg2 [21]).
Adding EN signal on $auto$ff.cc:262:slice$10407 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [20], Q = \P2.reg2 [20]).
Adding EN signal on $auto$ff.cc:262:slice$10406 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [19], Q = \P2.reg2 [19]).
Adding EN signal on $auto$ff.cc:262:slice$10405 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [18], Q = \P2.reg2 [18]).
Adding EN signal on $auto$ff.cc:262:slice$10404 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [17], Q = \P2.reg2 [17]).
Adding EN signal on $auto$ff.cc:262:slice$10403 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [16], Q = \P2.reg2 [16]).
Adding EN signal on $auto$ff.cc:262:slice$10402 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [15], Q = \P2.reg2 [15]).
Adding EN signal on $auto$ff.cc:262:slice$10401 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [14], Q = \P2.reg2 [14]).
Adding EN signal on $auto$ff.cc:262:slice$10400 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [13], Q = \P2.reg2 [13]).
Adding EN signal on $auto$ff.cc:262:slice$10399 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [12], Q = \P2.reg2 [12]).
Adding EN signal on $auto$ff.cc:262:slice$10398 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [11], Q = \P2.reg2 [11]).
Adding EN signal on $auto$ff.cc:262:slice$10397 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [10], Q = \P2.reg2 [10]).
Adding EN signal on $auto$ff.cc:262:slice$10396 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [9], Q = \P2.reg2 [9]).
Adding EN signal on $auto$ff.cc:262:slice$10395 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [8], Q = \P2.reg2 [8]).
Adding EN signal on $auto$ff.cc:262:slice$10394 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [7], Q = \P2.reg2 [7]).
Adding EN signal on $auto$ff.cc:262:slice$10393 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [6], Q = \P2.reg2 [6]).
Adding EN signal on $auto$ff.cc:262:slice$10392 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [5], Q = \P2.reg2 [5]).
Adding EN signal on $auto$ff.cc:262:slice$10391 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [4], Q = \P2.reg2 [4]).
Adding EN signal on $auto$ff.cc:262:slice$10390 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [3], Q = \P2.reg2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$10389 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [2], Q = \P2.reg2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$10388 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [1], Q = \P2.reg2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$10387 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [0], Q = \P2.reg2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$14942 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12036 [2], Q = \P2.reg3 [2]).
Adding EN signal on $auto$ff.cc:262:slice$14941 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12036 [1], Q = \P2.reg3 [1]).
Adding EN signal on $auto$ff.cc:262:slice$14940 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12036 [0], Q = \P2.reg3 [0]).
Adding EN signal on $auto$ff.cc:262:slice$10517 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$5810 [2], Q = \P1.reg3 [2]).
Adding EN signal on $auto$ff.cc:262:slice$10516 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$5810 [1], Q = \P1.reg3 [1]).
Adding EN signal on $auto$ff.cc:262:slice$10515 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$5810 [0], Q = \P1.reg3 [0]).
Adding EN signal on $auto$ff.cc:262:slice$10482 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [31], Q = \P2.reg0 [31]).
Adding EN signal on $auto$ff.cc:262:slice$10481 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [30], Q = \P2.reg0 [30]).
Adding EN signal on $auto$ff.cc:262:slice$10480 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [29], Q = \P2.reg0 [29]).
Adding EN signal on $auto$ff.cc:262:slice$10479 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [28], Q = \P2.reg0 [28]).
Adding EN signal on $auto$ff.cc:262:slice$10478 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [27], Q = \P2.reg0 [27]).
Adding EN signal on $auto$ff.cc:262:slice$10477 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [26], Q = \P2.reg0 [26]).
Adding EN signal on $auto$ff.cc:262:slice$10476 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [25], Q = \P2.reg0 [25]).
Adding EN signal on $auto$ff.cc:262:slice$10475 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [24], Q = \P2.reg0 [24]).
Adding EN signal on $auto$ff.cc:262:slice$10474 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [23], Q = \P2.reg0 [23]).
Adding EN signal on $auto$ff.cc:262:slice$10473 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [22], Q = \P2.reg0 [22]).
Adding EN signal on $auto$ff.cc:262:slice$10472 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [21], Q = \P2.reg0 [21]).
Adding EN signal on $auto$ff.cc:262:slice$10471 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [20], Q = \P2.reg0 [20]).
Adding EN signal on $auto$ff.cc:262:slice$10470 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [19], Q = \P2.reg0 [19]).
Adding EN signal on $auto$ff.cc:262:slice$10469 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [18], Q = \P2.reg0 [18]).
Adding EN signal on $auto$ff.cc:262:slice$10468 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [17], Q = \P2.reg0 [17]).
Adding EN signal on $auto$ff.cc:262:slice$10467 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [16], Q = \P2.reg0 [16]).
Adding EN signal on $auto$ff.cc:262:slice$10466 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [15], Q = \P2.reg0 [15]).
Adding EN signal on $auto$ff.cc:262:slice$10465 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [14], Q = \P2.reg0 [14]).
Adding EN signal on $auto$ff.cc:262:slice$10464 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [13], Q = \P2.reg0 [13]).
Adding EN signal on $auto$ff.cc:262:slice$10463 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [12], Q = \P2.reg0 [12]).
Adding EN signal on $auto$ff.cc:262:slice$10462 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [11], Q = \P2.reg0 [11]).
Adding EN signal on $auto$ff.cc:262:slice$10461 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [10], Q = \P2.reg0 [10]).
Adding EN signal on $auto$ff.cc:262:slice$10460 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [9], Q = \P2.reg0 [9]).
Adding EN signal on $auto$ff.cc:262:slice$10459 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [8], Q = \P2.reg0 [8]).
Adding EN signal on $auto$ff.cc:262:slice$10458 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [7], Q = \P2.reg0 [7]).
Adding EN signal on $auto$ff.cc:262:slice$10457 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [6], Q = \P2.reg0 [6]).
Adding EN signal on $auto$ff.cc:262:slice$10456 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [5], Q = \P2.reg0 [5]).
Adding EN signal on $auto$ff.cc:262:slice$10455 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [4], Q = \P2.reg0 [4]).
Adding EN signal on $auto$ff.cc:262:slice$10454 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [3], Q = \P2.reg0 [3]).
Adding EN signal on $auto$ff.cc:262:slice$10453 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [2], Q = \P2.reg0 [2]).
Adding EN signal on $auto$ff.cc:262:slice$10452 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [1], Q = \P2.reg0 [1]).
Adding EN signal on $auto$ff.cc:262:slice$10451 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [0], Q = \P2.reg0 [0]).
Adding EN signal on $auto$ff.cc:262:slice$10450 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [31], Q = \P2.reg1 [31]).
Adding EN signal on $auto$ff.cc:262:slice$10449 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [30], Q = \P2.reg1 [30]).
Adding EN signal on $auto$ff.cc:262:slice$10448 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [29], Q = \P2.reg1 [29]).
Adding EN signal on $auto$ff.cc:262:slice$10447 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [28], Q = \P2.reg1 [28]).
Adding EN signal on $auto$ff.cc:262:slice$10446 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [27], Q = \P2.reg1 [27]).
Adding EN signal on $auto$ff.cc:262:slice$10445 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [26], Q = \P2.reg1 [26]).
Adding EN signal on $auto$ff.cc:262:slice$10444 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [25], Q = \P2.reg1 [25]).
Adding EN signal on $auto$ff.cc:262:slice$10443 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [24], Q = \P2.reg1 [24]).
Adding EN signal on $auto$ff.cc:262:slice$10442 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [23], Q = \P2.reg1 [23]).
Adding EN signal on $auto$ff.cc:262:slice$10441 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [22], Q = \P2.reg1 [22]).
Adding EN signal on $auto$ff.cc:262:slice$10440 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [21], Q = \P2.reg1 [21]).
Adding EN signal on $auto$ff.cc:262:slice$10439 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [20], Q = \P2.reg1 [20]).
Adding EN signal on $auto$ff.cc:262:slice$10438 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [19], Q = \P2.reg1 [19]).
Adding EN signal on $auto$ff.cc:262:slice$10437 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [18], Q = \P2.reg1 [18]).
Adding EN signal on $auto$ff.cc:262:slice$10436 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [17], Q = \P2.reg1 [17]).
Adding EN signal on $auto$ff.cc:262:slice$10435 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [16], Q = \P2.reg1 [16]).
Adding EN signal on $auto$ff.cc:262:slice$10434 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [15], Q = \P2.reg1 [15]).
Adding EN signal on $auto$ff.cc:262:slice$10433 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [14], Q = \P2.reg1 [14]).
Adding EN signal on $auto$ff.cc:262:slice$10432 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [13], Q = \P2.reg1 [13]).
Adding EN signal on $auto$ff.cc:262:slice$10431 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [12], Q = \P2.reg1 [12]).
Adding EN signal on $auto$ff.cc:262:slice$10430 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [11], Q = \P2.reg1 [11]).
Adding EN signal on $auto$ff.cc:262:slice$10429 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [10], Q = \P2.reg1 [10]).
Adding EN signal on $auto$ff.cc:262:slice$10428 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [9], Q = \P2.reg1 [9]).
Adding EN signal on $auto$ff.cc:262:slice$10427 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [8], Q = \P2.reg1 [8]).
Adding EN signal on $auto$ff.cc:262:slice$10426 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [7], Q = \P2.reg1 [7]).
Adding EN signal on $auto$ff.cc:262:slice$10425 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [6], Q = \P2.reg1 [6]).
Adding EN signal on $auto$ff.cc:262:slice$10424 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [5], Q = \P2.reg1 [5]).
Adding EN signal on $auto$ff.cc:262:slice$10423 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [4], Q = \P2.reg1 [4]).
Adding EN signal on $auto$ff.cc:262:slice$10422 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [3], Q = \P2.reg1 [3]).
Adding EN signal on $auto$ff.cc:262:slice$10421 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [2], Q = \P2.reg1 [2]).
Adding EN signal on $auto$ff.cc:262:slice$10420 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [1], Q = \P2.reg1 [1]).
Adding EN signal on $auto$ff.cc:262:slice$10419 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [0], Q = \P2.reg1 [0]).
Adding EN signal on $auto$ff.cc:262:slice$10418 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [31], Q = \P2.reg2 [31]).
Adding EN signal on $auto$ff.cc:262:slice$10417 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [30], Q = \P2.reg2 [30]).
Adding EN signal on $auto$ff.cc:262:slice$10416 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [29], Q = \P2.reg2 [29]).
Adding EN signal on $auto$ff.cc:262:slice$10415 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [28], Q = \P2.reg2 [28]).
Adding EN signal on $auto$ff.cc:262:slice$10414 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [27], Q = \P2.reg2 [27]).
Adding EN signal on $auto$ff.cc:262:slice$10413 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [26], Q = \P2.reg2 [26]).
Adding EN signal on $auto$ff.cc:262:slice$10412 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [25], Q = \P2.reg2 [25]).
Adding EN signal on $auto$ff.cc:262:slice$10411 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [24], Q = \P2.reg2 [24]).
Adding EN signal on $auto$ff.cc:262:slice$10410 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [23], Q = \P2.reg2 [23]).
Adding EN signal on $auto$ff.cc:262:slice$10409 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$12520 [22], Q = \P2.reg2 [22]).
Adding EN signal on $auto$ff.cc:262:slice$4872 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [31], Q = \P1.reg0 [31]).
Adding EN signal on $auto$ff.cc:262:slice$4871 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [30], Q = \P1.reg0 [30]).
Adding EN signal on $auto$ff.cc:262:slice$4870 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [29], Q = \P1.reg0 [29]).
Adding EN signal on $auto$ff.cc:262:slice$4869 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [28], Q = \P1.reg0 [28]).
Adding EN signal on $auto$ff.cc:262:slice$4868 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [27], Q = \P1.reg0 [27]).
Adding EN signal on $auto$ff.cc:262:slice$4867 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [26], Q = \P1.reg0 [26]).
Adding EN signal on $auto$ff.cc:262:slice$4866 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [25], Q = \P1.reg0 [25]).
Adding EN signal on $auto$ff.cc:262:slice$4865 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [24], Q = \P1.reg0 [24]).
Adding EN signal on $auto$ff.cc:262:slice$4864 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [23], Q = \P1.reg0 [23]).
Adding EN signal on $auto$ff.cc:262:slice$4863 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [22], Q = \P1.reg0 [22]).
Adding EN signal on $auto$ff.cc:262:slice$4862 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [21], Q = \P1.reg0 [21]).
Adding EN signal on $auto$ff.cc:262:slice$4861 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [20], Q = \P1.reg0 [20]).
Adding EN signal on $auto$ff.cc:262:slice$4860 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [19], Q = \P1.reg0 [19]).
Adding EN signal on $auto$ff.cc:262:slice$4859 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [18], Q = \P1.reg0 [18]).
Adding EN signal on $auto$ff.cc:262:slice$4858 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [17], Q = \P1.reg0 [17]).
Adding EN signal on $auto$ff.cc:262:slice$4857 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [16], Q = \P1.reg0 [16]).
Adding EN signal on $auto$ff.cc:262:slice$4856 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [15], Q = \P1.reg0 [15]).
Adding EN signal on $auto$ff.cc:262:slice$4855 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [14], Q = \P1.reg0 [14]).
Adding EN signal on $auto$ff.cc:262:slice$4854 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [13], Q = \P1.reg0 [13]).
Adding EN signal on $auto$ff.cc:262:slice$4853 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [12], Q = \P1.reg0 [12]).
Adding EN signal on $auto$ff.cc:262:slice$4852 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [11], Q = \P1.reg0 [11]).
Adding EN signal on $auto$ff.cc:262:slice$4851 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [10], Q = \P1.reg0 [10]).
Adding EN signal on $auto$ff.cc:262:slice$4850 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [9], Q = \P1.reg0 [9]).
Adding EN signal on $auto$ff.cc:262:slice$4849 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [8], Q = \P1.reg0 [8]).
Adding EN signal on $auto$ff.cc:262:slice$4848 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [7], Q = \P1.reg0 [7]).
Adding EN signal on $auto$ff.cc:262:slice$4847 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [6], Q = \P1.reg0 [6]).
Adding EN signal on $auto$ff.cc:262:slice$4846 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [5], Q = \P1.reg0 [5]).
Adding EN signal on $auto$ff.cc:262:slice$4845 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [4], Q = \P1.reg0 [4]).
Adding EN signal on $auto$ff.cc:262:slice$4844 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [3], Q = \P1.reg0 [3]).
Adding EN signal on $auto$ff.cc:262:slice$4843 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [2], Q = \P1.reg0 [2]).
Adding EN signal on $auto$ff.cc:262:slice$4842 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [1], Q = \P1.reg0 [1]).
Adding EN signal on $auto$ff.cc:262:slice$4841 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [0], Q = \P1.reg0 [0]).
Adding EN signal on $auto$ff.cc:262:slice$4840 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [31], Q = \P1.reg1 [31]).
Adding EN signal on $auto$ff.cc:262:slice$4839 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [30], Q = \P1.reg1 [30]).
Adding EN signal on $auto$ff.cc:262:slice$4838 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [29], Q = \P1.reg1 [29]).
Adding EN signal on $auto$ff.cc:262:slice$4837 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [28], Q = \P1.reg1 [28]).
Adding EN signal on $auto$ff.cc:262:slice$4836 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [27], Q = \P1.reg1 [27]).
Adding EN signal on $auto$ff.cc:262:slice$4835 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [26], Q = \P1.reg1 [26]).
Adding EN signal on $auto$ff.cc:262:slice$4834 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [25], Q = \P1.reg1 [25]).
Adding EN signal on $auto$ff.cc:262:slice$4833 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [24], Q = \P1.reg1 [24]).
Adding EN signal on $auto$ff.cc:262:slice$4832 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [23], Q = \P1.reg1 [23]).
Adding EN signal on $auto$ff.cc:262:slice$4831 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [22], Q = \P1.reg1 [22]).
Adding EN signal on $auto$ff.cc:262:slice$4830 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [21], Q = \P1.reg1 [21]).
Adding EN signal on $auto$ff.cc:262:slice$4829 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [20], Q = \P1.reg1 [20]).
Adding EN signal on $auto$ff.cc:262:slice$4828 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [19], Q = \P1.reg1 [19]).
Adding EN signal on $auto$ff.cc:262:slice$4827 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [18], Q = \P1.reg1 [18]).
Adding EN signal on $auto$ff.cc:262:slice$4826 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [17], Q = \P1.reg1 [17]).
Adding EN signal on $auto$ff.cc:262:slice$4825 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [16], Q = \P1.reg1 [16]).
Adding EN signal on $auto$ff.cc:262:slice$4824 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [15], Q = \P1.reg1 [15]).
Adding EN signal on $auto$ff.cc:262:slice$4823 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [14], Q = \P1.reg1 [14]).
Adding EN signal on $auto$ff.cc:262:slice$4822 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [13], Q = \P1.reg1 [13]).
Adding EN signal on $auto$ff.cc:262:slice$4821 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [12], Q = \P1.reg1 [12]).
Adding EN signal on $auto$ff.cc:262:slice$4820 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [11], Q = \P1.reg1 [11]).
Adding EN signal on $auto$ff.cc:262:slice$4819 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [10], Q = \P1.reg1 [10]).
Adding EN signal on $auto$ff.cc:262:slice$4818 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [9], Q = \P1.reg1 [9]).
Adding EN signal on $auto$ff.cc:262:slice$4817 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [8], Q = \P1.reg1 [8]).
Adding EN signal on $auto$ff.cc:262:slice$4816 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [7], Q = \P1.reg1 [7]).
Adding EN signal on $auto$ff.cc:262:slice$4815 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [6], Q = \P1.reg1 [6]).
Adding EN signal on $auto$ff.cc:262:slice$4814 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [5], Q = \P1.reg1 [5]).
Adding EN signal on $auto$ff.cc:262:slice$4813 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [4], Q = \P1.reg1 [4]).
Adding EN signal on $auto$ff.cc:262:slice$4812 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [3], Q = \P1.reg1 [3]).
Adding EN signal on $auto$ff.cc:262:slice$4811 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [2], Q = \P1.reg1 [2]).
Adding EN signal on $auto$ff.cc:262:slice$4810 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [1], Q = \P1.reg1 [1]).
Adding EN signal on $auto$ff.cc:262:slice$4809 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [0], Q = \P1.reg1 [0]).
Adding EN signal on $auto$ff.cc:262:slice$4808 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [31], Q = \P1.reg2 [31]).
Adding EN signal on $auto$ff.cc:262:slice$4807 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [30], Q = \P1.reg2 [30]).
Adding EN signal on $auto$ff.cc:262:slice$4806 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [29], Q = \P1.reg2 [29]).
Adding EN signal on $auto$ff.cc:262:slice$4805 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [28], Q = \P1.reg2 [28]).
Adding EN signal on $auto$ff.cc:262:slice$4804 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [27], Q = \P1.reg2 [27]).
Adding EN signal on $auto$ff.cc:262:slice$4803 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [26], Q = \P1.reg2 [26]).
Adding EN signal on $auto$ff.cc:262:slice$4802 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [25], Q = \P1.reg2 [25]).
Adding EN signal on $auto$ff.cc:262:slice$4801 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [24], Q = \P1.reg2 [24]).
Adding EN signal on $auto$ff.cc:262:slice$4800 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [23], Q = \P1.reg2 [23]).
Adding EN signal on $auto$ff.cc:262:slice$4799 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [22], Q = \P1.reg2 [22]).
Adding EN signal on $auto$ff.cc:262:slice$4798 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [21], Q = \P1.reg2 [21]).
Adding EN signal on $auto$ff.cc:262:slice$4797 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [20], Q = \P1.reg2 [20]).
Adding EN signal on $auto$ff.cc:262:slice$4796 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [19], Q = \P1.reg2 [19]).
Adding EN signal on $auto$ff.cc:262:slice$4795 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [18], Q = \P1.reg2 [18]).
Adding EN signal on $auto$ff.cc:262:slice$4794 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [17], Q = \P1.reg2 [17]).
Adding EN signal on $auto$ff.cc:262:slice$4793 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [16], Q = \P1.reg2 [16]).
Adding EN signal on $auto$ff.cc:262:slice$4792 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [15], Q = \P1.reg2 [15]).
Adding EN signal on $auto$ff.cc:262:slice$4791 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [14], Q = \P1.reg2 [14]).
Adding EN signal on $auto$ff.cc:262:slice$4790 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [13], Q = \P1.reg2 [13]).
Adding EN signal on $auto$ff.cc:262:slice$4789 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [12], Q = \P1.reg2 [12]).
Adding EN signal on $auto$ff.cc:262:slice$4788 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [11], Q = \P1.reg2 [11]).
Adding EN signal on $auto$ff.cc:262:slice$4787 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [10], Q = \P1.reg2 [10]).
Adding EN signal on $auto$ff.cc:262:slice$4786 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [9], Q = \P1.reg2 [9]).
Adding EN signal on $auto$ff.cc:262:slice$4785 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [8], Q = \P1.reg2 [8]).
Adding EN signal on $auto$ff.cc:262:slice$4784 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [7], Q = \P1.reg2 [7]).
Adding EN signal on $auto$ff.cc:262:slice$4783 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [6], Q = \P1.reg2 [6]).
Adding EN signal on $auto$ff.cc:262:slice$4782 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [5], Q = \P1.reg2 [5]).
Adding EN signal on $auto$ff.cc:262:slice$4781 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [4], Q = \P1.reg2 [4]).
Adding EN signal on $auto$ff.cc:262:slice$4780 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [3], Q = \P1.reg2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$4779 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [2], Q = \P1.reg2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$4778 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [1], Q = \P1.reg2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$4777 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6294 [0], Q = \P1.reg2 [0]).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 1655 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~4598 debug messages>

3.27.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.27.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
<suppressed ~20892 debug messages>
Removed a total of 6964 cells.

yosys> opt_dff

3.27.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 6650 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.27.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.27.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..

yosys> opt_expr

3.27.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.27.30. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~1266 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$31987 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13004 [0], Q = \P2.reg1 [0]).
Adding EN signal on $auto$ff.cc:262:slice$28820 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$13488 [0], Q = \P2.reg0 [0]).
Adding EN signal on $auto$ff.cc:262:slice$36004 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$7262 [0], Q = \P1.reg0 [0]).
Adding EN signal on $auto$ff.cc:262:slice$39171 ($_DFFE_PP0P_) from module b21 (D = $auto$simplemap.cc:309:simplemap_bmux$6778 [0], Q = \P1.reg1 [0]).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 26 unused wires.
<suppressed ~1 debug messages>

3.28.5. Rerunning OPT passes. (Removed registers in this run.)

yosys> opt_expr -full

3.28.6. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~18 debug messages>

yosys> opt_merge

3.28.7. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_dff

3.28.8. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 8 unused wires.
<suppressed ~1 debug messages>

3.28.10. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14630 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14650
        $auto$simplemap.cc:86:simplemap_bitop$14651

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14631 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14648
        $auto$simplemap.cc:86:simplemap_bitop$14649

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14632 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14646
        $auto$simplemap.cc:86:simplemap_bitop$14647

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14633 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14644
        $auto$simplemap.cc:86:simplemap_bitop$14645

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$8713 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$8733
        $auto$simplemap.cc:86:simplemap_bitop$8734

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$8714 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$8731
        $auto$simplemap.cc:86:simplemap_bitop$8732

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$8715 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$8729
        $auto$simplemap.cc:86:simplemap_bitop$8730

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$8716 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$8727
        $auto$simplemap.cc:86:simplemap_bitop$8728


yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 16 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~8 debug messages>

3.30.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce -full

3.30.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.30.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_share

3.30.14. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14637 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14648
        $auto$simplemap.cc:86:simplemap_bitop$14650

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14638 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14644
        $auto$simplemap.cc:86:simplemap_bitop$14646

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$8720 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$8731
        $auto$simplemap.cc:86:simplemap_bitop$8733

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$8721 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$8727
        $auto$simplemap.cc:86:simplemap_bitop$8729


yosys> opt_dff

3.30.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 8 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~4 debug messages>

3.30.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~4 debug messages>

yosys> opt_reduce -full

3.30.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.30.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_share

3.30.22. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14641 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$14644
        $auto$simplemap.cc:86:simplemap_bitop$14648

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$8724 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$8727
        $auto$simplemap.cc:86:simplemap_bitop$8731


yosys> opt_dff

3.30.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~2 debug messages>

3.30.26. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce -full

3.30.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.30.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_share

3.30.30. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..

yosys> opt_expr -full

3.30.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.30.34. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.31. Executing ABC pass (technology mapping using ABC).

3.31.1. Summary of detected clock domains:
  167 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1602, arst=\reset, srst={ }
  34 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$46948, arst=\reset, srst={ }
  26 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$46931, arst=\reset, srst={ }
  28 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$46914, arst=\reset, srst={ }
  31 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$46897, arst=\reset, srst={ }
  41 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$41917, arst=\reset, srst={ }
  743 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$39313, arst=\reset, srst={ }
  602 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$36160, arst=\reset, srst={ }
  495 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$32993, arst=\reset, srst={ }
  773 cells in clk=\clock, en=\P2.state, arst=\reset, srst={ }
  752 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$28976, arst=\reset, srst={ }
  456 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$25809, arst=\reset, srst={ }
  29 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$25713, arst=\reset, srst={ }
  75 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$25574, arst=\reset, srst={ }
  39 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$25492, arst=\reset, srst={ }
  83 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$25353, arst=\reset, srst={ }
  34 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$25271, arst=\reset, srst={ }
  678 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$23517, arst=\reset, srst={ }
  520 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$22355, arst=\reset, srst={ }
  501 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$22237, arst=\reset, srst={ }
  146 cells in clk=\clock, en=$auto$opt_dff.cc:194:make_patterns_logic$22113, arst=\reset, srst={ }
  129 cells in clk=\clock, en=$auto$opt_dff.cc:194:make_patterns_logic$22095, arst=\reset, srst={ }
  300 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$1563, arst=\reset, srst={ }
  651 cells in clk=\clock, en=\P1.state, arst=\reset, srst={ }
  975 cells in clk=\clock, en={ }, arst=\reset, srst={ }

3.31.2. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1602, asynchronously reset by \reset
Extracted 135 gates and 268 wires to a netlist network with 133 inputs and 96 outputs.

3.31.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       32
ABC RESULTS:               NOT cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:                OR cells:        3
ABC RESULTS:               AND cells:        3
ABC RESULTS:               NOR cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:              XNOR cells:        4
ABC RESULTS:               XOR cells:       30
ABC RESULTS:               MUX cells:       95
ABC RESULTS:        internal signals:       39
ABC RESULTS:           input signals:      133
ABC RESULTS:          output signals:       96
Removing temp directory.

3.31.3. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$46948, asynchronously reset by \reset
Extracted 26 gates and 49 wires to a netlist network with 22 inputs and 10 outputs.

3.31.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               NOT cells:        3
ABC RESULTS:               XOR cells:        3
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:              NAND cells:        9
ABC RESULTS:               MUX cells:        4
ABC RESULTS:                OR cells:        1
ABC RESULTS:               AND cells:        9
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       17
ABC RESULTS:           input signals:       22
ABC RESULTS:          output signals:       10
Removing temp directory.

3.31.4. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$46931, asynchronously reset by \reset
Extracted 26 gates and 51 wires to a netlist network with 23 inputs and 6 outputs.

3.31.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               MUX cells:        2
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:               NOR cells:        3
ABC RESULTS:                OR cells:        5
ABC RESULTS:               XOR cells:        1
ABC RESULTS:               AND cells:       10
ABC RESULTS:              NAND cells:        9
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       22
ABC RESULTS:           input signals:       23
ABC RESULTS:          output signals:        6
Removing temp directory.

3.31.5. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$46914, asynchronously reset by \reset
Extracted 24 gates and 45 wires to a netlist network with 20 inputs and 7 outputs.

3.31.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               NOT cells:        3
ABC RESULTS:               XOR cells:        2
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:              NAND cells:        9
ABC RESULTS:               MUX cells:        4
ABC RESULTS:                OR cells:        1
ABC RESULTS:               AND cells:        8
ABC RESULTS:        internal signals:       18
ABC RESULTS:           input signals:       20
ABC RESULTS:          output signals:        7
Removing temp directory.

3.31.6. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$46897, asynchronously reset by \reset
Extracted 27 gates and 53 wires to a netlist network with 24 inputs and 7 outputs.

3.31.6.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.6.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               MUX cells:        2
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:               NOR cells:        3
ABC RESULTS:                OR cells:        5
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               AND cells:       10
ABC RESULTS:              NAND cells:        9
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       22
ABC RESULTS:           input signals:       24
ABC RESULTS:          output signals:        7
Removing temp directory.

3.31.7. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$41917, asynchronously reset by \reset
Extracted 37 gates and 70 wires to a netlist network with 31 inputs and 16 outputs.

3.31.7.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.7.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:               NOT cells:        3
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:                OR cells:       12
ABC RESULTS:               NOR cells:        2
ABC RESULTS:               MUX cells:        4
ABC RESULTS:              NAND cells:       16
ABC RESULTS:               AND cells:        8
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       23
ABC RESULTS:           input signals:       31
ABC RESULTS:          output signals:       16
Removing temp directory.

3.31.8. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$39313, asynchronously reset by \reset
Extracted 669 gates and 917 wires to a netlist network with 247 inputs and 193 outputs.

3.31.8.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.8.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:              XNOR cells:       30
ABC RESULTS:               NOT cells:       58
ABC RESULTS:               XOR cells:       23
ABC RESULTS:               NOR cells:        5
ABC RESULTS:            ANDNOT cells:        9
ABC RESULTS:                OR cells:       72
ABC RESULTS:               MUX cells:      105
ABC RESULTS:             ORNOT cells:       30
ABC RESULTS:               AND cells:      142
ABC RESULTS:              NAND cells:      362
ABC RESULTS:               BUF cells:       17
ABC RESULTS:        internal signals:      477
ABC RESULTS:           input signals:      247
ABC RESULTS:          output signals:      193
Removing temp directory.

3.31.9. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$36160, asynchronously reset by \reset
Extracted 584 gates and 816 wires to a netlist network with 231 inputs and 105 outputs.

3.31.9.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.9.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               NOT cells:        5
ABC RESULTS:              XNOR cells:        3
ABC RESULTS:               XOR cells:       45
ABC RESULTS:            ANDNOT cells:      113
ABC RESULTS:                OR cells:       62
ABC RESULTS:               NOR cells:       42
ABC RESULTS:               MUX cells:      119
ABC RESULTS:             ORNOT cells:       58
ABC RESULTS:              NAND cells:      140
ABC RESULTS:               AND cells:      161
ABC RESULTS:               BUF cells:       17
ABC RESULTS:        internal signals:      480
ABC RESULTS:           input signals:      231
ABC RESULTS:          output signals:      105
Removing temp directory.

3.31.10. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$32993, asynchronously reset by \reset
Extracted 470 gates and 670 wires to a netlist network with 199 inputs and 66 outputs.

3.31.10.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.10.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               NOT cells:        4
ABC RESULTS:                OR cells:       16
ABC RESULTS:             ORNOT cells:       11
ABC RESULTS:            ANDNOT cells:       59
ABC RESULTS:               NOR cells:       36
ABC RESULTS:               MUX cells:      167
ABC RESULTS:              NAND cells:      152
ABC RESULTS:               AND cells:      109
ABC RESULTS:               BUF cells:       31
ABC RESULTS:        internal signals:      405
ABC RESULTS:           input signals:      199
ABC RESULTS:          output signals:       66
Removing temp directory.

3.31.11. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by \P2.state, asynchronously reset by \reset
Extracted 771 gates and 1021 wires to a netlist network with 249 inputs and 50 outputs.

3.31.11.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.11.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       26
ABC RESULTS:              XNOR cells:        3
ABC RESULTS:               NOT cells:       10
ABC RESULTS:               XOR cells:       25
ABC RESULTS:               NOR cells:       12
ABC RESULTS:             ORNOT cells:       34
ABC RESULTS:               MUX cells:      206
ABC RESULTS:               AND cells:      139
ABC RESULTS:            ANDNOT cells:       37
ABC RESULTS:                OR cells:       48
ABC RESULTS:              NAND cells:      331
ABC RESULTS:        internal signals:      722
ABC RESULTS:           input signals:      249
ABC RESULTS:          output signals:       50
Removing temp directory.

3.31.12. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$28976, asynchronously reset by \reset
Extracted 674 gates and 899 wires to a netlist network with 224 inputs and 186 outputs.

3.31.12.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.12.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               NOT cells:       41
ABC RESULTS:              XNOR cells:       38
ABC RESULTS:               XOR cells:       32
ABC RESULTS:                OR cells:       55
ABC RESULTS:            ANDNOT cells:      126
ABC RESULTS:               NOR cells:       37
ABC RESULTS:               MUX cells:      141
ABC RESULTS:             ORNOT cells:       41
ABC RESULTS:              NAND cells:      160
ABC RESULTS:               AND cells:      139
ABC RESULTS:               BUF cells:       18
ABC RESULTS:        internal signals:      489
ABC RESULTS:           input signals:      224
ABC RESULTS:          output signals:      186
Removing temp directory.

3.31.13. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$25809, asynchronously reset by \reset
Extracted 450 gates and 631 wires to a netlist network with 180 inputs and 46 outputs.

3.31.13.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.13.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               NOT cells:        3
ABC RESULTS:                OR cells:       21
ABC RESULTS:             ORNOT cells:       16
ABC RESULTS:            ANDNOT cells:       60
ABC RESULTS:               NOR cells:       36
ABC RESULTS:               MUX cells:      143
ABC RESULTS:              NAND cells:      152
ABC RESULTS:               AND cells:      113
ABC RESULTS:               BUF cells:       31
ABC RESULTS:        internal signals:      405
ABC RESULTS:           input signals:      180
ABC RESULTS:          output signals:       46
Removing temp directory.

3.31.14. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$25713, asynchronously reset by \reset
Extracted 27 gates and 49 wires to a netlist network with 21 inputs and 11 outputs.

3.31.14.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.14.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:                OR cells:        3
ABC RESULTS:               NOT cells:        4
ABC RESULTS:               XOR cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               MUX cells:        3
ABC RESULTS:              NAND cells:       12
ABC RESULTS:               AND cells:        8
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       17
ABC RESULTS:           input signals:       21
ABC RESULTS:          output signals:       11
Removing temp directory.

3.31.15. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$25574, asynchronously reset by \reset
Extracted 70 gates and 107 wires to a netlist network with 36 inputs and 26 outputs.

3.31.15.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.15.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        8
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:                OR cells:        6
ABC RESULTS:               XOR cells:        2
ABC RESULTS:            ANDNOT cells:        8
ABC RESULTS:               MUX cells:       10
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:               NOR cells:        7
ABC RESULTS:              NAND cells:       20
ABC RESULTS:               AND cells:       17
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       45
ABC RESULTS:           input signals:       36
ABC RESULTS:          output signals:       26
Removing temp directory.

3.31.16. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$25492, asynchronously reset by \reset
Extracted 39 gates and 69 wires to a netlist network with 29 inputs and 14 outputs.

3.31.16.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.16.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        3
ABC RESULTS:                OR cells:        8
ABC RESULTS:               MUX cells:        8
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:             ORNOT cells:        6
ABC RESULTS:               NOR cells:        4
ABC RESULTS:              NAND cells:       10
ABC RESULTS:               AND cells:       11
ABC RESULTS:        internal signals:       26
ABC RESULTS:           input signals:       29
ABC RESULTS:          output signals:       14
Removing temp directory.

3.31.17. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$25353, asynchronously reset by \reset
Extracted 81 gates and 133 wires to a netlist network with 51 inputs and 25 outputs.

3.31.17.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.17.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        8
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:                OR cells:        7
ABC RESULTS:               XOR cells:        2
ABC RESULTS:            ANDNOT cells:        7
ABC RESULTS:               NOR cells:        9
ABC RESULTS:               MUX cells:       22
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              NAND cells:       24
ABC RESULTS:               AND cells:       15
ABC RESULTS:        internal signals:       57
ABC RESULTS:           input signals:       51
ABC RESULTS:          output signals:       25
Removing temp directory.

3.31.18. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$25271, asynchronously reset by \reset
Extracted 28 gates and 50 wires to a netlist network with 21 inputs and 14 outputs.

3.31.18.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.18.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               AND cells:        5
ABC RESULTS:                OR cells:        4
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:              NAND cells:        8
ABC RESULTS:               MUX cells:        5
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       15
ABC RESULTS:           input signals:       21
ABC RESULTS:          output signals:       14
Removing temp directory.

3.31.19. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$23517, asynchronously reset by \reset
Extracted 606 gates and 876 wires to a netlist network with 268 inputs and 134 outputs.

3.31.19.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.19.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               XOR cells:       19
ABC RESULTS:              XNOR cells:       13
ABC RESULTS:               NOT cells:       22
ABC RESULTS:             ORNOT cells:        6
ABC RESULTS:               MUX cells:      119
ABC RESULTS:                OR cells:       16
ABC RESULTS:               NOR cells:       23
ABC RESULTS:            ANDNOT cells:       30
ABC RESULTS:               AND cells:      152
ABC RESULTS:              NAND cells:      455
ABC RESULTS:               BUF cells:       18
ABC RESULTS:        internal signals:      474
ABC RESULTS:           input signals:      268
ABC RESULTS:          output signals:      134
Removing temp directory.

3.31.20. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$22355, asynchronously reset by \reset
Extracted 446 gates and 614 wires to a netlist network with 167 inputs and 117 outputs.

3.31.20.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.20.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               NOR cells:       21
ABC RESULTS:               NOT cells:        7
ABC RESULTS:               XOR cells:       27
ABC RESULTS:                OR cells:       28
ABC RESULTS:              NAND cells:       19
ABC RESULTS:             ORNOT cells:        6
ABC RESULTS:              XNOR cells:       33
ABC RESULTS:               MUX cells:        2
ABC RESULTS:               AND cells:       62
ABC RESULTS:               BUF cells:       27
ABC RESULTS:        internal signals:      330
ABC RESULTS:           input signals:      167
ABC RESULTS:          output signals:      117
Removing temp directory.

3.31.21. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$22237, asynchronously reset by \reset
Extracted 427 gates and 575 wires to a netlist network with 146 inputs and 106 outputs.

3.31.21.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.21.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:             ORNOT cells:        7
ABC RESULTS:               NOT cells:        5
ABC RESULTS:               XOR cells:       27
ABC RESULTS:                OR cells:       18
ABC RESULTS:               NOR cells:       17
ABC RESULTS:              NAND cells:       14
ABC RESULTS:              XNOR cells:       32
ABC RESULTS:               MUX cells:        2
ABC RESULTS:               AND cells:       62
ABC RESULTS:               BUF cells:       26
ABC RESULTS:        internal signals:      323
ABC RESULTS:           input signals:      146
ABC RESULTS:          output signals:      106
Removing temp directory.

3.31.22. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:194:make_patterns_logic$22113, asynchronously reset by \reset
Extracted 126 gates and 185 wires to a netlist network with 59 inputs and 105 outputs.

3.31.22.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.22.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       20
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               NOR cells:        9
ABC RESULTS:              NAND cells:        4
ABC RESULTS:               NOT cells:       24
ABC RESULTS:                OR cells:       17
ABC RESULTS:               AND cells:       12
ABC RESULTS:            ANDNOT cells:       10
ABC RESULTS:               XOR cells:        1
ABC RESULTS:               MUX cells:       21
ABC RESULTS:              XNOR cells:        3
ABC RESULTS:               BUF cells:       39
ABC RESULTS:        internal signals:       21
ABC RESULTS:           input signals:       59
ABC RESULTS:          output signals:      105
Removing temp directory.

3.31.23. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:194:make_patterns_logic$22095, asynchronously reset by \reset
Extracted 129 gates and 205 wires to a netlist network with 76 inputs and 94 outputs.

3.31.23.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.23.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       20
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               NOR cells:        3
ABC RESULTS:              NAND cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               NOT cells:       21
ABC RESULTS:               AND cells:       10
ABC RESULTS:                OR cells:       14
ABC RESULTS:               XOR cells:       19
ABC RESULTS:            ANDNOT cells:       11
ABC RESULTS:               MUX cells:       20
ABC RESULTS:               BUF cells:       21
ABC RESULTS:        internal signals:       35
ABC RESULTS:           input signals:       76
ABC RESULTS:          output signals:       94
Removing temp directory.

3.31.24. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1563, asynchronously reset by \reset
Extracted 268 gates and 493 wires to a netlist network with 225 inputs and 98 outputs.

3.31.24.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.24.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       32
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               NOR cells:       12
ABC RESULTS:              NAND cells:       36
ABC RESULTS:               NOT cells:        3
ABC RESULTS:               AND cells:       44
ABC RESULTS:                OR cells:       23
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:               XOR cells:       30
ABC RESULTS:               MUX cells:       95
ABC RESULTS:        internal signals:      170
ABC RESULTS:           input signals:      225
ABC RESULTS:          output signals:       98
Removing temp directory.

3.31.25. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by \P1.state, asynchronously reset by \reset
Extracted 651 gates and 800 wires to a netlist network with 148 inputs and 49 outputs.

3.31.25.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.25.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       26
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               XOR cells:       24
ABC RESULTS:               NOT cells:        4
ABC RESULTS:               NOR cells:       12
ABC RESULTS:            ANDNOT cells:       11
ABC RESULTS:             ORNOT cells:       34
ABC RESULTS:              NAND cells:      326
ABC RESULTS:                OR cells:       81
ABC RESULTS:               AND cells:      160
ABC RESULTS:               MUX cells:      104
ABC RESULTS:               BUF cells:       17
ABC RESULTS:        internal signals:      603
ABC RESULTS:           input signals:      148
ABC RESULTS:          output signals:       49
Removing temp directory.

3.31.26. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, asynchronously reset by \reset
Extracted 905 gates and 1159 wires to a netlist network with 252 inputs and 186 outputs.

3.31.26.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.26.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       76
ABC RESULTS:               NOR cells:       20
ABC RESULTS:               XOR cells:        7
ABC RESULTS:             ORNOT cells:       34
ABC RESULTS:                OR cells:       26
ABC RESULTS:               AND cells:       70
ABC RESULTS:               MUX cells:      164
ABC RESULTS:            ANDNOT cells:       17
ABC RESULTS:              NAND cells:       87
ABC RESULTS:              XNOR cells:        8
ABC RESULTS:               BUF cells:        4
ABC RESULTS:               NOT cells:       71
ABC RESULTS:        internal signals:      721
ABC RESULTS:           input signals:      252
ABC RESULTS:          output signals:      186
Removing temp directory.

yosys> abc -dff

3.32. Executing ABC pass (technology mapping using ABC).

3.32.1. Summary of detected clock domains:
  171 cells in clk=\clock, en=$abc$47002$auto$opt_dff.cc:219:make_patterns_logic$1602, arst=\reset, srst={ }
  36 cells in clk=\clock, en=$abc$47174$auto$opt_dff.cc:219:make_patterns_logic$46948, arst=\reset, srst={ }
  30 cells in clk=\clock, en=$abc$47211$auto$opt_dff.cc:219:make_patterns_logic$46931, arst=\reset, srst={ }
  31 cells in clk=\clock, en=$abc$47250$auto$opt_dff.cc:219:make_patterns_logic$46914, arst=\reset, srst={ }
  44 cells in clk=\clock, en=$abc$47284$auto$opt_dff.cc:219:make_patterns_logic$46897, arst=\reset, srst={ }
  44 cells in clk=\clock, en=$abc$47324$auto$opt_dff.cc:219:make_patterns_logic$41917, arst=\reset, srst={ }
  818 cells in clk=\clock, en=$abc$47381$auto$opt_dff.cc:219:make_patterns_logic$39313, arst=\reset, srst={ }
  964 cells in clk=\clock, en=$abc$48266$auto$opt_dff.cc:219:make_patterns_logic$36160, arst=\reset, srst={ }
  630 cells in clk=\clock, en=$abc$49063$auto$opt_dff.cc:219:make_patterns_logic$32993, arst=\reset, srst={ }
  794 cells in clk=\clock, en=$abc$50552$auto$opt_dff.cc:219:make_patterns_logic$28976, arst=\reset, srst={ }
  822 cells in clk=\clock, en=$abc$51412$auto$opt_dff.cc:219:make_patterns_logic$25809, arst=\reset, srst={ }
  42 cells in clk=\clock, en=$abc$52019$auto$opt_dff.cc:219:make_patterns_logic$25713, arst=\reset, srst={ }
  78 cells in clk=\clock, en=$abc$52059$auto$opt_dff.cc:219:make_patterns_logic$25574, arst=\reset, srst={ }
  42 cells in clk=\clock, en=$abc$52148$auto$opt_dff.cc:219:make_patterns_logic$25492, arst=\reset, srst={ }
  106 cells in clk=\clock, en=$abc$52202$auto$opt_dff.cc:219:make_patterns_logic$25353, arst=\reset, srst={ }
  38 cells in clk=\clock, en=$abc$52302$auto$opt_dff.cc:219:make_patterns_logic$25271, arst=\reset, srst={ }
  878 cells in clk=\clock, en=$abc$52336$auto$opt_dff.cc:219:make_patterns_logic$23517, arst=\reset, srst={ }
  268 cells in clk=\clock, en=$abc$53241$auto$opt_dff.cc:219:make_patterns_logic$22355, arst=\reset, srst={ }
  266 cells in clk=\clock, en=$abc$53477$auto$opt_dff.cc:219:make_patterns_logic$22237, arst=\reset, srst={ }
  260 cells in clk=\clock, en=$abc$53690$auto$opt_dff.cc:194:make_patterns_logic$22113, arst=\reset, srst={ }
  129 cells in clk=\clock, en=$abc$53852$auto$opt_dff.cc:194:make_patterns_logic$22095, arst=\reset, srst={ }
  279 cells in clk=\clock, en=$abc$53996$auto$opt_dff.cc:219:make_patterns_logic$1563, arst=\reset, srst={ }
  1649 cells in clk=\clock, en=$abc$55082$lo02, arst=\reset, srst={ }
  559 cells in clk=\clock, en={ }, arst=\reset, srst={ }

3.32.2. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47002$auto$opt_dff.cc:219:make_patterns_logic$1602, asynchronously reset by \reset
Extracted 139 gates and 272 wires to a netlist network with 133 inputs and 64 outputs.

3.32.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       32
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:                OR cells:        3
ABC RESULTS:               AND cells:        3
ABC RESULTS:              NAND cells:        2
ABC RESULTS:              XNOR cells:        4
ABC RESULTS:               XOR cells:       30
ABC RESULTS:               MUX cells:       63
ABC RESULTS:        internal signals:       75
ABC RESULTS:           input signals:      133
ABC RESULTS:          output signals:       64
Removing temp directory.

3.32.3. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47174$auto$opt_dff.cc:219:make_patterns_logic$46948, asynchronously reset by \reset
Extracted 31 gates and 51 wires to a netlist network with 20 inputs and 8 outputs.

3.32.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:               MUX cells:        3
ABC RESULTS:              NAND cells:       10
ABC RESULTS:               AND cells:       11
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       23
ABC RESULTS:           input signals:       20
ABC RESULTS:          output signals:        8
Removing temp directory.

3.32.4. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47211$auto$opt_dff.cc:219:make_patterns_logic$46931, asynchronously reset by \reset
Extracted 30 gates and 47 wires to a netlist network with 17 inputs and 6 outputs.

3.32.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:               NOR cells:        2
ABC RESULTS:               AND cells:       10
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:                OR cells:        6
ABC RESULTS:              NAND cells:        6
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       24
ABC RESULTS:           input signals:       17
ABC RESULTS:          output signals:        6
Removing temp directory.

3.32.5. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47250$auto$opt_dff.cc:219:make_patterns_logic$46914, asynchronously reset by \reset
Extracted 30 gates and 50 wires to a netlist network with 20 inputs and 5 outputs.

3.32.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:               NOR cells:        2
ABC RESULTS:               MUX cells:        3
ABC RESULTS:              NAND cells:        9
ABC RESULTS:               AND cells:       10
ABC RESULTS:        internal signals:       25
ABC RESULTS:           input signals:       20
ABC RESULTS:          output signals:        5
Removing temp directory.

3.32.6. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47284$auto$opt_dff.cc:219:make_patterns_logic$46897, asynchronously reset by \reset
Extracted 40 gates and 64 wires to a netlist network with 24 inputs and 8 outputs.

3.32.6.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.6.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:               NOT cells:        3
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:               NOR cells:        2
ABC RESULTS:               AND cells:       14
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:                OR cells:        6
ABC RESULTS:              NAND cells:       10
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       32
ABC RESULTS:           input signals:       24
ABC RESULTS:          output signals:        8
Removing temp directory.

3.32.7. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47324$auto$opt_dff.cc:219:make_patterns_logic$41917, asynchronously reset by \reset
Extracted 40 gates and 58 wires to a netlist network with 18 inputs and 12 outputs.

3.32.7.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.7.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:               XOR cells:        1
ABC RESULTS:              NAND cells:        5
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:               MUX cells:        4
ABC RESULTS:                OR cells:        6
ABC RESULTS:               AND cells:        9
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       28
ABC RESULTS:           input signals:       18
ABC RESULTS:          output signals:       12
Removing temp directory.

3.32.8. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47381$auto$opt_dff.cc:219:make_patterns_logic$39313, asynchronously reset by \reset
Extracted 777 gates and 1023 wires to a netlist network with 246 inputs and 100 outputs.

3.32.8.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.8.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               NOT cells:        3
ABC RESULTS:               XOR cells:       18
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               NOR cells:        8
ABC RESULTS:            ANDNOT cells:        5
ABC RESULTS:               MUX cells:      109
ABC RESULTS:             ORNOT cells:       30
ABC RESULTS:                OR cells:       65
ABC RESULTS:               AND cells:      137
ABC RESULTS:              NAND cells:      365
ABC RESULTS:               BUF cells:       17
ABC RESULTS:        internal signals:      677
ABC RESULTS:           input signals:      246
ABC RESULTS:          output signals:      100
Removing temp directory.

3.32.9. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$48266$auto$opt_dff.cc:219:make_patterns_logic$36160, asynchronously reset by \reset
Extracted 901 gates and 1124 wires to a netlist network with 223 inputs and 224 outputs.

3.32.9.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.9.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               XOR cells:       19
ABC RESULTS:              XNOR cells:       56
ABC RESULTS:            ANDNOT cells:        7
ABC RESULTS:               NOT cells:       54
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:                OR cells:       71
ABC RESULTS:               MUX cells:       94
ABC RESULTS:               NOR cells:       40
ABC RESULTS:              NAND cells:      323
ABC RESULTS:               AND cells:      228
ABC RESULTS:               BUF cells:       17
ABC RESULTS:        internal signals:      677
ABC RESULTS:           input signals:      223
ABC RESULTS:          output signals:      224
Removing temp directory.

3.32.10. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$49063$auto$opt_dff.cc:219:make_patterns_logic$32993, asynchronously reset by \reset
Extracted 611 gates and 810 wires to a netlist network with 199 inputs and 73 outputs.

3.32.10.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.10.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               NOT cells:       13
ABC RESULTS:               XOR cells:        6
ABC RESULTS:             ORNOT cells:       27
ABC RESULTS:            ANDNOT cells:       15
ABC RESULTS:               MUX cells:      110
ABC RESULTS:               NOR cells:       35
ABC RESULTS:                OR cells:       22
ABC RESULTS:              NAND cells:      230
ABC RESULTS:               AND cells:      188
ABC RESULTS:               BUF cells:       26
ABC RESULTS:        internal signals:      538
ABC RESULTS:           input signals:      199
ABC RESULTS:          output signals:       73
Removing temp directory.

3.32.11. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$50552$auto$opt_dff.cc:219:make_patterns_logic$28976, asynchronously reset by \reset
Extracted 757 gates and 922 wires to a netlist network with 165 inputs and 117 outputs.

3.32.11.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.11.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               NOT cells:       27
ABC RESULTS:               XOR cells:       19
ABC RESULTS:              XNOR cells:       29
ABC RESULTS:                OR cells:       71
ABC RESULTS:            ANDNOT cells:       64
ABC RESULTS:               NOR cells:       35
ABC RESULTS:               MUX cells:       90
ABC RESULTS:             ORNOT cells:       52
ABC RESULTS:              NAND cells:      178
ABC RESULTS:               AND cells:      166
ABC RESULTS:               BUF cells:       30
ABC RESULTS:        internal signals:      640
ABC RESULTS:           input signals:      165
ABC RESULTS:          output signals:      117
Removing temp directory.

3.32.12. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$51412$auto$opt_dff.cc:219:make_patterns_logic$25809, asynchronously reset by \reset
Extracted 751 gates and 1005 wires to a netlist network with 254 inputs and 178 outputs.

3.32.12.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.12.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:               XOR cells:       27
ABC RESULTS:               NOT cells:       33
ABC RESULTS:              XNOR cells:        6
ABC RESULTS:            ANDNOT cells:        5
ABC RESULTS:               MUX cells:      198
ABC RESULTS:               NOR cells:       15
ABC RESULTS:              NAND cells:      316
ABC RESULTS:               AND cells:       70
ABC RESULTS:               BUF cells:        1
ABC RESULTS:                OR cells:       17
ABC RESULTS:        internal signals:      573
ABC RESULTS:           input signals:      254
ABC RESULTS:          output signals:      178
Removing temp directory.

3.32.13. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$52019$auto$opt_dff.cc:219:make_patterns_logic$25713, asynchronously reset by \reset
Extracted 40 gates and 62 wires to a netlist network with 22 inputs and 12 outputs.

3.32.13.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.13.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:                OR cells:        4
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:               MUX cells:        3
ABC RESULTS:              NAND cells:       15
ABC RESULTS:               AND cells:        7
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       28
ABC RESULTS:           input signals:       22
ABC RESULTS:          output signals:       12
Removing temp directory.

3.32.14. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$52059$auto$opt_dff.cc:219:make_patterns_logic$25574, asynchronously reset by \reset
Extracted 76 gates and 110 wires to a netlist network with 34 inputs and 24 outputs.

3.32.14.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.14.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        4
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:                OR cells:        5
ABC RESULTS:               NOR cells:        3
ABC RESULTS:               XOR cells:        2
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               MUX cells:       10
ABC RESULTS:            ANDNOT cells:        5
ABC RESULTS:              NAND cells:       19
ABC RESULTS:               BUF cells:        1
ABC RESULTS:               AND cells:       17
ABC RESULTS:        internal signals:       52
ABC RESULTS:           input signals:       34
ABC RESULTS:          output signals:       24
Removing temp directory.

3.32.15. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$52148$auto$opt_dff.cc:219:make_patterns_logic$25492, asynchronously reset by \reset
Extracted 42 gates and 63 wires to a netlist network with 21 inputs and 15 outputs.

3.32.15.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.15.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        3
ABC RESULTS:                OR cells:        5
ABC RESULTS:              NAND cells:        6
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               NOR cells:        3
ABC RESULTS:               MUX cells:        6
ABC RESULTS:             ORNOT cells:        5
ABC RESULTS:               AND cells:        8
ABC RESULTS:        internal signals:       27
ABC RESULTS:           input signals:       21
ABC RESULTS:          output signals:       15
Removing temp directory.

3.32.16. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$52202$auto$opt_dff.cc:219:make_patterns_logic$25353, asynchronously reset by \reset
Extracted 98 gates and 158 wires to a netlist network with 60 inputs and 30 outputs.

3.32.16.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.16.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:                OR cells:        8
ABC RESULTS:               XOR cells:        2
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               NOT cells:        7
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               NOR cells:        6
ABC RESULTS:               MUX cells:       23
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              NAND cells:       21
ABC RESULTS:               BUF cells:        2
ABC RESULTS:               AND cells:       18
ABC RESULTS:        internal signals:       68
ABC RESULTS:           input signals:       60
ABC RESULTS:          output signals:       30
Removing temp directory.

3.32.17. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$52302$auto$opt_dff.cc:219:make_patterns_logic$25271, asynchronously reset by \reset
Extracted 32 gates and 56 wires to a netlist network with 24 inputs and 16 outputs.

3.32.17.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.17.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               AND cells:        7
ABC RESULTS:                OR cells:        5
ABC RESULTS:              NAND cells:        6
ABC RESULTS:               MUX cells:        5
ABC RESULTS:               BUF cells:        1
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:        internal signals:       16
ABC RESULTS:           input signals:       24
ABC RESULTS:          output signals:       16
Removing temp directory.

3.32.18. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$52336$auto$opt_dff.cc:219:make_patterns_logic$23517, asynchronously reset by \reset
Extracted 833 gates and 1078 wires to a netlist network with 245 inputs and 96 outputs.

3.32.18.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.18.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               NOT cells:        4
ABC RESULTS:               XOR cells:       18
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:            ANDNOT cells:       12
ABC RESULTS:               NOR cells:        8
ABC RESULTS:                OR cells:       61
ABC RESULTS:             ORNOT cells:       14
ABC RESULTS:               MUX cells:      101
ABC RESULTS:              NAND cells:      333
ABC RESULTS:               AND cells:      199
ABC RESULTS:               BUF cells:       18
ABC RESULTS:        internal signals:      737
ABC RESULTS:           input signals:      245
ABC RESULTS:          output signals:       96
Removing temp directory.

3.32.19. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$53241$auto$opt_dff.cc:219:make_patterns_logic$22355, asynchronously reset by \reset
Extracted 196 gates and 349 wires to a netlist network with 153 inputs and 76 outputs.

3.32.19.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.19.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:               NOR cells:       20
ABC RESULTS:               NOT cells:        6
ABC RESULTS:               XOR cells:       26
ABC RESULTS:                OR cells:       17
ABC RESULTS:              NAND cells:       14
ABC RESULTS:             ORNOT cells:        7
ABC RESULTS:              XNOR cells:       32
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               AND cells:       61
ABC RESULTS:        internal signals:      120
ABC RESULTS:           input signals:      153
ABC RESULTS:          output signals:       76
Removing temp directory.

3.32.20. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$53477$auto$opt_dff.cc:219:make_patterns_logic$22237, asynchronously reset by \reset
Extracted 195 gates and 351 wires to a netlist network with 156 inputs and 80 outputs.

3.32.20.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.20.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:             ORNOT cells:        6
ABC RESULTS:               NOT cells:        7
ABC RESULTS:               XOR cells:       26
ABC RESULTS:               NOR cells:       16
ABC RESULTS:                OR cells:       19
ABC RESULTS:              NAND cells:       18
ABC RESULTS:              XNOR cells:       32
ABC RESULTS:               MUX cells:        2
ABC RESULTS:               AND cells:       58
ABC RESULTS:        internal signals:      115
ABC RESULTS:           input signals:      156
ABC RESULTS:          output signals:       80
Removing temp directory.

3.32.21. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$53690$auto$opt_dff.cc:194:make_patterns_logic$22113, asynchronously reset by \reset
Extracted 238 gates and 365 wires to a netlist network with 127 inputs and 97 outputs.

3.32.21.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.21.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       20
ABC RESULTS:            ANDNOT cells:       10
ABC RESULTS:               NOR cells:        6
ABC RESULTS:               NOT cells:       20
ABC RESULTS:               XOR cells:       21
ABC RESULTS:              XNOR cells:        7
ABC RESULTS:                OR cells:       37
ABC RESULTS:               MUX cells:       44
ABC RESULTS:             ORNOT cells:       19
ABC RESULTS:               AND cells:       36
ABC RESULTS:              NAND cells:       49
ABC RESULTS:               BUF cells:       18
ABC RESULTS:        internal signals:      141
ABC RESULTS:           input signals:      127
ABC RESULTS:          output signals:       97
Removing temp directory.

3.32.22. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$53852$auto$opt_dff.cc:194:make_patterns_logic$22095, asynchronously reset by \reset
Extracted 127 gates and 199 wires to a netlist network with 72 inputs and 97 outputs.

3.32.22.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.22.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       20
ABC RESULTS:               NOT cells:       21
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:            ANDNOT cells:       11
ABC RESULTS:               MUX cells:       22
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:                OR cells:       20
ABC RESULTS:               AND cells:       15
ABC RESULTS:               NOR cells:        6
ABC RESULTS:              NAND cells:       16
ABC RESULTS:               BUF cells:       38
ABC RESULTS:        internal signals:       30
ABC RESULTS:           input signals:       72
ABC RESULTS:          output signals:       97
Removing temp directory.

3.32.23. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$53996$auto$opt_dff.cc:219:make_patterns_logic$1563, asynchronously reset by \reset
Extracted 247 gates and 471 wires to a netlist network with 224 inputs and 65 outputs.

3.32.23.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.23.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       32
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               NOR cells:       12
ABC RESULTS:              NAND cells:       36
ABC RESULTS:               AND cells:       44
ABC RESULTS:                OR cells:       23
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:               XOR cells:       30
ABC RESULTS:               MUX cells:       63
ABC RESULTS:        internal signals:      182
ABC RESULTS:           input signals:      224
ABC RESULTS:          output signals:       65
Removing temp directory.

3.32.24. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$55082$lo02, asynchronously reset by \reset
Extracted 1646 gates and 2033 wires to a netlist network with 387 inputs and 98 outputs.

3.32.24.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.24.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       52
ABC RESULTS:              XNOR cells:       36
ABC RESULTS:               NOT cells:       42
ABC RESULTS:               XOR cells:       15
ABC RESULTS:            ANDNOT cells:       45
ABC RESULTS:             ORNOT cells:       55
ABC RESULTS:               NOR cells:       31
ABC RESULTS:              NAND cells:      723
ABC RESULTS:                OR cells:      230
ABC RESULTS:               AND cells:      365
ABC RESULTS:               MUX cells:      184
ABC RESULTS:        internal signals:     1548
ABC RESULTS:           input signals:      387
ABC RESULTS:          output signals:       98
Removing temp directory.

3.32.25. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, asynchronously reset by \reset
Extracted 489 gates and 644 wires to a netlist network with 155 inputs and 172 outputs.

3.32.25.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.25.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       76
ABC RESULTS:              XNOR cells:        7
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOR cells:       24
ABC RESULTS:             ORNOT cells:       16
ABC RESULTS:                OR cells:       13
ABC RESULTS:               AND cells:       58
ABC RESULTS:              NAND cells:       49
ABC RESULTS:               MUX cells:      126
ABC RESULTS:               BUF cells:        5
ABC RESULTS:            ANDNOT cells:       28
ABC RESULTS:               NOT cells:       74
ABC RESULTS:        internal signals:      317
ABC RESULTS:           input signals:      155
ABC RESULTS:          output signals:      172
Removing temp directory.

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  45 cells in clk=\clock, en=$abc$59946$abc$52019$auto$opt_dff.cc:219:make_patterns_logic$25713, arst=\reset, srst={ }
  45 cells in clk=\clock, en=$abc$60062$abc$52148$auto$opt_dff.cc:219:make_patterns_logic$25492, arst=\reset, srst={ }
  110 cells in clk=\clock, en=$abc$59988$abc$52059$auto$opt_dff.cc:219:make_patterns_logic$25574, arst=\reset, srst={ }
  737 cells in clk=\clock, en=$abc$57725$abc$49063$auto$opt_dff.cc:219:make_patterns_logic$32993, arst=\reset, srst={ }
  254 cells in clk=\clock, en=$abc$61226$abc$53477$auto$opt_dff.cc:219:make_patterns_logic$22237, arst=\reset, srst={ }
  116 cells in clk=\clock, en=$abc$60103$abc$52202$auto$opt_dff.cc:219:make_patterns_logic$25353, arst=\reset, srst={ }
  36 cells in clk=\clock, en=$abc$55908$abc$47284$auto$opt_dff.cc:219:make_patterns_logic$46897, arst=\reset, srst={ }
  638 cells in clk=\clock, en=$abc$59223$abc$51412$auto$opt_dff.cc:219:make_patterns_logic$25809, arst=\reset, srst={ }
  905 cells in clk=\clock, en=$abc$56780$abc$48266$auto$opt_dff.cc:219:make_patterns_logic$36160, arst=\reset, srst={ }
  258 cells in clk=\clock, en=$abc$61036$abc$53241$auto$opt_dff.cc:219:make_patterns_logic$22355, arst=\reset, srst={ }
  36 cells in clk=\clock, en=$abc$55954$abc$47324$auto$opt_dff.cc:219:make_patterns_logic$41917, arst=\reset, srst={ }
  175 cells in clk=\clock, en=$abc$61703$abc$53852$auto$opt_dff.cc:194:make_patterns_logic$22095, arst=\reset, srst={ }
  30 cells in clk=\clock, en=$abc$60200$abc$52302$auto$opt_dff.cc:219:make_patterns_logic$25271, arst=\reset, srst={ }
  835 cells in clk=\clock, en=$abc$55990$abc$47381$auto$opt_dff.cc:219:make_patterns_logic$39313, arst=\reset, srst={ }
  847 cells in clk=\clock, en=$abc$60234$abc$52336$auto$opt_dff.cc:219:make_patterns_logic$23517, arst=\reset, srst={ }
  952 cells in clk=\clock, en=$abc$58430$abc$50552$auto$opt_dff.cc:219:make_patterns_logic$28976, arst=\reset, srst={ }
  280 cells in clk=\clock, en=$abc$61415$abc$53690$auto$opt_dff.cc:194:make_patterns_logic$22113, arst=\reset, srst={ }
  169 cells in clk=\clock, en=$abc$61877$abc$53996$auto$opt_dff.cc:219:make_patterns_logic$1563, arst=\reset, srst={ }
  1719 cells in clk=\clock, en=$abc$63904$lo02, arst=\reset, srst={ }
  281 cells in clk=\clock, en=$abc$55667$abc$47002$auto$opt_dff.cc:219:make_patterns_logic$1602, arst=\reset, srst={ }
  36 cells in clk=\clock, en=$abc$55806$abc$47174$auto$opt_dff.cc:219:make_patterns_logic$46948, arst=\reset, srst={ }
  45 cells in clk=\clock, en=$abc$55840$abc$47211$auto$opt_dff.cc:219:make_patterns_logic$46931, arst=\reset, srst={ }
  33 cells in clk=\clock, en=$abc$55876$abc$47250$auto$opt_dff.cc:219:make_patterns_logic$46914, arst=\reset, srst={ }
  543 cells in clk=\clock, en={ }, arst=\reset, srst={ }

3.33.2. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$59946$abc$52019$auto$opt_dff.cc:219:make_patterns_logic$25713, asynchronously reset by \reset
Extracted 43 gates and 68 wires to a netlist network with 25 inputs and 13 outputs.

3.33.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:               MUX cells:        4
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:             ORNOT cells:        7
ABC RESULTS:                OR cells:        7
ABC RESULTS:              NAND cells:        6
ABC RESULTS:               AND cells:       12
ABC RESULTS:        internal signals:       30
ABC RESULTS:           input signals:       25
ABC RESULTS:          output signals:       13
Removing temp directory.

3.33.3. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$60062$abc$52148$auto$opt_dff.cc:219:make_patterns_logic$25492, asynchronously reset by \reset
Extracted 42 gates and 67 wires to a netlist network with 25 inputs and 16 outputs.

3.33.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:               XOR cells:        1
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:                OR cells:        4
ABC RESULTS:               NOR cells:        3
ABC RESULTS:               MUX cells:        5
ABC RESULTS:              NAND cells:       12
ABC RESULTS:               AND cells:        9
ABC RESULTS:        internal signals:       26
ABC RESULTS:           input signals:       25
ABC RESULTS:          output signals:       16
Removing temp directory.

3.33.4. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$59988$abc$52059$auto$opt_dff.cc:219:make_patterns_logic$25574, asynchronously reset by \reset
Extracted 100 gates and 158 wires to a netlist network with 58 inputs and 36 outputs.

3.33.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOR cells:        6
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:                OR cells:        7
ABC RESULTS:               XOR cells:        3
ABC RESULTS:              XNOR cells:        3
ABC RESULTS:               NOT cells:        6
ABC RESULTS:               MUX cells:       17
ABC RESULTS:            ANDNOT cells:        5
ABC RESULTS:              NAND cells:       29
ABC RESULTS:               AND cells:       18
ABC RESULTS:        internal signals:       64
ABC RESULTS:           input signals:       58
ABC RESULTS:          output signals:       36
Removing temp directory.

3.33.5. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$57725$abc$49063$auto$opt_dff.cc:219:make_patterns_logic$32993, asynchronously reset by \reset
Extracted 709 gates and 926 wires to a netlist network with 217 inputs and 111 outputs.

3.33.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:              XNOR cells:        7
ABC RESULTS:               XOR cells:        3
ABC RESULTS:               NOT cells:       19
ABC RESULTS:               NOR cells:       24
ABC RESULTS:             ORNOT cells:       37
ABC RESULTS:            ANDNOT cells:       17
ABC RESULTS:               MUX cells:      122
ABC RESULTS:              NAND cells:      251
ABC RESULTS:                OR cells:       44
ABC RESULTS:               AND cells:      184
ABC RESULTS:               BUF cells:       21
ABC RESULTS:        internal signals:      598
ABC RESULTS:           input signals:      217
ABC RESULTS:          output signals:      111
Removing temp directory.

3.33.6. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$61226$abc$53477$auto$opt_dff.cc:219:make_patterns_logic$22237, asynchronously reset by \reset
Extracted 183 gates and 334 wires to a netlist network with 151 inputs and 75 outputs.

3.33.6.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.6.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:             ORNOT cells:        7
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               NOT cells:        6
ABC RESULTS:               XOR cells:       26
ABC RESULTS:                OR cells:       15
ABC RESULTS:               NOR cells:       16
ABC RESULTS:              NAND cells:       18
ABC RESULTS:              XNOR cells:       32
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               AND cells:       57
ABC RESULTS:        internal signals:      108
ABC RESULTS:           input signals:      151
ABC RESULTS:          output signals:       75
Removing temp directory.

3.33.7. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$60103$abc$52202$auto$opt_dff.cc:219:make_patterns_logic$25353, asynchronously reset by \reset
Extracted 106 gates and 178 wires to a netlist network with 72 inputs and 36 outputs.

3.33.7.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.7.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              XNOR cells:        3
ABC RESULTS:                OR cells:        9
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOT cells:        5
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               NOR cells:        5
ABC RESULTS:               MUX cells:       29
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:              NAND cells:       21
ABC RESULTS:               AND cells:       19
ABC RESULTS:        internal signals:       70
ABC RESULTS:           input signals:       72
ABC RESULTS:          output signals:       36
Removing temp directory.

3.33.8. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$55908$abc$47284$auto$opt_dff.cc:219:make_patterns_logic$46897, asynchronously reset by \reset
Extracted 32 gates and 50 wires to a netlist network with 18 inputs and 5 outputs.

3.33.8.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.8.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               AND cells:       10
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:                OR cells:        6
ABC RESULTS:              NAND cells:        7
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       27
ABC RESULTS:           input signals:       18
ABC RESULTS:          output signals:        5
Removing temp directory.

3.33.9. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$59223$abc$51412$auto$opt_dff.cc:219:make_patterns_logic$25809, asynchronously reset by \reset
Extracted 616 gates and 822 wires to a netlist network with 206 inputs and 91 outputs.

3.33.9.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.9.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               NOT cells:       14
ABC RESULTS:               NOR cells:        3
ABC RESULTS:            ANDNOT cells:        8
ABC RESULTS:               XOR cells:        1
ABC RESULTS:              XNOR cells:       14
ABC RESULTS:                OR cells:       14
ABC RESULTS:             ORNOT cells:        8
ABC RESULTS:               MUX cells:      120
ABC RESULTS:              NAND cells:      328
ABC RESULTS:               AND cells:      118
ABC RESULTS:               BUF cells:       13
ABC RESULTS:        internal signals:      525
ABC RESULTS:           input signals:      206
ABC RESULTS:          output signals:       91
Removing temp directory.

3.33.10. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$56780$abc$48266$auto$opt_dff.cc:219:make_patterns_logic$36160, asynchronously reset by \reset
Extracted 850 gates and 1073 wires to a netlist network with 223 inputs and 165 outputs.

3.33.10.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.10.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:              XNOR cells:       36
ABC RESULTS:               XOR cells:       27
ABC RESULTS:               NOT cells:       32
ABC RESULTS:            ANDNOT cells:       11
ABC RESULTS:             ORNOT cells:        6
ABC RESULTS:                OR cells:       52
ABC RESULTS:               MUX cells:       74
ABC RESULTS:               NOR cells:       34
ABC RESULTS:              NAND cells:      353
ABC RESULTS:               AND cells:      185
ABC RESULTS:               BUF cells:       18
ABC RESULTS:        internal signals:      685
ABC RESULTS:           input signals:      223
ABC RESULTS:          output signals:      165
Removing temp directory.

3.33.11. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$61036$abc$53241$auto$opt_dff.cc:219:make_patterns_logic$22355, asynchronously reset by \reset
Extracted 187 gates and 340 wires to a netlist network with 153 inputs and 74 outputs.

3.33.11.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.11.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:             ORNOT cells:        6
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:               NOT cells:        6
ABC RESULTS:               XOR cells:       26
ABC RESULTS:                OR cells:       12
ABC RESULTS:               NOR cells:       20
ABC RESULTS:              NAND cells:       17
ABC RESULTS:              XNOR cells:       32
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               AND cells:       59
ABC RESULTS:        internal signals:      113
ABC RESULTS:           input signals:      153
ABC RESULTS:          output signals:       74
Removing temp directory.

3.33.12. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$55954$abc$47324$auto$opt_dff.cc:219:make_patterns_logic$41917, asynchronously reset by \reset
Extracted 32 gates and 49 wires to a netlist network with 17 inputs and 10 outputs.

3.33.12.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.12.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:                OR cells:        4
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               MUX cells:        2
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:              NAND cells:        9
ABC RESULTS:               AND cells:        9
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       22
ABC RESULTS:           input signals:       17
ABC RESULTS:          output signals:       10
Removing temp directory.

3.33.13. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$61703$abc$53852$auto$opt_dff.cc:194:make_patterns_logic$22095, asynchronously reset by \reset
Extracted 173 gates and 276 wires to a netlist network with 103 inputs and 92 outputs.

3.33.13.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.13.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       20
ABC RESULTS:               NOT cells:       20
ABC RESULTS:            ANDNOT cells:       11
ABC RESULTS:               XOR cells:        9
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:               NOR cells:        8
ABC RESULTS:                OR cells:       20
ABC RESULTS:              NAND cells:       23
ABC RESULTS:               AND cells:       19
ABC RESULTS:               MUX cells:       43
ABC RESULTS:               BUF cells:       24
ABC RESULTS:        internal signals:       81
ABC RESULTS:           input signals:      103
ABC RESULTS:          output signals:       92
Removing temp directory.

3.33.14. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$60200$abc$52302$auto$opt_dff.cc:219:make_patterns_logic$25271, asynchronously reset by \reset
Extracted 26 gates and 47 wires to a netlist network with 21 inputs and 11 outputs.

3.33.14.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.14.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               MUX cells:        3
ABC RESULTS:                OR cells:        5
ABC RESULTS:               AND cells:        8
ABC RESULTS:              NAND cells:        7
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       15
ABC RESULTS:           input signals:       21
ABC RESULTS:          output signals:       11
Removing temp directory.

3.33.15. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$55990$abc$47381$auto$opt_dff.cc:219:make_patterns_logic$39313, asynchronously reset by \reset
Extracted 803 gates and 1052 wires to a netlist network with 249 inputs and 107 outputs.

3.33.15.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.15.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:              XNOR cells:        3
ABC RESULTS:               XOR cells:       24
ABC RESULTS:               NOT cells:       29
ABC RESULTS:               NOR cells:        9
ABC RESULTS:            ANDNOT cells:        8
ABC RESULTS:               MUX cells:       94
ABC RESULTS:             ORNOT cells:       46
ABC RESULTS:                OR cells:       69
ABC RESULTS:               AND cells:      142
ABC RESULTS:              NAND cells:      353
ABC RESULTS:               BUF cells:       17
ABC RESULTS:        internal signals:      696
ABC RESULTS:           input signals:      249
ABC RESULTS:          output signals:      107
Removing temp directory.

3.33.16. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$60234$abc$52336$auto$opt_dff.cc:219:make_patterns_logic$23517, asynchronously reset by \reset
Extracted 807 gates and 1045 wires to a netlist network with 238 inputs and 118 outputs.

3.33.16.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.16.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               NOT cells:       25
ABC RESULTS:               XOR cells:       18
ABC RESULTS:              XNOR cells:        4
ABC RESULTS:            ANDNOT cells:       18
ABC RESULTS:               NOR cells:       13
ABC RESULTS:                OR cells:       74
ABC RESULTS:             ORNOT cells:       14
ABC RESULTS:               MUX cells:       72
ABC RESULTS:              NAND cells:      364
ABC RESULTS:               AND cells:      204
ABC RESULTS:               BUF cells:       18
ABC RESULTS:        internal signals:      689
ABC RESULTS:           input signals:      238
ABC RESULTS:          output signals:      118
Removing temp directory.

3.33.17. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$58430$abc$50552$auto$opt_dff.cc:219:make_patterns_logic$28976, asynchronously reset by \reset
Extracted 863 gates and 1109 wires to a netlist network with 246 inputs and 223 outputs.

3.33.17.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.17.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               XOR cells:       19
ABC RESULTS:            ANDNOT cells:        8
ABC RESULTS:              XNOR cells:       45
ABC RESULTS:               NOT cells:       50
ABC RESULTS:                OR cells:       24
ABC RESULTS:             ORNOT cells:       22
ABC RESULTS:               NOR cells:       30
ABC RESULTS:               MUX cells:      120
ABC RESULTS:              NAND cells:      283
ABC RESULTS:               AND cells:      177
ABC RESULTS:               BUF cells:       30
ABC RESULTS:        internal signals:      640
ABC RESULTS:           input signals:      246
ABC RESULTS:          output signals:      223
Removing temp directory.

3.33.18. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$61415$abc$53690$auto$opt_dff.cc:194:make_patterns_logic$22113, asynchronously reset by \reset
Extracted 258 gates and 375 wires to a netlist network with 117 inputs and 90 outputs.

3.33.18.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.18.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       20
ABC RESULTS:               NOR cells:        7
ABC RESULTS:               NOT cells:       20
ABC RESULTS:               XOR cells:       12
ABC RESULTS:               AND cells:       19
ABC RESULTS:              XNOR cells:        6
ABC RESULTS:            ANDNOT cells:       29
ABC RESULTS:               MUX cells:       43
ABC RESULTS:                OR cells:       52
ABC RESULTS:              NAND cells:       52
ABC RESULTS:               BUF cells:       19
ABC RESULTS:        internal signals:      168
ABC RESULTS:           input signals:      117
ABC RESULTS:          output signals:       90
Removing temp directory.

3.33.19. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$61877$abc$53996$auto$opt_dff.cc:219:make_patterns_logic$1563, asynchronously reset by \reset
Extracted 137 gates and 270 wires to a netlist network with 133 inputs and 64 outputs.

3.33.19.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.19.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       32
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:                OR cells:        2
ABC RESULTS:               AND cells:        2
ABC RESULTS:               NOR cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:              XNOR cells:        4
ABC RESULTS:               XOR cells:       30
ABC RESULTS:               MUX cells:       63
ABC RESULTS:        internal signals:       73
ABC RESULTS:           input signals:      133
ABC RESULTS:          output signals:       64
Removing temp directory.

3.33.20. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$63904$lo02, asynchronously reset by \reset
Extracted 1717 gates and 2089 wires to a netlist network with 372 inputs and 99 outputs.

3.33.20.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.20.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       52
ABC RESULTS:               NOT cells:       17
ABC RESULTS:              XNOR cells:       36
ABC RESULTS:               XOR cells:       15
ABC RESULTS:            ANDNOT cells:       41
ABC RESULTS:               NOR cells:       26
ABC RESULTS:               MUX cells:      112
ABC RESULTS:             ORNOT cells:       89
ABC RESULTS:                OR cells:      181
ABC RESULTS:               AND cells:      361
ABC RESULTS:              NAND cells:      652
ABC RESULTS:               BUF cells:        5
ABC RESULTS:        internal signals:     1618
ABC RESULTS:           input signals:      372
ABC RESULTS:          output signals:       99
Removing temp directory.

3.33.21. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$55667$abc$47002$auto$opt_dff.cc:219:make_patterns_logic$1602, asynchronously reset by \reset
Extracted 249 gates and 473 wires to a netlist network with 224 inputs and 65 outputs.

3.33.21.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.21.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       32
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               NOR cells:       12
ABC RESULTS:              NAND cells:       37
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               AND cells:       42
ABC RESULTS:                OR cells:       23
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:               XOR cells:       30
ABC RESULTS:               MUX cells:       63
ABC RESULTS:        internal signals:      184
ABC RESULTS:           input signals:      224
ABC RESULTS:          output signals:       65
Removing temp directory.

3.33.22. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$55806$abc$47174$auto$opt_dff.cc:219:make_patterns_logic$46948, asynchronously reset by \reset
Extracted 31 gates and 51 wires to a netlist network with 20 inputs and 7 outputs.

3.33.22.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.22.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               MUX cells:        3
ABC RESULTS:              NAND cells:       11
ABC RESULTS:               AND cells:       10
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       24
ABC RESULTS:           input signals:       20
ABC RESULTS:          output signals:        7
Removing temp directory.

3.33.23. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$55840$abc$47211$auto$opt_dff.cc:219:make_patterns_logic$46931, asynchronously reset by \reset
Extracted 44 gates and 63 wires to a netlist network with 19 inputs and 15 outputs.

3.33.23.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.23.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        6
ABC RESULTS:                OR cells:        3
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:               NOR cells:        3
ABC RESULTS:               AND cells:       11
ABC RESULTS:              NAND cells:       13
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       29
ABC RESULTS:           input signals:       19
ABC RESULTS:          output signals:       15
Removing temp directory.

3.33.24. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$55876$abc$47250$auto$opt_dff.cc:219:make_patterns_logic$46914, asynchronously reset by \reset
Extracted 32 gates and 51 wires to a netlist network with 19 inputs and 7 outputs.

3.33.24.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.24.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               MUX cells:        2
ABC RESULTS:              NAND cells:       11
ABC RESULTS:               AND cells:        9
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       25
ABC RESULTS:           input signals:       19
ABC RESULTS:          output signals:        7
Removing temp directory.

3.33.25. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, asynchronously reset by \reset
Extracted 473 gates and 625 wires to a netlist network with 152 inputs and 169 outputs.

3.33.25.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.25.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       76
ABC RESULTS:              XNOR cells:        7
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOR cells:       25
ABC RESULTS:            ANDNOT cells:       22
ABC RESULTS:                OR cells:       10
ABC RESULTS:               AND cells:       59
ABC RESULTS:              NAND cells:       49
ABC RESULTS:             ORNOT cells:       17
ABC RESULTS:               MUX cells:      127
ABC RESULTS:               BUF cells:        5
ABC RESULTS:               NOT cells:       70
ABC RESULTS:        internal signals:      304
ABC RESULTS:           input signals:      152
ABC RESULTS:          output signals:      169
Removing temp directory.

yosys> opt_ffinv

3.34. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.35. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.35.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~219 debug messages>

yosys> opt_merge -nomux

3.35.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
<suppressed ~522 debug messages>
Removed a total of 174 cells.

yosys> opt_muxtree

3.35.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.35.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.35.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.35.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67420 ($_DFFE_PP0P_) from module b21 (D = $abc$67405$li14_li14, Q = $abc$67405$lo14).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67422 ($_DFFE_PP0P_) from module b21 (D = $abc$67405$li16_li16, Q = $abc$67405$lo16).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67425 ($_DFFE_PP0P_) from module b21 (D = $abc$67405$li19_li19, Q = $abc$67405$lo19).

yosys> opt_clean

3.35.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 3 unused cells and 29200 unused wires.
<suppressed ~24 debug messages>

yosys> opt_expr

3.35.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~9 debug messages>

3.35.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.35.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.35.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.35.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
<suppressed ~42 debug messages>
Removed a total of 14 cells.

yosys> opt_dff -sat

3.35.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67424 ($_DFFE_PP0P_) from module b21 (D = $abc$49680$flatten\P2.$verific$n11253$859[8], Q = $abc$67405$lo18).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67419 ($_DFFE_PP0P_) from module b21 (D = $abc$49680$flatten\P2.$verific$n11253$859[5], Q = $abc$67405$lo13).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67417 ($_DFFE_PP0P_) from module b21 (D = $abc$49680$flatten\P2.$verific$n11253$859[17], Q = $abc$53852$lo18).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67416 ($_DFFE_PP0P_) from module b21 (D = $abc$49680$flatten\P2.$verific$n11253$859[13], Q = $abc$53852$lo14).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67415 ($_DFFE_PP0P_) from module b21 (D = $abc$49680$flatten\P2.$verific$n11253$859[14], Q = $abc$53852$lo15).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67414 ($_DFFE_PP0P_) from module b21 (D = $abc$49680$flatten\P2.$verific$n11253$859[7], Q = $abc$53852$lo08).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67412 ($_DFFE_PP0P_) from module b21 (D = $abc$49680$flatten\P2.$verific$n11253$859[3], Q = $abc$53852$lo04).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67411 ($_DFFE_PP0P_) from module b21 (D = $abc$49680$flatten\P2.$verific$n11253$859[18], Q = $abc$53852$lo19).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67410 ($_DFFE_PP0P_) from module b21 (D = $abc$49680$flatten\P2.$verific$n11253$859[9], Q = $abc$53852$lo10).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67409 ($_DFFE_PP0P_) from module b21 (D = $abc$49680$flatten\P2.$verific$n11253$859[6], Q = $abc$53852$lo07).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67408 ($_DFFE_PP0P_) from module b21 (D = $abc$52202$flatten\P2.$verific$n11253$859[2], Q = $abc$53852$lo03).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67407 ($_DFFE_PP0P_) from module b21 (D = $abc$52202$flatten\P2.$verific$n11253$859[1], Q = $abc$53852$lo02).
Adding EN signal on $abc$67405$auto$blifparse.cc:362:parse_blif$67406 ($_DFFE_PP0P_) from module b21 (D = $abc$49680$flatten\P2.$verific$n11253$859[4], Q = $abc$67405$lo00).

yosys> opt_clean

3.35.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 43 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.35.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~52 debug messages>

3.35.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.35.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.35.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.35.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
<suppressed ~255 debug messages>
Removed a total of 85 cells.

yosys> opt_dff -sat

3.35.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.35.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 86 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.35.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.35.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.35.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.35.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.35.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.35.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.35.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..

yosys> opt_expr

3.35.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.35.30. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  28 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$73276, arst=\reset, srst={ }
  146 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$73086, arst=\reset, srst={ }
  34 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$73015, arst=\reset, srst={ }
  594 cells in clk=\clock, en={ }, arst=\reset, srst={ }
  31 cells in clk=\clock, en=$abc$47250$auto$opt_dff.cc:219:make_patterns_logic$46914, arst=\reset, srst={ }
  40 cells in clk=\clock, en=$abc$47211$auto$opt_dff.cc:219:make_patterns_logic$46931, arst=\reset, srst={ }
  32 cells in clk=\clock, en=$abc$47174$auto$opt_dff.cc:219:make_patterns_logic$46948, arst=\reset, srst={ }
  168 cells in clk=\clock, en=$abc$47002$auto$opt_dff.cc:219:make_patterns_logic$1602, arst=\reset, srst={ }
  1527 cells in clk=\clock, en=\P1.state, arst=\reset, srst={ }
  282 cells in clk=\clock, en=$abc$53996$auto$opt_dff.cc:219:make_patterns_logic$1563, arst=\reset, srst={ }
  270 cells in clk=\clock, en=$abc$53690$auto$opt_dff.cc:194:make_patterns_logic$22113, arst=\reset, srst={ }
  813 cells in clk=\clock, en=$abc$50552$auto$opt_dff.cc:219:make_patterns_logic$28976, arst=\reset, srst={ }
  884 cells in clk=\clock, en=$abc$52336$auto$opt_dff.cc:219:make_patterns_logic$23517, arst=\reset, srst={ }
  882 cells in clk=\clock, en=$abc$47381$auto$opt_dff.cc:219:make_patterns_logic$39313, arst=\reset, srst={ }
  56 cells in clk=\clock, en=$abc$52302$auto$opt_dff.cc:219:make_patterns_logic$25271, arst=\reset, srst={ }
  70 cells in clk=\clock, en=$abc$53852$auto$opt_dff.cc:194:make_patterns_logic$22095, arst=\reset, srst={ }
  45 cells in clk=\clock, en=$abc$47324$auto$opt_dff.cc:219:make_patterns_logic$41917, arst=\reset, srst={ }
  237 cells in clk=\clock, en=$abc$53241$auto$opt_dff.cc:219:make_patterns_logic$22355, arst=\reset, srst={ }
  802 cells in clk=\clock, en=$abc$48266$auto$opt_dff.cc:219:make_patterns_logic$36160, arst=\reset, srst={ }
  626 cells in clk=\clock, en=$abc$51412$auto$opt_dff.cc:219:make_patterns_logic$25809, arst=\reset, srst={ }
  47 cells in clk=\clock, en=$abc$47284$auto$opt_dff.cc:219:make_patterns_logic$46897, arst=\reset, srst={ }
  69 cells in clk=\clock, en=$abc$52202$auto$opt_dff.cc:219:make_patterns_logic$25353, arst=\reset, srst={ }
  214 cells in clk=\clock, en=$abc$53477$auto$opt_dff.cc:219:make_patterns_logic$22237, arst=\reset, srst={ }
  754 cells in clk=\clock, en=$abc$49063$auto$opt_dff.cc:219:make_patterns_logic$32993, arst=\reset, srst={ }
  90 cells in clk=\clock, en=$abc$52059$auto$opt_dff.cc:219:make_patterns_logic$25574, arst=\reset, srst={ }
  57 cells in clk=\clock, en=$abc$52148$auto$opt_dff.cc:219:make_patterns_logic$25492, arst=\reset, srst={ }
  48 cells in clk=\clock, en=$abc$52019$auto$opt_dff.cc:219:make_patterns_logic$25713, arst=\reset, srst={ }

3.36.2. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$73276, asynchronously reset by \reset
Extracted 28 gates and 51 wires to a netlist network with 22 inputs and 8 outputs.

3.36.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               XOR cells:        2
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:               MUX cells:        6
ABC RESULTS:                OR cells:        5
ABC RESULTS:               AND cells:        4
ABC RESULTS:              NAND cells:        8
ABC RESULTS:        internal signals:       21
ABC RESULTS:           input signals:       22
ABC RESULTS:          output signals:        8
Removing temp directory.

3.36.3. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$73086, asynchronously reset by \reset
Extracted 144 gates and 238 wires to a netlist network with 93 inputs and 48 outputs.

3.36.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       11
ABC RESULTS:               NOT cells:       11
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:                OR cells:       10
ABC RESULTS:               XOR cells:       12
ABC RESULTS:            ANDNOT cells:       11
ABC RESULTS:              NAND cells:       10
ABC RESULTS:               AND cells:       21
ABC RESULTS:               MUX cells:       51
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       97
ABC RESULTS:           input signals:       93
ABC RESULTS:          output signals:       48
Removing temp directory.

3.36.4. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$73015, asynchronously reset by \reset
Extracted 34 gates and 65 wires to a netlist network with 30 inputs and 12 outputs.

3.36.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        3
ABC RESULTS:               NOT cells:        3
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               XOR cells:        3
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               MUX cells:        9
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:              NAND cells:        7
ABC RESULTS:                OR cells:        4
ABC RESULTS:               AND cells:        8
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       23
ABC RESULTS:           input signals:       30
ABC RESULTS:          output signals:       12
Removing temp directory.

3.36.5. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, asynchronously reset by \reset
Extracted 524 gates and 718 wires to a netlist network with 194 inputs and 201 outputs.

3.36.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       76
ABC RESULTS:              XNOR cells:        9
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOR cells:       25
ABC RESULTS:            ANDNOT cells:       20
ABC RESULTS:             ORNOT cells:       45
ABC RESULTS:                OR cells:       10
ABC RESULTS:               AND cells:       74
ABC RESULTS:              NAND cells:       55
ABC RESULTS:               MUX cells:      134
ABC RESULTS:               BUF cells:        1
ABC RESULTS:               NOT cells:       73
ABC RESULTS:        internal signals:      323
ABC RESULTS:           input signals:      194
ABC RESULTS:          output signals:      201
Removing temp directory.

3.36.6. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47250$auto$opt_dff.cc:219:make_patterns_logic$46914, asynchronously reset by \reset
Extracted 30 gates and 49 wires to a netlist network with 19 inputs and 8 outputs.

3.36.6.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.6.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               MUX cells:        3
ABC RESULTS:              NAND cells:       11
ABC RESULTS:               AND cells:        8
ABC RESULTS:        internal signals:       22
ABC RESULTS:           input signals:       19
ABC RESULTS:          output signals:        8
Removing temp directory.

3.36.7. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47211$auto$opt_dff.cc:219:make_patterns_logic$46931, asynchronously reset by \reset
Extracted 40 gates and 59 wires to a netlist network with 19 inputs and 8 outputs.

3.36.7.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.7.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:                OR cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               MUX cells:        3
ABC RESULTS:               AND cells:        8
ABC RESULTS:              NAND cells:        9
ABC RESULTS:        internal signals:       32
ABC RESULTS:           input signals:       19
ABC RESULTS:          output signals:        8
Removing temp directory.

3.36.8. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47174$auto$opt_dff.cc:219:make_patterns_logic$46948, asynchronously reset by \reset
Extracted 28 gates and 46 wires to a netlist network with 18 inputs and 4 outputs.

3.36.8.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.8.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               MUX cells:        2
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:              NAND cells:       11
ABC RESULTS:               AND cells:       10
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       24
ABC RESULTS:           input signals:       18
ABC RESULTS:          output signals:        4
Removing temp directory.

3.36.9. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47002$auto$opt_dff.cc:219:make_patterns_logic$1602, asynchronously reset by \reset
Extracted 136 gates and 269 wires to a netlist network with 133 inputs and 95 outputs.

3.36.9.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.9.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       32
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:                OR cells:        3
ABC RESULTS:               AND cells:        3
ABC RESULTS:               NOR cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:              XNOR cells:        4
ABC RESULTS:               XOR cells:       30
ABC RESULTS:               MUX cells:       95
ABC RESULTS:        internal signals:       41
ABC RESULTS:           input signals:      133
ABC RESULTS:          output signals:       95
Removing temp directory.

3.36.10. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$73622$lo02, asynchronously reset by \reset
Extracted 1506 gates and 1858 wires to a netlist network with 352 inputs and 138 outputs.

3.36.10.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.10.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       52
ABC RESULTS:              XNOR cells:       45
ABC RESULTS:               XOR cells:       13
ABC RESULTS:               NOT cells:       28
ABC RESULTS:            ANDNOT cells:       46
ABC RESULTS:               NOR cells:       27
ABC RESULTS:             ORNOT cells:       60
ABC RESULTS:               MUX cells:       54
ABC RESULTS:                OR cells:      178
ABC RESULTS:               AND cells:      336
ABC RESULTS:              NAND cells:      645
ABC RESULTS:               BUF cells:       34
ABC RESULTS:        internal signals:     1368
ABC RESULTS:           input signals:      352
ABC RESULTS:          output signals:      138
Removing temp directory.

3.36.11. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$53996$auto$opt_dff.cc:219:make_patterns_logic$1563, asynchronously reset by \reset
Extracted 250 gates and 474 wires to a netlist network with 224 inputs and 96 outputs.

3.36.11.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.11.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       32
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               NOR cells:       12
ABC RESULTS:              NAND cells:       36
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               AND cells:       43
ABC RESULTS:                OR cells:       23
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:               XOR cells:       30
ABC RESULTS:               MUX cells:       95
ABC RESULTS:        internal signals:      154
ABC RESULTS:           input signals:      224
ABC RESULTS:          output signals:       96
Removing temp directory.

3.36.12. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$53690$auto$opt_dff.cc:194:make_patterns_logic$22113, asynchronously reset by \reset
Extracted 249 gates and 358 wires to a netlist network with 109 inputs and 82 outputs.

3.36.12.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.12.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       20
ABC RESULTS:               NOR cells:        7
ABC RESULTS:               XOR cells:        3
ABC RESULTS:               NOT cells:       20
ABC RESULTS:               AND cells:       18
ABC RESULTS:              XNOR cells:        7
ABC RESULTS:            ANDNOT cells:       30
ABC RESULTS:               MUX cells:       42
ABC RESULTS:                OR cells:       52
ABC RESULTS:              NAND cells:       52
ABC RESULTS:               BUF cells:       19
ABC RESULTS:        internal signals:      167
ABC RESULTS:           input signals:      109
ABC RESULTS:          output signals:       82
Removing temp directory.

3.36.13. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$50552$auto$opt_dff.cc:219:make_patterns_logic$28976, asynchronously reset by \reset
Extracted 711 gates and 958 wires to a netlist network with 247 inputs and 155 outputs.

3.36.13.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.13.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:              XNOR cells:        8
ABC RESULTS:               NOT cells:       23
ABC RESULTS:               XOR cells:       39
ABC RESULTS:            ANDNOT cells:        6
ABC RESULTS:               NOR cells:        3
ABC RESULTS:               MUX cells:       68
ABC RESULTS:             ORNOT cells:       27
ABC RESULTS:                OR cells:       57
ABC RESULTS:              NAND cells:      325
ABC RESULTS:               AND cells:      177
ABC RESULTS:               BUF cells:       18
ABC RESULTS:        internal signals:      556
ABC RESULTS:           input signals:      247
ABC RESULTS:          output signals:      155
Removing temp directory.

3.36.14. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$52336$auto$opt_dff.cc:219:make_patterns_logic$23517, asynchronously reset by \reset
Extracted 845 gates and 1061 wires to a netlist network with 216 inputs and 133 outputs.

3.36.14.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.14.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:              XNOR cells:       15
ABC RESULTS:               XOR cells:       19
ABC RESULTS:            ANDNOT cells:       19
ABC RESULTS:               NOT cells:       33
ABC RESULTS:                OR cells:       67
ABC RESULTS:               NOR cells:        6
ABC RESULTS:             ORNOT cells:       21
ABC RESULTS:               MUX cells:       68
ABC RESULTS:              NAND cells:      360
ABC RESULTS:               AND cells:      203
ABC RESULTS:               BUF cells:       18
ABC RESULTS:        internal signals:      712
ABC RESULTS:           input signals:      216
ABC RESULTS:          output signals:      133
Removing temp directory.

3.36.15. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47381$auto$opt_dff.cc:219:make_patterns_logic$39313, asynchronously reset by \reset
Extracted 816 gates and 1075 wires to a netlist network with 259 inputs and 132 outputs.

3.36.15.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.15.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               XOR cells:       27
ABC RESULTS:              XNOR cells:       13
ABC RESULTS:               NOT cells:       34
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               NOR cells:        5
ABC RESULTS:               MUX cells:      103
ABC RESULTS:             ORNOT cells:       44
ABC RESULTS:                OR cells:       64
ABC RESULTS:               AND cells:      135
ABC RESULTS:              NAND cells:      355
ABC RESULTS:               BUF cells:       17
ABC RESULTS:        internal signals:      684
ABC RESULTS:           input signals:      259
ABC RESULTS:          output signals:      132
Removing temp directory.

3.36.16. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$52302$auto$opt_dff.cc:219:make_patterns_logic$25271, asynchronously reset by \reset
Extracted 52 gates and 92 wires to a netlist network with 40 inputs and 19 outputs.

3.36.16.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.16.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               NOR cells:        8
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               AND cells:       10
ABC RESULTS:             ORNOT cells:        5
ABC RESULTS:               MUX cells:        3
ABC RESULTS:                OR cells:       12
ABC RESULTS:              NAND cells:       11
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       33
ABC RESULTS:           input signals:       40
ABC RESULTS:          output signals:       19
Removing temp directory.

3.36.17. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$53852$auto$opt_dff.cc:194:make_patterns_logic$22095, asynchronously reset by \reset
Extracted 67 gates and 116 wires to a netlist network with 49 inputs and 28 outputs.

3.36.17.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.17.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        4
ABC RESULTS:               NOT cells:        5
ABC RESULTS:               NOR cells:        5
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:               MUX cells:        6
ABC RESULTS:              XNOR cells:        3
ABC RESULTS:                OR cells:       11
ABC RESULTS:               AND cells:        7
ABC RESULTS:              NAND cells:       17
ABC RESULTS:               BUF cells:        6
ABC RESULTS:        internal signals:       39
ABC RESULTS:           input signals:       49
ABC RESULTS:          output signals:       28
Removing temp directory.

3.36.18. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47324$auto$opt_dff.cc:219:make_patterns_logic$41917, asynchronously reset by \reset
Extracted 39 gates and 66 wires to a netlist network with 27 inputs and 16 outputs.

3.36.18.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.18.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:                OR cells:        5
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOR cells:        2
ABC RESULTS:               MUX cells:        4
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:              NAND cells:        8
ABC RESULTS:               AND cells:       10
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       23
ABC RESULTS:           input signals:       27
ABC RESULTS:          output signals:       16
Removing temp directory.

3.36.19. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$53241$auto$opt_dff.cc:219:make_patterns_logic$22355, asynchronously reset by \reset
Extracted 166 gates and 304 wires to a netlist network with 138 inputs and 54 outputs.

3.36.19.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.19.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        6
ABC RESULTS:               NOT cells:        6
ABC RESULTS:               XOR cells:       16
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:               NOR cells:       16
ABC RESULTS:                OR cells:       10
ABC RESULTS:              NAND cells:       14
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               AND cells:       57
ABC RESULTS:               BUF cells:        1
ABC RESULTS:              XNOR cells:       25
ABC RESULTS:        internal signals:      112
ABC RESULTS:           input signals:      138
ABC RESULTS:          output signals:       54
Removing temp directory.

3.36.20. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$48266$auto$opt_dff.cc:219:make_patterns_logic$36160, asynchronously reset by \reset
Extracted 784 gates and 1012 wires to a netlist network with 228 inputs and 113 outputs.

3.36.20.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.20.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               XOR cells:       18
ABC RESULTS:               NOT cells:       11
ABC RESULTS:              XNOR cells:       16
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:            ANDNOT cells:        9
ABC RESULTS:               MUX cells:       64
ABC RESULTS:                OR cells:       64
ABC RESULTS:               NOR cells:       36
ABC RESULTS:              NAND cells:      359
ABC RESULTS:               AND cells:      181
ABC RESULTS:               BUF cells:       17
ABC RESULTS:        internal signals:      671
ABC RESULTS:           input signals:      228
ABC RESULTS:          output signals:      113
Removing temp directory.

3.36.21. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$51412$auto$opt_dff.cc:219:make_patterns_logic$25809, asynchronously reset by \reset
Extracted 626 gates and 798 wires to a netlist network with 172 inputs and 112 outputs.

3.36.21.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.21.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               NOT cells:       11
ABC RESULTS:              XNOR cells:       16
ABC RESULTS:            ANDNOT cells:        7
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:                OR cells:       18
ABC RESULTS:               MUX cells:       87
ABC RESULTS:              NAND cells:      332
ABC RESULTS:               AND cells:      123
ABC RESULTS:               BUF cells:       31
ABC RESULTS:        internal signals:      514
ABC RESULTS:           input signals:      172
ABC RESULTS:          output signals:      112
Removing temp directory.

3.36.22. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$47284$auto$opt_dff.cc:219:make_patterns_logic$46897, asynchronously reset by \reset
Extracted 43 gates and 68 wires to a netlist network with 25 inputs and 9 outputs.

3.36.22.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.22.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:                OR cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               AND cells:       14
ABC RESULTS:            ANDNOT cells:        5
ABC RESULTS:             ORNOT cells:        5
ABC RESULTS:              NAND cells:       13
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       34
ABC RESULTS:           input signals:       25
ABC RESULTS:          output signals:        9
Removing temp directory.

3.36.23. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$52202$auto$opt_dff.cc:219:make_patterns_logic$25353, asynchronously reset by \reset
Extracted 61 gates and 90 wires to a netlist network with 29 inputs and 17 outputs.

3.36.23.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.23.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:                OR cells:        1
ABC RESULTS:               XOR cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               NOT cells:        5
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               NOR cells:        4
ABC RESULTS:               MUX cells:       11
ABC RESULTS:              NAND cells:       16
ABC RESULTS:               AND cells:       17
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       44
ABC RESULTS:           input signals:       29
ABC RESULTS:          output signals:       17
Removing temp directory.

3.36.24. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$53477$auto$opt_dff.cc:219:make_patterns_logic$22237, asynchronously reset by \reset
Extracted 143 gates and 264 wires to a netlist network with 121 inputs and 43 outputs.

3.36.24.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.24.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOR cells:       15
ABC RESULTS:               NOT cells:        6
ABC RESULTS:               XOR cells:        9
ABC RESULTS:              NAND cells:       13
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:            ANDNOT cells:        5
ABC RESULTS:                OR cells:       10
ABC RESULTS:              XNOR cells:       22
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               AND cells:       56
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:      100
ABC RESULTS:           input signals:      121
ABC RESULTS:          output signals:       43
Removing temp directory.

3.36.25. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$49063$auto$opt_dff.cc:219:make_patterns_logic$32993, asynchronously reset by \reset
Extracted 731 gates and 916 wires to a netlist network with 185 inputs and 103 outputs.

3.36.25.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.25.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       31
ABC RESULTS:               XOR cells:        2
ABC RESULTS:              XNOR cells:       19
ABC RESULTS:               NOT cells:       21
ABC RESULTS:             ORNOT cells:       19
ABC RESULTS:               NOR cells:       25
ABC RESULTS:            ANDNOT cells:       62
ABC RESULTS:                OR cells:       59
ABC RESULTS:               AND cells:      151
ABC RESULTS:              NAND cells:      322
ABC RESULTS:               MUX cells:       66
ABC RESULTS:               BUF cells:       31
ABC RESULTS:        internal signals:      628
ABC RESULTS:           input signals:      185
ABC RESULTS:          output signals:      103
Removing temp directory.

3.36.26. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$52059$auto$opt_dff.cc:219:make_patterns_logic$25574, asynchronously reset by \reset
Extracted 82 gates and 126 wires to a netlist network with 44 inputs and 24 outputs.

3.36.26.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.26.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOT cells:        6
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:                OR cells:        4
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               MUX cells:       12
ABC RESULTS:               NOR cells:        2
ABC RESULTS:              NAND cells:       24
ABC RESULTS:               AND cells:       22
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       58
ABC RESULTS:           input signals:       44
ABC RESULTS:          output signals:       24
Removing temp directory.

3.36.27. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$52148$auto$opt_dff.cc:219:make_patterns_logic$25492, asynchronously reset by \reset
Extracted 54 gates and 95 wires to a netlist network with 41 inputs and 22 outputs.

3.36.27.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.27.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               NOR cells:        3
ABC RESULTS:               XOR cells:        1
ABC RESULTS:               MUX cells:        4
ABC RESULTS:             ORNOT cells:        5
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:              NAND cells:       16
ABC RESULTS:                OR cells:       13
ABC RESULTS:               AND cells:       11
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       32
ABC RESULTS:           input signals:       41
ABC RESULTS:          output signals:       22
Removing temp directory.

3.36.28. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$52019$auto$opt_dff.cc:219:make_patterns_logic$25713, asynchronously reset by \reset
Extracted 45 gates and 70 wires to a netlist network with 25 inputs and 17 outputs.

3.36.28.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.28.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:               MUX cells:        3
ABC RESULTS:                OR cells:       12
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:              NAND cells:       10
ABC RESULTS:               AND cells:        8
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       28
ABC RESULTS:           input signals:       25
ABC RESULTS:          output signals:       17
Removing temp directory.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> abc -script /tmp/yosys_a27bv7/abc_tmp_1.scr

3.38. Executing ABC pass (technology mapping using ABC).

3.38.1. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Extracted 7940 gates and 8839 wires to a netlist network with 899 inputs and 1007 outputs.

3.38.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /tmp/yosys_a27bv7/abc_tmp_1.scr 
ABC:   #PIs = 899  #Luts =  2624  Max Lvl =  38  Avg Lvl =   9.77  [   0.30 sec. at Pass 0]
ABC:   #PIs = 899  #Luts =  2055  Max Lvl =  35  Avg Lvl =   9.83  [  13.63 sec. at Pass 1]
ABC:   #PIs = 899  #Luts =  2009  Max Lvl =  36  Avg Lvl =   9.79  [   2.54 sec. at Pass 2]
ABC:   #PIs = 899  #Luts =  1919  Max Lvl =  36  Avg Lvl =   9.05  [   4.19 sec. at Pass 3]
ABC:   #PIs = 899  #Luts =  1900  Max Lvl =  33  Avg Lvl =   9.00  [   3.40 sec. at Pass 4]
ABC:   #PIs = 899  #Luts =  1846  Max Lvl =  37  Avg Lvl =  10.07  [   4.78 sec. at Pass 5]
ABC:   #PIs = 899  #Luts =  1837  Max Lvl =  31  Avg Lvl =   9.03  [   3.01 sec. at Pass 6]
ABC:   #PIs = 899  #Luts =  1803  Max Lvl =  33  Avg Lvl =   9.43  [   4.29 sec. at Pass 7]
ABC:   #PIs = 899  #Luts =  1794  Max Lvl =  26  Avg Lvl =   8.86  [   2.26 sec. at Pass 8]
ABC:   #PIs = 899  #Luts =  1770  Max Lvl =  27  Avg Lvl =   8.90  [   3.91 sec. at Pass 9]
ABC:   #PIs = 899  #Luts =  1762  Max Lvl =  27  Avg Lvl =   9.02  [   2.88 sec. at Pass 10]
ABC:   #PIs = 899  #Luts =  1745  Max Lvl =  24  Avg Lvl =   8.87  [   4.01 sec. at Pass 11]
ABC:   #PIs = 899  #Luts =  1739  Max Lvl =  26  Avg Lvl =   9.14  [   2.91 sec. at Pass 12]
ABC:   #PIs = 899  #Luts =  1723  Max Lvl =  29  Avg Lvl =   9.42  [   4.22 sec. at Pass 13]
ABC:   #PIs = 899  #Luts =  1715  Max Lvl =  25  Avg Lvl =   8.78  [   2.90 sec. at Pass 14]
ABC:   #PIs = 899  #Luts =  1700  Max Lvl =  25  Avg Lvl =   9.04  [   3.67 sec. at Pass 15]
ABC:   #PIs = 899  #Luts =  1693  Max Lvl =  30  Avg Lvl =   9.83  [   2.82 sec. at Pass 16]
ABC:   #PIs = 899  #Luts =  1675  Max Lvl =  26  Avg Lvl =   9.05  [   4.00 sec. at Pass 17]
ABC:   #PIs = 899  #Luts =  1670  Max Lvl =  28  Avg Lvl =   9.64  [   3.89 sec. at Pass 18]
ABC:   #PIs = 899  #Luts =  1655  Max Lvl =  26  Avg Lvl =   8.92  [   5.75 sec. at Pass 19]
ABC:   #PIs = 899  #Luts =  1653  Max Lvl =  27  Avg Lvl =   9.69  [   4.45 sec. at Pass 20]
ABC:   #PIs = 899  #Luts =  1644  Max Lvl =  28  Avg Lvl =   9.30  [   5.79 sec. at Pass 21]
ABC:   #PIs = 899  #Luts =  1643  Max Lvl =  28  Avg Lvl =   9.30  [   0.86 sec. at Pass 22]
ABC:   [DE total time =   92.46 sec. ]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.38.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     1643
ABC RESULTS:        internal signals:     6933
ABC RESULTS:           input signals:      899
ABC RESULTS:          output signals:     1007
Removing temp directory.

yosys> opt

3.39. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.39.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

yosys> opt_merge -nomux

3.39.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_muxtree

3.39.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.39.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.39.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff

3.39.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 20106 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.39.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.39.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.39.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.39.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.39.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff

3.39.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..

yosys> opt_expr

3.39.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.39.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.40. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 1 inverters.

yosys> stat

3.41. Printing statistics.

=== b21 ===

   Number of wires:               1498
   Number of wire bits:           3599
   Number of public wires:          22
   Number of public wire bits:     358
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2546
     $_DFFE_PP0P_                  356
     $_DFF_PP0_                     71
     $_DFF_PP1_                      1
     $lut                         1506
     $mux                           14
     adder_carry                   598


yosys> shregmap -minlen 8 -maxlen 20

3.42. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.43. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.44. Printing statistics.

=== b21 ===

   Number of wires:               1498
   Number of wire bits:           3599
   Number of public wires:          22
   Number of public wire bits:     358
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2546
     $_DFFE_PP0P_                  356
     $_DFF_PP0_                     71
     $_DFF_PP1_                      1
     $lut                         1506
     $mux                           14
     adder_carry                   598


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.45. Executing TECHMAP pass (map to technology primitives).

3.45.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.45.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.45.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $mux.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using template \$_DFF_PP1_ for cells of type $_DFF_PP1_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~2512 debug messages>

yosys> opt_expr -mux_undef

3.46. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~28657 debug messages>

yosys> simplemap

3.47. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

yosys> opt_merge

3.49. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
<suppressed ~14514 debug messages>
Removed a total of 4838 cells.

yosys> opt_dff -nodffe -nosdff

3.50. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.51. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 5494 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.52. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.52.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.
<suppressed ~1118 debug messages>

yosys> opt_merge -nomux

3.52.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
<suppressed ~39 debug messages>
Removed a total of 13 cells.

yosys> opt_muxtree

3.52.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.52.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.52.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.52.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 357 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.52.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.52.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.52.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.52.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.52.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.52.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..

yosys> opt_expr

3.52.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.52.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_a27bv7/abc_tmp_2.scr

3.53. Executing ABC pass (technology mapping using ABC).

3.53.1. Extracting gate netlist of module `\b21' to `<abc-temp-dir>/input.blif'..
Extracted 5104 gates and 5999 wires to a netlist network with 893 inputs and 853 outputs.

3.53.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /tmp/yosys_a27bv7/abc_tmp_2.scr 
ABC:   #PIs = 893  #Luts =  1504  Max Lvl =  28  Avg Lvl =   9.22  [   0.25 sec. at Pass 0]
ABC:   #PIs = 893  #Luts =  1493  Max Lvl =  28  Avg Lvl =   9.36  [  11.01 sec. at Pass 1]
ABC:   #PIs = 893  #Luts =  1486  Max Lvl =  28  Avg Lvl =   9.45  [   2.35 sec. at Pass 2]
ABC:   #PIs = 893  #Luts =  1478  Max Lvl =  27  Avg Lvl =   9.40  [   3.43 sec. at Pass 3]
ABC:   #PIs = 893  #Luts =  1477  Max Lvl =  28  Avg Lvl =   9.85  [   3.21 sec. at Pass 4]
ABC:   #PIs = 893  #Luts =  1467  Max Lvl =  25  Avg Lvl =   8.94  [   3.99 sec. at Pass 5]
ABC:   #PIs = 893  #Luts =  1461  Max Lvl =  27  Avg Lvl =   9.73  [   2.73 sec. at Pass 6]
ABC:   #PIs = 893  #Luts =  1457  Max Lvl =  27  Avg Lvl =   9.59  [   4.46 sec. at Pass 7]
ABC:   #PIs = 893  #Luts =  1456  Max Lvl =  30  Avg Lvl =   9.72  [   2.36 sec. at Pass 8]
ABC:   #PIs = 893  #Luts =  1449  Max Lvl =  27  Avg Lvl =   9.20  [   4.27 sec. at Pass 9]
ABC:   #PIs = 893  #Luts =  1446  Max Lvl =  26  Avg Lvl =   9.48  [   2.38 sec. at Pass 10]
ABC:   #PIs = 893  #Luts =  1440  Max Lvl =  28  Avg Lvl =   9.25  [   3.27 sec. at Pass 11]
ABC:   #PIs = 893  #Luts =  1438  Max Lvl =  28  Avg Lvl =   9.62  [   2.55 sec. at Pass 12]
ABC:   #PIs = 893  #Luts =  1435  Max Lvl =  29  Avg Lvl =   9.77  [   3.19 sec. at Pass 13]
ABC:   #PIs = 893  #Luts =  1434  Max Lvl =  28  Avg Lvl =   9.29  [   2.44 sec. at Pass 14]
ABC:   #PIs = 893  #Luts =  1434  Max Lvl =  27  Avg Lvl =   9.58  [   3.74 sec. at Pass 15]
ABC:   #PIs = 893  #Luts =  1433  Max Lvl =  28  Avg Lvl =   9.61  [   2.15 sec. at Pass 16]
ABC:   #PIs = 893  #Luts =  1430  Max Lvl =  27  Avg Lvl =   9.87  [   3.49 sec. at Pass 17]
ABC:   #PIs = 893  #Luts =  1430  Max Lvl =  27  Avg Lvl =   9.87  [   2.17 sec. at Pass 18]
ABC:   #PIs = 893  #Luts =  1429  Max Lvl =  27  Avg Lvl =   9.60  [   2.80 sec. at Pass 19]
ABC:   #PIs = 893  #Luts =  1429  Max Lvl =  25  Avg Lvl =   9.00  [   2.35 sec. at Pass 20]
ABC:   #PIs = 893  #Luts =  1425  Max Lvl =  27  Avg Lvl =   9.60  [   3.41 sec. at Pass 21]
ABC:   #PIs = 893  #Luts =  1425  Max Lvl =  27  Avg Lvl =   9.60  [   2.38 sec. at Pass 22]
ABC:   #PIs = 893  #Luts =  1425  Max Lvl =  27  Avg Lvl =   9.60  [   3.43 sec. at Pass 23]
ABC:   #PIs = 893  #Luts =  1425  Max Lvl =  26  Avg Lvl =   9.34  [   2.81 sec. at Pass 24]
ABC:   #PIs = 893  #Luts =  1423  Max Lvl =  27  Avg Lvl =   9.72  [   3.40 sec. at Pass 25]
ABC:   #PIs = 893  #Luts =  1423  Max Lvl =  27  Avg Lvl =   9.72  [   2.46 sec. at Pass 26]
ABC:   #PIs = 893  #Luts =  1421  Max Lvl =  29  Avg Lvl =   9.78  [   3.27 sec. at Pass 27]
ABC:   #PIs = 893  #Luts =  1421  Max Lvl =  29  Avg Lvl =   9.78  [   2.34 sec. at Pass 28]
ABC:   #PIs = 893  #Luts =  1421  Max Lvl =  29  Avg Lvl =   9.78  [   3.41 sec. at Pass 29]
ABC:   #PIs = 893  #Luts =  1421  Max Lvl =  29  Avg Lvl =   9.78  [   2.71 sec. at Pass 30]
ABC:   #PIs = 893  #Luts =  1421  Max Lvl =  29  Avg Lvl =   9.78  [   0.67 sec. at Pass 31]
ABC:   [DE total time =  100.79 sec. ]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.53.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     1421
ABC RESULTS:        internal signals:     4253
ABC RESULTS:           input signals:      893
ABC RESULTS:          output signals:      853
Removing temp directory.

yosys> opt

3.54. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.54.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

yosys> opt_merge -nomux

3.54.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.54.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.54.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff

3.54.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 5013 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.54.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.54.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.54.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b21..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b21.
Performed a total of 0 changes.

yosys> opt_merge

3.54.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b21'.
Removed a total of 0 cells.

yosys> opt_dff

3.54.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..

yosys> opt_expr

3.54.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b21.

3.54.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.55. Executing HIERARCHY pass (managing design hierarchy).

3.55.1. Analyzing design hierarchy..
Top module:  \b21

3.55.2. Analyzing design hierarchy..
Top module:  \b21
Removed 0 unused modules.

yosys> stat

3.56. Printing statistics.

=== b21 ===

   Number of wires:               1402
   Number of wire bits:           3503
   Number of public wires:          22
   Number of public wire bits:     358
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2447
     $lut                         1421
     adder_carry                   598
     dffsre                        428


yosys> opt_clean -purge

3.57. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b21..
Removed 0 unused cells and 8 unused wires.
<suppressed ~8 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.58. Executing Verilog backend.

yosys> bmuxmap

3.58.1. Executing BMUXMAP pass.

yosys> demuxmap

3.58.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\b21'.

Warnings: 5 unique messages, 6 total
End of script. Logfile hash: 402dabb9ca, CPU: user 64.45s system 1.34s, MEM: 112.60 MB peak
Yosys 0.16+65 (git sha1 03bd62bb8, gcc 9.1.0 -fPIC -Os)
Time spent: 97% 6x abc (2157 sec), 0% 33x opt_dff (21 sec), ...
real 279.31
user 2024.29
sys 191.73
