
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.24
 Yosys 0.16+65 (git sha1 03bd62bb8, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl b12.vhd

yosys> verific -vhdl b12.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'b12.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-INFO [VHDL-1012] b12.vhd:1: analyzing entity 'b12'
VERIFIC-INFO [VHDL-1010] b12.vhd:12: analyzing architecture 'behav'

yosys> synth_rs -top b12 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.47

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top b12

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] b12.vhd:1: processing 'b12(BEHAV)'
Importing module b12.

3.3.1. Analyzing design hierarchy..
Top module:  \b12

3.3.2. Analyzing design hierarchy..
Top module:  \b12
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.
<suppressed ~9 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 0 unused cells and 46 unused wires.
<suppressed ~19 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module b12...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~76 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$wr_reg$b12.vhd:564$542 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$timebase_reg$b12.vhd:564$546 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$speaker_reg$b12.vhd:144$304 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$sound_reg$b12.vhd:564$548 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$scan_reg$b12.vhd:564$543 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$s_reg$b12.vhd:144$303 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$play_reg$b12.vhd:564$541 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$nloss_reg$b12.vhd:564$539 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$nl_reg$b12.vhd:564$540 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_9$b12.vhd:184$391 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_8$b12.vhd:184$390 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_7$b12.vhd:184$389 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_6$b12.vhd:184$388 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_5$b12.vhd:184$387 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_4$b12.vhd:184$386 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_32$b12.vhd:184$414 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_31$b12.vhd:184$413 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_30$b12.vhd:184$412 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_3$b12.vhd:184$385 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_29$b12.vhd:184$411 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_28$b12.vhd:184$410 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_27$b12.vhd:184$409 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_26$b12.vhd:184$408 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_25$b12.vhd:184$407 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_24$b12.vhd:184$406 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_23$b12.vhd:184$405 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_22$b12.vhd:184$404 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_21$b12.vhd:184$403 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_20$b12.vhd:184$402 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_2$b12.vhd:184$384 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_19$b12.vhd:184$401 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_18$b12.vhd:184$400 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_17$b12.vhd:184$399 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_16$b12.vhd:184$398 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_15$b12.vhd:184$397 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_14$b12.vhd:184$396 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_13$b12.vhd:184$395 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_12$b12.vhd:184$394 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_11$b12.vhd:184$393 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg_10$b12.vhd:184$392 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$memory_reg$b12.vhd:184$415 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$max_reg$b12.vhd:564$544 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$ind_reg$b12.vhd:564$545 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$gamma_reg$b12.vhd:564$551 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$data_out_reg$b12.vhd:184$383 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$data_in_reg$b12.vhd:564$550 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$counter_reg$b12.vhd:144$305 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$count_reg_2$b12.vhd:164$311 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$count_reg$b12.vhd:564$547 ($aldff) from module b12.
Changing const-value async load to async reset on $verific$address_reg$b12.vhd:564$549 ($aldff) from module b12.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~76 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~76 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$s_reg$b12.vhd:144$303 ($adff) from module b12 (D = $verific$n125$27, Q = \s).
Adding EN signal on $verific$memory_reg_9$b12.vhd:184$391 ($adff) from module b12 (D = \data_in, Q = \memory[24]).
Adding EN signal on $verific$memory_reg_8$b12.vhd:184$390 ($adff) from module b12 (D = \data_in, Q = \memory[25]).
Adding EN signal on $verific$memory_reg_7$b12.vhd:184$389 ($adff) from module b12 (D = \data_in, Q = \memory[26]).
Adding EN signal on $verific$memory_reg_6$b12.vhd:184$388 ($adff) from module b12 (D = \data_in, Q = \memory[27]).
Adding EN signal on $verific$memory_reg_5$b12.vhd:184$387 ($adff) from module b12 (D = \data_in, Q = \memory[28]).
Adding EN signal on $verific$memory_reg_4$b12.vhd:184$386 ($adff) from module b12 (D = \data_in, Q = \memory[29]).
Adding EN signal on $verific$memory_reg_32$b12.vhd:184$414 ($adff) from module b12 (D = \data_in, Q = \memory[1]).
Adding EN signal on $verific$memory_reg_31$b12.vhd:184$413 ($adff) from module b12 (D = \data_in, Q = \memory[2]).
Adding EN signal on $verific$memory_reg_30$b12.vhd:184$412 ($adff) from module b12 (D = \data_in, Q = \memory[3]).
Adding EN signal on $verific$memory_reg_3$b12.vhd:184$385 ($adff) from module b12 (D = \data_in, Q = \memory[30]).
Adding EN signal on $verific$memory_reg_29$b12.vhd:184$411 ($adff) from module b12 (D = \data_in, Q = \memory[4]).
Adding EN signal on $verific$memory_reg_28$b12.vhd:184$410 ($adff) from module b12 (D = \data_in, Q = \memory[5]).
Adding EN signal on $verific$memory_reg_27$b12.vhd:184$409 ($adff) from module b12 (D = \data_in, Q = \memory[6]).
Adding EN signal on $verific$memory_reg_26$b12.vhd:184$408 ($adff) from module b12 (D = \data_in, Q = \memory[7]).
Adding EN signal on $verific$memory_reg_25$b12.vhd:184$407 ($adff) from module b12 (D = \data_in, Q = \memory[8]).
Adding EN signal on $verific$memory_reg_24$b12.vhd:184$406 ($adff) from module b12 (D = \data_in, Q = \memory[9]).
Adding EN signal on $verific$memory_reg_23$b12.vhd:184$405 ($adff) from module b12 (D = \data_in, Q = \memory[10]).
Adding EN signal on $verific$memory_reg_22$b12.vhd:184$404 ($adff) from module b12 (D = \data_in, Q = \memory[11]).
Adding EN signal on $verific$memory_reg_21$b12.vhd:184$403 ($adff) from module b12 (D = \data_in, Q = \memory[12]).
Adding EN signal on $verific$memory_reg_20$b12.vhd:184$402 ($adff) from module b12 (D = \data_in, Q = \memory[13]).
Adding EN signal on $verific$memory_reg_2$b12.vhd:184$384 ($adff) from module b12 (D = \data_in, Q = \memory[31]).
Adding EN signal on $verific$memory_reg_19$b12.vhd:184$401 ($adff) from module b12 (D = \data_in, Q = \memory[14]).
Adding EN signal on $verific$memory_reg_18$b12.vhd:184$400 ($adff) from module b12 (D = \data_in, Q = \memory[15]).
Adding EN signal on $verific$memory_reg_17$b12.vhd:184$399 ($adff) from module b12 (D = \data_in, Q = \memory[16]).
Adding EN signal on $verific$memory_reg_16$b12.vhd:184$398 ($adff) from module b12 (D = \data_in, Q = \memory[17]).
Adding EN signal on $verific$memory_reg_15$b12.vhd:184$397 ($adff) from module b12 (D = \data_in, Q = \memory[18]).
Adding EN signal on $verific$memory_reg_14$b12.vhd:184$396 ($adff) from module b12 (D = \data_in, Q = \memory[19]).
Adding EN signal on $verific$memory_reg_13$b12.vhd:184$395 ($adff) from module b12 (D = \data_in, Q = \memory[20]).
Adding EN signal on $verific$memory_reg_12$b12.vhd:184$394 ($adff) from module b12 (D = \data_in, Q = \memory[21]).
Adding EN signal on $verific$memory_reg_11$b12.vhd:184$393 ($adff) from module b12 (D = \data_in, Q = \memory[22]).
Adding EN signal on $verific$memory_reg_10$b12.vhd:184$392 ($adff) from module b12 (D = \data_in, Q = \memory[23]).
Adding EN signal on $verific$memory_reg$b12.vhd:184$415 ($adff) from module b12 (D = \data_in, Q = \memory[0]).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 65 unused cells and 65 unused wires.
<suppressed ~66 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~43 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.13.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 3) from port A of cell b12.$verific$LessThan_4$b12.vhd:80$267 ($lt).
Removed top 2 bits (of 3) from port B of cell b12.$verific$add_8$b12.vhd:85$271 ($add).
Removed top 1 bits (of 4) from port Y of cell b12.$verific$add_8$b12.vhd:85$271 ($add).
Removed top 1 bits (of 3) from port A of cell b12.$verific$LessThan_13$b12.vhd:88$277 ($lt).
Removed top 2 bits (of 3) from port A of cell b12.$verific$LessThan_49$b12.vhd:125$293 ($lt).
Removed top 1 bits (of 2) from port B of cell b12.$verific$add_69$b12.vhd:159$308 ($add).
Removed top 31 bits (of 32) from port A of cell b12.$verific$Decoder_79$b12.vhd:182$318 ($shl).
Removed top 3 bits (of 4) from port A of cell b12.$verific$Decoder_195$b12.vhd:284$420 ($shl).
Removed top 1 bits (of 7) from port A of cell b12.$verific$sub_207$b12.vhd:298$427 ($sub).
Removed top 6 bits (of 7) from port B of cell b12.$verific$sub_207$b12.vhd:298$427 ($sub).
Removed top 1 bits (of 7) from port Y of cell b12.$verific$sub_207$b12.vhd:298$427 ($sub).
Removed top 4 bits (of 5) from port B of cell b12.$verific$add_215$b12.vhd:306$432 ($add).
Removed top 1 bits (of 6) from port Y of cell b12.$verific$add_215$b12.vhd:306$432 ($add).
Removed top 1 bits (of 2) from port A of cell b12.$verific$equal_239$b12.vhd:358$442 ($eq).
Removed top 1 bits (of 4) from mux cell b12.$verific$mux_273$b12.vhd:394$471 ($mux).
Removed top 1 bits (of 4) from mux cell b12.$verific$mux_274$b12.vhd:394$472 ($mux).
Removed top 1 bits (of 4) from mux cell b12.$verific$mux_275$b12.vhd:394$473 ($mux).
Removed top 1 bits (of 4) from mux cell b12.$verific$mux_276$b12.vhd:394$474 ($mux).
Removed top 3 bits (of 4) from port A of cell b12.$verific$Decoder_289$b12.vhd:400$482 ($shl).
Removed top 4 bits (of 5) from port B of cell b12.$verific$add_309$b12.vhd:423$488 ($add).
Removed top 1 bits (of 6) from port Y of cell b12.$verific$add_309$b12.vhd:423$488 ($add).
Removed top 1 bits (of 7) from port A of cell b12.$verific$sub_311$b12.vhd:424$491 ($sub).
Removed top 6 bits (of 7) from port B of cell b12.$verific$sub_311$b12.vhd:424$491 ($sub).
Removed top 1 bits (of 7) from port Y of cell b12.$verific$sub_311$b12.vhd:424$491 ($sub).
Removed top 2 bits (of 19) from mux cell b12.$verific$mux_503$b12.vhd:510$494 ($mux).
Removed top 1 bits (of 4) from wire b12.$verific$n1024$184.
Removed top 1 bits (of 4) from wire b12.$verific$n1073$186.
Removed top 1 bits (of 4) from wire b12.$verific$n1139$199.
Removed top 1 bits (of 4) from wire b12.$verific$n1144$200.
Removed top 1 bits (of 4) from wire b12.$verific$n1149$201.
Removed top 1 bits (of 4) from wire b12.$verific$n1154$202.
Removed top 1 bits (of 7) from wire b12.$verific$n1280$211.
Removed top 1 bits (of 5) from wire b12.$verific$n1336$215.
Removed top 3 bits (of 5) from wire b12.$verific$n1688$237.
Removed top 2 bits (of 5) from wire b12.$verific$n1733$242.
Removed top 4 bits (of 5) from wire b12.$verific$n1997$252.
Removed top 1 bits (of 7) from wire b12.$verific$n765$167.
Removed top 1 bits (of 4) from wire b12.$verific$n926$180.
Removed top 1 bits (of 4) from wire b12.$verific$n975$182.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 0 unused cells and 19 unused wires.
<suppressed ~1 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module b12:
  creating $macc model for $verific$add_215$b12.vhd:306$432 ($add).
  creating $macc model for $verific$add_309$b12.vhd:423$488 ($add).
  creating $macc model for $verific$add_69$b12.vhd:159$308 ($add).
  creating $macc model for $verific$add_8$b12.vhd:85$271 ($add).
  creating $macc model for $verific$sub_207$b12.vhd:298$427 ($sub).
  creating $macc model for $verific$sub_311$b12.vhd:424$491 ($sub).
  creating $alu model for $macc $verific$sub_311$b12.vhd:424$491.
  creating $alu model for $macc $verific$sub_207$b12.vhd:298$427.
  creating $alu model for $macc $verific$add_8$b12.vhd:85$271.
  creating $alu model for $macc $verific$add_69$b12.vhd:159$308.
  creating $alu model for $macc $verific$add_309$b12.vhd:423$488.
  creating $alu model for $macc $verific$add_215$b12.vhd:306$432.
  creating $alu model for $verific$LessThan_13$b12.vhd:88$277 ($lt): new $alu
  creating $alu model for $verific$LessThan_22$b12.vhd:98$281 ($lt): new $alu
  creating $alu model for $verific$LessThan_31$b12.vhd:107$285 ($lt): new $alu
  creating $alu model for $verific$LessThan_4$b12.vhd:80$267 ($lt): new $alu
  creating $alu model for $verific$LessThan_40$b12.vhd:116$289 ($lt): new $alu
  creating $alu model for $verific$LessThan_49$b12.vhd:125$293 ($lt): new $alu
  creating $alu cell for $verific$LessThan_40$b12.vhd:116$289: $auto$alumacc.cc:485:replace_alu$670
  creating $alu cell for $verific$LessThan_4$b12.vhd:80$267: $auto$alumacc.cc:485:replace_alu$675
  creating $alu cell for $verific$LessThan_31$b12.vhd:107$285: $auto$alumacc.cc:485:replace_alu$680
  creating $alu cell for $verific$LessThan_22$b12.vhd:98$281: $auto$alumacc.cc:485:replace_alu$685
  creating $alu cell for $verific$LessThan_13$b12.vhd:88$277: $auto$alumacc.cc:485:replace_alu$690
  creating $alu cell for $verific$add_215$b12.vhd:306$432: $auto$alumacc.cc:485:replace_alu$695
  creating $alu cell for $verific$add_309$b12.vhd:423$488: $auto$alumacc.cc:485:replace_alu$698
  creating $alu cell for $verific$add_69$b12.vhd:159$308: $auto$alumacc.cc:485:replace_alu$701
  creating $alu cell for $verific$LessThan_49$b12.vhd:125$293: $auto$alumacc.cc:485:replace_alu$704
  creating $alu cell for $verific$add_8$b12.vhd:85$271: $auto$alumacc.cc:485:replace_alu$709
  creating $alu cell for $verific$sub_207$b12.vhd:298$427: $auto$alumacc.cc:485:replace_alu$712
  creating $alu cell for $verific$sub_311$b12.vhd:424$491: $auto$alumacc.cc:485:replace_alu$715
  created 12 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.
<suppressed ~18 debug messages>

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~43 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 6 unused cells and 12 unused wires.
<suppressed ~7 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~43 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== b12 ===

   Number of wires:                268
   Number of wire bits:            759
   Number of public wires:          56
   Number of public wire bits:     133
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                218
     $adff                          17
     $adffe                         33
     $alu                           12
     $bmux                          17
     $eq                             3
     $logic_not                      2
     $mux                           88
     $ne                             3
     $not                            8
     $reduce_and                    32
     $shl                            3


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.21.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> memory_share

3.21.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> memory_collect

3.21.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== b12 ===

   Number of wires:                268
   Number of wire bits:            759
   Number of public wires:          56
   Number of public wire bits:     133
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                218
     $adff                          17
     $adffe                         33
     $alu                           12
     $bmux                          17
     $eq                             3
     $logic_not                      2
     $mux                           88
     $ne                             3
     $not                            8
     $reduce_and                    32
     $shl                            3


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> stat

3.24. Printing statistics.

=== b12 ===

   Number of wires:                268
   Number of wire bits:            759
   Number of public wires:          56
   Number of public wire bits:     133
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                218
     $adff                          17
     $adffe                         33
     $alu                           12
     $bmux                          17
     $eq                             3
     $logic_not                      2
     $mux                           88
     $ne                             3
     $not                            8
     $reduce_and                    32
     $shl                            3


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $reduce_and.
Using template $paramod$78e969f2586efcf3a5b0b0440bcca0db83d5cca2\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $not.
Using template $paramod$a04dd9d4d8b430140c4ff94b50470fb380fda2a0\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $mux.
Using template $paramod$672a140277c71df8314410f22acc08d55222c3c7\_90_alu for cells of type $alu.
Using template $paramod$79fc7abbb3333dbd5736999d565fd903198fb1eb\_90_alu for cells of type $alu.
Using template $paramod$3ef7d3dd227da7627a99c5e5a6a4deb817573e39\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $adff.
Using template $paramod$constmap:dbcddb7b4524c1c5fa25e15435f3b9049e3d7d7a$paramod$3bf4391c2edcd7fdc564361d03ba2cf3a33c67d4\_90_shift_ops_shr_shl_sshl_sshr for cells of type $shl.
Using template $paramod$constmap:66d421c313e4e958be776b99540ac2de3b59fdbc$paramod$77562a466236eb4a6d905351a0995599b75075cb\_90_shift_ops_shr_shl_sshl_sshr for cells of type $shl.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $eq.
Using template $paramod$175e67c02b86e96b1288b9dc100122520d7240d8\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $and.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000011 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~2142 debug messages>

yosys> stat

3.26. Printing statistics.

=== b12 ===

   Number of wires:                788
   Number of wire bits:          22688
   Number of public wires:          56
   Number of public wire bits:     133
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2460
     $_AND_                        134
     $_DFFE_PP0P_                   65
     $_DFF_PP0_                     54
     $_MUX_                       1950
     $_NOT_                         62
     $_OR_                          72
     $_XOR_                        123


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.
<suppressed ~1084 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
<suppressed ~303 debug messages>
Removed a total of 101 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$1010 ($_DFF_PP0_) from module b12 (D = $verific$n133$30, Q = \speaker).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 26 unused cells and 491 unused wires.
<suppressed ~27 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.
<suppressed ~34 debug messages>

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
<suppressed ~57 debug messages>
Removed a total of 19 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$1025 ($_DFFE_PP0P_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$968, Q = \s).
Adding EN signal on $auto$ff.cc:262:slice$3475 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3076 [1], Q = \data_in [1]).
Adding EN signal on $auto$ff.cc:262:slice$3474 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3076 [0], Q = \data_in [0]).
Adding EN signal on $auto$ff.cc:262:slice$3473 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3006 [4], Q = \address [4]).
Adding EN signal on $auto$ff.cc:262:slice$3472 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3006 [3], Q = \address [3]).
Adding EN signal on $auto$ff.cc:262:slice$3471 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3006 [2], Q = \address [2]).
Adding EN signal on $auto$ff.cc:262:slice$3470 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3006 [1], Q = \address [1]).
Adding EN signal on $auto$ff.cc:262:slice$3469 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3006 [0], Q = \address [0]).
Adding EN signal on $auto$ff.cc:262:slice$3468 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3364 [2], Q = \sound [2]).
Adding EN signal on $auto$ff.cc:262:slice$3467 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3364 [1], Q = \sound [1]).
Adding EN signal on $auto$ff.cc:262:slice$3466 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3364 [0], Q = \sound [0]).
Adding EN signal on $auto$ff.cc:262:slice$3465 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3263 [5], Q = \count [5]).
Adding EN signal on $auto$ff.cc:262:slice$3464 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3263 [4], Q = \count [4]).
Adding EN signal on $auto$ff.cc:262:slice$3463 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3263 [3], Q = \count [3]).
Adding EN signal on $auto$ff.cc:262:slice$3462 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3263 [2], Q = \count [2]).
Adding EN signal on $auto$ff.cc:262:slice$3461 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3263 [1], Q = \count [1]).
Adding EN signal on $auto$ff.cc:262:slice$3460 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3263 [0], Q = \count [0]).
Adding EN signal on $auto$ff.cc:262:slice$3459 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2685 [5], Q = \timebase [5]).
Adding EN signal on $auto$ff.cc:262:slice$3458 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2685 [4], Q = \timebase [4]).
Adding EN signal on $auto$ff.cc:262:slice$3457 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2685 [3], Q = \timebase [3]).
Adding EN signal on $auto$ff.cc:262:slice$3456 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2685 [2], Q = \timebase [2]).
Adding EN signal on $auto$ff.cc:262:slice$3455 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2685 [1], Q = \timebase [1]).
Adding EN signal on $auto$ff.cc:262:slice$3454 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2685 [0], Q = \timebase [0]).
Adding EN signal on $auto$ff.cc:262:slice$3453 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3432 [1], Q = \ind [1]).
Adding EN signal on $auto$ff.cc:262:slice$3452 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$3432 [0], Q = \ind [0]).
Adding EN signal on $auto$ff.cc:262:slice$3451 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2495 [4], Q = \max [4]).
Adding EN signal on $auto$ff.cc:262:slice$3450 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2495 [3], Q = \max [3]).
Adding EN signal on $auto$ff.cc:262:slice$3449 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2495 [2], Q = \max [2]).
Adding EN signal on $auto$ff.cc:262:slice$3448 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2495 [1], Q = \max [1]).
Adding EN signal on $auto$ff.cc:262:slice$3447 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2495 [0], Q = \max [0]).
Adding EN signal on $auto$ff.cc:262:slice$3446 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2846 [4], Q = \scan [4]).
Adding EN signal on $auto$ff.cc:262:slice$3445 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2846 [3], Q = \scan [3]).
Adding EN signal on $auto$ff.cc:262:slice$3444 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2846 [2], Q = \scan [2]).
Adding EN signal on $auto$ff.cc:262:slice$3443 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2846 [1], Q = \scan [1]).
Adding EN signal on $auto$ff.cc:262:slice$3442 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2846 [0], Q = \scan [0]).
Adding EN signal on $auto$ff.cc:262:slice$3441 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2339, Q = \wr).
Adding EN signal on $auto$ff.cc:262:slice$3440 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2303, Q = \play).
Adding EN signal on $auto$ff.cc:262:slice$3439 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2264 [3], Q = \nl [3]).
Adding EN signal on $auto$ff.cc:262:slice$3438 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2264 [2], Q = \nl [2]).
Adding EN signal on $auto$ff.cc:262:slice$3437 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2264 [1], Q = \nl [1]).
Adding EN signal on $auto$ff.cc:262:slice$3436 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2264 [0], Q = \nl [0]).
Adding EN signal on $auto$ff.cc:262:slice$3435 ($_DFF_PP0_) from module b12 (D = $auto$simplemap.cc:309:simplemap_bmux$2138, Q = \nloss).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 0 unused cells and 515 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.
<suppressed ~2289 debug messages>

3.27.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.27.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
<suppressed ~9105 debug messages>
Removed a total of 3035 cells.

yosys> opt_dff

3.27.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 0 unused cells and 2592 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.27.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.27.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> opt_expr

3.27.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.27.30. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.
<suppressed ~497 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
<suppressed ~81 debug messages>
Removed a total of 27 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 0 unused cells and 94 unused wires.
<suppressed ~1 debug messages>

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.
<suppressed ~37 debug messages>

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
<suppressed ~18 debug messages>
Removed a total of 6 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$2045 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$1984
        $auto$simplemap.cc:312:simplemap_bmux$1979

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$984 in front of them:
        $auto$simplemap.cc:278:simplemap_mux$928
        $auto$simplemap.cc:278:simplemap_mux$916

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$985 in front of them:
        $auto$simplemap.cc:278:simplemap_mux$929
        $auto$simplemap.cc:278:simplemap_mux$917

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$986 in front of them:
        $auto$simplemap.cc:278:simplemap_mux$930
        $auto$simplemap.cc:278:simplemap_mux$918

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$987 in front of them:
        $auto$simplemap.cc:278:simplemap_mux$957
        $auto$simplemap.cc:278:simplemap_mux$940

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$988 in front of them:
        $auto$simplemap.cc:278:simplemap_mux$958
        $auto$simplemap.cc:278:simplemap_mux$941

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$989 in front of them:
        $auto$simplemap.cc:278:simplemap_mux$959
        $auto$simplemap.cc:278:simplemap_mux$942


yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 0 unused cells and 6 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.
<suppressed ~7 debug messages>

3.30.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~7 debug messages>

yosys> opt_reduce -full

3.30.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.30.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_share

3.30.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

3.30.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.30.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce -full

3.30.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.30.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_share

3.30.22. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> opt_expr -full

3.30.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.30.26. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.31. Executing ABC pass (technology mapping using ABC).

3.31.1. Summary of detected clock domains:
  79 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$8798, arst=\reset, srst={ }
  33 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$8400, arst=\reset, srst={ }
  82 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$7316, arst=\reset, srst={ }
  136 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$6234, arst=\reset, srst={ }
  39 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$6044, arst=\reset, srst={ }
  65 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$5392, arst=\reset, srst={ }
  141 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$4544, arst=\reset, srst={ }
  9 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$4321, arst=\reset, srst={ }
  17 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$4233, arst=\reset, srst={ }
  22 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$4086, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$576, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$579, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$582, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$588, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$591, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$594, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$597, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$600, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$603, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$606, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$609, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$612, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$615, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$621, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$624, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$627, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$630, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$633, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$636, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$639, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$642, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$645, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$648, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$558, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$561, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$564, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$567, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$570, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$573, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$585, arst=\reset, srst={ }
  3 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$618, arst=\reset, srst={ }
  38 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$12199, arst=\reset, srst={ }
  85 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$11433, arst=\reset, srst={ }
  35 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$11259, arst=\reset, srst={ }
  15 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$10989, arst=\reset, srst={ }
  131 cells in clk=\clock, en={ }, arst=\reset, srst={ }
  58 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$10090, arst=\reset, srst={ }
  2 cells in clk=\clock, en=$auto$opt_dff.cc:219:make_patterns_logic$555, arst=\reset, srst={ }

3.31.2. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$8798, asynchronously reset by \reset
Extracted 79 gates and 114 wires to a netlist network with 35 inputs and 26 outputs.

3.31.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        5
ABC RESULTS:               NOT cells:        5
ABC RESULTS:               NOR cells:        2
ABC RESULTS:               XOR cells:        4
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:              NAND cells:        3
ABC RESULTS:               MUX cells:       13
ABC RESULTS:                OR cells:       13
ABC RESULTS:               AND cells:       23
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       53
ABC RESULTS:           input signals:       35
ABC RESULTS:          output signals:       26
Removing temp directory.

3.31.3. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$8400, asynchronously reset by \reset
Extracted 33 gates and 51 wires to a netlist network with 17 inputs and 20 outputs.

3.31.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        3
ABC RESULTS:              NAND cells:        1
ABC RESULTS:                OR cells:       11
ABC RESULTS:               AND cells:        8
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               NOR cells:        6
ABC RESULTS:        internal signals:       14
ABC RESULTS:           input signals:       17
ABC RESULTS:          output signals:       20
Removing temp directory.

3.31.4. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$7316, asynchronously reset by \reset
Extracted 82 gates and 112 wires to a netlist network with 29 inputs and 23 outputs.

3.31.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        6
ABC RESULTS:               NOT cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:                OR cells:        2
ABC RESULTS:               MUX cells:       18
ABC RESULTS:               NOR cells:        3
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               XOR cells:        3
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               AND cells:       12
ABC RESULTS:              NAND cells:        3
ABC RESULTS:        internal signals:       60
ABC RESULTS:           input signals:       29
ABC RESULTS:          output signals:       23
Removing temp directory.

3.31.5. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$6234, asynchronously reset by \reset
Extracted 136 gates and 175 wires to a netlist network with 38 inputs and 23 outputs.

3.31.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        6
ABC RESULTS:               NOT cells:        7
ABC RESULTS:               XOR cells:        2
ABC RESULTS:            ANDNOT cells:        6
ABC RESULTS:              XNOR cells:        4
ABC RESULTS:                OR cells:       29
ABC RESULTS:               MUX cells:       20
ABC RESULTS:               AND cells:       48
ABC RESULTS:             ORNOT cells:       11
ABC RESULTS:               NOR cells:        9
ABC RESULTS:              NAND cells:       56
ABC RESULTS:               BUF cells:        6
ABC RESULTS:        internal signals:      114
ABC RESULTS:           input signals:       38
ABC RESULTS:          output signals:       23
Removing temp directory.

3.31.6. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$6044, asynchronously reset by \reset
Extracted 37 gates and 72 wires to a netlist network with 34 inputs and 15 outputs.

3.31.6.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.6.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:               MUX cells:        4
ABC RESULTS:                OR cells:       12
ABC RESULTS:               AND cells:       18
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       23
ABC RESULTS:           input signals:       34
ABC RESULTS:          output signals:       15
Removing temp directory.

3.31.7. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$5392, asynchronously reset by \reset
Extracted 65 gates and 101 wires to a netlist network with 34 inputs and 23 outputs.

3.31.7.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.7.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOR cells:        4
ABC RESULTS:                OR cells:        5
ABC RESULTS:               AND cells:       14
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               MUX cells:        4
ABC RESULTS:             ORNOT cells:        9
ABC RESULTS:              NAND cells:       19
ABC RESULTS:               BUF cells:        1
ABC RESULTS:               NOT cells:        8
ABC RESULTS:        internal signals:       44
ABC RESULTS:           input signals:       34
ABC RESULTS:          output signals:       23
Removing temp directory.

3.31.8. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4544, asynchronously reset by \reset
Extracted 141 gates and 224 wires to a netlist network with 82 inputs and 38 outputs.

3.31.8.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.8.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        5
ABC RESULTS:               NOT cells:        1
ABC RESULTS:            ANDNOT cells:       30
ABC RESULTS:               NOR cells:        3
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:                OR cells:        5
ABC RESULTS:               AND cells:       82
ABC RESULTS:              NAND cells:       79
ABC RESULTS:               MUX cells:        8
ABC RESULTS:               BUF cells:        5
ABC RESULTS:        internal signals:      104
ABC RESULTS:           input signals:       82
ABC RESULTS:          output signals:       38
Removing temp directory.

3.31.9. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4321, asynchronously reset by \reset
Extracted 9 gates and 19 wires to a netlist network with 10 inputs and 5 outputs.

3.31.9.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.9.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:                OR cells:        2
ABC RESULTS:               AND cells:        5
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        4
ABC RESULTS:           input signals:       10
ABC RESULTS:          output signals:        5
Removing temp directory.

3.31.10. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4233, asynchronously reset by \reset
Extracted 17 gates and 30 wires to a netlist network with 13 inputs and 2 outputs.

3.31.10.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.10.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:                OR cells:        7
ABC RESULTS:               AND cells:        6
ABC RESULTS:               NOT cells:        2
ABC RESULTS:        internal signals:       15
ABC RESULTS:           input signals:       13
ABC RESULTS:          output signals:        2
Removing temp directory.

3.31.11. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4086, asynchronously reset by \reset
Extracted 22 gates and 38 wires to a netlist network with 16 inputs and 4 outputs.

3.31.11.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.11.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:                OR cells:        7
ABC RESULTS:               AND cells:        7
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       18
ABC RESULTS:           input signals:       16
ABC RESULTS:          output signals:        4
Removing temp directory.

3.31.12. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$576, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.12.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.12.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.13. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$579, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.13.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.13.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.14. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$582, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.14.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.14.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.15. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$588, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.15.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.15.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.16. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$591, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.16.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.16.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.17. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$594, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.17.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.17.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.18. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$597, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.18.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.18.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.19. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$600, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.19.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.19.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.20. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$603, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.20.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.20.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.21. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$606, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.21.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.21.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.22. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$609, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.22.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.22.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.23. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$612, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.23.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.23.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.24. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$615, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.24.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.24.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.25. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$621, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.25.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.25.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.26. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$624, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.26.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.26.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.27. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$627, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.27.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.27.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.28. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$630, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.28.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.28.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.29. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$633, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.29.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.29.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.30. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$636, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.30.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.30.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.31. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$639, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.31.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.31.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.32. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$642, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.32.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.32.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.33. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$645, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.33.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.33.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.34. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$648, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.34.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.34.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.35. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$558, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.35.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.35.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.36. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$561, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.36.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.36.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.37. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$564, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.37.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.37.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.38. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$567, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.38.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.38.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.39. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$570, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.39.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.39.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.40. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$573, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.40.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.40.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.41. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$585, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.41.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.41.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.42. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$618, asynchronously reset by \reset
Extracted 3 gates and 7 wires to a netlist network with 4 inputs and 3 outputs.

3.31.42.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.42.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        4
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.43. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$12199, asynchronously reset by \reset
Extracted 38 gates and 68 wires to a netlist network with 30 inputs and 4 outputs.

3.31.43.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.43.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:                OR cells:        4
ABC RESULTS:               NOR cells:        7
ABC RESULTS:              NAND cells:        4
ABC RESULTS:               AND cells:       14
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       34
ABC RESULTS:           input signals:       30
ABC RESULTS:          output signals:        4
Removing temp directory.

3.31.44. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$11433, asynchronously reset by \reset
Extracted 85 gates and 112 wires to a netlist network with 26 inputs and 13 outputs.

3.31.44.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.44.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        4
ABC RESULTS:               NOT cells:        3
ABC RESULTS:                OR cells:       14
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:               NOR cells:        3
ABC RESULTS:               MUX cells:        4
ABC RESULTS:             ORNOT cells:        9
ABC RESULTS:               AND cells:       23
ABC RESULTS:              NAND cells:       26
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:       73
ABC RESULTS:           input signals:       26
ABC RESULTS:          output signals:       13
Removing temp directory.

3.31.45. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$11259, asynchronously reset by \reset
Extracted 35 gates and 61 wires to a netlist network with 25 inputs and 10 outputs.

3.31.45.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.45.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:                OR cells:        7
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               AND cells:       17
ABC RESULTS:              NAND cells:        9
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       26
ABC RESULTS:           input signals:       25
ABC RESULTS:          output signals:       10
Removing temp directory.

3.31.46. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$10989, asynchronously reset by \reset
Extracted 15 gates and 25 wires to a netlist network with 10 inputs and 12 outputs.

3.31.46.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.46.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:                OR cells:        4
ABC RESULTS:               AND cells:        5
ABC RESULTS:               BUF cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:        internal signals:        3
ABC RESULTS:           input signals:       10
ABC RESULTS:          output signals:       12
Removing temp directory.

3.31.47. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, asynchronously reset by \reset
Extracted 130 gates and 159 wires to a netlist network with 27 inputs and 37 outputs.

3.31.47.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.47.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       12
ABC RESULTS:               NOT cells:       14
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               NOR cells:        8
ABC RESULTS:            ANDNOT cells:       10
ABC RESULTS:               MUX cells:        7
ABC RESULTS:                OR cells:       20
ABC RESULTS:             ORNOT cells:       11
ABC RESULTS:               AND cells:       30
ABC RESULTS:              NAND cells:       43
ABC RESULTS:               BUF cells:       10
ABC RESULTS:        internal signals:       95
ABC RESULTS:           input signals:       27
ABC RESULTS:          output signals:       37
Removing temp directory.

3.31.48. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $auto$opt_dff.cc:219:make_patterns_logic$10090, asynchronously reset by \reset
Extracted 58 gates and 84 wires to a netlist network with 26 inputs and 14 outputs.

3.31.48.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.48.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        5
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               NOR cells:        2
ABC RESULTS:               MUX cells:        5
ABC RESULTS:                OR cells:        9
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               XOR cells:        3
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               AND cells:       19
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:       44
ABC RESULTS:           input signals:       26
ABC RESULTS:          output signals:       14
Removing temp directory.

3.31.49. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15387$auto$opt_dff.cc:219:make_patterns_logic$555, asynchronously reset by \reset
Extracted 2 gates and 4 wires to a netlist network with 2 inputs and 2 outputs.

3.31.49.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.49.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        2
ABC RESULTS:          output signals:        2
Removing temp directory.

yosys> abc -dff

3.32. Executing ABC pass (technology mapping using ABC).

3.32.1. Summary of detected clock domains:
  5 cells in clk=\clock, en=$abc$15182$auto$opt_dff.cc:219:make_patterns_logic$570, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15142$auto$opt_dff.cc:219:make_patterns_logic$648, arst=\reset, srst={ }
  38 cells in clk=\clock, en=$abc$15387$auto$opt_dff.cc:219:make_patterns_logic$10989, arst=\reset, srst={ }
  32 cells in clk=\clock, en=$abc$14582$auto$opt_dff.cc:219:make_patterns_logic$6044, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15174$auto$opt_dff.cc:219:make_patterns_logic$567, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15134$auto$opt_dff.cc:219:make_patterns_logic$645, arst=\reset, srst={ }
  37 cells in clk=\clock, en=$abc$15345$auto$opt_dff.cc:219:make_patterns_logic$11259, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15118$auto$opt_dff.cc:219:make_patterns_logic$639, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15150$auto$opt_dff.cc:219:make_patterns_logic$558, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15190$auto$opt_dff.cc:219:make_patterns_logic$573, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15094$auto$opt_dff.cc:219:make_patterns_logic$630, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15086$auto$opt_dff.cc:219:make_patterns_logic$627, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15078$auto$opt_dff.cc:219:make_patterns_logic$624, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15070$auto$opt_dff.cc:219:make_patterns_logic$621, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15062$auto$opt_dff.cc:219:make_patterns_logic$615, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15110$auto$opt_dff.cc:219:make_patterns_logic$636, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15166$auto$opt_dff.cc:219:make_patterns_logic$564, arst=\reset, srst={ }
  27 cells in clk=\clock, en=$abc$14287$auto$opt_dff.cc:219:make_patterns_logic$8400, arst=\reset, srst={ }
  50 cells in clk=\clock, en=$abc$14322$auto$opt_dff.cc:219:make_patterns_logic$7316, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15102$auto$opt_dff.cc:219:make_patterns_logic$633, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15126$auto$opt_dff.cc:219:make_patterns_logic$642, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15158$auto$opt_dff.cc:219:make_patterns_logic$561, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15198$auto$opt_dff.cc:219:make_patterns_logic$585, arst=\reset, srst={ }
  37 cells in clk=\clock, en=$abc$15214$auto$opt_dff.cc:219:make_patterns_logic$12199, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15054$auto$opt_dff.cc:219:make_patterns_logic$612, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15046$auto$opt_dff.cc:219:make_patterns_logic$609, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15038$auto$opt_dff.cc:219:make_patterns_logic$606, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15030$auto$opt_dff.cc:219:make_patterns_logic$603, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15022$auto$opt_dff.cc:219:make_patterns_logic$600, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15014$auto$opt_dff.cc:219:make_patterns_logic$597, arst=\reset, srst={ }
  65 cells in clk=\clock, en=$abc$14216$auto$opt_dff.cc:219:make_patterns_logic$8798, arst=\reset, srst={ }
  21 cells in clk=\clock, en=$abc$14945$auto$opt_dff.cc:219:make_patterns_logic$4086, arst=\reset, srst={ }
  18 cells in clk=\clock, en=$abc$14928$auto$opt_dff.cc:219:make_patterns_logic$4233, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$14982$auto$opt_dff.cc:219:make_patterns_logic$582, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15006$auto$opt_dff.cc:219:make_patterns_logic$594, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$14966$auto$opt_dff.cc:219:make_patterns_logic$576, arst=\reset, srst={ }
  54 cells in clk=\clock, en=$abc$14622$auto$opt_dff.cc:219:make_patterns_logic$5392, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$14974$auto$opt_dff.cc:219:make_patterns_logic$579, arst=\reset, srst={ }
  207 cells in clk=\clock, en=$abc$14377$auto$opt_dff.cc:219:make_patterns_logic$6234, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$14998$auto$opt_dff.cc:219:make_patterns_logic$591, arst=\reset, srst={ }
  15 cells in clk=\clock, en=$abc$14914$auto$opt_dff.cc:219:make_patterns_logic$4321, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15206$auto$opt_dff.cc:219:make_patterns_logic$618, arst=\reset, srst={ }
  92 cells in clk=\clock, en=$abc$15250$auto$opt_dff.cc:219:make_patterns_logic$11433, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$14990$auto$opt_dff.cc:219:make_patterns_logic$588, arst=\reset, srst={ }
  150 cells in clk=\clock, en=$abc$14692$auto$opt_dff.cc:219:make_patterns_logic$4544, arst=\reset, srst={ }
  176 cells in clk=\clock, en={ }, arst=\reset, srst={ }
  49 cells in clk=\clock, en=$abc$15573$auto$opt_dff.cc:219:make_patterns_logic$10090, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15387$auto$opt_dff.cc:219:make_patterns_logic$555, arst=\reset, srst={ }

3.32.2. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15182$auto$opt_dff.cc:219:make_patterns_logic$570, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.32.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.32.3. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15142$auto$opt_dff.cc:219:make_patterns_logic$648, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.32.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.32.4. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15387$auto$opt_dff.cc:219:make_patterns_logic$10989, asynchronously reset by \reset
Extracted 38 gates and 72 wires to a netlist network with 34 inputs and 34 outputs.

3.32.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:                OR cells:        2
ABC RESULTS:               AND cells:       29
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        4
ABC RESULTS:           input signals:       34
ABC RESULTS:          output signals:       34
Removing temp directory.

3.32.5. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14582$auto$opt_dff.cc:219:make_patterns_logic$6044, asynchronously reset by \reset
Extracted 30 gates and 56 wires to a netlist network with 26 inputs and 9 outputs.

3.32.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:                OR cells:        9
ABC RESULTS:               NOR cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               AND cells:       14
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       21
ABC RESULTS:           input signals:       26
ABC RESULTS:          output signals:        9
Removing temp directory.

3.32.6. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15174$auto$opt_dff.cc:219:make_patterns_logic$567, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.32.6.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.6.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.32.7. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15134$auto$opt_dff.cc:219:make_patterns_logic$645, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.7.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.7.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.8. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15345$auto$opt_dff.cc:219:make_patterns_logic$11259, asynchronously reset by \reset
Extracted 37 gates and 60 wires to a netlist network with 23 inputs and 8 outputs.

3.32.8.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.8.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:                OR cells:        6
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:               AND cells:       18
ABC RESULTS:              NAND cells:        6
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       29
ABC RESULTS:           input signals:       23
ABC RESULTS:          output signals:        8
Removing temp directory.

3.32.9. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15118$auto$opt_dff.cc:219:make_patterns_logic$639, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.32.9.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.9.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.32.10. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15150$auto$opt_dff.cc:219:make_patterns_logic$558, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.32.10.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.10.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.32.11. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15190$auto$opt_dff.cc:219:make_patterns_logic$573, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.32.11.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.11.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.32.12. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15094$auto$opt_dff.cc:219:make_patterns_logic$630, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.32.12.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.12.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.32.13. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15086$auto$opt_dff.cc:219:make_patterns_logic$627, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.13.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.13.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.14. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15078$auto$opt_dff.cc:219:make_patterns_logic$624, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.14.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.14.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.15. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15070$auto$opt_dff.cc:219:make_patterns_logic$621, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.15.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.15.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.16. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15062$auto$opt_dff.cc:219:make_patterns_logic$615, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.16.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.16.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.17. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15110$auto$opt_dff.cc:219:make_patterns_logic$636, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.17.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.17.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.18. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15166$auto$opt_dff.cc:219:make_patterns_logic$564, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.18.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.18.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.19. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14287$auto$opt_dff.cc:219:make_patterns_logic$8400, asynchronously reset by \reset
Extracted 27 gates and 43 wires to a netlist network with 16 inputs and 14 outputs.

3.32.19.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.19.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:                OR cells:        5
ABC RESULTS:               AND cells:        8
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:               NOR cells:        5
ABC RESULTS:        internal signals:       13
ABC RESULTS:           input signals:       16
ABC RESULTS:          output signals:       14
Removing temp directory.

3.32.20. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14322$auto$opt_dff.cc:219:make_patterns_logic$7316, asynchronously reset by \reset
Extracted 50 gates and 78 wires to a netlist network with 28 inputs and 22 outputs.

3.32.20.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.20.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        6
ABC RESULTS:                OR cells:        2
ABC RESULTS:               MUX cells:       13
ABC RESULTS:               NOR cells:        5
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:              NAND cells:        4
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               XOR cells:        3
ABC RESULTS:               AND cells:       12
ABC RESULTS:               BUF cells:        5
ABC RESULTS:        internal signals:       28
ABC RESULTS:           input signals:       28
ABC RESULTS:          output signals:       22
Removing temp directory.

3.32.21. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15102$auto$opt_dff.cc:219:make_patterns_logic$633, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.21.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.21.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.22. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15126$auto$opt_dff.cc:219:make_patterns_logic$642, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.22.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.22.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.23. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15158$auto$opt_dff.cc:219:make_patterns_logic$561, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.23.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.23.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.24. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15198$auto$opt_dff.cc:219:make_patterns_logic$585, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.24.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.24.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.25. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15214$auto$opt_dff.cc:219:make_patterns_logic$12199, asynchronously reset by \reset
Extracted 37 gates and 65 wires to a netlist network with 28 inputs and 5 outputs.

3.32.25.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.25.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOR cells:        3
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:              NAND cells:        5
ABC RESULTS:                OR cells:        5
ABC RESULTS:               AND cells:       12
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       32
ABC RESULTS:           input signals:       28
ABC RESULTS:          output signals:        5
Removing temp directory.

3.32.26. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15054$auto$opt_dff.cc:219:make_patterns_logic$612, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.26.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.26.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.27. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15046$auto$opt_dff.cc:219:make_patterns_logic$609, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.27.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.27.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.28. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15038$auto$opt_dff.cc:219:make_patterns_logic$606, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.28.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.28.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.29. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15030$auto$opt_dff.cc:219:make_patterns_logic$603, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.29.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.29.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.30. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15022$auto$opt_dff.cc:219:make_patterns_logic$600, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.30.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.30.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.31. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15014$auto$opt_dff.cc:219:make_patterns_logic$597, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.31.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.31.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.32. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14216$auto$opt_dff.cc:219:make_patterns_logic$8798, asynchronously reset by \reset
Extracted 65 gates and 95 wires to a netlist network with 30 inputs and 23 outputs.

3.32.32.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.32.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        5
ABC RESULTS:               NOT cells:        6
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:                OR cells:        8
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:              NAND cells:        1
ABC RESULTS:               MUX cells:       10
ABC RESULTS:               XOR cells:        4
ABC RESULTS:               AND cells:       23
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       42
ABC RESULTS:           input signals:       30
ABC RESULTS:          output signals:       23
Removing temp directory.

3.32.33. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14945$auto$opt_dff.cc:219:make_patterns_logic$4086, asynchronously reset by \reset
Extracted 21 gates and 36 wires to a netlist network with 15 inputs and 2 outputs.

3.32.33.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.33.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:             ORNOT cells:        5
ABC RESULTS:                OR cells:        4
ABC RESULTS:               AND cells:        6
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       19
ABC RESULTS:           input signals:       15
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.34. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14928$auto$opt_dff.cc:219:make_patterns_logic$4233, asynchronously reset by \reset
Extracted 18 gates and 31 wires to a netlist network with 13 inputs and 2 outputs.

3.32.34.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.34.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:                OR cells:        5
ABC RESULTS:               AND cells:        6
ABC RESULTS:               NOT cells:        2
ABC RESULTS:        internal signals:       16
ABC RESULTS:           input signals:       13
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.35. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$14982$auto$opt_dff.cc:219:make_patterns_logic$582, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.35.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.35.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.36. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15006$auto$opt_dff.cc:219:make_patterns_logic$594, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.36.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.36.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.37. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$14966$auto$opt_dff.cc:219:make_patterns_logic$576, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.37.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.37.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.38. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14622$auto$opt_dff.cc:219:make_patterns_logic$5392, asynchronously reset by \reset
Extracted 54 gates and 82 wires to a netlist network with 28 inputs and 23 outputs.

3.32.38.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.38.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:       14
ABC RESULTS:               NOR cells:        4
ABC RESULTS:                OR cells:       10
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               MUX cells:        1
ABC RESULTS:             ORNOT cells:        5
ABC RESULTS:              NAND cells:       15
ABC RESULTS:               BUF cells:        2
ABC RESULTS:               NOT cells:        4
ABC RESULTS:        internal signals:       31
ABC RESULTS:           input signals:       28
ABC RESULTS:          output signals:       23
Removing temp directory.

3.32.39. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$14974$auto$opt_dff.cc:219:make_patterns_logic$579, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.39.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.39.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.40. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14377$auto$opt_dff.cc:219:make_patterns_logic$6234, asynchronously reset by \reset
Extracted 207 gates and 244 wires to a netlist network with 37 inputs and 18 outputs.

3.32.40.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.40.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        6
ABC RESULTS:               NOT cells:        3
ABC RESULTS:               XOR cells:        2
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               NOR cells:        6
ABC RESULTS:             ORNOT cells:        8
ABC RESULTS:            ANDNOT cells:        9
ABC RESULTS:                OR cells:       25
ABC RESULTS:               AND cells:       36
ABC RESULTS:              NAND cells:       52
ABC RESULTS:               MUX cells:       20
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:      189
ABC RESULTS:           input signals:       37
ABC RESULTS:          output signals:       18
Removing temp directory.

3.32.41. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$14998$auto$opt_dff.cc:219:make_patterns_logic$591, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.41.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.41.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.42. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14914$auto$opt_dff.cc:219:make_patterns_logic$4321, asynchronously reset by \reset
Extracted 15 gates and 25 wires to a netlist network with 10 inputs and 11 outputs.

3.32.42.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.42.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        1
ABC RESULTS:                OR cells:        5
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:               AND cells:        5
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        4
ABC RESULTS:           input signals:       10
ABC RESULTS:          output signals:       11
Removing temp directory.

3.32.43. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15206$auto$opt_dff.cc:219:make_patterns_logic$618, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.43.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.43.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.44. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15250$auto$opt_dff.cc:219:make_patterns_logic$11433, asynchronously reset by \reset
Extracted 92 gates and 119 wires to a netlist network with 27 inputs and 13 outputs.

3.32.44.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.44.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        4
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:             ORNOT cells:        6
ABC RESULTS:            ANDNOT cells:        8
ABC RESULTS:                OR cells:       20
ABC RESULTS:               AND cells:       22
ABC RESULTS:              NAND cells:       25
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:       79
ABC RESULTS:           input signals:       27
ABC RESULTS:          output signals:       13
Removing temp directory.

3.32.45. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$14990$auto$opt_dff.cc:219:make_patterns_logic$588, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.45.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.45.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.32.46. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14692$auto$opt_dff.cc:219:make_patterns_logic$4544, asynchronously reset by \reset
Extracted 150 gates and 233 wires to a netlist network with 83 inputs and 43 outputs.

3.32.46.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.46.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        5
ABC RESULTS:              NAND cells:       17
ABC RESULTS:               NOR cells:        2
ABC RESULTS:                OR cells:        6
ABC RESULTS:            ANDNOT cells:       35
ABC RESULTS:               AND cells:       79
ABC RESULTS:               MUX cells:        8
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:      107
ABC RESULTS:           input signals:       83
ABC RESULTS:          output signals:       43
Removing temp directory.

3.32.47. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, asynchronously reset by \reset
Extracted 175 gates and 206 wires to a netlist network with 31 inputs and 28 outputs.

3.32.47.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.47.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       12
ABC RESULTS:               NOT cells:       11
ABC RESULTS:            ANDNOT cells:       13
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               NOR cells:        9
ABC RESULTS:                OR cells:       12
ABC RESULTS:             ORNOT cells:       10
ABC RESULTS:              NAND cells:       48
ABC RESULTS:               MUX cells:        8
ABC RESULTS:               XOR cells:        2
ABC RESULTS:               AND cells:       33
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:      147
ABC RESULTS:           input signals:       31
ABC RESULTS:          output signals:       28
Removing temp directory.

3.32.48. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15573$auto$opt_dff.cc:219:make_patterns_logic$10090, asynchronously reset by \reset
Extracted 49 gates and 75 wires to a netlist network with 26 inputs and 14 outputs.

3.32.48.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.48.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        5
ABC RESULTS:               NOT cells:        2
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:                OR cells:        8
ABC RESULTS:               MUX cells:        4
ABC RESULTS:              NAND cells:        5
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               XOR cells:        3
ABC RESULTS:               AND cells:       18
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:       35
ABC RESULTS:           input signals:       26
ABC RESULTS:          output signals:       14
Removing temp directory.

3.32.49. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15387$auto$opt_dff.cc:219:make_patterns_logic$555, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.32.49.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.49.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  5 cells in clk=\clock, en=$abc$15633$abc$15182$auto$opt_dff.cc:219:make_patterns_logic$570, arst=\reset, srst={ }
  33 cells in clk=\clock, en=$abc$15649$abc$15387$auto$opt_dff.cc:219:make_patterns_logic$10989, arst=\reset, srst={ }
  35 cells in clk=\clock, en=$abc$15689$abc$14582$auto$opt_dff.cc:219:make_patterns_logic$6044, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15721$abc$15174$auto$opt_dff.cc:219:make_patterns_logic$567, arst=\reset, srst={ }
  44 cells in clk=\clock, en=$abc$15736$abc$15345$auto$opt_dff.cc:219:make_patterns_logic$11259, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15775$abc$15118$auto$opt_dff.cc:219:make_patterns_logic$639, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15783$abc$15150$auto$opt_dff.cc:219:make_patterns_logic$558, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15791$abc$15190$auto$opt_dff.cc:219:make_patterns_logic$573, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15799$abc$15094$auto$opt_dff.cc:219:make_patterns_logic$630, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15086$auto$opt_dff.cc:219:make_patterns_logic$627, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15078$auto$opt_dff.cc:219:make_patterns_logic$624, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15070$auto$opt_dff.cc:219:make_patterns_logic$621, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15062$auto$opt_dff.cc:219:make_patterns_logic$615, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15110$auto$opt_dff.cc:219:make_patterns_logic$636, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15649$abc$15166$auto$opt_dff.cc:219:make_patterns_logic$564, arst=\reset, srst={ }
  25 cells in clk=\clock, en=$abc$15849$abc$14287$auto$opt_dff.cc:219:make_patterns_logic$8400, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15102$auto$opt_dff.cc:219:make_patterns_logic$633, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15649$abc$15126$auto$opt_dff.cc:219:make_patterns_logic$642, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15649$abc$15158$auto$opt_dff.cc:219:make_patterns_logic$561, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15198$auto$opt_dff.cc:219:make_patterns_logic$585, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15641$abc$15142$auto$opt_dff.cc:219:make_patterns_logic$648, arst=\reset, srst={ }
  32 cells in clk=\clock, en=$abc$15961$abc$15214$auto$opt_dff.cc:219:make_patterns_logic$12199, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15054$auto$opt_dff.cc:219:make_patterns_logic$612, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15046$auto$opt_dff.cc:219:make_patterns_logic$609, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15038$auto$opt_dff.cc:219:make_patterns_logic$606, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15030$auto$opt_dff.cc:219:make_patterns_logic$603, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15022$auto$opt_dff.cc:219:make_patterns_logic$600, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15014$auto$opt_dff.cc:219:make_patterns_logic$597, arst=\reset, srst={ }
  16 cells in clk=\clock, en=$abc$16101$abc$14945$auto$opt_dff.cc:219:make_patterns_logic$4086, arst=\reset, srst={ }
  19 cells in clk=\clock, en=$abc$16120$abc$14928$auto$opt_dff.cc:219:make_patterns_logic$4233, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$14982$auto$opt_dff.cc:219:make_patterns_logic$582, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15006$auto$opt_dff.cc:219:make_patterns_logic$594, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15134$auto$opt_dff.cc:219:make_patterns_logic$645, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$14966$auto$opt_dff.cc:219:make_patterns_logic$576, arst=\reset, srst={ }
  52 cells in clk=\clock, en=$abc$16158$abc$14622$auto$opt_dff.cc:219:make_patterns_logic$5392, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15649$abc$14974$auto$opt_dff.cc:219:make_patterns_logic$579, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$14998$auto$opt_dff.cc:219:make_patterns_logic$591, arst=\reset, srst={ }
  15 cells in clk=\clock, en=$abc$16403$abc$14914$auto$opt_dff.cc:219:make_patterns_logic$4321, arst=\reset, srst={ }
  157 cells in clk=\clock, en={ }, arst=\reset, srst={ }
  51 cells in clk=\clock, en=$abc$16036$abc$14216$auto$opt_dff.cc:219:make_patterns_logic$8798, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15206$auto$opt_dff.cc:219:make_patterns_logic$618, arst=\reset, srst={ }
  84 cells in clk=\clock, en=$abc$16430$abc$15250$auto$opt_dff.cc:219:make_patterns_logic$11433, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$14990$auto$opt_dff.cc:219:make_patterns_logic$588, arst=\reset, srst={ }
  157 cells in clk=\clock, en=$abc$16529$abc$14692$auto$opt_dff.cc:219:make_patterns_logic$4544, arst=\reset, srst={ }
  60 cells in clk=\clock, en=$abc$15877$abc$14322$auto$opt_dff.cc:219:make_patterns_logic$7316, arst=\reset, srst={ }
  163 cells in clk=\clock, en=$abc$16225$abc$14377$auto$opt_dff.cc:219:make_patterns_logic$6234, arst=\reset, srst={ }
  53 cells in clk=\clock, en=$abc$16851$abc$15573$auto$opt_dff.cc:219:make_patterns_logic$10090, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15649$abc$15387$auto$opt_dff.cc:219:make_patterns_logic$555, arst=\reset, srst={ }

3.33.2. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15633$abc$15182$auto$opt_dff.cc:219:make_patterns_logic$570, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.33.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.33.3. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15387$auto$opt_dff.cc:219:make_patterns_logic$10989, asynchronously reset by \reset
Extracted 33 gates and 65 wires to a netlist network with 32 inputs and 29 outputs.

3.33.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:                OR cells:        3
ABC RESULTS:               AND cells:       27
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        4
ABC RESULTS:           input signals:       32
ABC RESULTS:          output signals:       29
Removing temp directory.

3.33.4. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15689$abc$14582$auto$opt_dff.cc:219:make_patterns_logic$6044, asynchronously reset by \reset
Extracted 33 gates and 61 wires to a netlist network with 28 inputs and 11 outputs.

3.33.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               AND cells:       14
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               NOR cells:        2
ABC RESULTS:                OR cells:       11
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       22
ABC RESULTS:           input signals:       28
ABC RESULTS:          output signals:       11
Removing temp directory.

3.33.5. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15721$abc$15174$auto$opt_dff.cc:219:make_patterns_logic$567, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.6. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15736$abc$15345$auto$opt_dff.cc:219:make_patterns_logic$11259, asynchronously reset by \reset
Extracted 44 gates and 74 wires to a netlist network with 30 inputs and 11 outputs.

3.33.6.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.6.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:                OR cells:        7
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:               MUX cells:        2
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:               AND cells:       20
ABC RESULTS:              NAND cells:        7
ABC RESULTS:        internal signals:       33
ABC RESULTS:           input signals:       30
ABC RESULTS:          output signals:       11
Removing temp directory.

3.33.7. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15775$abc$15118$auto$opt_dff.cc:219:make_patterns_logic$639, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.33.7.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.7.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.33.8. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15783$abc$15150$auto$opt_dff.cc:219:make_patterns_logic$558, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.33.8.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.8.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.33.9. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15791$abc$15190$auto$opt_dff.cc:219:make_patterns_logic$573, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.33.9.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.9.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.33.10. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15799$abc$15094$auto$opt_dff.cc:219:make_patterns_logic$630, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.10.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.10.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.11. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15086$auto$opt_dff.cc:219:make_patterns_logic$627, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.11.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.11.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.12. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15078$auto$opt_dff.cc:219:make_patterns_logic$624, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.12.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.12.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.13. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15070$auto$opt_dff.cc:219:make_patterns_logic$621, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.13.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.13.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.14. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15062$auto$opt_dff.cc:219:make_patterns_logic$615, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.14.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.14.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.15. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15110$auto$opt_dff.cc:219:make_patterns_logic$636, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.15.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.15.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.16. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15166$auto$opt_dff.cc:219:make_patterns_logic$564, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.33.16.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.16.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.33.17. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15849$abc$14287$auto$opt_dff.cc:219:make_patterns_logic$8400, asynchronously reset by \reset
Extracted 25 gates and 40 wires to a netlist network with 15 inputs and 12 outputs.

3.33.17.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.17.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        1
ABC RESULTS:              NAND cells:        1
ABC RESULTS:                OR cells:        3
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:               AND cells:        9
ABC RESULTS:               NOR cells:        6
ABC RESULTS:        internal signals:       13
ABC RESULTS:           input signals:       15
ABC RESULTS:          output signals:       12
Removing temp directory.

3.33.18. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15102$auto$opt_dff.cc:219:make_patterns_logic$633, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.18.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.18.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.19. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15126$auto$opt_dff.cc:219:make_patterns_logic$642, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.33.19.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.19.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.33.20. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$15158$auto$opt_dff.cc:219:make_patterns_logic$561, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.33.20.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.20.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.33.21. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15198$auto$opt_dff.cc:219:make_patterns_logic$585, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.21.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.21.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.22. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15641$abc$15142$auto$opt_dff.cc:219:make_patterns_logic$648, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.33.22.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.22.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.33.23. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15961$abc$15214$auto$opt_dff.cc:219:make_patterns_logic$12199, asynchronously reset by \reset
Extracted 32 gates and 60 wires to a netlist network with 28 inputs and 6 outputs.

3.33.23.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.23.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:               NOR cells:        2
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:              NAND cells:        4
ABC RESULTS:               MUX cells:        1
ABC RESULTS:                OR cells:        5
ABC RESULTS:               AND cells:       11
ABC RESULTS:               BUF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:        internal signals:       26
ABC RESULTS:           input signals:       28
ABC RESULTS:          output signals:        6
Removing temp directory.

3.33.24. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15054$auto$opt_dff.cc:219:make_patterns_logic$612, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.24.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.24.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.25. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15046$auto$opt_dff.cc:219:make_patterns_logic$609, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.25.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.25.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.26. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15038$auto$opt_dff.cc:219:make_patterns_logic$606, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.26.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.26.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.27. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15030$auto$opt_dff.cc:219:make_patterns_logic$603, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.27.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.27.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.28. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15022$auto$opt_dff.cc:219:make_patterns_logic$600, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.28.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.28.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.29. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15014$auto$opt_dff.cc:219:make_patterns_logic$597, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.29.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.29.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.30. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16101$abc$14945$auto$opt_dff.cc:219:make_patterns_logic$4086, asynchronously reset by \reset
Extracted 16 gates and 31 wires to a netlist network with 15 inputs and 2 outputs.

3.33.30.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.30.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:             ORNOT cells:        5
ABC RESULTS:                OR cells:        4
ABC RESULTS:               AND cells:        6
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       14
ABC RESULTS:           input signals:       15
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.31. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16120$abc$14928$auto$opt_dff.cc:219:make_patterns_logic$4233, asynchronously reset by \reset
Extracted 19 gates and 33 wires to a netlist network with 14 inputs and 2 outputs.

3.33.31.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.31.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOR cells:        1
ABC RESULTS:              NAND cells:        4
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:                OR cells:        2
ABC RESULTS:               AND cells:        5
ABC RESULTS:               NOT cells:        2
ABC RESULTS:        internal signals:       17
ABC RESULTS:           input signals:       14
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.32. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$14982$auto$opt_dff.cc:219:make_patterns_logic$582, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.32.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.32.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.33. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15006$auto$opt_dff.cc:219:make_patterns_logic$594, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.33.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.33.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.34. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15134$auto$opt_dff.cc:219:make_patterns_logic$645, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.34.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.34.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.35. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$14966$auto$opt_dff.cc:219:make_patterns_logic$576, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.35.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.35.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.36. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16158$abc$14622$auto$opt_dff.cc:219:make_patterns_logic$5392, asynchronously reset by \reset
Extracted 52 gates and 74 wires to a netlist network with 22 inputs and 19 outputs.

3.33.36.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.36.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:                OR cells:        5
ABC RESULTS:               NOR cells:        2
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:               AND cells:       15
ABC RESULTS:              NAND cells:       15
ABC RESULTS:               BUF cells:        2
ABC RESULTS:               NOT cells:        6
ABC RESULTS:        internal signals:       33
ABC RESULTS:           input signals:       22
ABC RESULTS:          output signals:       19
Removing temp directory.

3.33.37. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15649$abc$14974$auto$opt_dff.cc:219:make_patterns_logic$579, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.33.37.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.37.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.33.38. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$14998$auto$opt_dff.cc:219:make_patterns_logic$591, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.38.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.38.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.39. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16403$abc$14914$auto$opt_dff.cc:219:make_patterns_logic$4321, asynchronously reset by \reset
Extracted 15 gates and 25 wires to a netlist network with 10 inputs and 11 outputs.

3.33.39.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.39.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:                OR cells:        3
ABC RESULTS:             ORNOT cells:        3
ABC RESULTS:               AND cells:        5
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        4
ABC RESULTS:           input signals:       10
ABC RESULTS:          output signals:       11
Removing temp directory.

3.33.40. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, asynchronously reset by \reset
Extracted 156 gates and 182 wires to a netlist network with 26 inputs and 27 outputs.

3.33.40.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.40.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       12
ABC RESULTS:               NOT cells:        9
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:               NOR cells:        6
ABC RESULTS:            ANDNOT cells:       18
ABC RESULTS:                OR cells:       13
ABC RESULTS:             ORNOT cells:       12
ABC RESULTS:              NAND cells:       46
ABC RESULTS:               AND cells:       31
ABC RESULTS:               MUX cells:        6
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:      129
ABC RESULTS:           input signals:       26
ABC RESULTS:          output signals:       27
Removing temp directory.

3.33.41. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16036$abc$14216$auto$opt_dff.cc:219:make_patterns_logic$8798, asynchronously reset by \reset
Extracted 51 gates and 76 wires to a netlist network with 25 inputs and 16 outputs.

3.33.41.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.41.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        5
ABC RESULTS:               NOT cells:        5
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               NOR cells:        2
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               MUX cells:        2
ABC RESULTS:               XOR cells:        1
ABC RESULTS:              NAND cells:        4
ABC RESULTS:                OR cells:        8
ABC RESULTS:               AND cells:       23
ABC RESULTS:               BUF cells:        5
ABC RESULTS:        internal signals:       35
ABC RESULTS:           input signals:       25
ABC RESULTS:          output signals:       16
Removing temp directory.

3.33.42. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15206$auto$opt_dff.cc:219:make_patterns_logic$618, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.42.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.42.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.43. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16430$abc$15250$auto$opt_dff.cc:219:make_patterns_logic$11433, asynchronously reset by \reset
Extracted 84 gates and 111 wires to a netlist network with 27 inputs and 10 outputs.

3.33.43.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.43.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        4
ABC RESULTS:               NOR cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:               MUX cells:        1
ABC RESULTS:            ANDNOT cells:        5
ABC RESULTS:                OR cells:       21
ABC RESULTS:               AND cells:       26
ABC RESULTS:              NAND cells:       20
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:       74
ABC RESULTS:           input signals:       27
ABC RESULTS:          output signals:       10
Removing temp directory.

3.33.44. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$14990$auto$opt_dff.cc:219:make_patterns_logic$588, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.44.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.44.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

3.33.45. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16529$abc$14692$auto$opt_dff.cc:219:make_patterns_logic$4544, asynchronously reset by \reset
Extracted 157 gates and 244 wires to a netlist network with 87 inputs and 45 outputs.

3.33.45.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.45.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        5
ABC RESULTS:               NOT cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:              NAND cells:       17
ABC RESULTS:               NOR cells:        2
ABC RESULTS:                OR cells:        7
ABC RESULTS:            ANDNOT cells:       36
ABC RESULTS:               AND cells:       83
ABC RESULTS:               MUX cells:        9
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:      112
ABC RESULTS:           input signals:       87
ABC RESULTS:          output signals:       45
Removing temp directory.

3.33.46. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15877$abc$14322$auto$opt_dff.cc:219:make_patterns_logic$7316, asynchronously reset by \reset
Extracted 60 gates and 96 wires to a netlist network with 36 inputs and 24 outputs.

3.33.46.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.46.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        6
ABC RESULTS:               NOT cells:        1
ABC RESULTS:                OR cells:        6
ABC RESULTS:               MUX cells:       17
ABC RESULTS:               NOR cells:        5
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:              NAND cells:        4
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               XOR cells:        3
ABC RESULTS:               AND cells:       12
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       36
ABC RESULTS:           input signals:       36
ABC RESULTS:          output signals:       24
Removing temp directory.

3.33.47. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16225$abc$14377$auto$opt_dff.cc:219:make_patterns_logic$6234, asynchronously reset by \reset
Extracted 163 gates and 199 wires to a netlist network with 36 inputs and 21 outputs.

3.33.47.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.47.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        6
ABC RESULTS:               NOT cells:        3
ABC RESULTS:               XOR cells:        2
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:             ORNOT cells:       10
ABC RESULTS:               MUX cells:       11
ABC RESULTS:            ANDNOT cells:       13
ABC RESULTS:               NOR cells:        8
ABC RESULTS:                OR cells:       18
ABC RESULTS:               AND cells:       41
ABC RESULTS:              NAND cells:       56
ABC RESULTS:               BUF cells:        5
ABC RESULTS:        internal signals:      142
ABC RESULTS:           input signals:       36
ABC RESULTS:          output signals:       21
Removing temp directory.

3.33.48. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16851$abc$15573$auto$opt_dff.cc:219:make_patterns_logic$10090, asynchronously reset by \reset
Extracted 53 gates and 77 wires to a netlist network with 24 inputs and 15 outputs.

3.33.48.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.48.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        5
ABC RESULTS:               NOT cells:        2
ABC RESULTS:                OR cells:        8
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:               MUX cells:        4
ABC RESULTS:              NAND cells:        4
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               XOR cells:        6
ABC RESULTS:               AND cells:       17
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       38
ABC RESULTS:           input signals:       24
ABC RESULTS:          output signals:       15
Removing temp directory.

3.33.49. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$16920$abc$15649$abc$15387$auto$opt_dff.cc:219:make_patterns_logic$555, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.33.49.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.49.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

yosys> opt_ffinv

3.34. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 1 inverters.

yosys> opt -sat

3.35. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.35.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.
<suppressed ~23 debug messages>

yosys> opt_merge -nomux

3.35.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
<suppressed ~45 debug messages>
Removed a total of 15 cells.

yosys> opt_muxtree

3.35.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce

3.35.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.35.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.35.6. Executing OPT_DFF pass (perform DFF optimizations).
Handling D = Q on $abc$17275$auto$blifparse.cc:362:parse_blif$17276 ($_DFFE_PP1P_) from module b12 (removing D path).
Setting constant 1-bit at position 0 on $abc$17275$auto$blifparse.cc:362:parse_blif$17276 ($_DLATCH_P_) from module b12.

yosys> opt_clean

3.35.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 18 unused cells and 4920 unused wires.
<suppressed ~59 debug messages>

yosys> opt_expr

3.35.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.
<suppressed ~1 debug messages>

3.35.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.35.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce

3.35.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.35.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.35.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.35.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.35.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.35.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.35.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce

3.35.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.35.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.35.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.35.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> opt_expr

3.35.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.35.23. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  5 cells in clk=\clock, en=$abc$15387$auto$opt_dff.cc:219:make_patterns_logic$555, arst=\reset, srst={ }
  54 cells in clk=\clock, en=$abc$15573$auto$opt_dff.cc:219:make_patterns_logic$10090, arst=\reset, srst={ }
  174 cells in clk=\clock, en=$abc$14377$auto$opt_dff.cc:219:make_patterns_logic$6234, arst=\reset, srst={ }
  58 cells in clk=\clock, en=$abc$14322$auto$opt_dff.cc:219:make_patterns_logic$7316, arst=\reset, srst={ }
  160 cells in clk=\clock, en=$abc$14692$auto$opt_dff.cc:219:make_patterns_logic$4544, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$14990$auto$opt_dff.cc:219:make_patterns_logic$588, arst=\reset, srst={ }
  79 cells in clk=\clock, en=$abc$15250$auto$opt_dff.cc:219:make_patterns_logic$11433, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15206$auto$opt_dff.cc:219:make_patterns_logic$618, arst=\reset, srst={ }
  50 cells in clk=\clock, en=$abc$14216$auto$opt_dff.cc:219:make_patterns_logic$8798, arst=\reset, srst={ }
  147 cells in clk=\clock, en={ }, arst=\reset, srst={ }
  12 cells in clk=\clock, en=$abc$14914$auto$opt_dff.cc:219:make_patterns_logic$4321, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$14998$auto$opt_dff.cc:219:make_patterns_logic$591, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$14974$auto$opt_dff.cc:219:make_patterns_logic$579, arst=\reset, srst={ }
  47 cells in clk=\clock, en=$abc$14622$auto$opt_dff.cc:219:make_patterns_logic$5392, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$14966$auto$opt_dff.cc:219:make_patterns_logic$576, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15134$auto$opt_dff.cc:219:make_patterns_logic$645, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15006$auto$opt_dff.cc:219:make_patterns_logic$594, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$14982$auto$opt_dff.cc:219:make_patterns_logic$582, arst=\reset, srst={ }
  17 cells in clk=\clock, en=$abc$14945$auto$opt_dff.cc:219:make_patterns_logic$4086, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15014$auto$opt_dff.cc:219:make_patterns_logic$597, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15022$auto$opt_dff.cc:219:make_patterns_logic$600, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15030$auto$opt_dff.cc:219:make_patterns_logic$603, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15038$auto$opt_dff.cc:219:make_patterns_logic$606, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15046$auto$opt_dff.cc:219:make_patterns_logic$609, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15054$auto$opt_dff.cc:219:make_patterns_logic$612, arst=\reset, srst={ }
  28 cells in clk=\clock, en=$abc$15214$auto$opt_dff.cc:219:make_patterns_logic$12199, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15142$auto$opt_dff.cc:219:make_patterns_logic$648, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15198$auto$opt_dff.cc:219:make_patterns_logic$585, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15158$auto$opt_dff.cc:219:make_patterns_logic$561, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15126$auto$opt_dff.cc:219:make_patterns_logic$642, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15102$auto$opt_dff.cc:219:make_patterns_logic$633, arst=\reset, srst={ }
  23 cells in clk=\clock, en=$abc$14287$auto$opt_dff.cc:219:make_patterns_logic$8400, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15166$auto$opt_dff.cc:219:make_patterns_logic$564, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15110$auto$opt_dff.cc:219:make_patterns_logic$636, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15062$auto$opt_dff.cc:219:make_patterns_logic$615, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15070$auto$opt_dff.cc:219:make_patterns_logic$621, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15078$auto$opt_dff.cc:219:make_patterns_logic$624, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15086$auto$opt_dff.cc:219:make_patterns_logic$627, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15094$auto$opt_dff.cc:219:make_patterns_logic$630, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15190$auto$opt_dff.cc:219:make_patterns_logic$573, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15150$auto$opt_dff.cc:219:make_patterns_logic$558, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15118$auto$opt_dff.cc:219:make_patterns_logic$639, arst=\reset, srst={ }
  41 cells in clk=\clock, en=$abc$15345$auto$opt_dff.cc:219:make_patterns_logic$11259, arst=\reset, srst={ }
  5 cells in clk=\clock, en=$abc$15174$auto$opt_dff.cc:219:make_patterns_logic$567, arst=\reset, srst={ }
  32 cells in clk=\clock, en=$abc$14582$auto$opt_dff.cc:219:make_patterns_logic$6044, arst=\reset, srst={ }
  17 cells in clk=\clock, en=$abc$15387$auto$opt_dff.cc:219:make_patterns_logic$10989, arst=\reset, srst={ }
  4 cells in clk=\clock, en=$abc$15182$auto$opt_dff.cc:219:make_patterns_logic$570, arst=\reset, srst={ }

3.36.2. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15387$auto$opt_dff.cc:219:make_patterns_logic$555, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        1
ABC RESULTS:               AND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.3. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15573$auto$opt_dff.cc:219:make_patterns_logic$10090, asynchronously reset by \reset
Extracted 54 gates and 78 wires to a netlist network with 24 inputs and 17 outputs.

3.36.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        5
ABC RESULTS:               NOT cells:        3
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:               MUX cells:        5
ABC RESULTS:              NAND cells:        7
ABC RESULTS:              XNOR cells:        3
ABC RESULTS:                OR cells:        7
ABC RESULTS:               XOR cells:        5
ABC RESULTS:               AND cells:       18
ABC RESULTS:        internal signals:       37
ABC RESULTS:           input signals:       24
ABC RESULTS:          output signals:       17
Removing temp directory.

3.36.4. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14377$auto$opt_dff.cc:219:make_patterns_logic$6234, asynchronously reset by \reset
Extracted 174 gates and 212 wires to a netlist network with 38 inputs and 15 outputs.

3.36.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        6
ABC RESULTS:               NOT cells:        2
ABC RESULTS:               XOR cells:        2
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:             ORNOT cells:       10
ABC RESULTS:               MUX cells:       14
ABC RESULTS:                OR cells:       21
ABC RESULTS:            ANDNOT cells:       15
ABC RESULTS:               NOR cells:        4
ABC RESULTS:               AND cells:       40
ABC RESULTS:              NAND cells:       60
ABC RESULTS:        internal signals:      159
ABC RESULTS:           input signals:       38
ABC RESULTS:          output signals:       15
Removing temp directory.

3.36.5. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14322$auto$opt_dff.cc:219:make_patterns_logic$7316, asynchronously reset by \reset
Extracted 58 gates and 91 wires to a netlist network with 33 inputs and 26 outputs.

3.36.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        6
ABC RESULTS:               NOT cells:        1
ABC RESULTS:                OR cells:        4
ABC RESULTS:               MUX cells:       12
ABC RESULTS:               NOR cells:        5
ABC RESULTS:            ANDNOT cells:        7
ABC RESULTS:              NAND cells:        5
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               XOR cells:        3
ABC RESULTS:               AND cells:       13
ABC RESULTS:               BUF cells:        6
ABC RESULTS:        internal signals:       32
ABC RESULTS:           input signals:       33
ABC RESULTS:          output signals:       26
Removing temp directory.

3.36.6. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14692$auto$opt_dff.cc:219:make_patterns_logic$4544, asynchronously reset by \reset
Extracted 160 gates and 245 wires to a netlist network with 85 inputs and 44 outputs.

3.36.6.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.6.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        5
ABC RESULTS:               NOT cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               NOR cells:        2
ABC RESULTS:                OR cells:        5
ABC RESULTS:              NAND cells:       17
ABC RESULTS:               AND cells:       74
ABC RESULTS:            ANDNOT cells:       34
ABC RESULTS:               MUX cells:       13
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:      116
ABC RESULTS:           input signals:       85
ABC RESULTS:          output signals:       44
Removing temp directory.

3.36.7. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14990$auto$opt_dff.cc:219:make_patterns_logic$588, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.7.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.7.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.8. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15250$auto$opt_dff.cc:219:make_patterns_logic$11433, asynchronously reset by \reset
Extracted 79 gates and 106 wires to a netlist network with 27 inputs and 10 outputs.

3.36.8.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.8.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        4
ABC RESULTS:               NOT cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:                OR cells:       17
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               NOR cells:        2
ABC RESULTS:               AND cells:       21
ABC RESULTS:              NAND cells:       21
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:       69
ABC RESULTS:           input signals:       27
ABC RESULTS:          output signals:       10
Removing temp directory.

3.36.9. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15206$auto$opt_dff.cc:219:make_patterns_logic$618, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.9.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.9.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.10. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14216$auto$opt_dff.cc:219:make_patterns_logic$8798, asynchronously reset by \reset
Extracted 50 gates and 73 wires to a netlist network with 23 inputs and 14 outputs.

3.36.10.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.10.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        5
ABC RESULTS:               NOT cells:        5
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:              NAND cells:        3
ABC RESULTS:                OR cells:        9
ABC RESULTS:               AND cells:       23
ABC RESULTS:               BUF cells:        5
ABC RESULTS:        internal signals:       36
ABC RESULTS:           input signals:       23
ABC RESULTS:          output signals:       14
Removing temp directory.

3.36.11. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, asynchronously reset by \reset
Extracted 146 gates and 172 wires to a netlist network with 26 inputs and 23 outputs.

3.36.11.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.11.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       12
ABC RESULTS:               NOT cells:        6
ABC RESULTS:               NOR cells:        5
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               XOR cells:        1
ABC RESULTS:             ORNOT cells:        9
ABC RESULTS:            ANDNOT cells:       19
ABC RESULTS:                OR cells:       17
ABC RESULTS:              NAND cells:       42
ABC RESULTS:               AND cells:       24
ABC RESULTS:               MUX cells:        8
ABC RESULTS:               BUF cells:        3
ABC RESULTS:        internal signals:      123
ABC RESULTS:           input signals:       26
ABC RESULTS:          output signals:       23
Removing temp directory.

3.36.12. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14914$auto$opt_dff.cc:219:make_patterns_logic$4321, asynchronously reset by \reset
Extracted 12 gates and 25 wires to a netlist network with 13 inputs and 8 outputs.

3.36.12.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.12.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:                OR cells:        2
ABC RESULTS:               AND cells:        5
ABC RESULTS:               BUF cells:        4
ABC RESULTS:        internal signals:        4
ABC RESULTS:           input signals:       13
ABC RESULTS:          output signals:        8
Removing temp directory.

3.36.13. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14998$auto$opt_dff.cc:219:make_patterns_logic$591, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.13.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.13.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.14. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14974$auto$opt_dff.cc:219:make_patterns_logic$579, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.14.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.14.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.15. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14622$auto$opt_dff.cc:219:make_patterns_logic$5392, asynchronously reset by \reset
Extracted 47 gates and 69 wires to a netlist network with 22 inputs and 14 outputs.

3.36.15.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.15.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        2
ABC RESULTS:                OR cells:        4
ABC RESULTS:               NOR cells:        2
ABC RESULTS:               AND cells:       13
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:            ANDNOT cells:        5
ABC RESULTS:              NAND cells:       14
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       33
ABC RESULTS:           input signals:       22
ABC RESULTS:          output signals:       14
Removing temp directory.

3.36.16. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14966$auto$opt_dff.cc:219:make_patterns_logic$576, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.16.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.16.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.17. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15134$auto$opt_dff.cc:219:make_patterns_logic$645, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.17.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.17.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.18. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15006$auto$opt_dff.cc:219:make_patterns_logic$594, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.18.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.18.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.19. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14982$auto$opt_dff.cc:219:make_patterns_logic$582, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.19.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.19.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.20. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14945$auto$opt_dff.cc:219:make_patterns_logic$4086, asynchronously reset by \reset
Extracted 17 gates and 30 wires to a netlist network with 13 inputs and 2 outputs.

3.36.20.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.20.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:              NAND cells:        1
ABC RESULTS:                OR cells:        4
ABC RESULTS:               AND cells:        6
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:       15
ABC RESULTS:           input signals:       13
ABC RESULTS:          output signals:        2
Removing temp directory.

3.36.21. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15014$auto$opt_dff.cc:219:make_patterns_logic$597, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.21.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.21.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.22. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15022$auto$opt_dff.cc:219:make_patterns_logic$600, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.22.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.22.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.23. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15030$auto$opt_dff.cc:219:make_patterns_logic$603, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.23.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.23.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.24. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15038$auto$opt_dff.cc:219:make_patterns_logic$606, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.24.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.24.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.25. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15046$auto$opt_dff.cc:219:make_patterns_logic$609, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.25.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.25.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.26. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15054$auto$opt_dff.cc:219:make_patterns_logic$612, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.26.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.26.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.27. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15214$auto$opt_dff.cc:219:make_patterns_logic$12199, asynchronously reset by \reset
Extracted 28 gates and 55 wires to a netlist network with 27 inputs and 6 outputs.

3.36.27.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.27.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOR cells:        2
ABC RESULTS:            ANDNOT cells:        5
ABC RESULTS:              NAND cells:        6
ABC RESULTS:                OR cells:        5
ABC RESULTS:               AND cells:       10
ABC RESULTS:               BUF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:        internal signals:       22
ABC RESULTS:           input signals:       27
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.28. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15142$auto$opt_dff.cc:219:make_patterns_logic$648, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.28.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.28.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.29. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15198$auto$opt_dff.cc:219:make_patterns_logic$585, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.29.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.29.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.30. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15158$auto$opt_dff.cc:219:make_patterns_logic$561, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.30.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.30.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.31. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15126$auto$opt_dff.cc:219:make_patterns_logic$642, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.31.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.31.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.32. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15102$auto$opt_dff.cc:219:make_patterns_logic$633, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.32.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.32.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.33. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14287$auto$opt_dff.cc:219:make_patterns_logic$8400, asynchronously reset by \reset
Extracted 23 gates and 39 wires to a netlist network with 16 inputs and 14 outputs.

3.36.33.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.33.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        1
ABC RESULTS:                OR cells:        3
ABC RESULTS:               AND cells:        9
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:               NOR cells:        5
ABC RESULTS:        internal signals:        9
ABC RESULTS:           input signals:       16
ABC RESULTS:          output signals:       14
Removing temp directory.

3.36.34. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15166$auto$opt_dff.cc:219:make_patterns_logic$564, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.34.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.34.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.35. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15110$auto$opt_dff.cc:219:make_patterns_logic$636, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.35.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.35.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.36. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15062$auto$opt_dff.cc:219:make_patterns_logic$615, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.36.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.36.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.37. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15070$auto$opt_dff.cc:219:make_patterns_logic$621, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.37.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.37.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.38. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15078$auto$opt_dff.cc:219:make_patterns_logic$624, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.38.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.38.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.39. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15086$auto$opt_dff.cc:219:make_patterns_logic$627, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.39.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.39.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.40. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15094$auto$opt_dff.cc:219:make_patterns_logic$630, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.40.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.40.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.41. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15190$auto$opt_dff.cc:219:make_patterns_logic$573, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.41.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.41.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.42. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15150$auto$opt_dff.cc:219:make_patterns_logic$558, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.42.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.42.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.43. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15118$auto$opt_dff.cc:219:make_patterns_logic$639, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.43.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.43.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.44. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15345$auto$opt_dff.cc:219:make_patterns_logic$11259, asynchronously reset by \reset
Extracted 41 gates and 68 wires to a netlist network with 27 inputs and 10 outputs.

3.36.44.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.44.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:                OR cells:        6
ABC RESULTS:               AND cells:       17
ABC RESULTS:               MUX cells:        1
ABC RESULTS:              NAND cells:       12
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       31
ABC RESULTS:           input signals:       27
ABC RESULTS:          output signals:       10
Removing temp directory.

3.36.45. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15174$auto$opt_dff.cc:219:make_patterns_logic$567, asynchronously reset by \reset
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 3 outputs.

3.36.45.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.45.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        5
ABC RESULTS:          output signals:        3
Removing temp directory.

3.36.46. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$14582$auto$opt_dff.cc:219:make_patterns_logic$6044, asynchronously reset by \reset
Extracted 30 gates and 56 wires to a netlist network with 26 inputs and 9 outputs.

3.36.46.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.46.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        1
ABC RESULTS:                OR cells:        8
ABC RESULTS:               NOR cells:        2
ABC RESULTS:               AND cells:       15
ABC RESULTS:               MUX cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:       21
ABC RESULTS:           input signals:       26
ABC RESULTS:          output signals:        9
Removing temp directory.

3.36.47. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$15387$auto$opt_dff.cc:219:make_patterns_logic$10989, asynchronously reset by \reset
Extracted 17 gates and 25 wires to a netlist network with 8 inputs and 13 outputs.

3.36.47.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.47.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        1
ABC RESULTS:               NOT cells:        3
ABC RESULTS:              NAND cells:        1
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:               AND cells:        5
ABC RESULTS:                OR cells:        2
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               BUF cells:        1
ABC RESULTS:        internal signals:        4
ABC RESULTS:           input signals:        8
ABC RESULTS:          output signals:       13
Removing temp directory.

3.36.48. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock, enabled by $abc$19389$abc$15182$auto$opt_dff.cc:219:make_patterns_logic$570, asynchronously reset by \reset
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.36.48.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.48.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:              NAND cells:        2
ABC RESULTS:               BUF cells:        2
ABC RESULTS:        internal signals:        2
ABC RESULTS:           input signals:        3
ABC RESULTS:          output signals:        2
Removing temp directory.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> abc -script /tmp/yosys_dSLgYE/abc_tmp_1.scr

3.38. Executing ABC pass (technology mapping using ABC).

3.38.1. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Extracted 964 gates and 1086 wires to a netlist network with 122 inputs and 104 outputs.

3.38.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /tmp/yosys_dSLgYE/abc_tmp_1.scr 
ABC:   #PIs = 122  #Luts =   295  Max Lvl =   9  Avg Lvl =   3.18  [   0.07 sec. at Pass 0]
ABC:   #PIs = 122  #Luts =   234  Max Lvl =   8  Avg Lvl =   2.97  [   1.29 sec. at Pass 1]
ABC:   #PIs = 122  #Luts =   227  Max Lvl =   8  Avg Lvl =   3.08  [   0.85 sec. at Pass 2]
ABC:   #PIs = 122  #Luts =   223  Max Lvl =   8  Avg Lvl =   2.97  [   1.02 sec. at Pass 3]
ABC:   #PIs = 122  #Luts =   220  Max Lvl =  10  Avg Lvl =   3.23  [   0.37 sec. at Pass 4]
ABC:   #PIs = 122  #Luts =   218  Max Lvl =   7  Avg Lvl =   2.54  [   1.07 sec. at Pass 5]
ABC:   #PIs = 122  #Luts =   217  Max Lvl =   8  Avg Lvl =   2.59  [   0.34 sec. at Pass 6]
ABC:   #PIs = 122  #Luts =   216  Max Lvl =   7  Avg Lvl =   2.51  [   1.05 sec. at Pass 7]
ABC:   #PIs = 122  #Luts =   214  Max Lvl =   6  Avg Lvl =   2.48  [   0.46 sec. at Pass 8]
ABC:   #PIs = 122  #Luts =   214  Max Lvl =   6  Avg Lvl =   2.48  [   1.25 sec. at Pass 9]
ABC:   #PIs = 122  #Luts =   214  Max Lvl =   6  Avg Lvl =   2.48  [   0.45 sec. at Pass 10]
ABC:   #PIs = 122  #Luts =   210  Max Lvl =   6  Avg Lvl =   2.37  [   1.16 sec. at Pass 11]
ABC:   #PIs = 122  #Luts =   209  Max Lvl =   7  Avg Lvl =   2.52  [   0.45 sec. at Pass 12]
ABC:   #PIs = 122  #Luts =   207  Max Lvl =   7  Avg Lvl =   2.56  [   1.25 sec. at Pass 13]
ABC:   #PIs = 122  #Luts =   207  Max Lvl =   7  Avg Lvl =   2.56  [   0.43 sec. at Pass 14]
ABC:   #PIs = 122  #Luts =   207  Max Lvl =   7  Avg Lvl =   2.56  [   1.56 sec. at Pass 15]
ABC:   #PIs = 122  #Luts =   207  Max Lvl =   7  Avg Lvl =   2.56  [   0.47 sec. at Pass 16]
ABC:   #PIs = 122  #Luts =   205  Max Lvl =   6  Avg Lvl =   2.48  [   5.06 sec. at Pass 17]
ABC:   #PIs = 122  #Luts =   205  Max Lvl =   6  Avg Lvl =   2.48  [   0.92 sec. at Pass 18]
ABC:   #PIs = 122  #Luts =   205  Max Lvl =   6  Avg Lvl =   2.48  [   0.36 sec. at Pass 19]
ABC:   #PIs = 122  #Luts =   205  Max Lvl =   6  Avg Lvl =   2.48  [   0.90 sec. at Pass 20]
ABC:   #PIs = 122  #Luts =   203  Max Lvl =   6  Avg Lvl =   2.44  [   4.71 sec. at Pass 21]
ABC:   #PIs = 122  #Luts =   203  Max Lvl =   6  Avg Lvl =   2.44  [   0.33 sec. at Pass 22]
ABC:   #PIs = 122  #Luts =   203  Max Lvl =   6  Avg Lvl =   2.44  [   1.17 sec. at Pass 23]
ABC:   #PIs = 122  #Luts =   203  Max Lvl =   6  Avg Lvl =   2.44  [   0.41 sec. at Pass 24]
ABC:   #PIs = 122  #Luts =   202  Max Lvl =   6  Avg Lvl =   2.44  [   5.13 sec. at Pass 25]
ABC:   #PIs = 122  #Luts =   202  Max Lvl =   6  Avg Lvl =   2.44  [   0.92 sec. at Pass 26]
ABC:   #PIs = 122  #Luts =   202  Max Lvl =   6  Avg Lvl =   2.44  [   0.40 sec. at Pass 27]
ABC:   #PIs = 122  #Luts =   202  Max Lvl =   6  Avg Lvl =   2.44  [   0.87 sec. at Pass 28]
ABC:   #PIs = 122  #Luts =   201  Max Lvl =   6  Avg Lvl =   2.43  [   4.40 sec. at Pass 29]
ABC:   #PIs = 122  #Luts =   201  Max Lvl =   6  Avg Lvl =   2.43  [   0.34 sec. at Pass 30]
ABC:   #PIs = 122  #Luts =   201  Max Lvl =   6  Avg Lvl =   2.43  [   0.98 sec. at Pass 31]
ABC:   #PIs = 122  #Luts =   201  Max Lvl =   6  Avg Lvl =   2.43  [   0.41 sec. at Pass 32]
ABC:   #PIs = 122  #Luts =   201  Max Lvl =   6  Avg Lvl =   2.43  [   0.12 sec. at Pass 33]
ABC:   [DE total time =   42.94 sec. ]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.38.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      201
ABC RESULTS:        internal signals:      860
ABC RESULTS:           input signals:      122
ABC RESULTS:          output signals:      104
Removing temp directory.

yosys> opt

3.39. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.39.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

yosys> opt_merge -nomux

3.39.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.39.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce

3.39.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.39.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff

3.39.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 0 unused cells and 2801 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.39.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.39.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.39.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce

3.39.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.39.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff

3.39.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> opt_expr

3.39.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.39.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.40. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.41. Printing statistics.

=== b12 ===

   Number of wires:                322
   Number of wire bits:            345
   Number of public wires:          13
   Number of public wire bits:      28
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                322
     $_DFFE_PP0P_                  106
     $_DFF_PP0_                     12
     $lut                          201
     $mux                            3


yosys> shregmap -minlen 8 -maxlen 20

3.42. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.43. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.44. Printing statistics.

=== b12 ===

   Number of wires:                322
   Number of wire bits:            345
   Number of public wires:          13
   Number of public wire bits:      28
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                322
     $_DFFE_PP0P_                  106
     $_DFF_PP0_                     12
     $lut                          201
     $mux                            3


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.45. Executing TECHMAP pass (map to technology primitives).

3.45.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.45.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.45.3. Continuing TECHMAP pass.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $lut.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~576 debug messages>

yosys> opt_expr -mux_undef

3.46. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.
<suppressed ~7569 debug messages>

yosys> simplemap

3.47. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

yosys> opt_merge

3.49. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
<suppressed ~2136 debug messages>
Removed a total of 712 cells.

yosys> opt_dff -nodffe -nosdff

3.50. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.51. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 0 unused cells and 1104 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.52. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.52.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.
<suppressed ~120 debug messages>

yosys> opt_merge -nomux

3.52.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_muxtree

3.52.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.52.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.52.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.52.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 0 unused cells and 11 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.52.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.52.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.52.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.52.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.52.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.52.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> opt_expr

3.52.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.52.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_dSLgYE/abc_tmp_2.scr

3.53. Executing ABC pass (technology mapping using ABC).

3.53.1. Extracting gate netlist of module `\b12' to `<abc-temp-dir>/input.blif'..
Extracted 1209 gates and 1331 wires to a netlist network with 120 inputs and 98 outputs.

3.53.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /tmp/yosys_dSLgYE/abc_tmp_2.scr 
ABC:   #PIs = 120  #Luts =   198  Max Lvl =   6  Avg Lvl =   2.52  [   0.07 sec. at Pass 0]
ABC:   #PIs = 120  #Luts =   198  Max Lvl =   6  Avg Lvl =   2.52  [   1.24 sec. at Pass 1]
ABC:   #PIs = 120  #Luts =   198  Max Lvl =   6  Avg Lvl =   2.52  [   0.37 sec. at Pass 2]
ABC:   #PIs = 120  #Luts =   198  Max Lvl =   6  Avg Lvl =   2.52  [   0.84 sec. at Pass 3]
ABC:   #PIs = 120  #Luts =   197  Max Lvl =   6  Avg Lvl =   2.50  [   0.37 sec. at Pass 4]
ABC:   #PIs = 120  #Luts =   197  Max Lvl =   5  Avg Lvl =   2.39  [   0.93 sec. at Pass 5]
ABC:   #PIs = 120  #Luts =   197  Max Lvl =   5  Avg Lvl =   2.39  [   0.36 sec. at Pass 6]
ABC:   #PIs = 120  #Luts =   197  Max Lvl =   5  Avg Lvl =   2.39  [   1.09 sec. at Pass 7]
ABC:   #PIs = 120  #Luts =   197  Max Lvl =   5  Avg Lvl =   2.39  [   0.35 sec. at Pass 8]
ABC:   #PIs = 120  #Luts =   193  Max Lvl =   6  Avg Lvl =   2.48  [   5.94 sec. at Pass 9]
ABC:   #PIs = 120  #Luts =   193  Max Lvl =   6  Avg Lvl =   2.48  [   1.10 sec. at Pass 10]
ABC:   #PIs = 120  #Luts =   193  Max Lvl =   6  Avg Lvl =   2.48  [   0.45 sec. at Pass 11]
ABC:   #PIs = 120  #Luts =   193  Max Lvl =   6  Avg Lvl =   2.48  [   0.93 sec. at Pass 12]
ABC:   #PIs = 120  #Luts =   193  Max Lvl =   6  Avg Lvl =   2.48  [   5.64 sec. at Pass 13]
ABC:   #PIs = 120  #Luts =   193  Max Lvl =   6  Avg Lvl =   2.48  [   0.13 sec. at Pass 14]
ABC:   [DE total time =   20.51 sec. ]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.53.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      193
ABC RESULTS:        internal signals:     1113
ABC RESULTS:           input signals:      120
ABC RESULTS:          output signals:       98
Removing temp directory.

yosys> opt

3.54. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.54.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

yosys> opt_merge -nomux

3.54.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.54.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.54.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff

3.54.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 0 unused cells and 950 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.54.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.54.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.54.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b12..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b12.
Performed a total of 0 changes.

yosys> opt_merge

3.54.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b12'.
Removed a total of 0 cells.

yosys> opt_dff

3.54.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..

yosys> opt_expr

3.54.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b12.

3.54.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.55. Executing HIERARCHY pass (managing design hierarchy).

3.55.1. Analyzing design hierarchy..
Top module:  \b12

3.55.2. Analyzing design hierarchy..
Top module:  \b12
Removed 0 unused modules.

yosys> stat

3.56. Printing statistics.

=== b12 ===

   Number of wires:                311
   Number of wire bits:            326
   Number of public wires:          13
   Number of public wire bits:      28
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                311
     $lut                          193
     dffsre                        118


yosys> opt_clean -purge

3.57. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b12..
Removed 0 unused cells and 2 unused wires.
<suppressed ~2 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.58. Executing Verilog backend.

yosys> bmuxmap

3.58.1. Executing BMUXMAP pass.

yosys> demuxmap

3.58.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\b12'.

End of script. Logfile hash: c37d606f6e, CPU: user 6.98s system 0.50s, MEM: 36.28 MB peak
Yosys 0.16+65 (git sha1 03bd62bb8, gcc 9.1.0 -fPIC -Os)
Time spent: 99% 6x abc (679 sec), 0% 48x opt_expr (2 sec), ...
real 87.42
user 640.86
sys 44.33
