
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.14+36 (git sha1 4cd3e3b51, gcc 7.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k adder.v control.v conv2d.v fadder.v tfl.v

yosys> verific -vlog2k adder.v control.v conv2d.v fadder.v tfl.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'adder.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'control.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'conv2d.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'fadder.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tfl.v'
VERIFIC-WARNING [VERI-1407] tfl.v:385: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:260: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:254: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:248: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:241: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:237: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:236: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:225: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:221: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:219: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:218: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:217: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:216: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:215: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:214: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:213: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:212: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:211: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:210: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:209: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:206: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:160: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:158: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:156: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:149: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:144: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:129: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:128: attribute target identifier 'pad' not found in this scope
VERIFIC-WARNING [VERI-1407] tfl.v:5: attribute target identifier 'pad' not found in this scope

yosys> synth_rs -top top -tech genesis -goal area -de -no_dsp -no_bram -verilog top.verilog

3. Executing synth_rs pass.

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dff'.
Generating RTLIL representation for module `\dffn'.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top top

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] tfl.v:2: compiling module 'top'
VERIFIC-INFO [VERI-1018] control.v:1: compiling module 'CONTROL'
VERIFIC-WARNING [VERI-1209] control.v:155: expression size 32 truncated to fit in target size 16
VERIFIC-WARNING [VERI-1209] control.v:161: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] control.v:166: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] control.v:171: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] control.v:205: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] control.v:209: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] control.v:213: expression size 21 truncated to fit in target size 20
VERIFIC-INFO [VERI-1018] conv2d.v:2: compiling module 'conv2d'
VERIFIC-INFO [VERI-1018] adder.v:1: compiling module 'myadder(WIDTH=20)'
VERIFIC-WARNING [VERI-1209] conv2d.v:418: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:435: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:442: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:449: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:456: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:463: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:470: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:477: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:540: expression size 14 truncated to fit in target size 13
VERIFIC-WARNING [VERI-1209] conv2d.v:606: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:630: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] conv2d.v:638: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:669: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:672: expression size 32 truncated to fit in target size 14
VERIFIC-WARNING [VERI-1209] conv2d.v:673: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:681: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] conv2d.v:685: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:687: expression size 32 truncated to fit in target size 13
VERIFIC-WARNING [VERI-1209] conv2d.v:688: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:689: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:717: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:720: expression size 32 truncated to fit in target size 14
VERIFIC-WARNING [VERI-1209] conv2d.v:721: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:729: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] conv2d.v:733: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:735: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:736: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:842: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:867: expression size 21 truncated to fit in target size 20
VERIFIC-WARNING [VERI-1209] conv2d.v:869: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:874: expression size 17 truncated to fit in target size 16
VERIFIC-INFO [VERI-1018] adder.v:1: compiling module 'myadder(WIDTH=24)'
VERIFIC-INFO [VERI-1018] adder.v:1: compiling module 'myadder(WIDTH=16)'
VERIFIC-INFO [VERI-1018] adder.v:1: compiling module 'myadder(WIDTH=12)'
VERIFIC-INFO [VERI-1018] fadder.v:1: compiling module 'fadder(WIDTH=12)'
VERIFIC-WARNING [VERI-1209] conv2d.v:1119: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:1138: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:1153: expression size 3 truncated to fit in target size 2
VERIFIC-WARNING [VERI-1209] conv2d.v:1156: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:1169: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:1173: expression size 13 truncated to fit in target size 12
VERIFIC-WARNING [VERI-1209] conv2d.v:1181: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] conv2d.v:1199: expression size 17 truncated to fit in target size 16
Importing module top.
Importing module CONTROL.
Importing module conv2d.
Importing module myadder(WIDTH=20).
Importing module myadder(WIDTH=24).
Importing module myadder(WIDTH=16).
Importing module myadder(WIDTH=12).
Importing module fadder(WIDTH=12).

3.3.1. Analyzing design hierarchy..
Top module:  \top
Used module:     \conv2d
Used module:         \fadder(WIDTH=12)
Used module:         \myadder(WIDTH=12)
Used module:         \myadder(WIDTH=16)
Used module:         \myadder(WIDTH=24)
Used module:         \myadder(WIDTH=20)
Used module:     \CONTROL

3.3.2. Analyzing design hierarchy..
Top module:  \top
Used module:     \conv2d
Used module:         \fadder(WIDTH=12)
Used module:         \myadder(WIDTH=12)
Used module:         \myadder(WIDTH=16)
Used module:         \myadder(WIDTH=24)
Used module:         \myadder(WIDTH=20)
Used module:     \CONTROL
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module fadder(WIDTH=12).
Optimizing module myadder(WIDTH=12).
Optimizing module myadder(WIDTH=16).
Optimizing module myadder(WIDTH=24).
Optimizing module myadder(WIDTH=20).
Optimizing module conv2d.
<suppressed ~168 debug messages>
Optimizing module CONTROL.
<suppressed ~41 debug messages>
Optimizing module top.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module fadder(WIDTH=12).
Deleting now unused module myadder(WIDTH=12).
Deleting now unused module myadder(WIDTH=16).
Deleting now unused module myadder(WIDTH=24).
Deleting now unused module myadder(WIDTH=20).
Deleting now unused module conv2d.
Deleting now unused module CONTROL.
<suppressed ~23 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 8 unused cells and 2933 unused wires.
<suppressed ~273 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module top...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~9 debug messages>
Removed a total of 3 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
      Replacing known input bits on port A of cell $flatten\u_conv2d.$verific$i1027$conv2d.v:1124$4260: \u_conv2d.filter_reload -> 1'0
      Replacing known input bits on port A of cell $flatten\u_conv2d.$verific$i1014$conv2d.v:1113$4251: \u_conv2d.filter_reload -> 1'1
      Replacing known input bits on port A of cell $flatten\u_conv2d.$verific$i357$conv2d.v:607$2825: \u_conv2d.i_bias_wen -> 1'0
      Replacing known input bits on port A of cell $flatten\u_conv2d.$verific$i727$conv2d.v:843$3047: \u_conv2d.i_pixel_wen -> 1'0
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~154 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_1181$conv2d.v:1245$4344: { $flatten\u_conv2d.$verific$n11580$1926 $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11249$1917 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_1184$conv2d.v:1245$4347: { $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11249$1917 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_1194$conv2d.v:1245$4356: { $flatten\u_conv2d.$verific$n11615$1934 $flatten\u_conv2d.$verific$n11256$1924 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_1197$conv2d.v:1245$4359: { $flatten\u_conv2d.$verific$n11617$1936 $flatten\u_conv2d.$verific$n11618$1937 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_1203$conv2d.v:1245$4363: { $flatten\u_conv2d.$verific$n11636$1940 $flatten\u_conv2d.$verific$n11249$1917 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_632$conv2d.v:784$2969: { $flatten\u_conv2d.$verific$n6557$1815 $auto$opt_reduce.cc:134:opt_pmux$4439 $flatten\u_conv2d.$verific$n6560$1818 $flatten\u_conv2d.$verific$n6561$1819 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_633$conv2d.v:784$2970: { $flatten\u_conv2d.$verific$n6557$1815 $auto$opt_reduce.cc:134:opt_pmux$4441 $flatten\u_conv2d.$verific$n6560$1818 $flatten\u_conv2d.$verific$n6561$1819 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_638$conv2d.v:784$2975: $auto$opt_reduce.cc:134:opt_pmux$4443
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_640$conv2d.v:784$2976: $auto$opt_reduce.cc:134:opt_pmux$4445
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_643$conv2d.v:784$2979: { $flatten\u_conv2d.$verific$n6698$1825 $auto$opt_reduce.cc:134:opt_pmux$4447 $flatten\u_conv2d.$verific$n6560$1818 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_826$conv2d.v:912$3107: { $flatten\u_conv2d.$verific$n8234$1854 $flatten\u_conv2d.$verific$n8268$1858 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$Select_828$conv2d.v:912$3108: { $flatten\u_conv2d.$verific$n8234$1854 $flatten\u_conv2d.$verific$n8268$1858 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_106$conv2d.v:223$2508: { $flatten\u_conv2d.$verific$n851$1736 $flatten\u_conv2d.$verific$n852$1737 $flatten\u_conv2d.$verific$n853$1738 $flatten\u_conv2d.$verific$n854$1739 $flatten\u_conv2d.$verific$n856$1741 $flatten\u_conv2d.$verific$n858$1743 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1164$conv2d.v:1245$4327: { $flatten\u_conv2d.$verific$n11242$1910 $flatten\u_conv2d.$verific$n11251$1919 $flatten\u_conv2d.$verific$n11256$1924 $auto$opt_reduce.cc:134:opt_pmux$4449 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1165$conv2d.v:1245$4328: { $auto$opt_reduce.cc:134:opt_pmux$4453 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$4451 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1166$conv2d.v:1245$4329: { $auto$opt_reduce.cc:134:opt_pmux$4457 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$4455 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1167$conv2d.v:1245$4330: { $auto$opt_reduce.cc:134:opt_pmux$4461 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$4459 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1168$conv2d.v:1245$4331: { $auto$opt_reduce.cc:134:opt_pmux$4465 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$4463 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1169$conv2d.v:1245$4332: { $auto$opt_reduce.cc:134:opt_pmux$4469 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$4467 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1170$conv2d.v:1245$4333: { $auto$opt_reduce.cc:134:opt_pmux$4473 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$4471 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1171$conv2d.v:1245$4334: { $auto$opt_reduce.cc:134:opt_pmux$4477 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$4475 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1172$conv2d.v:1245$4335: { $auto$opt_reduce.cc:134:opt_pmux$4481 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$4479 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1173$conv2d.v:1245$4336: { $flatten\u_conv2d.$verific$n11242$1910 $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11244$1912 $flatten\u_conv2d.$verific$n11245$1913 $auto$opt_reduce.cc:134:opt_pmux$4483 $flatten\u_conv2d.$verific$n11248$1916 $flatten\u_conv2d.$verific$n11249$1917 $flatten\u_conv2d.$verific$n11250$1918 $flatten\u_conv2d.$verific$n11251$1919 $flatten\u_conv2d.$verific$n11252$1920 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $flatten\u_conv2d.$verific$n11255$1923 $flatten\u_conv2d.$verific$n11256$1924 $flatten\u_conv2d.$verific$n11257$1925 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1174$conv2d.v:1245$4337: { $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11249$1917 $flatten\u_conv2d.$verific$n11251$1919 $flatten\u_conv2d.$verific$n11252$1920 $auto$opt_reduce.cc:134:opt_pmux$4485 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1175$conv2d.v:1245$4338: { $auto$opt_reduce.cc:134:opt_pmux$4489 $auto$opt_reduce.cc:134:opt_pmux$4487 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1176$conv2d.v:1245$4339: { $auto$opt_reduce.cc:134:opt_pmux$4493 $auto$opt_reduce.cc:134:opt_pmux$4491 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1177$conv2d.v:1245$4340: { $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11251$1919 $auto$opt_reduce.cc:134:opt_pmux$4495 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1178$conv2d.v:1245$4341: { $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11253$1921 $auto$opt_reduce.cc:134:opt_pmux$4497 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1179$conv2d.v:1245$4342: { $flatten\u_conv2d.$verific$n11243$1911 $auto$opt_reduce.cc:134:opt_pmux$4499 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1182$conv2d.v:1245$4345: { $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11249$1917 $flatten\u_conv2d.$verific$n11252$1920 $auto$opt_reduce.cc:134:opt_pmux$4501 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1189$conv2d.v:1245$4352: { $flatten\u_conv2d.$verific$n11251$1919 $auto$opt_reduce.cc:134:opt_pmux$4503 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1190$conv2d.v:1245$4353: { $flatten\u_conv2d.$verific$n11248$1916 $flatten\u_conv2d.$verific$n11249$1917 $flatten\u_conv2d.$verific$n11254$1922 $auto$opt_reduce.cc:134:opt_pmux$4507 $auto$opt_reduce.cc:134:opt_pmux$4505 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1191$conv2d.v:1245$4354: { $flatten\u_conv2d.$verific$n11248$1916 $flatten\u_conv2d.$verific$n11251$1919 $auto$opt_reduce.cc:134:opt_pmux$4509 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_1201$conv2d.v:1245$4361: { $flatten\u_conv2d.$verific$n11249$1917 $flatten\u_conv2d.$verific$n11250$1918 $flatten\u_conv2d.$verific$n11251$1919 $flatten\u_conv2d.$verific$n11252$1920 $auto$opt_reduce.cc:134:opt_pmux$4511 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_409$conv2d.v:648$2862: { $flatten\u_conv2d.$verific$n5060$1775 $auto$opt_reduce.cc:134:opt_pmux$4513 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_410$conv2d.v:648$2863: $auto$opt_reduce.cc:134:opt_pmux$4515
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_411$conv2d.v:648$2864: { $flatten\u_conv2d.$verific$n5060$1775 $flatten\u_conv2d.$verific$n5061$1776 $auto$opt_reduce.cc:134:opt_pmux$4517 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_418$conv2d.v:648$2870: { $flatten\u_conv2d.$verific$n5061$1776 $auto$opt_reduce.cc:134:opt_pmux$4519 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_627$conv2d.v:784$2964: { $flatten\u_conv2d.$verific$n6558$1816 $flatten\u_conv2d.$verific$n6559$1817 $flatten\u_conv2d.$verific$n6560$1818 $flatten\u_conv2d.$verific$n6561$1819 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_629$conv2d.v:784$2966: { $flatten\u_conv2d.$verific$n6557$1815 $flatten\u_conv2d.$verific$n6558$1816 $auto$opt_reduce.cc:134:opt_pmux$4521 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_630$conv2d.v:784$2967: { $flatten\u_conv2d.$verific$n6558$1816 $flatten\u_conv2d.$verific$n6559$1817 $flatten\u_conv2d.$verific$n6560$1818 $flatten\u_conv2d.$verific$n6561$1819 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_631$conv2d.v:784$2968: { $flatten\u_conv2d.$verific$n6557$1815 $flatten\u_conv2d.$verific$n6558$1816 $flatten\u_conv2d.$verific$n6559$1817 $auto$opt_reduce.cc:134:opt_pmux$4523 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_636$conv2d.v:784$2973: { $flatten\u_conv2d.$verific$n6558$1816 $flatten\u_conv2d.$verific$n6559$1817 $auto$opt_reduce.cc:134:opt_pmux$4525 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_641$conv2d.v:784$2977: { $flatten\u_conv2d.$verific$n6558$1816 $flatten\u_conv2d.$verific$n6559$1817 $flatten\u_conv2d.$verific$n6560$1818 $auto$opt_reduce.cc:134:opt_pmux$4527 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_75$conv2d.v:164$2504: { $flatten\u_conv2d.$verific$n851$1736 $flatten\u_conv2d.$verific$n852$1737 $flatten\u_conv2d.$verific$n853$1738 $flatten\u_conv2d.$verific$n854$1739 $flatten\u_conv2d.$verific$n856$1741 $flatten\u_conv2d.$verific$n858$1743 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_823$conv2d.v:912$3104: { $flatten\u_conv2d.$verific$n8234$1854 $auto$opt_reduce.cc:134:opt_pmux$4529 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_824$conv2d.v:912$3105: { $flatten\u_conv2d.$verific$n8236$1856 $auto$opt_reduce.cc:134:opt_pmux$4531 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_829$conv2d.v:912$3109: { $flatten\u_conv2d.$verific$n8233$1853 $flatten\u_conv2d.$verific$n8234$1854 $auto$opt_reduce.cc:134:opt_pmux$4533 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_830$conv2d.v:912$3110: { $flatten\u_conv2d.$verific$n8234$1854 $flatten\u_conv2d.$verific$n8236$1856 $auto$opt_reduce.cc:134:opt_pmux$4535 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_836$conv2d.v:912$3115: { $flatten\u_conv2d.$verific$n8234$1854 $auto$opt_reduce.cc:134:opt_pmux$4537 }
    New ctrl vector for $pmux cell $flatten\u_conv2d.$verific$select_838$conv2d.v:912$3117: { $flatten\u_conv2d.$verific$n8234$1854 $auto$opt_reduce.cc:134:opt_pmux$4539 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$Select_225$control.v:223$1677: { $flatten\u_ctl.$verific$n2482$1443 $flatten\u_ctl.$verific$n2485$1446 $flatten\u_ctl.$verific$n2486$1447 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_144$control.v:185$1637: { $flatten\u_ctl.$verific$n1301$1414 $auto$opt_reduce.cc:134:opt_pmux$4541 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_145$control.v:185$1638: { $flatten\u_ctl.$verific$n1302$1415 $auto$opt_reduce.cc:134:opt_pmux$4543 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_146$control.v:185$1639: { $flatten\u_ctl.$verific$n1303$1416 $auto$opt_reduce.cc:134:opt_pmux$4545 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_147$control.v:185$1640: { $flatten\u_ctl.$verific$n1304$1417 $auto$opt_reduce.cc:134:opt_pmux$4547 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_148$control.v:185$1641: { $flatten\u_ctl.$verific$n1305$1418 $auto$opt_reduce.cc:134:opt_pmux$4549 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_149$control.v:185$1642: { $flatten\u_ctl.$verific$n1306$1419 $auto$opt_reduce.cc:134:opt_pmux$4551 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_150$control.v:185$1643: { $flatten\u_ctl.$verific$n1307$1420 $auto$opt_reduce.cc:134:opt_pmux$4553 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_151$control.v:185$1644: { $flatten\u_ctl.$verific$n1308$1421 $auto$opt_reduce.cc:134:opt_pmux$4555 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_152$control.v:185$1645: { $flatten\u_ctl.$verific$n1309$1422 $auto$opt_reduce.cc:134:opt_pmux$4557 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_153$control.v:185$1646: { $flatten\u_ctl.$verific$n1310$1423 $auto$opt_reduce.cc:134:opt_pmux$4559 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_156$control.v:185$1649: { $flatten\u_ctl.$verific$n1313$1426 $auto$opt_reduce.cc:134:opt_pmux$4563 $auto$opt_reduce.cc:134:opt_pmux$4561 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_161$control.v:185$1654: { $flatten\u_ctl.$verific$n1317$1430 $auto$opt_reduce.cc:134:opt_pmux$4565 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_162$control.v:185$1655: { $flatten\u_ctl.$verific$n1318$1431 $auto$opt_reduce.cc:134:opt_pmux$4567 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_163$control.v:185$1656: { $flatten\u_ctl.$verific$n1318$1431 $auto$opt_reduce.cc:134:opt_pmux$4569 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_216$control.v:220$1667: { $auto$opt_reduce.cc:134:opt_pmux$4573 $auto$opt_reduce.cc:134:opt_pmux$4571 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_223$control.v:223$1675: { $flatten\u_ctl.$verific$n2482$1443 $flatten\u_ctl.$verific$n2485$1446 $flatten\u_ctl.$verific$n2486$1447 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_226$control.v:223$1678: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$4575 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_227$control.v:223$1679: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$4577 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_228$control.v:223$1680: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$4579 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_229$control.v:223$1681: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$4581 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_230$control.v:223$1682: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$4583 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_231$control.v:223$1683: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$4585 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_232$control.v:223$1684: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$4587 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_233$control.v:223$1685: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$4589 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_234$control.v:223$1686: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$4591 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_235$control.v:223$1687: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$4593 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_238$control.v:223$1690: { $flatten\u_ctl.$verific$n2484$1445 $flatten\u_ctl.$verific$n2485$1446 $auto$opt_reduce.cc:134:opt_pmux$4595 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_243$control.v:223$1695: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$4597 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_244$control.v:223$1696: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$4599 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_245$control.v:223$1697: { $flatten\u_ctl.$verific$n2484$1445 $auto$opt_reduce.cc:134:opt_pmux$4601 }
    New ctrl vector for $pmux cell $flatten\u_ctl.$verific$select_248$control.v:223$1700: { $flatten\u_ctl.$verific$n2485$1446 $auto$opt_reduce.cc:134:opt_pmux$4603 }
  Optimizing cells in module \top.
Performed a total of 85 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~120 debug messages>
Removed a total of 40 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_width_reg$control.v:224$1703 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_total_reg$control.v:224$1712 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_shift_reg$control.v:224$1725 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_sda_reg$control.v:224$1726 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_scl_reg$control.v:224$1727 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_result_base_reg$control.v:224$1711 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_ready_reg$control.v:224$1701 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_quant_reg$control.v:224$1724 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_pixel_base_reg$control.v:224$1709 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_intr_sts_reg$control.v:224$1723 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_intr_en_reg$control.v:224$1722 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_height_reg$control.v:224$1704 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_filters_reg$control.v:224$1706 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_filter_base_reg$control.v:224$1708 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_debug_mux_reg$control.v:224$1715 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_dataout_reg$control.v:224$1707 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_ctl_pwen_reg$control.v:224$1720 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_ctl_pfwaddr_reg$control.v:224$1718 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_ctl_fwen_reg$control.v:224$1719 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_ctl_bwen_reg$control.v:224$1721 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_channels_reg$control.v:224$1705 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_bias_base_reg$control.v:224$1710 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$i_addr_reg$control.v:224$1717 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$fsm_ctl_reg$control.v:224$1728 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$ctl_reg$control.v:224$1702 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_ctl.$verific$counter_reg$control.v:224$1713 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$write2_reg$conv2d.v:1246$4402 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$wdata2_reg$conv2d.v:785$3001 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$total_pixels_done_reg$conv2d.v:1246$4388 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$total_filters_done_reg$conv2d.v:1246$4382 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$sat37_reg$conv2d.v:92$2470 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$sat26_reg$conv2d.v:92$2469 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$sat15_reg$conv2d.v:92$2468 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$sat04_reg$conv2d.v:92$2467 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$running_reg$conv2d.v:1246$4384 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$result_base_reg$conv2d.v:785$2999 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$reset_bias_address_reg$conv2d.v:785$3024 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$pixels_read_reg$conv2d.v:913$3120 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$pixel_start_reg$conv2d.v:913$3127 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$pixel_select_reg$conv2d.v:1246$4400 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$p2_raddr_reg$conv2d.v:1246$4370 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$p1_raddr_reg$conv2d.v:1246$4369 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$next_buffer_reg$conv2d.v:1246$4399 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$load_more_pixels_reg$conv2d.v:1246$4387 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$load_more_filters_reg$conv2d.v:1246$4386 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$load_ext_acc_reg$conv2d.v:1246$4389 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$load_buffer_reg$conv2d.v:913$3129 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$last_start2d_reg$conv2d.v:785$3023 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm3_wen_reg$conv2d.v:785$3010 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm3_req_reg$conv2d.v:785$3009 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm3_rdata_reg$conv2d.v:785$3026 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm2_wreq_reg$conv2d.v:785$3008 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm2_wen_reg$conv2d.v:785$3018 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm2_wdata_reg$conv2d.v:785$3000 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm2_rreq_reg$conv2d.v:785$3007 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm2_rdata_reg$conv2d.v:785$3025 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm1_wen_reg$conv2d.v:913$3122 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm1_req_reg$conv2d.v:913$3123 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_tcdm1_rdata_reg$conv2d.v:913$3130 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_sat_reg$conv2d.v:1246$4373 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_pixel_wen_reg$conv2d.v:913$3124 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_pixel_wdata_reg$conv2d.v:913$3126 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_pixel_waddr_reg$conv2d.v:913$3125 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_pixel_raddr_reg$conv2d.v:1246$4378 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_outsel_reg$conv2d.v:1246$4377 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_mult2_coef_reg$conv2d.v:1246$4404 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_mult1_coef_reg$conv2d.v:1246$4403 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_math_mode_reg$conv2d.v:1246$4374 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_mac_clr_reg$conv2d.v:1246$4375 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_mac_clken_reg$conv2d.v:1246$4376 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_filter_wdata_reg$conv2d.v:785$3014 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_filter_waddr_reg$conv2d.v:785$3013 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_filter_raddr_reg$conv2d.v:1246$4379 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_filter2_wen_reg$conv2d.v:785$3016 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_filter1_wen_reg$conv2d.v:785$3015 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_done2d_reg$conv2d.v:1246$4383 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_csel_reg$conv2d.v:1246$4372 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_bias_wen_reg$conv2d.v:785$3011 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_bias_wdata_reg$conv2d.v:785$3012 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_bias_waddr_reg$conv2d.v:785$3004 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i_bias_raddr_reg$conv2d.v:785$3003 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i3_t2_waddr_reg$conv2d.v:785$2982 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i2_t2_waddr_reg$conv2d.v:785$2981 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$i1_t2_waddr_reg$conv2d.v:785$2980 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fsm_writechannels_reg$conv2d.v:785$3022 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fsm_loadacc_reg$conv2d.v:785$2988 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fsm_getpixels_reg$conv2d.v:913$3118 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fsm_getfilters_reg$conv2d.v:785$2986 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fsm_getbias_reg$conv2d.v:785$2987 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fsm_conv2d_reg$conv2d.v:1246$4371 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$fract_select_reg$conv2d.v:1246$4401 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filters_loaded_reg$conv2d.v:785$2983 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filters_done_reg$conv2d.v:1246$4381 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filters_complete_reg$conv2d.v:785$3021 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filter_stride_reg$conv2d.v:785$2984 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filter_start_reg$conv2d.v:785$3019 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filter_space_left_reg$conv2d.v:785$3020 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filter_reload_reg$conv2d.v:1246$4385 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$filter_channels_reg$conv2d.v:785$3017 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$copy_acc_reg$conv2d.v:1246$4390 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$channels_loaded_reg$conv2d.v:913$3119 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$channels_done_reg$conv2d.v:1246$4380 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$buffers_used_reg$conv2d.v:913$3128 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias_loaded_reg$conv2d.v:785$3006 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias_base_addr_reg$conv2d.v:785$3005 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias7_reg$conv2d.v:785$2996 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias6_reg$conv2d.v:785$2995 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias5_reg$conv2d.v:785$2994 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias4_reg$conv2d.v:785$2993 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias3_reg$conv2d.v:785$2992 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias2_reg$conv2d.v:785$2991 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias1_reg$conv2d.v:785$2990 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$bias0_reg$conv2d.v:785$2989 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$add_stride_reg$conv2d.v:785$2985 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc7_reg$conv2d.v:1246$4398 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc6_reg$conv2d.v:1246$4397 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc5_reg$conv2d.v:1246$4396 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc4_reg$conv2d.v:1246$4395 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc3_reg$conv2d.v:1246$4394 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc2_reg$conv2d.v:1246$4393 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc1_reg$conv2d.v:1246$4392 ($aldff) from module top.
Changing const-value async load to async reset on $flatten\u_conv2d.$verific$acc0_reg$conv2d.v:1246$4391 ($aldff) from module top.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 4 unused cells and 48 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~152 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).
Not marking top.u_conv2d.fract_select as FSM state register:
    Users of register don't seem to benefit from recoding.
Found FSM state register top.u_conv2d.fsm_conv2d.
Found FSM state register top.u_conv2d.fsm_getbias.
Found FSM state register top.u_conv2d.fsm_getpixels.
Not marking top.u_conv2d.i_outsel as FSM state register:
    Register is connected to module port.
    Users of register don't seem to benefit from recoding.
Found FSM state register top.u_ctl.fsm_ctl.

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).
Extracting FSM `\u_conv2d.fsm_conv2d' from module `\top'.
  found $adff cell for state register: $flatten\u_conv2d.$verific$fsm_conv2d_reg$conv2d.v:1246$4371
  root of input selection tree: $flatten\u_conv2d.$verific$n11461$2435
  found reset state: 5'00000 (from async reset)
  found ctrl input: $flatten\u_conv2d.$verific$n11257$1925
  found ctrl input: $flatten\u_conv2d.$verific$n11256$1924
  found ctrl input: $flatten\u_conv2d.$verific$n11255$1923
  found ctrl input: $flatten\u_conv2d.$verific$n11254$1922
  found ctrl input: $flatten\u_conv2d.$verific$n11253$1921
  found ctrl input: $flatten\u_conv2d.$verific$n11252$1920
  found ctrl input: $flatten\u_conv2d.$verific$n11251$1919
  found ctrl input: $flatten\u_conv2d.$verific$n11250$1918
  found ctrl input: $flatten\u_conv2d.$verific$n11249$1917
  found ctrl input: $flatten\u_conv2d.$verific$n11248$1916
  found ctrl input: $auto$opt_reduce.cc:134:opt_pmux$4483
  found ctrl input: $flatten\u_conv2d.$verific$n11245$1913
  found ctrl input: $flatten\u_conv2d.$verific$n11244$1912
  found ctrl input: $flatten\u_conv2d.$verific$n11243$1911
  found ctrl input: $flatten\u_conv2d.$verific$n11242$1910
  found ctrl input: \u_ctl.ctl [0]
  found state code: 5'01100
  found ctrl input: $flatten\u_conv2d.$verific$n11095$1905
  found state code: 5'01001
  found state code: 5'01000
  found state code: 5'00100
  found state code: 5'00011
  found ctrl input: $flatten\u_conv2d.$verific$n10441$1895
  found ctrl input: $flatten\u_conv2d.$verific$n10472$1899
  found state code: 5'00010
  found state code: 5'00001
  found ctrl input: \u_conv2d.filter_reload
  found ctrl input: $flatten\u_conv2d.$verific$n10079$1885
  found ctrl input: $flatten\u_conv2d.$verific$n10042$1881
  found state code: 5'00110
  found state code: 5'00111
  found state code: 5'01111
  found ctrl input: $flatten\u_conv2d.$verific$n9562$1865
  found ctrl input: $flatten\u_conv2d.$verific$n9563$1866
  found ctrl input: $flatten\u_conv2d.$verific$n9583$1867
  found ctrl input: $flatten\u_conv2d.$verific$n9612$1868
  found state code: 5'00101
  found state code: 5'01010
  found ctrl output: $flatten\u_conv2d.$verific$n11256$1924
  found ctrl output: $flatten\u_conv2d.$verific$n11255$1923
  found ctrl output: $flatten\u_conv2d.$verific$n11254$1922
  found ctrl output: $flatten\u_conv2d.$verific$n11253$1921
  found ctrl output: $flatten\u_conv2d.$verific$n11252$1920
  found ctrl output: $flatten\u_conv2d.$verific$n11251$1919
  found ctrl output: $flatten\u_conv2d.$verific$n11250$1918
  found ctrl output: $flatten\u_conv2d.$verific$n11249$1917
  found ctrl output: $flatten\u_conv2d.$verific$n11248$1916
  found ctrl output: $flatten\u_conv2d.$verific$n11247$1915
  found ctrl output: $flatten\u_conv2d.$verific$n11246$1914
  found ctrl output: $flatten\u_conv2d.$verific$n11245$1913
  found ctrl output: $flatten\u_conv2d.$verific$n11244$1912
  found ctrl output: $flatten\u_conv2d.$verific$n11243$1911
  found ctrl output: $flatten\u_conv2d.$verific$n11242$1910
  ctrl inputs: { \u_conv2d.filter_reload $flatten\u_conv2d.$verific$n9562$1865 $flatten\u_conv2d.$verific$n9563$1866 $flatten\u_conv2d.$verific$n9583$1867 $flatten\u_conv2d.$verific$n9612$1868 $flatten\u_conv2d.$verific$n10042$1881 $flatten\u_conv2d.$verific$n10079$1885 $flatten\u_conv2d.$verific$n10441$1895 $flatten\u_conv2d.$verific$n10472$1899 $flatten\u_conv2d.$verific$n11095$1905 $flatten\u_conv2d.$verific$n11257$1925 $auto$opt_reduce.cc:134:opt_pmux$4483 \u_ctl.ctl [0] }
  ctrl outputs: { $flatten\u_conv2d.$verific$n11242$1910 $flatten\u_conv2d.$verific$n11243$1911 $flatten\u_conv2d.$verific$n11244$1912 $flatten\u_conv2d.$verific$n11245$1913 $flatten\u_conv2d.$verific$n11246$1914 $flatten\u_conv2d.$verific$n11247$1915 $flatten\u_conv2d.$verific$n11248$1916 $flatten\u_conv2d.$verific$n11249$1917 $flatten\u_conv2d.$verific$n11250$1918 $flatten\u_conv2d.$verific$n11251$1919 $flatten\u_conv2d.$verific$n11252$1920 $flatten\u_conv2d.$verific$n11253$1921 $flatten\u_conv2d.$verific$n11254$1922 $flatten\u_conv2d.$verific$n11255$1923 $flatten\u_conv2d.$verific$n11256$1924 $flatten\u_conv2d.$verific$n11461$2435 }
  transition:    5'00000 13'-----0------- ->    5'00000 20'00000010000000000000
  transition:    5'00000 13'-----1------- ->    5'00110 20'00000010000000000110
  transition:    5'01000 13'------------- ->    5'00001 20'00000000100000000001
  transition:    5'00100 13'---------0--- ->    5'01001 20'00000000000010001001
  transition:    5'00100 13'---------1--- ->    5'01000 20'00000000000010001000
  transition:    5'01100 13'------------0 ->    5'00000 20'00000000000000100000
  transition:    5'01100 13'------------1 ->    5'01100 20'00000000000000101100
  transition:    5'00010 13'------------- ->    5'00011 20'00000000001000000011
  transition:    5'01010 13'-0----------- ->    5'01010 20'01000000000000001010
  transition:    5'01010 13'-100--------- ->    5'00111 20'01000000000000000111
  transition:    5'01010 13'-1010-------- ->    5'00111 20'01000000000000000111
  transition:    5'01010 13'-1011-------- ->    5'00101 20'01000000000000000101
  transition:    5'01010 13'-11---------- ->    5'00111 20'01000000000000000111
  transition:    5'00110 13'0------------ ->    5'00001 20'00000001000000000001
  transition:    5'00110 13'1-----0------ ->    5'00110 20'00000001000000000110
  transition:    5'00110 13'1-----1------ ->    5'00000 20'00000001000000000000
  transition:    5'00001 13'-------0----- ->    5'00001 20'00000000010000000001
  transition:    5'00001 13'-------10---- ->    5'00001 20'00000000010000000001
  transition:    5'00001 13'-------11---- ->    5'00010 20'00000000010000000010
  transition:    5'01001 13'------------- ->    5'01010 20'10000000000000001010
  transition:    5'00101 13'------------- ->    5'01100 20'00000000000001001100
  transition:    5'00011 13'------------- ->    5'00100 20'00000000000100000100
  transition:    5'00111 13'------------- ->    5'00110 20'00001000000000000110
  transition:    5'01111 13'------------- ->    5'00111 20'00010000000000000111
Extracting FSM `\u_conv2d.fsm_getbias' from module `\top'.
  found $adff cell for state register: $flatten\u_conv2d.$verific$fsm_getbias_reg$conv2d.v:785$2987
  root of input selection tree: $flatten\u_conv2d.$verific$n5122$2153
  found reset state: 3'000 (from async reset)
  found ctrl input: $flatten\u_conv2d.$verific$n5063$1778
  found ctrl input: $flatten\u_conv2d.$verific$n5062$1777
  found ctrl input: $flatten\u_conv2d.$verific$n5061$1776
  found ctrl input: $flatten\u_conv2d.$verific$n5060$1775
  found ctrl input: \u_conv2d.i_done2d
  found ctrl input: \tcdm_valid_p3
  found ctrl input: $flatten\u_conv2d.$verific$n4916$1769
  found state code: 3'010
  found ctrl input: \u_ctl.ctl [0]
  found state code: 3'001
  found ctrl output: $flatten\u_conv2d.$verific$n5062$1777
  found ctrl output: $flatten\u_conv2d.$verific$n5061$1776
  found ctrl output: $flatten\u_conv2d.$verific$n5060$1775
  ctrl inputs: { \u_conv2d.i_done2d $flatten\u_conv2d.$verific$n4916$1769 $flatten\u_conv2d.$verific$n5063$1778 \u_ctl.ctl [0] \tcdm_valid_p3 }
  ctrl outputs: { $flatten\u_conv2d.$verific$n5060$1775 $flatten\u_conv2d.$verific$n5061$1776 $flatten\u_conv2d.$verific$n5062$1777 $flatten\u_conv2d.$verific$n5122$2153 }
  transition:      3'000 5'---0- ->      3'000 6'100000
  transition:      3'000 5'---1- ->      3'001 6'100001
  transition:      3'010 5'0---- ->      3'010 6'001010
  transition:      3'010 5'1---- ->      3'000 6'001000
  transition:      3'001 5'----0 ->      3'001 6'010001
  transition:      3'001 5'-0--1 ->      3'001 6'010001
  transition:      3'001 5'-1--1 ->      3'010 6'010010
Extracting FSM `\u_conv2d.fsm_getpixels' from module `\top'.
  found $adff cell for state register: $flatten\u_conv2d.$verific$fsm_getpixels_reg$conv2d.v:913$3118
  root of input selection tree: $flatten\u_conv2d.$verific$n8296$2272
  found reset state: 3'000 (from async reset)
  found ctrl input: $flatten\u_conv2d.$verific$n8237$1857
  found ctrl input: $flatten\u_conv2d.$verific$n8236$1856
  found ctrl input: $flatten\u_conv2d.$verific$n8235$1855
  found ctrl input: $flatten\u_conv2d.$verific$n8234$1854
  found ctrl input: $flatten\u_conv2d.$verific$n8233$1853
  found ctrl input: $flatten\u_conv2d.$verific$n8211$1849
  found state code: 3'001
  found ctrl input: \u_conv2d.i_done2d
  found ctrl input: \u_conv2d.load_more_filters
  found ctrl input: \tcdm_valid_p1
  found ctrl input: $flatten\u_conv2d.$verific$n7947$1834
  found ctrl input: $flatten\u_conv2d.$verific$n8018$1838
  found state code: 3'011
  found state code: 3'010
  found ctrl input: \u_ctl.ctl [0]
  found ctrl output: $flatten\u_conv2d.$verific$n8236$1856
  found ctrl output: $flatten\u_conv2d.$verific$n8235$1855
  found ctrl output: $flatten\u_conv2d.$verific$n8234$1854
  found ctrl output: $flatten\u_conv2d.$verific$n8233$1853
  ctrl inputs: { \u_conv2d.i_done2d \u_conv2d.load_more_filters $flatten\u_conv2d.$verific$n7947$1834 $flatten\u_conv2d.$verific$n8018$1838 $flatten\u_conv2d.$verific$n8211$1849 $flatten\u_conv2d.$verific$n8237$1857 \u_ctl.ctl [0] \tcdm_valid_p1 }
  ctrl outputs: { $flatten\u_conv2d.$verific$n8233$1853 $flatten\u_conv2d.$verific$n8234$1854 $flatten\u_conv2d.$verific$n8235$1855 $flatten\u_conv2d.$verific$n8236$1856 $flatten\u_conv2d.$verific$n8296$2272 }
  transition:      3'000 8'------0- ->      3'000 7'1000000
  transition:      3'000 8'------1- ->      3'001 7'1000001
  transition:      3'010 8'00------ ->      3'010 7'0010010
  transition:      3'010 8'01------ ->      3'000 7'0010000
  transition:      3'010 8'1------- ->      3'000 7'0010000
  transition:      3'001 8'-------0 ->      3'001 7'0100001
  transition:      3'001 8'--0----1 ->      3'001 7'0100001
  transition:      3'001 8'--10---1 ->      3'011 7'0100011
  transition:      3'001 8'--11---1 ->      3'010 7'0100010
  transition:      3'011 8'----0--- ->      3'001 7'0001001
  transition:      3'011 8'----1--- ->      3'011 7'0001011
Extracting FSM `\u_ctl.fsm_ctl' from module `\top'.
  found $adff cell for state register: $flatten\u_ctl.$verific$fsm_ctl_reg$control.v:224$1728
  root of input selection tree: $flatten\u_ctl.$verific$n2487$1532
  found reset state: 3'000 (from async reset)
  found ctrl input: $flatten\u_ctl.$verific$n2486$1447
  found ctrl input: $flatten\u_ctl.$verific$n2485$1446
  found ctrl input: $flatten\u_ctl.$verific$n2482$1443
  found state code: 3'011
  found ctrl input: $flatten\u_ctl.$verific$n828$1411
  found ctrl input: $flatten\u_ctl.$verific$n815$1408
  found state code: 3'001
  found state code: 3'010
  found ctrl output: $flatten\u_ctl.$verific$n2485$1446
  found ctrl output: $flatten\u_ctl.$verific$n2484$1445
  found ctrl output: $flatten\u_ctl.$verific$n2483$1444
  found ctrl output: $flatten\u_ctl.$verific$n2482$1443
  ctrl inputs: { $flatten\u_ctl.$verific$n815$1408 $flatten\u_ctl.$verific$n828$1411 $flatten\u_ctl.$verific$n2486$1447 }
  ctrl outputs: { $flatten\u_ctl.$verific$n2482$1443 $flatten\u_ctl.$verific$n2483$1444 $flatten\u_ctl.$verific$n2484$1445 $flatten\u_ctl.$verific$n2485$1446 $flatten\u_ctl.$verific$n2487$1532 }
  transition:      3'000 3'00- ->      3'000 7'1000000
  transition:      3'000 3'10- ->      3'001 7'1000001
  transition:      3'000 3'-1- ->      3'010 7'1000010
  transition:      3'010 3'--- ->      3'011 7'0001011
  transition:      3'001 3'--- ->      3'000 7'0010000
  transition:      3'011 3'--- ->      3'000 7'0100000

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\u_ctl.fsm_ctl$4632' from module `\top'.
  Removing unused input signal $flatten\u_ctl.$verific$n2486$1447.
Optimizing FSM `$fsm$\u_conv2d.fsm_getpixels$4626' from module `\top'.
  Removing unused input signal $flatten\u_conv2d.$verific$n8237$1857.
Optimizing FSM `$fsm$\u_conv2d.fsm_getbias$4621' from module `\top'.
  Removing unused input signal $flatten\u_conv2d.$verific$n5063$1778.
Optimizing FSM `$fsm$\u_conv2d.fsm_conv2d$4604' from module `\top'.
  Removing unreachable state 5'01111.
  Removing unused input signal $flatten\u_conv2d.$verific$n11257$1925.
  Removing unused input signal $auto$opt_reduce.cc:134:opt_pmux$4483.

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 59 unused cells and 59 unused wires.
<suppressed ~60 debug messages>

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).
Optimizing FSM `$fsm$\u_conv2d.fsm_conv2d$4604' from module `\top'.
  Removing unused output signal $flatten\u_conv2d.$verific$n11461$2435 [0].
  Removing unused output signal $flatten\u_conv2d.$verific$n11461$2435 [1].
  Removing unused output signal $flatten\u_conv2d.$verific$n11461$2435 [2].
  Removing unused output signal $flatten\u_conv2d.$verific$n11461$2435 [3].
  Removing unused output signal $flatten\u_conv2d.$verific$n11461$2435 [4].
Optimizing FSM `$fsm$\u_conv2d.fsm_getbias$4621' from module `\top'.
  Removing unused output signal $flatten\u_conv2d.$verific$n5122$2153 [0].
  Removing unused output signal $flatten\u_conv2d.$verific$n5122$2153 [1].
  Removing unused output signal $flatten\u_conv2d.$verific$n5122$2153 [2].
Optimizing FSM `$fsm$\u_conv2d.fsm_getpixels$4626' from module `\top'.
  Removing unused output signal $flatten\u_conv2d.$verific$n8296$2272 [0].
  Removing unused output signal $flatten\u_conv2d.$verific$n8296$2272 [1].
  Removing unused output signal $flatten\u_conv2d.$verific$n8296$2272 [2].
Optimizing FSM `$fsm$\u_ctl.fsm_ctl$4632' from module `\top'.
  Removing unused output signal $flatten\u_ctl.$verific$n2487$1532 [0].
  Removing unused output signal $flatten\u_ctl.$verific$n2487$1532 [1].
  Removing unused output signal $flatten\u_ctl.$verific$n2487$1532 [2].

yosys> fsm_recode

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).
Recoding FSM `$fsm$\u_conv2d.fsm_conv2d$4604' from module `\top' using `auto' encoding:
  mapping auto encoding to `one-hot` for this FSM.
  00000 -> -----------1
  01000 -> ----------1-
  00100 -> ---------1--
  01100 -> --------1---
  00010 -> -------1----
  01010 -> ------1-----
  00110 -> -----1------
  00001 -> ----1-------
  01001 -> ---1--------
  00101 -> --1---------
  00011 -> -1----------
  00111 -> 1-----------
Recoding FSM `$fsm$\u_conv2d.fsm_getbias$4621' from module `\top' using `auto' encoding:
  mapping auto encoding to `one-hot` for this FSM.
  000 -> --1
  010 -> -1-
  001 -> 1--
Recoding FSM `$fsm$\u_conv2d.fsm_getpixels$4626' from module `\top' using `auto' encoding:
  mapping auto encoding to `one-hot` for this FSM.
  000 -> ---1
  010 -> --1-
  001 -> -1--
  011 -> 1---
Recoding FSM `$fsm$\u_ctl.fsm_ctl$4632' from module `\top' using `auto' encoding:
  mapping auto encoding to `one-hot` for this FSM.
  000 -> ---1
  010 -> --1-
  001 -> -1--
  011 -> 1---

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

FSM `$fsm$\u_conv2d.fsm_conv2d$4604' from module `top':
-------------------------------------

  Information on FSM $fsm$\u_conv2d.fsm_conv2d$4604 (\u_conv2d.fsm_conv2d):

  Number of input signals:   11
  Number of output signals:  15
  Number of state bits:      12

  Input signals:
    0: \u_ctl.ctl [0]
    1: $flatten\u_conv2d.$verific$n11095$1905
    2: $flatten\u_conv2d.$verific$n10472$1899
    3: $flatten\u_conv2d.$verific$n10441$1895
    4: $flatten\u_conv2d.$verific$n10079$1885
    5: $flatten\u_conv2d.$verific$n10042$1881
    6: $flatten\u_conv2d.$verific$n9612$1868
    7: $flatten\u_conv2d.$verific$n9583$1867
    8: $flatten\u_conv2d.$verific$n9563$1866
    9: $flatten\u_conv2d.$verific$n9562$1865
   10: \u_conv2d.filter_reload

  Output signals:
    0: $flatten\u_conv2d.$verific$n11256$1924
    1: $flatten\u_conv2d.$verific$n11255$1923
    2: $flatten\u_conv2d.$verific$n11254$1922
    3: $flatten\u_conv2d.$verific$n11253$1921
    4: $flatten\u_conv2d.$verific$n11252$1920
    5: $flatten\u_conv2d.$verific$n11251$1919
    6: $flatten\u_conv2d.$verific$n11250$1918
    7: $flatten\u_conv2d.$verific$n11249$1917
    8: $flatten\u_conv2d.$verific$n11248$1916
    9: $flatten\u_conv2d.$verific$n11247$1915
   10: $flatten\u_conv2d.$verific$n11246$1914
   11: $flatten\u_conv2d.$verific$n11245$1913
   12: $flatten\u_conv2d.$verific$n11244$1912
   13: $flatten\u_conv2d.$verific$n11243$1911
   14: $flatten\u_conv2d.$verific$n11242$1910

  State encoding:
    0: 12'-----------1  <RESET STATE>
    1: 12'----------1-
    2: 12'---------1--
    3: 12'--------1---
    4: 12'-------1----
    5: 12'------1-----
    6: 12'-----1------
    7: 12'----1-------
    8: 12'---1--------
    9: 12'--1---------
   10: 12'-1----------
   11: 12'1-----------

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 11'-----0-----   ->     0 15'000000100000000
      1:     0 11'-----1-----   ->     6 15'000000100000000
      2:     1 11'-----------   ->     7 15'000000001000000
      3:     2 11'---------1-   ->     1 15'000000000000100
      4:     2 11'---------0-   ->     8 15'000000000000100
      5:     3 11'----------0   ->     0 15'000000000000001
      6:     3 11'----------1   ->     3 15'000000000000001
      7:     4 11'-----------   ->    10 15'000000000010000
      8:     5 11'-0---------   ->     5 15'010000000000000
      9:     5 11'-1011------   ->     9 15'010000000000000
     10:     5 11'-1010------   ->    11 15'010000000000000
     11:     5 11'-100-------   ->    11 15'010000000000000
     12:     5 11'-11--------   ->    11 15'010000000000000
     13:     6 11'1-----1----   ->     0 15'000000010000000
     14:     6 11'1-----0----   ->     6 15'000000010000000
     15:     6 11'0----------   ->     7 15'000000010000000
     16:     7 11'-------11--   ->     4 15'000000000100000
     17:     7 11'-------10--   ->     7 15'000000000100000
     18:     7 11'-------0---   ->     7 15'000000000100000
     19:     8 11'-----------   ->     5 15'100000000000000
     20:     9 11'-----------   ->     3 15'000000000000010
     21:    10 11'-----------   ->     2 15'000000000001000
     22:    11 11'-----------   ->     6 15'000010000000000

-------------------------------------

FSM `$fsm$\u_conv2d.fsm_getbias$4621' from module `top':
-------------------------------------

  Information on FSM $fsm$\u_conv2d.fsm_getbias$4621 (\u_conv2d.fsm_getbias):

  Number of input signals:    4
  Number of output signals:   3
  Number of state bits:       3

  Input signals:
    0: \tcdm_valid_p3
    1: \u_ctl.ctl [0]
    2: $flatten\u_conv2d.$verific$n4916$1769
    3: \u_conv2d.i_done2d

  Output signals:
    0: $flatten\u_conv2d.$verific$n5062$1777
    1: $flatten\u_conv2d.$verific$n5061$1776
    2: $flatten\u_conv2d.$verific$n5060$1775

  State encoding:
    0:      3'--1  <RESET STATE>
    1:      3'-1-
    2:      3'1--

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 4'--0-   ->     0 3'100
      1:     0 4'--1-   ->     2 3'100
      2:     1 4'1---   ->     0 3'001
      3:     1 4'0---   ->     1 3'001
      4:     2 4'-1-1   ->     1 3'010
      5:     2 4'---0   ->     2 3'010
      6:     2 4'-0-1   ->     2 3'010

-------------------------------------

FSM `$fsm$\u_conv2d.fsm_getpixels$4626' from module `top':
-------------------------------------

  Information on FSM $fsm$\u_conv2d.fsm_getpixels$4626 (\u_conv2d.fsm_getpixels):

  Number of input signals:    7
  Number of output signals:   4
  Number of state bits:       4

  Input signals:
    0: \tcdm_valid_p1
    1: \u_ctl.ctl [0]
    2: $flatten\u_conv2d.$verific$n8211$1849
    3: $flatten\u_conv2d.$verific$n8018$1838
    4: $flatten\u_conv2d.$verific$n7947$1834
    5: \u_conv2d.load_more_filters
    6: \u_conv2d.i_done2d

  Output signals:
    0: $flatten\u_conv2d.$verific$n8236$1856
    1: $flatten\u_conv2d.$verific$n8235$1855
    2: $flatten\u_conv2d.$verific$n8234$1854
    3: $flatten\u_conv2d.$verific$n8233$1853

  State encoding:
    0:     4'---1  <RESET STATE>
    1:     4'--1-
    2:     4'-1--
    3:     4'1---

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 7'-----0-   ->     0 4'1000
      1:     0 7'-----1-   ->     2 4'1000
      2:     1 7'01-----   ->     0 4'0010
      3:     1 7'1------   ->     0 4'0010
      4:     1 7'00-----   ->     1 4'0010
      5:     2 7'--11--1   ->     1 4'0100
      6:     2 7'------0   ->     2 4'0100
      7:     2 7'--0---1   ->     2 4'0100
      8:     2 7'--10--1   ->     3 4'0100
      9:     3 7'----0--   ->     2 4'0001
     10:     3 7'----1--   ->     3 4'0001

-------------------------------------

FSM `$fsm$\u_ctl.fsm_ctl$4632' from module `top':
-------------------------------------

  Information on FSM $fsm$\u_ctl.fsm_ctl$4632 (\u_ctl.fsm_ctl):

  Number of input signals:    2
  Number of output signals:   4
  Number of state bits:       4

  Input signals:
    0: $flatten\u_ctl.$verific$n828$1411
    1: $flatten\u_ctl.$verific$n815$1408

  Output signals:
    0: $flatten\u_ctl.$verific$n2485$1446
    1: $flatten\u_ctl.$verific$n2484$1445
    2: $flatten\u_ctl.$verific$n2483$1444
    3: $flatten\u_ctl.$verific$n2482$1443

  State encoding:
    0:     4'---1  <RESET STATE>
    1:     4'--1-
    2:     4'-1--
    3:     4'1---

  Transition Table (state_in, ctrl_in, state_out, ctrl_out):
      0:     0 2'00   ->     0 4'1000
      1:     0 2'-1   ->     1 4'1000
      2:     0 2'10   ->     2 4'1000
      3:     1 2'--   ->     3 4'0001
      4:     2 2'--   ->     0 4'0010
      5:     3 2'--   ->     0 4'0100

-------------------------------------

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).
Mapping FSM `$fsm$\u_conv2d.fsm_conv2d$4604' from module `\top'.
Mapping FSM `$fsm$\u_conv2d.fsm_getbias$4621' from module `\top'.
Mapping FSM `$fsm$\u_conv2d.fsm_getpixels$4626' from module `\top'.
Mapping FSM `$fsm$\u_ctl.fsm_ctl$4632' from module `\top'.

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~23 debug messages>

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~148 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_or_1206$conv2d.v:1245$4365: { \u_conv2d.fsm_conv2d [11:7] \u_conv2d.fsm_conv2d [5:4] \u_conv2d.fsm_conv2d [1:0] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_or_1202$conv2d.v:1245$4362: { \u_conv2d.fsm_conv2d [11:7] \u_conv2d.fsm_conv2d [5:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_or_1195$conv2d.v:1245$4357: { \u_conv2d.fsm_conv2d [11:8] \u_conv2d.fsm_conv2d [6:3] \u_conv2d.fsm_conv2d [1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_or_1193$conv2d.v:1245$4355: { \u_conv2d.fsm_conv2d [11:4] \u_conv2d.fsm_conv2d [2:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_or_1185$conv2d.v:1245$4348: { \u_conv2d.fsm_conv2d [11:6] \u_conv2d.fsm_conv2d [4:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_or_1180$conv2d.v:1245$4343: { \u_conv2d.fsm_conv2d [11:7] \u_conv2d.fsm_conv2d [4:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $flatten\u_conv2d.$verific$reduce_nor_1163$conv2d.v:1245$4325: \u_conv2d.fsm_conv2d
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$4510: { \u_conv2d.fsm_conv2d [11:8] \u_conv2d.fsm_conv2d [5] \u_conv2d.fsm_conv2d [3:2] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$4508: { \u_conv2d.fsm_conv2d [10:8] \u_conv2d.fsm_conv2d [6:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$4504: { \u_conv2d.fsm_conv2d [10] \u_conv2d.fsm_conv2d [8:7] \u_conv2d.fsm_conv2d [5:3] \u_conv2d.fsm_conv2d [1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$4500: { \u_conv2d.fsm_conv2d [11:10] \u_conv2d.fsm_conv2d [8:7] \u_conv2d.fsm_conv2d [3:0] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$4498: { \u_conv2d.fsm_conv2d [11:10] \u_conv2d.fsm_conv2d [8:6] \u_conv2d.fsm_conv2d [4:0] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$4496: { \u_conv2d.fsm_conv2d [11] \u_conv2d.fsm_conv2d [9:6] \u_conv2d.fsm_conv2d [4:0] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$4494: { \u_conv2d.fsm_conv2d [11:8] \u_conv2d.fsm_conv2d [6] \u_conv2d.fsm_conv2d [4:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$4490: { \u_conv2d.fsm_conv2d [10] \u_conv2d.fsm_conv2d [8:6] \u_conv2d.fsm_conv2d [4:0] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$4484: { \u_conv2d.fsm_conv2d [11] \u_conv2d.fsm_conv2d [9:8] \u_conv2d.fsm_conv2d [3:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$4478: { \u_conv2d.fsm_conv2d [11] \u_conv2d.fsm_conv2d [9] \u_conv2d.fsm_conv2d [7:3] \u_conv2d.fsm_conv2d [0] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$opt_reduce.cc:128:opt_pmux$4448: { \u_conv2d.fsm_conv2d [11:9] \u_conv2d.fsm_conv2d [6:4] \u_conv2d.fsm_conv2d [2:0] $flatten\u_conv2d.$verific$n11257$1925 }
  Optimizing cells in module \top.
Performed a total of 18 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\u_ctl.$verific$i_width_reg$control.v:224$1703 ($adff) from module top (D = $flatten\u_ctl.$verific$n2526$1534, Q = \u_ctl.i_width).
Adding EN signal on $flatten\u_ctl.$verific$i_total_reg$control.v:224$1712 ($adff) from module top (D = $flatten\u_ctl.$verific$n2650$1542, Q = \u_ctl.i_total).
Adding EN signal on $flatten\u_ctl.$verific$i_shift_reg$control.v:224$1725 ($adff) from module top (D = $flatten\u_ctl.$verific$n2752$1547, Q = \u_ctl.i_shift).
Adding EN signal on $flatten\u_ctl.$verific$i_sda_reg$control.v:224$1726 ($adff) from module top (D = \PWDATA [0], Q = \u_ctl.i_sda).
Adding EN signal on $flatten\u_ctl.$verific$i_scl_reg$control.v:224$1727 ($adff) from module top (D = \PWDATA [1], Q = \u_ctl.i_scl).
Adding EN signal on $flatten\u_ctl.$verific$i_result_base_reg$control.v:224$1711 ($adff) from module top (D = $flatten\u_ctl.$verific$n2629$1541, Q = \u_ctl.i_result_base).
Adding EN signal on $flatten\u_ctl.$verific$i_ready_reg$control.v:224$1701 ($adff) from module top (D = $flatten\u_ctl.$verific$n2492$1449, Q = \u_ctl.i_ready).
Adding EN signal on $flatten\u_ctl.$verific$i_quant_reg$control.v:224$1724 ($adff) from module top (D = $flatten\u_ctl.$verific$n2735$1546, Q = \u_ctl.i_quant).
Adding EN signal on $flatten\u_ctl.$verific$i_pixel_base_reg$control.v:224$1709 ($adff) from module top (D = $flatten\u_ctl.$verific$n2587$1539, Q = \u_ctl.i_pixel_base).
Adding EN signal on $flatten\u_ctl.$verific$i_intr_en_reg$control.v:224$1722 ($adff) from module top (D = \PWDATA [0], Q = \u_ctl.i_intr_en).
Adding EN signal on $flatten\u_ctl.$verific$i_height_reg$control.v:224$1704 ($adff) from module top (D = $flatten\u_ctl.$verific$n2536$1535, Q = \u_ctl.i_height).
Adding EN signal on $flatten\u_ctl.$verific$i_filters_reg$control.v:224$1706 ($adff) from module top (D = $flatten\u_ctl.$verific$n2556$1537, Q = \u_ctl.i_filters).
Adding EN signal on $flatten\u_ctl.$verific$i_filter_base_reg$control.v:224$1708 ($adff) from module top (D = $flatten\u_ctl.$verific$n2566$1538, Q = \u_ctl.i_filter_base).
Adding EN signal on $flatten\u_ctl.$verific$i_debug_mux_reg$control.v:224$1715 ($adff) from module top (D = $flatten\u_ctl.$verific$n2726$1545, Q = \u_ctl.i_debug_mux).
Adding EN signal on $flatten\u_ctl.$verific$i_dataout_reg$control.v:224$1707 ($adff) from module top (D = $flatten\u_ctl.$verific$n2758$1548, Q = \u_ctl.i_dataout).
Adding EN signal on $flatten\u_ctl.$verific$i_channels_reg$control.v:224$1705 ($adff) from module top (D = $flatten\u_ctl.$verific$n2546$1536, Q = \u_ctl.i_channels).
Adding EN signal on $flatten\u_ctl.$verific$i_bias_base_reg$control.v:224$1710 ($adff) from module top (D = $flatten\u_ctl.$verific$n2608$1540, Q = \u_ctl.i_bias_base).
Adding EN signal on $flatten\u_ctl.$verific$i_addr_reg$control.v:224$1717 ($adff) from module top (D = $flatten\u_ctl.$verific$n2669$1543 [1:0], Q = \u_ctl.i_addr [1:0]).
Adding EN signal on $flatten\u_ctl.$verific$i_addr_reg$control.v:224$1717 ($adff) from module top (D = $flatten\u_ctl.$verific$n2669$1543 [19:2], Q = \u_ctl.i_addr [19:2]).
Adding EN signal on $flatten\u_ctl.$verific$ctl_reg$control.v:224$1702 ($adff) from module top (D = $flatten\u_ctl.$verific$n2493$1533 [31:1], Q = \u_ctl.ctl [31:1]).
Adding EN signal on $flatten\u_conv2d.$verific$total_filters_done_reg$conv2d.v:1246$4382 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11570$2441, Q = \u_conv2d.total_filters_done).
Adding EN signal on $flatten\u_conv2d.$verific$running_reg$conv2d.v:1246$4384 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11639$1942, Q = \u_conv2d.running).
Adding EN signal on $flatten\u_conv2d.$verific$pixels_read_reg$conv2d.v:913$3120 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8238$2268, Q = \u_conv2d.pixels_read).
Adding EN signal on $flatten\u_conv2d.$verific$pixel_start_reg$conv2d.v:913$3127 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8271$1860, Q = \u_conv2d.pixel_start).
Adding EN signal on $flatten\u_conv2d.$verific$pixel_select_reg$conv2d.v:1246$4400 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11598$2443, Q = \u_conv2d.pixel_select).
Adding EN signal on $flatten\u_conv2d.$verific$next_buffer_reg$conv2d.v:1246$4399 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11595$1931, Q = \u_conv2d.next_buffer).
Adding EN signal on $flatten\u_conv2d.$verific$load_more_filters_reg$conv2d.v:1246$4386 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11637$1941, Q = \u_conv2d.load_more_filters).
Adding EN signal on $flatten\u_conv2d.$verific$load_buffer_reg$conv2d.v:913$3129 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8269$1859, Q = \u_conv2d.load_buffer).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm3_wen_reg$conv2d.v:785$3010 ($adff) from module top (D = $flatten\u_conv2d.$verific$n5111$1781, Q = \u_conv2d.i_tcdm3_wen).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm3_req_reg$conv2d.v:785$3009 ($adff) from module top (D = $flatten\u_conv2d.$verific$n5109$1780, Q = \u_conv2d.i_tcdm3_req).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm3_raddr_reg$conv2d.v:785$3002 ($aldff) from module top (D = $flatten\u_conv2d.$verific$n5087$2151 [1:0], Q = \u_conv2d.i_tcdm3_raddr [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm3_raddr_reg$conv2d.v:785$3002 ($aldff) from module top (D = $flatten\u_conv2d.$verific$n5087$2151 [19:2], Q = \u_conv2d.i_tcdm3_raddr [19:2]).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm2_wen_reg$conv2d.v:785$3018 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6636$1821, Q = \u_conv2d.i_tcdm2_wen).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm2_rreq_reg$conv2d.v:785$3007 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6635$1820, Q = \u_conv2d.i_tcdm2_rreq).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm2_raddr_reg$conv2d.v:785$2997 ($aldff) from module top (D = $flatten\u_conv2d.$verific$n6614$2225 [1:0], Q = \u_conv2d.i_tcdm2_raddr [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm2_raddr_reg$conv2d.v:785$2997 ($aldff) from module top (D = $flatten\u_conv2d.$verific$n6614$2225 [19:2], Q = \u_conv2d.i_tcdm2_raddr [19:2]).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm1_wen_reg$conv2d.v:913$3122 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8303$1863, Q = \u_conv2d.i_tcdm1_wen).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm1_req_reg$conv2d.v:913$3123 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8301$1862, Q = \u_conv2d.i_tcdm1_req).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm1_addr_reg$conv2d.v:913$3121 ($aldff) from module top (D = $flatten\u_conv2d.$verific$n8272$2270 [1:0], Q = \u_conv2d.i_tcdm1_addr [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$i_tcdm1_addr_reg$conv2d.v:913$3121 ($aldff) from module top (D = $flatten\u_conv2d.$verific$n8272$2270 [19:2], Q = \u_conv2d.i_tcdm1_addr [19:2]).
Adding EN signal on $flatten\u_conv2d.$verific$i_pixel_wdata_reg$conv2d.v:913$3126 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8304$2273, Q = \u_conv2d.i_pixel_wdata).
Adding EN signal on $flatten\u_conv2d.$verific$i_pixel_raddr_reg$conv2d.v:1246$4378 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11540$2439, Q = \u_conv2d.i_pixel_raddr).
Adding EN signal on $flatten\u_conv2d.$verific$i_outsel_reg$conv2d.v:1246$4377 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11467$2436, Q = \u_conv2d.i_outsel).
Adding EN signal on $flatten\u_conv2d.$verific$i_mult2_coef_reg$conv2d.v:1246$4404 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11507$2438, Q = \u_conv2d.i_mult2_coef).
Adding EN signal on $flatten\u_conv2d.$verific$i_mult1_coef_reg$conv2d.v:1246$4403 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11474$2437, Q = \u_conv2d.i_mult1_coef).
Adding EN signal on $flatten\u_conv2d.$verific$i_math_mode_reg$conv2d.v:1246$4374 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11258$2426, Q = \u_conv2d.i_math_mode).
Adding EN signal on $flatten\u_conv2d.$verific$i_mac_clr_reg$conv2d.v:1246$4375 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11619$1938, Q = \u_conv2d.i_mac_clr).
Adding EN signal on $flatten\u_conv2d.$verific$i_mac_clken_reg$conv2d.v:1246$4376 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11622$1939, Q = \u_conv2d.i_mac_clken).
Adding EN signal on $flatten\u_conv2d.$verific$i_filter_wdata_reg$conv2d.v:785$3014 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6651$2228, Q = \u_conv2d.i_filter_wdata).
Adding EN signal on $flatten\u_conv2d.$verific$i_filter_waddr_reg$conv2d.v:785$3013 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6562$2221 [0], Q = \u_conv2d.i_filter_waddr [0]).
Adding EN signal on $flatten\u_conv2d.$verific$i_filter_waddr_reg$conv2d.v:785$3013 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6562$2221 [11:1], Q = \u_conv2d.i_filter_waddr [11:1]).
Adding EN signal on $flatten\u_conv2d.$verific$i_filter_raddr_reg$conv2d.v:1246$4379 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11623$2446 [1:0], Q = \u_conv2d.i_filter_raddr [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$i_filter_raddr_reg$conv2d.v:1246$4379 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11623$2446 [11:2], Q = \u_conv2d.i_filter_raddr [11:2]).
Adding EN signal on $flatten\u_conv2d.$verific$i_done2d_reg$conv2d.v:1246$4383 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11616$1935, Q = \u_conv2d.i_done2d).
Adding EN signal on $flatten\u_conv2d.$verific$i_csel_reg$conv2d.v:1246$4372 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11641$1944, Q = \u_conv2d.i_csel).
Adding EN signal on $flatten\u_conv2d.$verific$i_bias_wdata_reg$conv2d.v:785$3012 ($adff) from module top (D = $flatten\u_conv2d.$verific$n5126$2154, Q = \u_conv2d.i_bias_wdata).
Adding EN signal on $flatten\u_conv2d.$verific$i_bias_waddr_reg$conv2d.v:785$3004 ($adff) from module top (D = $flatten\u_conv2d.$verific$n5064$2149 [11:2], Q = \u_conv2d.i_bias_waddr [11:2]).
Adding EN signal on $flatten\u_conv2d.$verific$i_bias_waddr_reg$conv2d.v:785$3004 ($adff) from module top (D = $flatten\u_conv2d.$verific$n5064$2149 [1:0], Q = \u_conv2d.i_bias_waddr [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$fsm_getfilters_reg$conv2d.v:785$2986 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6647$2227, Q = \u_conv2d.fsm_getfilters).
Adding EN signal on $flatten\u_conv2d.$verific$fract_select_reg$conv2d.v:1246$4401 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11601$2444, Q = \u_conv2d.fract_select).
Adding EN signal on $flatten\u_conv2d.$verific$filters_loaded_reg$conv2d.v:785$2983 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6604$2224, Q = \u_conv2d.filters_loaded).
Adding EN signal on $flatten\u_conv2d.$verific$filters_done_reg$conv2d.v:1246$4381 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11582$2442 [2:0], Q = \u_conv2d.filters_done [2:0]).
Adding EN signal on $flatten\u_conv2d.$verific$filters_done_reg$conv2d.v:1246$4381 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11582$2442 [8:3], Q = \u_conv2d.filters_done [8:3]).
Adding EN signal on $flatten\u_conv2d.$verific$filter_stride_reg$conv2d.v:785$2984 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6590$2223, Q = \u_conv2d.filter_stride).
Adding EN signal on $flatten\u_conv2d.$verific$filter_start_reg$conv2d.v:785$3019 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6699$1826, Q = \u_conv2d.filter_start).
Adding EN signal on $flatten\u_conv2d.$verific$filter_space_left_reg$conv2d.v:785$3020 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6575$2222, Q = \u_conv2d.filter_space_left).
Adding EN signal on $flatten\u_conv2d.$verific$filter_reload_reg$conv2d.v:1246$4385 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11581$1927, Q = \u_conv2d.filter_reload).
Adding EN signal on $flatten\u_conv2d.$verific$filter_channels_reg$conv2d.v:785$3017 ($adff) from module top (D = $flatten\u_conv2d.$verific$n6637$2226, Q = \u_conv2d.filter_channels).
Adding EN signal on $flatten\u_conv2d.$verific$channels_loaded_reg$conv2d.v:913$3119 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8338$2274 [1:0], Q = \u_conv2d.channels_loaded [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$channels_loaded_reg$conv2d.v:913$3119 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8338$2274 [8:2], Q = \u_conv2d.channels_loaded [8:2]).
Adding EN signal on $flatten\u_conv2d.$verific$channels_done_reg$conv2d.v:1246$4380 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11604$2445 [1:0], Q = \u_conv2d.channels_done [1:0]).
Adding EN signal on $flatten\u_conv2d.$verific$channels_done_reg$conv2d.v:1246$4380 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11604$2445 [8:2], Q = \u_conv2d.channels_done [8:2]).
Adding EN signal on $flatten\u_conv2d.$verific$buffers_used_reg$conv2d.v:913$3128 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8293$2271 [1], Q = \u_conv2d.buffers_used [1]).
Adding EN signal on $flatten\u_conv2d.$verific$buffers_used_reg$conv2d.v:913$3128 ($adff) from module top (D = $flatten\u_conv2d.$verific$n8293$2271 [0], Q = \u_conv2d.buffers_used [0]).
Adding EN signal on $flatten\u_conv2d.$verific$bias_loaded_reg$conv2d.v:785$3006 ($adff) from module top (D = $flatten\u_conv2d.$verific$n5112$2152, Q = \u_conv2d.bias_loaded).
Adding EN signal on $flatten\u_conv2d.$verific$acc7_reg$conv2d.v:1246$4398 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11436$2434 [7:0], Q = \u_conv2d.acc7 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc7_reg$conv2d.v:1246$4398 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11436$2434 [15:8], Q = \u_conv2d.acc7 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc7_reg$conv2d.v:1246$4398 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11436$2434 [23:16], Q = \u_conv2d.acc7 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc6_reg$conv2d.v:1246$4397 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11411$2433 [7:0], Q = \u_conv2d.acc6 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc6_reg$conv2d.v:1246$4397 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11411$2433 [15:8], Q = \u_conv2d.acc6 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc6_reg$conv2d.v:1246$4397 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11411$2433 [23:16], Q = \u_conv2d.acc6 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc5_reg$conv2d.v:1246$4396 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11386$2432 [7:0], Q = \u_conv2d.acc5 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc5_reg$conv2d.v:1246$4396 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11386$2432 [15:8], Q = \u_conv2d.acc5 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc5_reg$conv2d.v:1246$4396 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11386$2432 [23:16], Q = \u_conv2d.acc5 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc4_reg$conv2d.v:1246$4395 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11361$2431 [7:0], Q = \u_conv2d.acc4 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc4_reg$conv2d.v:1246$4395 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11361$2431 [15:8], Q = \u_conv2d.acc4 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc4_reg$conv2d.v:1246$4395 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11361$2431 [23:16], Q = \u_conv2d.acc4 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc3_reg$conv2d.v:1246$4394 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11336$2430 [7:0], Q = \u_conv2d.acc3 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc3_reg$conv2d.v:1246$4394 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11336$2430 [15:8], Q = \u_conv2d.acc3 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc3_reg$conv2d.v:1246$4394 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11336$2430 [23:16], Q = \u_conv2d.acc3 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc2_reg$conv2d.v:1246$4393 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11311$2429 [7:0], Q = \u_conv2d.acc2 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc2_reg$conv2d.v:1246$4393 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11311$2429 [15:8], Q = \u_conv2d.acc2 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc2_reg$conv2d.v:1246$4393 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11311$2429 [23:16], Q = \u_conv2d.acc2 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc1_reg$conv2d.v:1246$4392 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11286$2428 [7:0], Q = \u_conv2d.acc1 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc1_reg$conv2d.v:1246$4392 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11286$2428 [15:8], Q = \u_conv2d.acc1 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc1_reg$conv2d.v:1246$4392 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11286$2428 [23:16], Q = \u_conv2d.acc1 [23:16]).
Adding EN signal on $flatten\u_conv2d.$verific$acc0_reg$conv2d.v:1246$4391 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11261$2427 [7:0], Q = \u_conv2d.acc0 [7:0]).
Adding EN signal on $flatten\u_conv2d.$verific$acc0_reg$conv2d.v:1246$4391 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11261$2427 [15:8], Q = \u_conv2d.acc0 [15:8]).
Adding EN signal on $flatten\u_conv2d.$verific$acc0_reg$conv2d.v:1246$4391 ($adff) from module top (D = $flatten\u_conv2d.$verific$n11261$2427 [23:16], Q = \u_conv2d.acc0 [23:16]).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$5451 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$5451 ($adffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$5435 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$5435 ($adffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$5336 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$5336 ($adffe) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$5336 ($adffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$5238 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$5238 ($adffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$5208 ($adffe) from module top.
Setting constant 0-bit at position 0 on $flatten\u_conv2d.$verific$bias_base_addr_reg$conv2d.v:785$3005 ($adff) from module top.
Setting constant 0-bit at position 1 on $flatten\u_conv2d.$verific$bias_base_addr_reg$conv2d.v:785$3005 ($adff) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$5398 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$5398 ($adffe) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$5398 ($adffe) from module top.
Setting constant 0-bit at position 0 on $flatten\u_conv2d.$verific$filters_complete_reg$conv2d.v:785$3021 ($adff) from module top.
Setting constant 0-bit at position 1 on $flatten\u_conv2d.$verific$filters_complete_reg$conv2d.v:785$3021 ($adff) from module top.
Setting constant 0-bit at position 2 on $flatten\u_conv2d.$verific$filters_complete_reg$conv2d.v:785$3021 ($adff) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$5325 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$5325 ($adffe) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$5325 ($adffe) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$5303 ($adffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$5296 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$5296 ($adffe) from module top.
Setting constant 0-bit at position 0 on $flatten\u_conv2d.$verific$i_pixel_waddr_reg$conv2d.v:913$3125 ($adff) from module top.
Setting constant 0-bit at position 1 on $flatten\u_conv2d.$verific$i_pixel_waddr_reg$conv2d.v:913$3125 ($adff) from module top.

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 46 unused cells and 95 unused wires.
<suppressed ~47 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~135 debug messages>

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~145 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~519 debug messages>
Removed a total of 173 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$4957 ($adffe) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$4957 ($adffe) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$4957 ($adffe) from module top.
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$5666 ($adff) from module top.
Setting constant 0-bit at position 1 on $auto$ff.cc:262:slice$5666 ($adff) from module top.
Setting constant 0-bit at position 2 on $auto$ff.cc:262:slice$5666 ($adff) from module top.
Setting constant 0-bit at position 0 on $flatten\u_conv2d.$verific$i_bias_raddr_reg$conv2d.v:785$3003 ($adff) from module top.
Setting constant 0-bit at position 1 on $flatten\u_conv2d.$verific$i_bias_raddr_reg$conv2d.v:785$3003 ($adff) from module top.

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 1 unused cells and 182 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~149 debug messages>

yosys> opt_reduce

3.13.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.13.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.13.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.13.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 7 bits (of 20) from FF cell top.$flatten\u_ctl.$verific$i_ctl_pfwaddr_reg$control.v:224$1718 ($adff).
Removed top 2 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_211$control.v:216$1662 ($eq).
Removed top 2 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_142$control.v:181$1633 ($eq).
Removed top 2 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_141$control.v:177$1632 ($eq).
Removed top 2 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_140$control.v:174$1631 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_139$control.v:169$1630 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_138$control.v:164$1629 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_137$control.v:159$1628 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_136$control.v:158$1627 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_135$control.v:157$1626 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_134$control.v:156$1625 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_133$control.v:155$1624 ($eq).
Removed top 3 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_132$control.v:154$1623 ($eq).
Removed top 4 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_131$control.v:153$1622 ($eq).
Removed top 4 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_130$control.v:152$1621 ($eq).
Removed top 4 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_129$control.v:151$1620 ($eq).
Removed top 4 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_128$control.v:150$1619 ($eq).
Removed top 5 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_127$control.v:149$1618 ($eq).
Removed top 5 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_126$control.v:148$1617 ($eq).
Removed top 6 bits (of 7) from port B of cell top.$flatten\u_ctl.$verific$equal_125$control.v:147$1616 ($eq).
Removed top 17 bits (of 18) from port B of cell top.$flatten\u_ctl.$verific$add_108$control.v:161$1611 ($add).
Removed top 23 bits (of 24) from port B of cell top.$flatten\u_ctl.$verific$add_69$control.v:118$1593 ($add).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5509 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5483 ($ne).
Removed top 1 bits (of 4) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5477 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5406 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5404 ($ne).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5391 ($ne).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5378 ($ne).
Removed top 2 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5313 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5295 ($ne).
Removed top 2 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5235 ($ne).
Removed top 2 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5233 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5231 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5069 ($ne).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5063 ($ne).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5031 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$5017 ($ne).
Removed top 1 bits (of 3) from port B of cell top.$auto$opt_dff.cc:195:make_patterns_logic$4983 ($ne).
Removed top 1 bits (of 2) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$4760 ($eq).
Removed top 1 bits (of 2) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$4782 ($eq).
Removed top 12 bits (of 13) from port B of cell top.$flatten\u_conv2d.\pk2.$verific$add_4$fadder.v:9$4436 ($add).
Removed top 1 bits (of 13) from port Y of cell top.$flatten\u_conv2d.\pk2.$verific$add_4$fadder.v:9$4436 ($add).
Removed top 1 bits (of 13) from port A of cell top.$flatten\u_conv2d.\pk2.$verific$add_4$fadder.v:9$4436 ($add).
Removed top 1 bits (of 2) from port B of cell top.$auto$fsm_map.cc:77:implement_pattern_cache$4743 ($eq).
Removed top 15 bits (of 16) from port B of cell top.$flatten\u_conv2d.$verific$add_1110$conv2d.v:1199$4296 ($add).
Removed top 1 bits (of 7) from port B of cell top.$flatten\u_conv2d.$verific$equal_1094$conv2d.v:1182$4292 ($eq).
Removed top 5 bits (of 6) from port B of cell top.$flatten\u_conv2d.$verific$add_1091$conv2d.v:1181$4290 ($add).
Removed top 1 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$equal_1069$conv2d.v:1157$4276 ($eq).
Removed top 6 bits (of 7) from port B of cell top.$flatten\u_conv2d.$verific$add_1066$conv2d.v:1156$4274 ($add).
Removed top 1 bits (of 2) from port B of cell top.$flatten\u_conv2d.$verific$add_1063$conv2d.v:1153$4272 ($add).
Removed top 9 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$add_1018$conv2d.v:1119$4253 ($add).
Removed top 1 bits (of 13) from port Y of cell top.$flatten\u_conv2d.\pk2.$verific$add_3$fadder.v:9$4435 ($add).
Removed top 9 bits (of 12) from port B of cell top.$flatten\u_conv2d.\pk1.$verific$add_3$adder.v:8$4428 ($add).
Removed top 1 bits (of 13) from port Y of cell top.$flatten\u_conv2d.\pk1.$verific$add_3$adder.v:8$4428 ($add).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_7.$verific$add_3$adder.v:8$4422 ($add).
Removed top 1 bits (of 17) from port Y of cell top.$flatten\u_conv2d.\k16_7.$verific$add_3$adder.v:8$4422 ($add).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_6.$verific$add_3$adder.v:8$4422 ($add).
Removed top 1 bits (of 17) from port Y of cell top.$flatten\u_conv2d.\k16_6.$verific$add_3$adder.v:8$4422 ($add).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_5.$verific$add_3$adder.v:8$4422 ($add).
Removed top 1 bits (of 17) from port Y of cell top.$flatten\u_conv2d.\k16_5.$verific$add_3$adder.v:8$4422 ($add).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_4.$verific$add_3$adder.v:8$4422 ($add).
Removed top 1 bits (of 17) from port Y of cell top.$flatten\u_conv2d.\k16_4.$verific$add_3$adder.v:8$4422 ($add).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_3.$verific$add_3$adder.v:8$4422 ($add).
Removed top 1 bits (of 17) from port Y of cell top.$flatten\u_conv2d.\k16_3.$verific$add_3$adder.v:8$4422 ($add).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_2.$verific$add_3$adder.v:8$4422 ($add).
Removed top 1 bits (of 17) from port Y of cell top.$flatten\u_conv2d.\k16_2.$verific$add_3$adder.v:8$4422 ($add).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_1.$verific$add_3$adder.v:8$4422 ($add).
Removed top 1 bits (of 17) from port Y of cell top.$flatten\u_conv2d.\k16_1.$verific$add_3$adder.v:8$4422 ($add).
Removed top 8 bits (of 16) from port B of cell top.$flatten\u_conv2d.\k16_0.$verific$add_3$adder.v:8$4422 ($add).
Removed top 1 bits (of 17) from port Y of cell top.$flatten\u_conv2d.\k16_0.$verific$add_3$adder.v:8$4422 ($add).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k7.$verific$add_3$adder.v:8$4416 ($add).
Removed top 1 bits (of 25) from port Y of cell top.$flatten\u_conv2d.\k7.$verific$add_3$adder.v:8$4416 ($add).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k6.$verific$add_3$adder.v:8$4416 ($add).
Removed top 1 bits (of 25) from port Y of cell top.$flatten\u_conv2d.\k6.$verific$add_3$adder.v:8$4416 ($add).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k5.$verific$add_3$adder.v:8$4416 ($add).
Removed top 1 bits (of 25) from port Y of cell top.$flatten\u_conv2d.\k5.$verific$add_3$adder.v:8$4416 ($add).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k4.$verific$add_3$adder.v:8$4416 ($add).
Removed top 1 bits (of 25) from port Y of cell top.$flatten\u_conv2d.\k4.$verific$add_3$adder.v:8$4416 ($add).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k3.$verific$add_3$adder.v:8$4416 ($add).
Removed top 1 bits (of 25) from port Y of cell top.$flatten\u_conv2d.\k3.$verific$add_3$adder.v:8$4416 ($add).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k2.$verific$add_3$adder.v:8$4416 ($add).
Removed top 1 bits (of 25) from port Y of cell top.$flatten\u_conv2d.\k2.$verific$add_3$adder.v:8$4416 ($add).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k1.$verific$add_3$adder.v:8$4416 ($add).
Removed top 1 bits (of 25) from port Y of cell top.$flatten\u_conv2d.\k1.$verific$add_3$adder.v:8$4416 ($add).
Removed top 16 bits (of 24) from port B of cell top.$flatten\u_conv2d.\k0.$verific$add_3$adder.v:8$4416 ($add).
Removed top 1 bits (of 25) from port Y of cell top.$flatten\u_conv2d.\k0.$verific$add_3$adder.v:8$4416 ($add).
Removed top 1 bits (of 17) from port B of cell top.$flatten\u_conv2d.$verific$equal_768$conv2d.v:876$3066 ($eq).
Removed top 15 bits (of 16) from port B of cell top.$flatten\u_conv2d.$verific$add_764$conv2d.v:874$3064 ($add).
Removed top 1 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$equal_756$conv2d.v:870$3060 ($eq).
Removed top 6 bits (of 7) from port B of cell top.$flatten\u_conv2d.$verific$add_753$conv2d.v:869$3058 ($add).
Removed top 17 bits (of 18) from port B of cell top.$flatten\u_conv2d.$verific$add_750$conv2d.v:867$3056 ($add).
Removed top 9 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$add_724$conv2d.v:842$3045 ($add).
Removed top 1 bits (of 3) from mux cell top.$flatten\u_conv2d.$verific$select_635$conv2d.v:784$2972 ($pmux).
Removed top 1 bits (of 2) from port B of cell top.$flatten\u_conv2d.$verific$equal_623$conv2d.v:667$2958 ($eq).
Removed top 1 bits (of 3) from mux cell top.$flatten\u_conv2d.$verific$mux_621$conv2d.v:782$2956 ($mux).
Removed top 1 bits (of 3) from mux cell top.$flatten\u_conv2d.$verific$mux_617$conv2d.v:779$2954 ($mux).
Removed top 1 bits (of 3) from mux cell top.$flatten\u_conv2d.$verific$mux_486$conv2d.v:702$2913 ($mux).
Removed top 2 bits (of 14) from port A of cell top.$flatten\u_conv2d.$verific$LessThan_472$conv2d.v:691$2908 ($le).
Removed top 1 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$LessThan_471$conv2d.v:690$2907 ($lt).
Removed top 5 bits (of 6) from port B of cell top.$flatten\u_conv2d.$verific$add_468$conv2d.v:689$2905 ($add).
Removed top 5 bits (of 6) from port B of cell top.$flatten\u_conv2d.$verific$add_466$conv2d.v:688$2903 ($add).
Removed top 1 bits (of 14) from port A of cell top.$flatten\u_conv2d.$verific$sub_464$conv2d.v:687$2900 ($sub).
Removed top 10 bits (of 14) from port B of cell top.$flatten\u_conv2d.$verific$sub_464$conv2d.v:687$2900 ($sub).
Removed top 1 bits (of 14) from port Y of cell top.$flatten\u_conv2d.$verific$sub_464$conv2d.v:687$2900 ($sub).
Removed top 1 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$equal_463$conv2d.v:686$2899 ($eq).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_conv2d.$verific$add_460$conv2d.v:685$2897 ($add).
Removed top 17 bits (of 18) from port B of cell top.$flatten\u_conv2d.$verific$add_454$conv2d.v:681$2891 ($add).
Removed top 1 bits (of 15) from port A of cell top.$flatten\u_conv2d.$verific$sub_439$conv2d.v:672$2881 ($sub).
Removed top 11 bits (of 15) from port B of cell top.$flatten\u_conv2d.$verific$sub_439$conv2d.v:672$2881 ($sub).
Removed top 1 bits (of 15) from port Y of cell top.$flatten\u_conv2d.$verific$sub_439$conv2d.v:672$2881 ($sub).
Removed top 10 bits (of 11) from port B of cell top.$flatten\u_conv2d.$verific$add_436$conv2d.v:669$2879 ($add).
Removed top 1 bits (of 3) from mux cell top.$flatten\u_conv2d.$verific$mux_435$conv2d.v:665$2878 ($mux).
Removed top 8 bits (of 9) from port B of cell top.$flatten\u_conv2d.$verific$add_387$conv2d.v:638$2841 ($add).
Removed top 17 bits (of 18) from port B of cell top.$flatten\u_conv2d.$verific$add_381$conv2d.v:630$2837 ($add).
Removed top 9 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$add_354$conv2d.v:606$2823 ($add).
Removed top 1 bits (of 4) from mux cell top.$flatten\u_conv2d.$verific$mux_324$conv2d.v:579$2806 ($mux).
Removed top 10 bits (of 11) from port B of cell top.$flatten\u_conv2d.$verific$add_291$conv2d.v:540$2788 ($add).
Removed top 9 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$add_202$conv2d.v:418$2738 ($add).
Removed top 1 bits (of 10) from port B of cell top.$flatten\u_conv2d.$verific$add_190$conv2d.v:409$2729 ($add).
Removed top 7 bits (of 20) from port B of cell top.$flatten\u_conv2d.\t2_3.$verific$add_3$adder.v:8$4410 ($add).
Removed top 1 bits (of 21) from port Y of cell top.$flatten\u_conv2d.\t2_3.$verific$add_3$adder.v:8$4410 ($add).
Removed top 17 bits (of 20) from port B of cell top.$flatten\u_conv2d.\t2_2.$verific$add_3$adder.v:8$4410 ($add).
Removed top 1 bits (of 21) from port Y of cell top.$flatten\u_conv2d.\t2_2.$verific$add_3$adder.v:8$4410 ($add).
Removed top 11 bits (of 20) from port B of cell top.$flatten\u_conv2d.\t2_1.$verific$add_3$adder.v:8$4410 ($add).
Removed top 1 bits (of 21) from port Y of cell top.$flatten\u_conv2d.\t2_1.$verific$add_3$adder.v:8$4410 ($add).
Removed top 2 bits (of 4) from port B of cell top.$flatten\u_conv2d.$verific$equal_69$conv2d.v:123$2492 ($eq).
Removed top 2 bits (of 4) from port B of cell top.$flatten\u_conv2d.$verific$equal_68$conv2d.v:122$2491 ($eq).
Removed top 3 bits (of 4) from port B of cell top.$flatten\u_conv2d.$verific$equal_67$conv2d.v:121$2490 ($eq).
Removed top 1 bits (of 6) from mux cell top.$flatten\u_conv2d.$verific$mux_1278$conv2d.v:713$4197 ($mux).
Removed top 1 bits (of 4) from wire top.$flatten\u_conv2d.$verific$n4415$2110.
Removed top 1 bits (of 20) from wire top.$flatten\u_conv2d.$verific$n4420$2111.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n5316$2159.
Removed top 1 bits (of 15) from wire top.$flatten\u_conv2d.$verific$n5359$2163.
Removed top 6 bits (of 14) from wire top.$flatten\u_conv2d.$verific$n5416$2165.
Removed top 1 bits (of 14) from wire top.$flatten\u_conv2d.$verific$n5563$2172.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n5681$2178.
Removed top 1 bits (of 13) from wire top.$flatten\u_conv2d.$verific$n5687$2179.
Removed top 7 bits (of 9) from wire top.$flatten\u_conv2d.$verific$n5701$2180.
Removed top 1 bits (of 9) from wire top.$flatten\u_conv2d.$verific$n5711$2181.
Removed top 3 bits (of 9) from wire top.$flatten\u_conv2d.$verific$n5723$2182.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n5734$2183.
Removed top 2 bits (of 9) from wire top.$flatten\u_conv2d.$verific$n5740$2184.
Removed top 2 bits (of 13) from wire top.$flatten\u_conv2d.$verific$n5750$2185.
Removed top 1 bits (of 9) from wire top.$flatten\u_conv2d.$verific$n5764$2186.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n5894$2195.
Removed top 1 bits (of 12) from wire top.$flatten\u_conv2d.$verific$n5924$2197.
Removed top 1 bits (of 14) from wire top.$flatten\u_conv2d.$verific$n5994$2199.
Removed top 3 bits (of 12) from wire top.$flatten\u_conv2d.$verific$n6009$2200.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n6534$2218.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n6553$2220.
Removed top 1 bits (of 12) from wire top.$flatten\u_conv2d.$verific$n6562$2221.
Removed top 2 bits (of 14) from wire top.$flatten\u_conv2d.$verific$n6575$2222.
Removed top 3 bits (of 13) from wire top.$flatten\u_conv2d.$verific$n6590$2223.
Removed top 1 bits (of 3) from wire top.$flatten\u_conv2d.$verific$n6647$2227.
Removed top 7 bits (of 20) from wire top.ctl_pfwaddr.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 180 unused cells and 320 unused wires.
<suppressed ~202 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module top:
  creating $macc model for $flatten\u_conv2d.$verific$add_1018$conv2d.v:1119$4253 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_1063$conv2d.v:1153$4272 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_1066$conv2d.v:1156$4274 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_1091$conv2d.v:1181$4290 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_1110$conv2d.v:1199$4296 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_190$conv2d.v:409$2729 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_202$conv2d.v:418$2738 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_291$conv2d.v:540$2788 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_354$conv2d.v:606$2823 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_381$conv2d.v:630$2837 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_387$conv2d.v:638$2841 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_436$conv2d.v:669$2879 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_454$conv2d.v:681$2891 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_460$conv2d.v:685$2897 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_466$conv2d.v:688$2903 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_468$conv2d.v:689$2905 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_724$conv2d.v:842$3045 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_750$conv2d.v:867$3056 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_753$conv2d.v:869$3058 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_764$conv2d.v:874$3064 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_903$conv2d.v:1018$4179 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_905$conv2d.v:1019$4181 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_907$conv2d.v:1020$4183 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_909$conv2d.v:1021$4185 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_911$conv2d.v:1022$4187 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_913$conv2d.v:1023$4189 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_915$conv2d.v:1024$4191 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_917$conv2d.v:1025$4193 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$add_929$conv2d.v:1041$4203 ($add).
  creating $macc model for $flatten\u_conv2d.$verific$sub_439$conv2d.v:672$2881 ($sub).
  creating $macc model for $flatten\u_conv2d.$verific$sub_464$conv2d.v:687$2900 ($sub).
  creating $macc model for $flatten\u_conv2d.$verific$sub_697$conv2d.v:804$3033 ($sub).
  creating $macc model for $flatten\u_conv2d.$verific$sub_699$conv2d.v:805$3035 ($sub).
  creating $macc model for $flatten\u_conv2d.$verific$sub_701$conv2d.v:806$3037 ($sub).
  creating $macc model for $flatten\u_conv2d.$verific$sub_703$conv2d.v:807$3039 ($sub).
  creating $macc model for $flatten\u_conv2d.\k0.$verific$add_3$adder.v:8$4416 ($add).
  creating $macc model for $flatten\u_conv2d.\k1.$verific$add_3$adder.v:8$4416 ($add).
  creating $macc model for $flatten\u_conv2d.\k16_0.$verific$add_3$adder.v:8$4422 ($add).
  creating $macc model for $flatten\u_conv2d.\k16_1.$verific$add_3$adder.v:8$4422 ($add).
  creating $macc model for $flatten\u_conv2d.\k16_2.$verific$add_3$adder.v:8$4422 ($add).
  creating $macc model for $flatten\u_conv2d.\k16_3.$verific$add_3$adder.v:8$4422 ($add).
  creating $macc model for $flatten\u_conv2d.\k16_4.$verific$add_3$adder.v:8$4422 ($add).
  creating $macc model for $flatten\u_conv2d.\k16_5.$verific$add_3$adder.v:8$4422 ($add).
  creating $macc model for $flatten\u_conv2d.\k16_6.$verific$add_3$adder.v:8$4422 ($add).
  creating $macc model for $flatten\u_conv2d.\k16_7.$verific$add_3$adder.v:8$4422 ($add).
  creating $macc model for $flatten\u_conv2d.\k2.$verific$add_3$adder.v:8$4416 ($add).
  creating $macc model for $flatten\u_conv2d.\k3.$verific$add_3$adder.v:8$4416 ($add).
  creating $macc model for $flatten\u_conv2d.\k4.$verific$add_3$adder.v:8$4416 ($add).
  creating $macc model for $flatten\u_conv2d.\k5.$verific$add_3$adder.v:8$4416 ($add).
  creating $macc model for $flatten\u_conv2d.\k6.$verific$add_3$adder.v:8$4416 ($add).
  creating $macc model for $flatten\u_conv2d.\k7.$verific$add_3$adder.v:8$4416 ($add).
  creating $macc model for $flatten\u_conv2d.\pk1.$verific$add_3$adder.v:8$4428 ($add).
  creating $macc model for $flatten\u_conv2d.\pk2.$verific$add_3$fadder.v:9$4435 ($add).
  creating $macc model for $flatten\u_conv2d.\pk2.$verific$add_4$fadder.v:9$4436 ($add).
  creating $macc model for $flatten\u_conv2d.\t2_1.$verific$add_3$adder.v:8$4410 ($add).
  creating $macc model for $flatten\u_conv2d.\t2_2.$verific$add_3$adder.v:8$4410 ($add).
  creating $macc model for $flatten\u_conv2d.\t2_3.$verific$add_3$adder.v:8$4410 ($add).
  creating $macc model for $flatten\u_ctl.$verific$add_108$control.v:161$1611 ($add).
  creating $macc model for $flatten\u_ctl.$verific$add_69$control.v:118$1593 ($add).
  merging $macc model for $flatten\u_conv2d.\pk2.$verific$add_3$fadder.v:9$4435 into $flatten\u_conv2d.\pk2.$verific$add_4$fadder.v:9$4436.
  creating $alu model for $macc $flatten\u_ctl.$verific$add_108$control.v:161$1611.
  creating $alu model for $macc $flatten\u_conv2d.\t2_3.$verific$add_3$adder.v:8$4410.
  creating $alu model for $macc $flatten\u_conv2d.\t2_2.$verific$add_3$adder.v:8$4410.
  creating $alu model for $macc $flatten\u_conv2d.\t2_1.$verific$add_3$adder.v:8$4410.
  creating $alu model for $macc $flatten\u_conv2d.\pk2.$verific$add_4$fadder.v:9$4436.
  creating $alu model for $macc $flatten\u_ctl.$verific$add_69$control.v:118$1593.
  creating $alu model for $macc $flatten\u_conv2d.\pk1.$verific$add_3$adder.v:8$4428.
  creating $alu model for $macc $flatten\u_conv2d.\k7.$verific$add_3$adder.v:8$4416.
  creating $alu model for $macc $flatten\u_conv2d.\k6.$verific$add_3$adder.v:8$4416.
  creating $alu model for $macc $flatten\u_conv2d.\k5.$verific$add_3$adder.v:8$4416.
  creating $alu model for $macc $flatten\u_conv2d.\k4.$verific$add_3$adder.v:8$4416.
  creating $alu model for $macc $flatten\u_conv2d.\k3.$verific$add_3$adder.v:8$4416.
  creating $alu model for $macc $flatten\u_conv2d.\k2.$verific$add_3$adder.v:8$4416.
  creating $alu model for $macc $flatten\u_conv2d.\k16_7.$verific$add_3$adder.v:8$4422.
  creating $alu model for $macc $flatten\u_conv2d.\k16_6.$verific$add_3$adder.v:8$4422.
  creating $alu model for $macc $flatten\u_conv2d.\k16_5.$verific$add_3$adder.v:8$4422.
  creating $alu model for $macc $flatten\u_conv2d.\k16_4.$verific$add_3$adder.v:8$4422.
  creating $alu model for $macc $flatten\u_conv2d.\k16_3.$verific$add_3$adder.v:8$4422.
  creating $alu model for $macc $flatten\u_conv2d.\k16_2.$verific$add_3$adder.v:8$4422.
  creating $alu model for $macc $flatten\u_conv2d.\k16_1.$verific$add_3$adder.v:8$4422.
  creating $alu model for $macc $flatten\u_conv2d.\k16_0.$verific$add_3$adder.v:8$4422.
  creating $alu model for $macc $flatten\u_conv2d.\k1.$verific$add_3$adder.v:8$4416.
  creating $alu model for $macc $flatten\u_conv2d.\k0.$verific$add_3$adder.v:8$4416.
  creating $alu model for $macc $flatten\u_conv2d.$verific$sub_703$conv2d.v:807$3039.
  creating $alu model for $macc $flatten\u_conv2d.$verific$sub_701$conv2d.v:806$3037.
  creating $alu model for $macc $flatten\u_conv2d.$verific$sub_699$conv2d.v:805$3035.
  creating $alu model for $macc $flatten\u_conv2d.$verific$sub_697$conv2d.v:804$3033.
  creating $alu model for $macc $flatten\u_conv2d.$verific$sub_464$conv2d.v:687$2900.
  creating $alu model for $macc $flatten\u_conv2d.$verific$sub_439$conv2d.v:672$2881.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_929$conv2d.v:1041$4203.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_917$conv2d.v:1025$4193.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_915$conv2d.v:1024$4191.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_913$conv2d.v:1023$4189.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_911$conv2d.v:1022$4187.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_909$conv2d.v:1021$4185.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_907$conv2d.v:1020$4183.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_905$conv2d.v:1019$4181.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_903$conv2d.v:1018$4179.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_764$conv2d.v:874$3064.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_753$conv2d.v:869$3058.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_750$conv2d.v:867$3056.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_724$conv2d.v:842$3045.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_468$conv2d.v:689$2905.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_466$conv2d.v:688$2903.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_460$conv2d.v:685$2897.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_454$conv2d.v:681$2891.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_436$conv2d.v:669$2879.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_387$conv2d.v:638$2841.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_381$conv2d.v:630$2837.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_354$conv2d.v:606$2823.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_291$conv2d.v:540$2788.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_202$conv2d.v:418$2738.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_190$conv2d.v:409$2729.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_1110$conv2d.v:1199$4296.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_1091$conv2d.v:1181$4290.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_1066$conv2d.v:1156$4274.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_1063$conv2d.v:1153$4272.
  creating $alu model for $macc $flatten\u_conv2d.$verific$add_1018$conv2d.v:1119$4253.
  creating $alu model for $flatten\u_conv2d.$verific$LessThan_471$conv2d.v:690$2907 ($lt): new $alu
  creating $alu model for $flatten\u_conv2d.$verific$LessThan_472$conv2d.v:691$2908 ($le): new $alu
  creating $alu model for $flatten\u_conv2d.$verific$LessThan_924$conv2d.v:1033$4199 ($lt): new $alu
  creating $alu cell for $flatten\u_conv2d.$verific$LessThan_924$conv2d.v:1033$4199: $auto$alumacc.cc:485:replace_alu$6740
  creating $alu cell for $flatten\u_conv2d.$verific$LessThan_472$conv2d.v:691$2908: $auto$alumacc.cc:485:replace_alu$6751
  creating $alu cell for $flatten\u_conv2d.$verific$LessThan_471$conv2d.v:690$2907: $auto$alumacc.cc:485:replace_alu$6760
  creating $alu cell for $flatten\u_conv2d.$verific$add_1018$conv2d.v:1119$4253: $auto$alumacc.cc:485:replace_alu$6771
  creating $alu cell for $flatten\u_conv2d.$verific$add_1063$conv2d.v:1153$4272: $auto$alumacc.cc:485:replace_alu$6774
  creating $alu cell for $flatten\u_conv2d.$verific$add_1066$conv2d.v:1156$4274: $auto$alumacc.cc:485:replace_alu$6777
  creating $alu cell for $flatten\u_conv2d.$verific$add_1091$conv2d.v:1181$4290: $auto$alumacc.cc:485:replace_alu$6780
  creating $alu cell for $flatten\u_conv2d.$verific$add_1110$conv2d.v:1199$4296: $auto$alumacc.cc:485:replace_alu$6783
  creating $alu cell for $flatten\u_conv2d.$verific$add_190$conv2d.v:409$2729: $auto$alumacc.cc:485:replace_alu$6786
  creating $alu cell for $flatten\u_conv2d.$verific$add_202$conv2d.v:418$2738: $auto$alumacc.cc:485:replace_alu$6789
  creating $alu cell for $flatten\u_conv2d.$verific$add_291$conv2d.v:540$2788: $auto$alumacc.cc:485:replace_alu$6792
  creating $alu cell for $flatten\u_conv2d.$verific$add_354$conv2d.v:606$2823: $auto$alumacc.cc:485:replace_alu$6795
  creating $alu cell for $flatten\u_conv2d.$verific$add_381$conv2d.v:630$2837: $auto$alumacc.cc:485:replace_alu$6798
  creating $alu cell for $flatten\u_conv2d.$verific$add_387$conv2d.v:638$2841: $auto$alumacc.cc:485:replace_alu$6801
  creating $alu cell for $flatten\u_conv2d.$verific$add_436$conv2d.v:669$2879: $auto$alumacc.cc:485:replace_alu$6804
  creating $alu cell for $flatten\u_conv2d.$verific$add_454$conv2d.v:681$2891: $auto$alumacc.cc:485:replace_alu$6807
  creating $alu cell for $flatten\u_conv2d.$verific$add_460$conv2d.v:685$2897: $auto$alumacc.cc:485:replace_alu$6810
  creating $alu cell for $flatten\u_conv2d.$verific$add_466$conv2d.v:688$2903: $auto$alumacc.cc:485:replace_alu$6813
  creating $alu cell for $flatten\u_conv2d.$verific$add_468$conv2d.v:689$2905: $auto$alumacc.cc:485:replace_alu$6816
  creating $alu cell for $flatten\u_conv2d.$verific$add_724$conv2d.v:842$3045: $auto$alumacc.cc:485:replace_alu$6819
  creating $alu cell for $flatten\u_conv2d.$verific$add_750$conv2d.v:867$3056: $auto$alumacc.cc:485:replace_alu$6822
  creating $alu cell for $flatten\u_conv2d.$verific$add_753$conv2d.v:869$3058: $auto$alumacc.cc:485:replace_alu$6825
  creating $alu cell for $flatten\u_conv2d.$verific$add_764$conv2d.v:874$3064: $auto$alumacc.cc:485:replace_alu$6828
  creating $alu cell for $flatten\u_conv2d.$verific$add_903$conv2d.v:1018$4179: $auto$alumacc.cc:485:replace_alu$6831
  creating $alu cell for $flatten\u_conv2d.$verific$add_905$conv2d.v:1019$4181: $auto$alumacc.cc:485:replace_alu$6834
  creating $alu cell for $flatten\u_conv2d.$verific$add_907$conv2d.v:1020$4183: $auto$alumacc.cc:485:replace_alu$6837
  creating $alu cell for $flatten\u_conv2d.$verific$add_909$conv2d.v:1021$4185: $auto$alumacc.cc:485:replace_alu$6840
  creating $alu cell for $flatten\u_conv2d.$verific$add_911$conv2d.v:1022$4187: $auto$alumacc.cc:485:replace_alu$6843
  creating $alu cell for $flatten\u_conv2d.$verific$add_913$conv2d.v:1023$4189: $auto$alumacc.cc:485:replace_alu$6846
  creating $alu cell for $flatten\u_conv2d.$verific$add_915$conv2d.v:1024$4191: $auto$alumacc.cc:485:replace_alu$6849
  creating $alu cell for $flatten\u_conv2d.$verific$add_917$conv2d.v:1025$4193: $auto$alumacc.cc:485:replace_alu$6852
  creating $alu cell for $flatten\u_conv2d.$verific$add_929$conv2d.v:1041$4203: $auto$alumacc.cc:485:replace_alu$6855
  creating $alu cell for $flatten\u_conv2d.$verific$sub_439$conv2d.v:672$2881: $auto$alumacc.cc:485:replace_alu$6858
  creating $alu cell for $flatten\u_conv2d.$verific$sub_464$conv2d.v:687$2900: $auto$alumacc.cc:485:replace_alu$6861
  creating $alu cell for $flatten\u_conv2d.$verific$sub_697$conv2d.v:804$3033: $auto$alumacc.cc:485:replace_alu$6864
  creating $alu cell for $flatten\u_conv2d.$verific$sub_699$conv2d.v:805$3035: $auto$alumacc.cc:485:replace_alu$6867
  creating $alu cell for $flatten\u_conv2d.$verific$sub_701$conv2d.v:806$3037: $auto$alumacc.cc:485:replace_alu$6870
  creating $alu cell for $flatten\u_conv2d.$verific$sub_703$conv2d.v:807$3039: $auto$alumacc.cc:485:replace_alu$6873
  creating $alu cell for $flatten\u_conv2d.\k0.$verific$add_3$adder.v:8$4416: $auto$alumacc.cc:485:replace_alu$6876
  creating $alu cell for $flatten\u_conv2d.\k1.$verific$add_3$adder.v:8$4416: $auto$alumacc.cc:485:replace_alu$6879
  creating $alu cell for $flatten\u_conv2d.\k16_0.$verific$add_3$adder.v:8$4422: $auto$alumacc.cc:485:replace_alu$6882
  creating $alu cell for $flatten\u_conv2d.\k16_1.$verific$add_3$adder.v:8$4422: $auto$alumacc.cc:485:replace_alu$6885
  creating $alu cell for $flatten\u_conv2d.\k16_2.$verific$add_3$adder.v:8$4422: $auto$alumacc.cc:485:replace_alu$6888
  creating $alu cell for $flatten\u_conv2d.\k16_3.$verific$add_3$adder.v:8$4422: $auto$alumacc.cc:485:replace_alu$6891
  creating $alu cell for $flatten\u_conv2d.\k16_4.$verific$add_3$adder.v:8$4422: $auto$alumacc.cc:485:replace_alu$6894
  creating $alu cell for $flatten\u_conv2d.\k16_5.$verific$add_3$adder.v:8$4422: $auto$alumacc.cc:485:replace_alu$6897
  creating $alu cell for $flatten\u_conv2d.\k16_6.$verific$add_3$adder.v:8$4422: $auto$alumacc.cc:485:replace_alu$6900
  creating $alu cell for $flatten\u_conv2d.\k16_7.$verific$add_3$adder.v:8$4422: $auto$alumacc.cc:485:replace_alu$6903
  creating $alu cell for $flatten\u_conv2d.\k2.$verific$add_3$adder.v:8$4416: $auto$alumacc.cc:485:replace_alu$6906
  creating $alu cell for $flatten\u_conv2d.\k3.$verific$add_3$adder.v:8$4416: $auto$alumacc.cc:485:replace_alu$6909
  creating $alu cell for $flatten\u_conv2d.\k4.$verific$add_3$adder.v:8$4416: $auto$alumacc.cc:485:replace_alu$6912
  creating $alu cell for $flatten\u_conv2d.\k5.$verific$add_3$adder.v:8$4416: $auto$alumacc.cc:485:replace_alu$6915
  creating $alu cell for $flatten\u_conv2d.\k6.$verific$add_3$adder.v:8$4416: $auto$alumacc.cc:485:replace_alu$6918
  creating $alu cell for $flatten\u_conv2d.\k7.$verific$add_3$adder.v:8$4416: $auto$alumacc.cc:485:replace_alu$6921
  creating $alu cell for $flatten\u_conv2d.\pk1.$verific$add_3$adder.v:8$4428: $auto$alumacc.cc:485:replace_alu$6924
  creating $alu cell for $flatten\u_ctl.$verific$add_69$control.v:118$1593: $auto$alumacc.cc:485:replace_alu$6927
  creating $alu cell for $flatten\u_conv2d.\pk2.$verific$add_4$fadder.v:9$4436: $auto$alumacc.cc:485:replace_alu$6930
  creating $alu cell for $flatten\u_conv2d.\t2_1.$verific$add_3$adder.v:8$4410: $auto$alumacc.cc:485:replace_alu$6933
  creating $alu cell for $flatten\u_conv2d.\t2_2.$verific$add_3$adder.v:8$4410: $auto$alumacc.cc:485:replace_alu$6936
  creating $alu cell for $flatten\u_conv2d.\t2_3.$verific$add_3$adder.v:8$4410: $auto$alumacc.cc:485:replace_alu$6939
  creating $alu cell for $flatten\u_ctl.$verific$add_108$control.v:161$1611: $auto$alumacc.cc:485:replace_alu$6942
  created 61 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~21 debug messages>

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~57 debug messages>
Removed a total of 19 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~158 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$6601: { $auto$rtlil.cc:2393:Or$6556 $flatten\u_ctl.$verific$n1311$1424 $flatten\u_ctl.$verific$n1312$1425 $flatten\u_ctl.$verific$n1313$1426 $flatten\u_ctl.$verific$n1314$1427 $flatten\u_ctl.$verific$n1315$1428 $flatten\u_ctl.$verific$n1316$1429 $flatten\u_ctl.$verific$n1317$1430 $flatten\u_ctl.$verific$n1318$1431 $flatten\u_ctl.$verific$n2420$1441 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$6167: { \u_conv2d.fsm_conv2d [11:7] \u_conv2d.fsm_conv2d [5:2] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$6061: { \u_conv2d.fsm_conv2d [11] \u_conv2d.fsm_conv2d [9:7] \u_conv2d.fsm_conv2d [4:1] $flatten\u_conv2d.$verific$n11257$1925 }
    New input vector for $reduce_or cell $auto$pmuxtree.cc:37:or_generator$6139: { \u_conv2d.fsm_conv2d [11:7] \u_conv2d.fsm_conv2d [5:1] $flatten\u_conv2d.$verific$n11257$1925 }
  Optimizing cells in module \top.
Performed a total of 4 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~33 debug messages>
Removed a total of 11 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 1 unused cells and 34 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~164 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.20. Executing MEMORY pass.

yosys> opt_mem

3.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_share

3.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_collect

3.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> techmap

3.22. Executing TECHMAP pass (map to technology primitives).

3.22.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.22.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $logic_not.
Using template $paramod$ee3d784672cdb1cb32d9a801a3af776716f16b74\_90_alu for cells of type $alu.
Using template $paramod$d2fa05d38998afabc6d4f34471305d0af4b8b2df\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $aldffe.
Using template $paramod$e7805029c1165837427dbe14a2d7866b011821bd\_90_alu for cells of type $alu.
Using template $paramod$49641a5ace7a8dbedd31c417f5a1b54fcecf6c7d\_90_alu for cells of type $alu.
Using template $paramod$2af30114e9bd4ccb04dad757b3f0a8f6bf0615b0\_90_alu for cells of type $alu.
Using template $paramod$f28fc3f2e267d7716249e826e8c90c34ca9542c1\_90_alu for cells of type $alu.
Using template $paramod$0a77e3c00010cb33e399decd813a7380c6e25cba\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $bmux.
Using template $paramod$175e67c02b86e96b1288b9dc100122520d7240d8\_90_alu for cells of type $alu.
Using template $paramod$403c17aef119cccdd585ba431bb1c77ec6e3c700\_90_alu for cells of type $alu.
Using template $paramod$46d3f1a4a915912bab1067a0beb0fb376719baeb\_90_alu for cells of type $alu.
Using template $paramod$a1bc51c02ce12ac21eb18988e83292af48ed7d72\_90_alu for cells of type $alu.
Using template $paramod$79aa992f2eb7f354d4aaf651790713cf239111fa\_90_alu for cells of type $alu.
Using template $paramod$29d3d723e2c9a54df62a83d5064c4f03fe8f57c9\_90_alu for cells of type $alu.
Using template $paramod$1f812f0514ea3255703342654e053e2c502325cc\_90_alu for cells of type $alu.
Using template $paramod$d305a30c4cb819236c1200875202f330c981285f\_90_alu for cells of type $alu.
Using template $paramod$f30f8fc2e30bd83d28cb1ad43b9d9ec083109075\_90_alu for cells of type $alu.
Using template $paramod$ea402187f386206c0840504755479bf827f47707\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $aldff.
Using template $paramod$754650b284649a026620fc6856e5b6886cbfe794\_90_alu for cells of type $alu.
Using template $paramod$32efbfac1c4dc57230cf86180788fdfd12e3b511\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using template $paramod$b2626aff51a34e60b9c57dceb41667aaf5650a38\_90_alu for cells of type $alu.
Using template $paramod$c703ee6d780d90e162c7eed92bfd050bee00636f\_90_alu for cells of type $alu.
Using template $paramod$2f5fb04daf2da94d981bf9455fa4454c6ec8b705\_90_alu for cells of type $alu.
Using template $paramod$53700bbee849b2010ad0b60a61ccd204a10e24ca\_90_alu for cells of type $alu.
Using template $paramod$c59fff10bfbf6a909195f2d154211eac024f754f\_90_alu for cells of type $alu.
Using template $paramod$e6b2d1d39ccd3e56f9ee66bced1b5381ffd5e84a\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001100 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010100 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000111 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001011 for cells of type $lcu.
No more expansions possible.
<suppressed ~7896 debug messages>

yosys> opt

3.23. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.23.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~8503 debug messages>

yosys> opt_merge -nomux

3.23.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~4284 debug messages>
Removed a total of 1428 cells.

yosys> opt_muxtree

3.23.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.23.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.23.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$22540 ($_DFFE_PN1P_) from module top (D = $auto$rtlil.cc:2459:Mux$5936 [1], Q = \u_conv2d.i_math_mode [1]).
Adding EN signal on $auto$ff.cc:262:slice$22539 ($_DFFE_PN0P_) from module top (D = $auto$rtlil.cc:2459:Mux$5936 [0], Q = \u_conv2d.i_math_mode [0]).
Adding EN signal on $auto$ff.cc:262:slice$16176 ($_DFFE_PN0P_) from module top (D = $auto$rtlil.cc:2459:Mux$6254 [0], Q = \u_conv2d.filter_stride [0]).
Adding EN signal on $auto$ff.cc:262:slice$16177 ($_DFFE_PN0P_) from module top (D = $auto$rtlil.cc:2459:Mux$6254 [1], Q = \u_conv2d.filter_stride [1]).
Adding EN signal on $auto$ff.cc:262:slice$16178 ($_DFFE_PN0P_) from module top (D = $auto$rtlil.cc:2459:Mux$6254 [2], Q = \u_conv2d.filter_stride [2]).

yosys> opt_clean

3.23.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 1971 unused cells and 3948 unused wires.
<suppressed ~1972 debug messages>

yosys> opt_expr

3.23.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~36 debug messages>

3.23.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.23.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.23.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~81 debug messages>
Removed a total of 27 cells.

yosys> opt_dff

3.23.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$7464 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21943 [11], Q = \u_conv2d.bias_base_addr [11]).
Adding EN signal on $auto$ff.cc:262:slice$7463 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21943 [10], Q = \u_conv2d.bias_base_addr [10]).
Adding EN signal on $auto$ff.cc:262:slice$7462 ($_DFF_PN1_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21943 [9], Q = \u_conv2d.bias_base_addr [9]).
Adding EN signal on $auto$ff.cc:262:slice$7461 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21943 [8], Q = \u_conv2d.bias_base_addr [8]).
Adding EN signal on $auto$ff.cc:262:slice$7460 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21943 [7], Q = \u_conv2d.bias_base_addr [7]).
Adding EN signal on $auto$ff.cc:262:slice$7459 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21943 [6], Q = \u_conv2d.bias_base_addr [6]).
Adding EN signal on $auto$ff.cc:262:slice$7458 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21943 [5], Q = \u_conv2d.bias_base_addr [5]).
Adding EN signal on $auto$ff.cc:262:slice$15759 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17766 [12], Q = \u_conv2d.add_stride [12]).
Adding EN signal on $auto$ff.cc:262:slice$15758 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17766 [11], Q = \u_conv2d.add_stride [11]).
Adding EN signal on $auto$ff.cc:262:slice$15757 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17766 [10], Q = \u_conv2d.add_stride [10]).
Adding EN signal on $auto$ff.cc:262:slice$15756 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17766 [9], Q = \u_conv2d.add_stride [9]).
Adding EN signal on $auto$ff.cc:262:slice$15755 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17766 [8], Q = \u_conv2d.add_stride [8]).
Adding EN signal on $auto$ff.cc:262:slice$15754 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17766 [7], Q = \u_conv2d.add_stride [7]).
Adding EN signal on $auto$ff.cc:262:slice$15753 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17766 [6], Q = \u_conv2d.add_stride [6]).
Adding EN signal on $auto$ff.cc:262:slice$15752 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17766 [5], Q = \u_conv2d.add_stride [5]).
Adding EN signal on $auto$ff.cc:262:slice$15751 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17766 [4], Q = \u_conv2d.add_stride [4]).
Adding EN signal on $auto$ff.cc:262:slice$15750 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17766 [3], Q = \u_conv2d.add_stride [3]).
Adding EN signal on $auto$ff.cc:262:slice$15749 ($_DFF_PN1_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17766 [2], Q = \u_conv2d.add_stride [2]).
Adding EN signal on $auto$ff.cc:262:slice$15748 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17766 [1], Q = \u_conv2d.add_stride [1]).
Adding EN signal on $auto$ff.cc:262:slice$15747 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17766 [0], Q = \u_conv2d.add_stride [0]).
Adding EN signal on $auto$ff.cc:262:slice$15729 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21564 [3], Q = \u_conv2d.fsm_loadacc [3]).
Adding EN signal on $auto$ff.cc:262:slice$15728 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21564 [2], Q = \u_conv2d.fsm_loadacc [2]).
Adding EN signal on $auto$ff.cc:262:slice$15727 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21564 [1], Q = \u_conv2d.fsm_loadacc [1]).
Adding EN signal on $auto$ff.cc:262:slice$15726 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21564 [0], Q = \u_conv2d.fsm_loadacc [0]).
Adding EN signal on $auto$ff.cc:262:slice$15720 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [18], Q = \u_conv2d.bias0 [18]).
Adding EN signal on $auto$ff.cc:262:slice$15719 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [17], Q = \u_conv2d.bias0 [17]).
Adding EN signal on $auto$ff.cc:262:slice$15718 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [16], Q = \u_conv2d.bias0 [16]).
Adding EN signal on $auto$ff.cc:262:slice$15717 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [15], Q = \u_conv2d.bias0 [15]).
Adding EN signal on $auto$ff.cc:262:slice$15716 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [14], Q = \u_conv2d.bias0 [14]).
Adding EN signal on $auto$ff.cc:262:slice$15715 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [13], Q = \u_conv2d.bias0 [13]).
Adding EN signal on $auto$ff.cc:262:slice$15714 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [12], Q = \u_conv2d.bias0 [12]).
Adding EN signal on $auto$ff.cc:262:slice$15713 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [11], Q = \u_conv2d.bias0 [11]).
Adding EN signal on $auto$ff.cc:262:slice$15712 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [10], Q = \u_conv2d.bias0 [10]).
Adding EN signal on $auto$ff.cc:262:slice$15711 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [9], Q = \u_conv2d.bias0 [9]).
Adding EN signal on $auto$ff.cc:262:slice$15710 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [8], Q = \u_conv2d.bias0 [8]).
Adding EN signal on $auto$ff.cc:262:slice$15709 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [7], Q = \u_conv2d.bias0 [7]).
Adding EN signal on $auto$ff.cc:262:slice$15708 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [6], Q = \u_conv2d.bias0 [6]).
Adding EN signal on $auto$ff.cc:262:slice$15707 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [5], Q = \u_conv2d.bias0 [5]).
Adding EN signal on $auto$ff.cc:262:slice$15706 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [4], Q = \u_conv2d.bias0 [4]).
Adding EN signal on $auto$ff.cc:262:slice$15705 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [3], Q = \u_conv2d.bias0 [3]).
Adding EN signal on $auto$ff.cc:262:slice$15704 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [2], Q = \u_conv2d.bias0 [2]).
Adding EN signal on $auto$ff.cc:262:slice$15703 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [1], Q = \u_conv2d.bias0 [1]).
Adding EN signal on $auto$ff.cc:262:slice$15702 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21480 [0], Q = \u_conv2d.bias0 [0]).
Adding EN signal on $auto$ff.cc:262:slice$15696 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [18], Q = \u_conv2d.bias1 [18]).
Adding EN signal on $auto$ff.cc:262:slice$15695 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [17], Q = \u_conv2d.bias1 [17]).
Adding EN signal on $auto$ff.cc:262:slice$15694 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [16], Q = \u_conv2d.bias1 [16]).
Adding EN signal on $auto$ff.cc:262:slice$15693 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [15], Q = \u_conv2d.bias1 [15]).
Adding EN signal on $auto$ff.cc:262:slice$15692 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [14], Q = \u_conv2d.bias1 [14]).
Adding EN signal on $auto$ff.cc:262:slice$15691 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [13], Q = \u_conv2d.bias1 [13]).
Adding EN signal on $auto$ff.cc:262:slice$15690 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [12], Q = \u_conv2d.bias1 [12]).
Adding EN signal on $auto$ff.cc:262:slice$15689 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [11], Q = \u_conv2d.bias1 [11]).
Adding EN signal on $auto$ff.cc:262:slice$15688 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [10], Q = \u_conv2d.bias1 [10]).
Adding EN signal on $auto$ff.cc:262:slice$15687 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [9], Q = \u_conv2d.bias1 [9]).
Adding EN signal on $auto$ff.cc:262:slice$15686 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [8], Q = \u_conv2d.bias1 [8]).
Adding EN signal on $auto$ff.cc:262:slice$15685 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [7], Q = \u_conv2d.bias1 [7]).
Adding EN signal on $auto$ff.cc:262:slice$15684 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [6], Q = \u_conv2d.bias1 [6]).
Adding EN signal on $auto$ff.cc:262:slice$15683 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [5], Q = \u_conv2d.bias1 [5]).
Adding EN signal on $auto$ff.cc:262:slice$15682 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [4], Q = \u_conv2d.bias1 [4]).
Adding EN signal on $auto$ff.cc:262:slice$15681 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [3], Q = \u_conv2d.bias1 [3]).
Adding EN signal on $auto$ff.cc:262:slice$15680 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [2], Q = \u_conv2d.bias1 [2]).
Adding EN signal on $auto$ff.cc:262:slice$15679 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [1], Q = \u_conv2d.bias1 [1]).
Adding EN signal on $auto$ff.cc:262:slice$15678 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21116 [0], Q = \u_conv2d.bias1 [0]).
Adding EN signal on $auto$ff.cc:262:slice$15672 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [18], Q = \u_conv2d.bias2 [18]).
Adding EN signal on $auto$ff.cc:262:slice$15671 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [17], Q = \u_conv2d.bias2 [17]).
Adding EN signal on $auto$ff.cc:262:slice$15670 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [16], Q = \u_conv2d.bias2 [16]).
Adding EN signal on $auto$ff.cc:262:slice$15669 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [15], Q = \u_conv2d.bias2 [15]).
Adding EN signal on $auto$ff.cc:262:slice$15668 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [14], Q = \u_conv2d.bias2 [14]).
Adding EN signal on $auto$ff.cc:262:slice$15667 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [13], Q = \u_conv2d.bias2 [13]).
Adding EN signal on $auto$ff.cc:262:slice$15666 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [12], Q = \u_conv2d.bias2 [12]).
Adding EN signal on $auto$ff.cc:262:slice$15665 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [11], Q = \u_conv2d.bias2 [11]).
Adding EN signal on $auto$ff.cc:262:slice$15664 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [10], Q = \u_conv2d.bias2 [10]).
Adding EN signal on $auto$ff.cc:262:slice$15663 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [9], Q = \u_conv2d.bias2 [9]).
Adding EN signal on $auto$ff.cc:262:slice$15662 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [8], Q = \u_conv2d.bias2 [8]).
Adding EN signal on $auto$ff.cc:262:slice$15661 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [7], Q = \u_conv2d.bias2 [7]).
Adding EN signal on $auto$ff.cc:262:slice$15660 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [6], Q = \u_conv2d.bias2 [6]).
Adding EN signal on $auto$ff.cc:262:slice$15659 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [5], Q = \u_conv2d.bias2 [5]).
Adding EN signal on $auto$ff.cc:262:slice$15658 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [4], Q = \u_conv2d.bias2 [4]).
Adding EN signal on $auto$ff.cc:262:slice$15657 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [3], Q = \u_conv2d.bias2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$15656 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [2], Q = \u_conv2d.bias2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$15655 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [1], Q = \u_conv2d.bias2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$15654 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20752 [0], Q = \u_conv2d.bias2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$15648 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [18], Q = \u_conv2d.bias3 [18]).
Adding EN signal on $auto$ff.cc:262:slice$15647 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [17], Q = \u_conv2d.bias3 [17]).
Adding EN signal on $auto$ff.cc:262:slice$15646 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [16], Q = \u_conv2d.bias3 [16]).
Adding EN signal on $auto$ff.cc:262:slice$15645 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [15], Q = \u_conv2d.bias3 [15]).
Adding EN signal on $auto$ff.cc:262:slice$15644 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [14], Q = \u_conv2d.bias3 [14]).
Adding EN signal on $auto$ff.cc:262:slice$15643 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [13], Q = \u_conv2d.bias3 [13]).
Adding EN signal on $auto$ff.cc:262:slice$15642 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [12], Q = \u_conv2d.bias3 [12]).
Adding EN signal on $auto$ff.cc:262:slice$15641 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [11], Q = \u_conv2d.bias3 [11]).
Adding EN signal on $auto$ff.cc:262:slice$15640 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [10], Q = \u_conv2d.bias3 [10]).
Adding EN signal on $auto$ff.cc:262:slice$15639 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [9], Q = \u_conv2d.bias3 [9]).
Adding EN signal on $auto$ff.cc:262:slice$15638 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [8], Q = \u_conv2d.bias3 [8]).
Adding EN signal on $auto$ff.cc:262:slice$15637 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [7], Q = \u_conv2d.bias3 [7]).
Adding EN signal on $auto$ff.cc:262:slice$15636 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [6], Q = \u_conv2d.bias3 [6]).
Adding EN signal on $auto$ff.cc:262:slice$15635 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [5], Q = \u_conv2d.bias3 [5]).
Adding EN signal on $auto$ff.cc:262:slice$15634 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [4], Q = \u_conv2d.bias3 [4]).
Adding EN signal on $auto$ff.cc:262:slice$15633 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [3], Q = \u_conv2d.bias3 [3]).
Adding EN signal on $auto$ff.cc:262:slice$15632 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [2], Q = \u_conv2d.bias3 [2]).
Adding EN signal on $auto$ff.cc:262:slice$15631 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [1], Q = \u_conv2d.bias3 [1]).
Adding EN signal on $auto$ff.cc:262:slice$15630 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20388 [0], Q = \u_conv2d.bias3 [0]).
Adding EN signal on $auto$ff.cc:262:slice$15624 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [18], Q = \u_conv2d.bias4 [18]).
Adding EN signal on $auto$ff.cc:262:slice$15623 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [17], Q = \u_conv2d.bias4 [17]).
Adding EN signal on $auto$ff.cc:262:slice$15622 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [16], Q = \u_conv2d.bias4 [16]).
Adding EN signal on $auto$ff.cc:262:slice$15621 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [15], Q = \u_conv2d.bias4 [15]).
Adding EN signal on $auto$ff.cc:262:slice$15620 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [14], Q = \u_conv2d.bias4 [14]).
Adding EN signal on $auto$ff.cc:262:slice$15619 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [13], Q = \u_conv2d.bias4 [13]).
Adding EN signal on $auto$ff.cc:262:slice$15618 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [12], Q = \u_conv2d.bias4 [12]).
Adding EN signal on $auto$ff.cc:262:slice$15617 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [11], Q = \u_conv2d.bias4 [11]).
Adding EN signal on $auto$ff.cc:262:slice$15616 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [10], Q = \u_conv2d.bias4 [10]).
Adding EN signal on $auto$ff.cc:262:slice$15615 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [9], Q = \u_conv2d.bias4 [9]).
Adding EN signal on $auto$ff.cc:262:slice$15614 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [8], Q = \u_conv2d.bias4 [8]).
Adding EN signal on $auto$ff.cc:262:slice$15613 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [7], Q = \u_conv2d.bias4 [7]).
Adding EN signal on $auto$ff.cc:262:slice$15612 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [6], Q = \u_conv2d.bias4 [6]).
Adding EN signal on $auto$ff.cc:262:slice$15611 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [5], Q = \u_conv2d.bias4 [5]).
Adding EN signal on $auto$ff.cc:262:slice$15610 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [4], Q = \u_conv2d.bias4 [4]).
Adding EN signal on $auto$ff.cc:262:slice$15609 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [3], Q = \u_conv2d.bias4 [3]).
Adding EN signal on $auto$ff.cc:262:slice$15608 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [2], Q = \u_conv2d.bias4 [2]).
Adding EN signal on $auto$ff.cc:262:slice$15607 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [1], Q = \u_conv2d.bias4 [1]).
Adding EN signal on $auto$ff.cc:262:slice$15606 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$20024 [0], Q = \u_conv2d.bias4 [0]).
Adding EN signal on $auto$ff.cc:262:slice$15600 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [18], Q = \u_conv2d.bias5 [18]).
Adding EN signal on $auto$ff.cc:262:slice$15599 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [17], Q = \u_conv2d.bias5 [17]).
Adding EN signal on $auto$ff.cc:262:slice$15598 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [16], Q = \u_conv2d.bias5 [16]).
Adding EN signal on $auto$ff.cc:262:slice$15597 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [15], Q = \u_conv2d.bias5 [15]).
Adding EN signal on $auto$ff.cc:262:slice$15596 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [14], Q = \u_conv2d.bias5 [14]).
Adding EN signal on $auto$ff.cc:262:slice$15595 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [13], Q = \u_conv2d.bias5 [13]).
Adding EN signal on $auto$ff.cc:262:slice$15594 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [12], Q = \u_conv2d.bias5 [12]).
Adding EN signal on $auto$ff.cc:262:slice$15593 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [11], Q = \u_conv2d.bias5 [11]).
Adding EN signal on $auto$ff.cc:262:slice$15592 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [10], Q = \u_conv2d.bias5 [10]).
Adding EN signal on $auto$ff.cc:262:slice$15591 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [9], Q = \u_conv2d.bias5 [9]).
Adding EN signal on $auto$ff.cc:262:slice$15590 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [8], Q = \u_conv2d.bias5 [8]).
Adding EN signal on $auto$ff.cc:262:slice$15589 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [7], Q = \u_conv2d.bias5 [7]).
Adding EN signal on $auto$ff.cc:262:slice$15588 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [6], Q = \u_conv2d.bias5 [6]).
Adding EN signal on $auto$ff.cc:262:slice$15587 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [5], Q = \u_conv2d.bias5 [5]).
Adding EN signal on $auto$ff.cc:262:slice$15586 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [4], Q = \u_conv2d.bias5 [4]).
Adding EN signal on $auto$ff.cc:262:slice$15585 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [3], Q = \u_conv2d.bias5 [3]).
Adding EN signal on $auto$ff.cc:262:slice$15584 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [2], Q = \u_conv2d.bias5 [2]).
Adding EN signal on $auto$ff.cc:262:slice$15583 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [1], Q = \u_conv2d.bias5 [1]).
Adding EN signal on $auto$ff.cc:262:slice$15582 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19660 [0], Q = \u_conv2d.bias5 [0]).
Adding EN signal on $auto$ff.cc:262:slice$15576 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [18], Q = \u_conv2d.bias6 [18]).
Adding EN signal on $auto$ff.cc:262:slice$15575 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [17], Q = \u_conv2d.bias6 [17]).
Adding EN signal on $auto$ff.cc:262:slice$15574 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [16], Q = \u_conv2d.bias6 [16]).
Adding EN signal on $auto$ff.cc:262:slice$15573 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [15], Q = \u_conv2d.bias6 [15]).
Adding EN signal on $auto$ff.cc:262:slice$15572 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [14], Q = \u_conv2d.bias6 [14]).
Adding EN signal on $auto$ff.cc:262:slice$15571 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [13], Q = \u_conv2d.bias6 [13]).
Adding EN signal on $auto$ff.cc:262:slice$15570 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [12], Q = \u_conv2d.bias6 [12]).
Adding EN signal on $auto$ff.cc:262:slice$15569 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [11], Q = \u_conv2d.bias6 [11]).
Adding EN signal on $auto$ff.cc:262:slice$15568 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [10], Q = \u_conv2d.bias6 [10]).
Adding EN signal on $auto$ff.cc:262:slice$15567 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [9], Q = \u_conv2d.bias6 [9]).
Adding EN signal on $auto$ff.cc:262:slice$15566 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [8], Q = \u_conv2d.bias6 [8]).
Adding EN signal on $auto$ff.cc:262:slice$15565 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [7], Q = \u_conv2d.bias6 [7]).
Adding EN signal on $auto$ff.cc:262:slice$15564 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [6], Q = \u_conv2d.bias6 [6]).
Adding EN signal on $auto$ff.cc:262:slice$15563 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [5], Q = \u_conv2d.bias6 [5]).
Adding EN signal on $auto$ff.cc:262:slice$15562 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [4], Q = \u_conv2d.bias6 [4]).
Adding EN signal on $auto$ff.cc:262:slice$15561 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [3], Q = \u_conv2d.bias6 [3]).
Adding EN signal on $auto$ff.cc:262:slice$15560 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [2], Q = \u_conv2d.bias6 [2]).
Adding EN signal on $auto$ff.cc:262:slice$15559 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [1], Q = \u_conv2d.bias6 [1]).
Adding EN signal on $auto$ff.cc:262:slice$15558 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$19296 [0], Q = \u_conv2d.bias6 [0]).
Adding EN signal on $auto$ff.cc:262:slice$15552 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [42], Q = \u_conv2d.bias7 [18]).
Adding EN signal on $auto$ff.cc:262:slice$15551 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [41], Q = \u_conv2d.bias7 [17]).
Adding EN signal on $auto$ff.cc:262:slice$15550 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [40], Q = \u_conv2d.bias7 [16]).
Adding EN signal on $auto$ff.cc:262:slice$15549 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [39], Q = \u_conv2d.bias7 [15]).
Adding EN signal on $auto$ff.cc:262:slice$15548 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [38], Q = \u_conv2d.bias7 [14]).
Adding EN signal on $auto$ff.cc:262:slice$15547 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [37], Q = \u_conv2d.bias7 [13]).
Adding EN signal on $auto$ff.cc:262:slice$15546 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [36], Q = \u_conv2d.bias7 [12]).
Adding EN signal on $auto$ff.cc:262:slice$15545 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [35], Q = \u_conv2d.bias7 [11]).
Adding EN signal on $auto$ff.cc:262:slice$15544 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [34], Q = \u_conv2d.bias7 [10]).
Adding EN signal on $auto$ff.cc:262:slice$15543 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [33], Q = \u_conv2d.bias7 [9]).
Adding EN signal on $auto$ff.cc:262:slice$15542 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [32], Q = \u_conv2d.bias7 [8]).
Adding EN signal on $auto$ff.cc:262:slice$15541 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [31], Q = \u_conv2d.bias7 [7]).
Adding EN signal on $auto$ff.cc:262:slice$15540 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [30], Q = \u_conv2d.bias7 [6]).
Adding EN signal on $auto$ff.cc:262:slice$15539 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [29], Q = \u_conv2d.bias7 [5]).
Adding EN signal on $auto$ff.cc:262:slice$15538 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [28], Q = \u_conv2d.bias7 [4]).
Adding EN signal on $auto$ff.cc:262:slice$15537 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [27], Q = \u_conv2d.bias7 [3]).
Adding EN signal on $auto$ff.cc:262:slice$15536 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [26], Q = \u_conv2d.bias7 [2]).
Adding EN signal on $auto$ff.cc:262:slice$15535 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [25], Q = \u_conv2d.bias7 [1]).
Adding EN signal on $auto$ff.cc:262:slice$15534 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18883 [24], Q = \u_conv2d.bias7 [0]).
Adding EN signal on $auto$ff.cc:262:slice$15512 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [19], Q = \u_conv2d.result_base [19]).
Adding EN signal on $auto$ff.cc:262:slice$15511 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [18], Q = \u_conv2d.result_base [18]).
Adding EN signal on $auto$ff.cc:262:slice$15510 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [17], Q = \u_conv2d.result_base [17]).
Adding EN signal on $auto$ff.cc:262:slice$15509 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [16], Q = \u_conv2d.result_base [16]).
Adding EN signal on $auto$ff.cc:262:slice$15508 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [15], Q = \u_conv2d.result_base [15]).
Adding EN signal on $auto$ff.cc:262:slice$15507 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [14], Q = \u_conv2d.result_base [14]).
Adding EN signal on $auto$ff.cc:262:slice$15506 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [13], Q = \u_conv2d.result_base [13]).
Adding EN signal on $auto$ff.cc:262:slice$15505 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [12], Q = \u_conv2d.result_base [12]).
Adding EN signal on $auto$ff.cc:262:slice$15504 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [11], Q = \u_conv2d.result_base [11]).
Adding EN signal on $auto$ff.cc:262:slice$15503 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [10], Q = \u_conv2d.result_base [10]).
Adding EN signal on $auto$ff.cc:262:slice$15502 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [9], Q = \u_conv2d.result_base [9]).
Adding EN signal on $auto$ff.cc:262:slice$15501 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [8], Q = \u_conv2d.result_base [8]).
Adding EN signal on $auto$ff.cc:262:slice$15500 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [7], Q = \u_conv2d.result_base [7]).
Adding EN signal on $auto$ff.cc:262:slice$15499 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [6], Q = \u_conv2d.result_base [6]).
Adding EN signal on $auto$ff.cc:262:slice$15498 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [5], Q = \u_conv2d.result_base [5]).
Adding EN signal on $auto$ff.cc:262:slice$15497 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [4], Q = \u_conv2d.result_base [4]).
Adding EN signal on $auto$ff.cc:262:slice$15496 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [3], Q = \u_conv2d.result_base [3]).
Adding EN signal on $auto$ff.cc:262:slice$15495 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [2], Q = \u_conv2d.result_base [2]).
Adding EN signal on $auto$ff.cc:262:slice$15494 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [1], Q = \u_conv2d.result_base [1]).
Adding EN signal on $auto$ff.cc:262:slice$15493 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$18063 [0], Q = \u_conv2d.result_base [0]).
Adding EN signal on $auto$ff.cc:262:slice$15492 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [31], Q = \u_conv2d.i_tcdm2_wdata [31]).
Adding EN signal on $auto$ff.cc:262:slice$15491 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [30], Q = \u_conv2d.i_tcdm2_wdata [30]).
Adding EN signal on $auto$ff.cc:262:slice$15490 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [29], Q = \u_conv2d.i_tcdm2_wdata [29]).
Adding EN signal on $auto$ff.cc:262:slice$15489 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [28], Q = \u_conv2d.i_tcdm2_wdata [28]).
Adding EN signal on $auto$ff.cc:262:slice$15488 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [27], Q = \u_conv2d.i_tcdm2_wdata [27]).
Adding EN signal on $auto$ff.cc:262:slice$15487 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [26], Q = \u_conv2d.i_tcdm2_wdata [26]).
Adding EN signal on $auto$ff.cc:262:slice$15486 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [25], Q = \u_conv2d.i_tcdm2_wdata [25]).
Adding EN signal on $auto$ff.cc:262:slice$15485 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [24], Q = \u_conv2d.i_tcdm2_wdata [24]).
Adding EN signal on $auto$ff.cc:262:slice$15484 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [23], Q = \u_conv2d.i_tcdm2_wdata [23]).
Adding EN signal on $auto$ff.cc:262:slice$15483 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [22], Q = \u_conv2d.i_tcdm2_wdata [22]).
Adding EN signal on $auto$ff.cc:262:slice$15482 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [21], Q = \u_conv2d.i_tcdm2_wdata [21]).
Adding EN signal on $auto$ff.cc:262:slice$15481 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [20], Q = \u_conv2d.i_tcdm2_wdata [20]).
Adding EN signal on $auto$ff.cc:262:slice$15480 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [19], Q = \u_conv2d.i_tcdm2_wdata [19]).
Adding EN signal on $auto$ff.cc:262:slice$15479 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [18], Q = \u_conv2d.i_tcdm2_wdata [18]).
Adding EN signal on $auto$ff.cc:262:slice$15478 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [17], Q = \u_conv2d.i_tcdm2_wdata [17]).
Adding EN signal on $auto$ff.cc:262:slice$15477 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [16], Q = \u_conv2d.i_tcdm2_wdata [16]).
Adding EN signal on $auto$ff.cc:262:slice$15476 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [15], Q = \u_conv2d.i_tcdm2_wdata [15]).
Adding EN signal on $auto$ff.cc:262:slice$15475 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [14], Q = \u_conv2d.i_tcdm2_wdata [14]).
Adding EN signal on $auto$ff.cc:262:slice$15474 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [13], Q = \u_conv2d.i_tcdm2_wdata [13]).
Adding EN signal on $auto$ff.cc:262:slice$15473 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [12], Q = \u_conv2d.i_tcdm2_wdata [12]).
Adding EN signal on $auto$ff.cc:262:slice$15472 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [11], Q = \u_conv2d.i_tcdm2_wdata [11]).
Adding EN signal on $auto$ff.cc:262:slice$15471 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [10], Q = \u_conv2d.i_tcdm2_wdata [10]).
Adding EN signal on $auto$ff.cc:262:slice$15470 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [9], Q = \u_conv2d.i_tcdm2_wdata [9]).
Adding EN signal on $auto$ff.cc:262:slice$15469 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [8], Q = \u_conv2d.i_tcdm2_wdata [8]).
Adding EN signal on $auto$ff.cc:262:slice$15468 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [7], Q = \u_conv2d.i_tcdm2_wdata [7]).
Adding EN signal on $auto$ff.cc:262:slice$15467 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [6], Q = \u_conv2d.i_tcdm2_wdata [6]).
Adding EN signal on $auto$ff.cc:262:slice$15466 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [5], Q = \u_conv2d.i_tcdm2_wdata [5]).
Adding EN signal on $auto$ff.cc:262:slice$15465 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [4], Q = \u_conv2d.i_tcdm2_wdata [4]).
Adding EN signal on $auto$ff.cc:262:slice$15464 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [3], Q = \u_conv2d.i_tcdm2_wdata [3]).
Adding EN signal on $auto$ff.cc:262:slice$15463 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [2], Q = \u_conv2d.i_tcdm2_wdata [2]).
Adding EN signal on $auto$ff.cc:262:slice$15462 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [1], Q = \u_conv2d.i_tcdm2_wdata [1]).
Adding EN signal on $auto$ff.cc:262:slice$15461 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$16916 [0], Q = \u_conv2d.i_tcdm2_wdata [0]).
Adding EN signal on $auto$ff.cc:262:slice$15460 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [7], Q = \u_conv2d.wdata2 [31]).
Adding EN signal on $auto$ff.cc:262:slice$15459 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [6], Q = \u_conv2d.wdata2 [30]).
Adding EN signal on $auto$ff.cc:262:slice$15458 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [5], Q = \u_conv2d.wdata2 [29]).
Adding EN signal on $auto$ff.cc:262:slice$15457 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [4], Q = \u_conv2d.wdata2 [28]).
Adding EN signal on $auto$ff.cc:262:slice$15456 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [3], Q = \u_conv2d.wdata2 [27]).
Adding EN signal on $auto$ff.cc:262:slice$15455 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [2], Q = \u_conv2d.wdata2 [26]).
Adding EN signal on $auto$ff.cc:262:slice$15454 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [1], Q = \u_conv2d.wdata2 [25]).
Adding EN signal on $auto$ff.cc:262:slice$15453 ($_DFF_PN0_) from module top (D = \u_conv2d.sat04 [0], Q = \u_conv2d.wdata2 [24]).
Adding EN signal on $auto$ff.cc:262:slice$15452 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [7], Q = \u_conv2d.wdata2 [23]).
Adding EN signal on $auto$ff.cc:262:slice$15451 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [6], Q = \u_conv2d.wdata2 [22]).
Adding EN signal on $auto$ff.cc:262:slice$15450 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [5], Q = \u_conv2d.wdata2 [21]).
Adding EN signal on $auto$ff.cc:262:slice$15449 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [4], Q = \u_conv2d.wdata2 [20]).
Adding EN signal on $auto$ff.cc:262:slice$15448 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [3], Q = \u_conv2d.wdata2 [19]).
Adding EN signal on $auto$ff.cc:262:slice$15447 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [2], Q = \u_conv2d.wdata2 [18]).
Adding EN signal on $auto$ff.cc:262:slice$15446 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [1], Q = \u_conv2d.wdata2 [17]).
Adding EN signal on $auto$ff.cc:262:slice$15445 ($_DFF_PN0_) from module top (D = \u_conv2d.sat15 [0], Q = \u_conv2d.wdata2 [16]).
Adding EN signal on $auto$ff.cc:262:slice$15444 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [7], Q = \u_conv2d.wdata2 [15]).
Adding EN signal on $auto$ff.cc:262:slice$15443 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [6], Q = \u_conv2d.wdata2 [14]).
Adding EN signal on $auto$ff.cc:262:slice$15442 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [5], Q = \u_conv2d.wdata2 [13]).
Adding EN signal on $auto$ff.cc:262:slice$15441 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [4], Q = \u_conv2d.wdata2 [12]).
Adding EN signal on $auto$ff.cc:262:slice$15440 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [3], Q = \u_conv2d.wdata2 [11]).
Adding EN signal on $auto$ff.cc:262:slice$15439 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [2], Q = \u_conv2d.wdata2 [10]).
Adding EN signal on $auto$ff.cc:262:slice$15438 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [1], Q = \u_conv2d.wdata2 [9]).
Adding EN signal on $auto$ff.cc:262:slice$15437 ($_DFF_PN0_) from module top (D = \u_conv2d.sat26 [0], Q = \u_conv2d.wdata2 [8]).
Adding EN signal on $auto$ff.cc:262:slice$15436 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [7], Q = \u_conv2d.wdata2 [7]).
Adding EN signal on $auto$ff.cc:262:slice$15435 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [6], Q = \u_conv2d.wdata2 [6]).
Adding EN signal on $auto$ff.cc:262:slice$15434 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [5], Q = \u_conv2d.wdata2 [5]).
Adding EN signal on $auto$ff.cc:262:slice$15433 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [4], Q = \u_conv2d.wdata2 [4]).
Adding EN signal on $auto$ff.cc:262:slice$15432 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [3], Q = \u_conv2d.wdata2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$15431 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [2], Q = \u_conv2d.wdata2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$15430 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [1], Q = \u_conv2d.wdata2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$15429 ($_DFF_PN0_) from module top (D = \u_conv2d.sat37 [0], Q = \u_conv2d.wdata2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$15405 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17028 [0], Q = \u_conv2d.i_tcdm2_wreq).
Adding EN signal on $auto$ff.cc:262:slice$15378 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21759 [11], Q = \u_conv2d.i_bias_raddr [11]).
Adding EN signal on $auto$ff.cc:262:slice$15377 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21759 [10], Q = \u_conv2d.i_bias_raddr [10]).
Adding EN signal on $auto$ff.cc:262:slice$15376 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21759 [9], Q = \u_conv2d.i_bias_raddr [9]).
Adding EN signal on $auto$ff.cc:262:slice$15375 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21759 [8], Q = \u_conv2d.i_bias_raddr [8]).
Adding EN signal on $auto$ff.cc:262:slice$15374 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21759 [7], Q = \u_conv2d.i_bias_raddr [7]).
Adding EN signal on $auto$ff.cc:262:slice$15373 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21759 [6], Q = \u_conv2d.i_bias_raddr [6]).
Adding EN signal on $auto$ff.cc:262:slice$15372 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21759 [5], Q = \u_conv2d.i_bias_raddr [5]).
Adding EN signal on $auto$ff.cc:262:slice$15371 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21759 [4], Q = \u_conv2d.i_bias_raddr [4]).
Adding EN signal on $auto$ff.cc:262:slice$15370 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21759 [3], Q = \u_conv2d.i_bias_raddr [3]).
Adding EN signal on $auto$ff.cc:262:slice$15369 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$21759 [2], Q = \u_conv2d.i_bias_raddr [2]).
Adding EN signal on $auto$ff.cc:262:slice$15352 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17576 [3], Q = \u_conv2d.fsm_writechannels [3]).
Adding EN signal on $auto$ff.cc:262:slice$15351 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17576 [2], Q = \u_conv2d.fsm_writechannels [2]).
Adding EN signal on $auto$ff.cc:262:slice$15350 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17576 [1], Q = \u_conv2d.fsm_writechannels [1]).
Adding EN signal on $auto$ff.cc:262:slice$15349 ($_DFF_PN0_) from module top (D = $auto$simplemap.cc:309:simplemap_bmux$17576 [0], Q = \u_conv2d.fsm_writechannels [0]).

yosys> opt_clean

3.23.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 180 unused cells and 2059 unused wires.
<suppressed ~181 debug messages>

yosys> opt_expr

3.23.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~6158 debug messages>

3.23.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.23.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.23.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~28386 debug messages>
Removed a total of 9462 cells.

yosys> opt_dff

3.23.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.23.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 9124 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.23.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.23.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.23.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.23.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.23.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.23.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.23.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.23.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.23.30. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.24. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.24.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~3833 debug messages>

yosys> opt_merge

3.24.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~33 debug messages>
Removed a total of 11 cells.

yosys> opt_dff

3.24.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 253 unused wires.
<suppressed ~1 debug messages>

3.24.5. Finished fast OPT passes.

yosys> memory_map

3.25. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~218 debug messages>

yosys> opt_merge -nomux

3.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.26.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.26.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.26.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.26.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.26.7. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $auto$ff.cc:262:slice$15407 ($_ALDFFE_PNP_) from module top (D = \u_ctl.i_filter_base [1], Q = \u_conv2d.i_tcdm2_raddr [1], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$15406 ($_ALDFFE_PNP_) from module top (D = \u_ctl.i_filter_base [0], Q = \u_conv2d.i_tcdm2_raddr [0], rval = 1'0).

yosys> opt_clean

3.26.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 2 unused cells and 0 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr -full

3.26.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.26.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.26.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.26.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.26.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.26.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.26.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr -full

3.26.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.26.18. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.27. Executing ABC pass (technology mapping using ABC).

3.27.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 7351 gates and 8872 wires to a netlist network with 1519 inputs and 1541 outputs.

3.27.1.1. Executing ABC.
Running ABC command: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/result_23-03-2022T14-57-36/All_lut_synth_rs_ade.json/conv2d_no_ksa/abc_tmp.scr 
ABC:   #Luts =  2728  Max Lvl =   8  Avg Lvl =   2.75  [   1.84 sec. at Pass 0]
ABC:   #Luts =  2341  Max Lvl =  10  Avg Lvl =   2.82  [  35.54 sec. at Pass 1]
ABC:   #Luts =  2316  Max Lvl =  10  Avg Lvl =   2.86  [   8.15 sec. at Pass 2]
ABC:   #Luts =  2303  Max Lvl =  10  Avg Lvl =   2.82  [   7.77 sec. at Pass 3]
ABC:   #Luts =  2303  Max Lvl =  10  Avg Lvl =   2.82  [   5.43 sec. at Pass 4]
ABC:   #Luts =  2301  Max Lvl =  10  Avg Lvl =   2.77  [   9.20 sec. at Pass 5]
ABC:   #Luts =  2296  Max Lvl =  10  Avg Lvl =   2.69  [   9.50 sec. at Pass 6]
ABC:   #Luts =  2296  Max Lvl =  10  Avg Lvl =   2.69  [  14.47 sec. at Pass 7]
ABC:   #Luts =  2296  Max Lvl =  10  Avg Lvl =   2.69  [  11.79 sec. at Pass 8]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.27.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     2347
ABC RESULTS:        internal signals:     5812
ABC RESULTS:           input signals:     1519
ABC RESULTS:          output signals:     1541
Removing temp directory.

yosys> opt

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 4064 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.28.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.28.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.28.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.28.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.28.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.28.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.28.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.29. Printing statistics.

=== top ===

   Number of wires:               2428
   Number of wire bits:           7798
   Number of public wires:         463
   Number of public wire bits:    5833
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3650
     $_ALDFFE_PNP_                  60
     $_ALDFF_PN_                    20
     $_DFFE_PN0N_                   43
     $_DFFE_PN0P_                  879
     $_DFFE_PN1N_                    1
     $_DFFE_PN1P_                   26
     $_DFF_PN0_                    315
     $_DFF_PN1_                      5
     $lut                         2301


yosys> shregmap -minlen 8 -maxlen 20

3.30. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.31. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.32. Printing statistics.

=== top ===

   Number of wires:               2588
   Number of wire bits:           7958
   Number of public wires:         463
   Number of public wire bits:    5833
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3810
     $_DFFE_PN0N_                   43
     $_DFFE_PN0P_                  879
     $_DFFE_PN1N_                    1
     $_DFFE_PN1P_                   26
     $_DFFSRE_PNNP_                 60
     $_DFFSR_PNN_                   20
     $_DFF_PN0_                    315
     $_DFF_PN1_                      5
     $_ORNOT_                       80
     $_OR_                          80
     $lut                         2301


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.33. Executing TECHMAP pass (map to technology primitives).

3.33.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.33.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Successfully finished Verilog frontend.

3.33.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_DFFE_PN1P_ for cells of type $_DFFE_PN1P_.
Using template \$_DFFE_PN0N_ for cells of type $_DFFE_PN0N_.
Using template \$_DFFSRE_PNNP_ for cells of type $_DFFSRE_PNNP_.
Using template \$_DFF_PN1_ for cells of type $_DFF_PN1_.
Using template \$_DFFE_PN1N_ for cells of type $_DFFE_PN1N_.
Using template \$_DFFSR_PNN_ for cells of type $_DFFSR_PNN_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~3822 debug messages>

yosys> opt_expr -mux_undef

3.34. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~46260 debug messages>

yosys> simplemap

3.35. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.36. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~16980 debug messages>
Removed a total of 5660 cells.

yosys> opt_dff -nodffe -nosdff

3.38. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 11598 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~961 debug messages>

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 256 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.41. Executing ABC pass (technology mapping using ABC).

3.41.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 8852 gates and 10322 wires to a netlist network with 1468 inputs and 1654 outputs.

3.41.1.1. Executing ABC.
Running ABC command: /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/meri/Documents/workspace/clean/for_push/yosys_verific_rs/result_23-03-2022T14-57-36/All_lut_synth_rs_ade.json/conv2d_no_ksa/abc_tmp.scr 
ABC:   #Luts =  2504  Max Lvl =  10  Avg Lvl =   2.63  [   1.03 sec. at Pass 0]
ABC:   #Luts =  2479  Max Lvl =  11  Avg Lvl =   2.68  [  35.57 sec. at Pass 1]
ABC:   #Luts =  2464  Max Lvl =  10  Avg Lvl =   2.72  [   5.53 sec. at Pass 2]
ABC:   #Luts =  2464  Max Lvl =  10  Avg Lvl =   2.72  [  11.11 sec. at Pass 3]
ABC:   #Luts =  2462  Max Lvl =  10  Avg Lvl =   2.71  [   7.35 sec. at Pass 4]
ABC:   #Luts =  2460  Max Lvl =  10  Avg Lvl =   2.69  [  11.85 sec. at Pass 5]
ABC:   #Luts =  2457  Max Lvl =  10  Avg Lvl =   2.79  [  10.00 sec. at Pass 6]
ABC:   #Luts =  2457  Max Lvl =  10  Avg Lvl =   2.79  [  11.91 sec. at Pass 7]
ABC:   #Luts =  2452  Max Lvl =  10  Avg Lvl =   2.70  [   9.35 sec. at Pass 8]
ABC:   #Luts =  2450  Max Lvl =  10  Avg Lvl =   2.66  [  13.61 sec. at Pass 9]
ABC:   #Luts =  2449  Max Lvl =  10  Avg Lvl =   2.66  [  12.10 sec. at Pass 10]
ABC:   #Luts =  2448  Max Lvl =  10  Avg Lvl =   2.67  [  14.27 sec. at Pass 11]
ABC:   #Luts =  2446  Max Lvl =  10  Avg Lvl =   2.76  [  12.10 sec. at Pass 12]
ABC:   #Luts =  2442  Max Lvl =  10  Avg Lvl =   2.76  [  17.12 sec. at Pass 13]
ABC:   #Luts =  2442  Max Lvl =  10  Avg Lvl =   2.76  [  13.17 sec. at Pass 14]
ABC:   #Luts =  2442  Max Lvl =  10  Avg Lvl =   2.76  [  18.16 sec. at Pass 15]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.41.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     2447
ABC RESULTS:        internal signals:     7200
ABC RESULTS:           input signals:     1468
ABC RESULTS:          output signals:     1654
Removing temp directory.

yosys> opt

3.42. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.42.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.42.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.42.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.42.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.42.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 8374 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.42.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.42.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.42.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.42.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.42.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.42.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.42.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.42.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.42.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.43. Executing HIERARCHY pass (managing design hierarchy).

3.43.1. Analyzing design hierarchy..
Top module:  \top

3.43.2. Analyzing design hierarchy..
Top module:  \top
Removed 0 unused modules.

yosys> stat

3.44. Printing statistics.

=== top ===

   Number of wires:               2574
   Number of wire bits:           7944
   Number of public wires:         463
   Number of public wire bits:    5833
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3796
     $lut                         2447
     dffsre                       1349


yosys> opt_clean -purge

3.45. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 255 unused wires.
<suppressed ~255 debug messages>

yosys> write_verilog -noattr -nohex top.verilog

3.46. Executing Verilog backend.

yosys> bmuxmap

3.46.1. Executing BMUXMAP pass.

yosys> demuxmap

3.46.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\top'.

Warnings: 75 unique messages, 75 total
End of script. Logfile hash: ec7dca0a64, CPU: user 63.52s system 0.42s, MEM: 152.16 MB peak
Yosys 0.14+36 (git sha1 4cd3e3b51, gcc 7.1.0 -fPIC -Os)
Time spent: 96% 2x abc (1517 sec), 1% 62x opt_expr (19 sec), ...
real 442.53
user 1456.06
sys 124.48
