
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.34
 Yosys 0.16+65 (git sha1 7987105a9, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl twofish.vhd

yosys> verific -vhdl twofish.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/home/users/aram/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'twofish.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_1164' from file '/home/users/aram/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_1164.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/home/users/aram/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.textio' from file '/home/users/aram/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/textio.vdb'
VERIFIC-INFO [VHDL-1012] twofish.vhd:44: analyzing entity 'q0'
VERIFIC-INFO [VHDL-1010] twofish.vhd:51: analyzing architecture 'q0_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:199: analyzing entity 'q1'
VERIFIC-INFO [VHDL-1010] twofish.vhd:207: analyzing architecture 'q1_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:355: analyzing entity 'mul_ef'
VERIFIC-INFO [VHDL-1010] twofish.vhd:363: analyzing architecture 'mul_ef_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:391: analyzing entity 'mul_5b'
VERIFIC-INFO [VHDL-1010] twofish.vhd:398: analyzing architecture 'mul_5b_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:423: analyzing entity 'mds'
VERIFIC-INFO [VHDL-1010] twofish.vhd:438: analyzing architecture 'mds_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:544: analyzing entity 'adder'
VERIFIC-INFO [VHDL-1010] twofish.vhd:554: analyzing architecture 'adder_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:576: analyzing entity 'pht'
VERIFIC-INFO [VHDL-1010] twofish.vhd:587: analyzing architecture 'pht_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:681: analyzing entity 'mul01'
VERIFIC-INFO [VHDL-1010] twofish.vhd:688: analyzing architecture 'mul01_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:707: analyzing entity 'mula4'
VERIFIC-INFO [VHDL-1010] twofish.vhd:714: analyzing architecture 'mula4_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:740: analyzing entity 'mul55'
VERIFIC-INFO [VHDL-1010] twofish.vhd:747: analyzing architecture 'mul55_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:773: analyzing entity 'mul87'
VERIFIC-INFO [VHDL-1010] twofish.vhd:780: analyzing architecture 'mul87_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:806: analyzing entity 'mul5a'
VERIFIC-INFO [VHDL-1010] twofish.vhd:813: analyzing architecture 'mul5a_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:839: analyzing entity 'mul58'
VERIFIC-INFO [VHDL-1010] twofish.vhd:846: analyzing architecture 'mul58_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:872: analyzing entity 'muldb'
VERIFIC-INFO [VHDL-1010] twofish.vhd:879: analyzing architecture 'muldb_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:905: analyzing entity 'mul9e'
VERIFIC-INFO [VHDL-1010] twofish.vhd:912: analyzing architecture 'mul9e_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:938: analyzing entity 'mul56'
VERIFIC-INFO [VHDL-1010] twofish.vhd:945: analyzing architecture 'mul56_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:971: analyzing entity 'mul82'
VERIFIC-INFO [VHDL-1010] twofish.vhd:978: analyzing architecture 'mul82_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1004: analyzing entity 'mulf3'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1011: analyzing architecture 'mulf3_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1038: analyzing entity 'mul1e'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1045: analyzing architecture 'mul1e_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1070: analyzing entity 'mulc6'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1077: analyzing architecture 'mulc6_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1103: analyzing entity 'mul68'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1111: analyzing architecture 'mul68_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1137: analyzing entity 'mule5'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1145: analyzing architecture 'mule5_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1171: analyzing entity 'mul02'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1179: analyzing architecture 'mul02_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1205: analyzing entity 'mula1'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1212: analyzing architecture 'mula1_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1238: analyzing entity 'mulfc'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1246: analyzing architecture 'mulfc_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1272: analyzing entity 'mulc1'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1280: analyzing architecture 'mulc1_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1306: analyzing entity 'mul47'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1313: analyzing architecture 'mul47_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1339: analyzing entity 'mulae'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1346: analyzing architecture 'mulae_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1372: analyzing entity 'mul3d'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1379: analyzing architecture 'mul3d_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1405: analyzing entity 'mul19'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1412: analyzing architecture 'mul19_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1438: analyzing entity 'mul03'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1445: analyzing architecture 'mul03_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1471: analyzing entity 'h_192'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1481: analyzing architecture 'h192_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1653: analyzing entity 'twofish_whit_keysched192'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1667: analyzing architecture 'twofish_whit_keysched192_arch'

yosys> synth_rs -top twofish_whit_keysched192 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.50

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top twofish_whit_keysched192

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] twofish.vhd:1653: processing 'twofish_whit_keysched192(twofish_whit_keysched192_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:1471: processing 'h_192(h192_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:199: processing 'q1(q1_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:44: processing 'q0(q0_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:423: processing 'mds(mds_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:355: processing 'mul_ef(mul_ef_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:391: processing 'mul_5b(mul_5b_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:576: processing 'pht(pht_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:544: processing 'adder(adder_arch)'
Importing module twofish_whit_keysched192.
Importing module h_192(h192_arch).
Importing module mds(mds_arch).
Importing module mul_5b(mul_5b_arch).
Importing module mul_ef(mul_ef_arch).
Importing module pht(pht_arch).
Importing module adder(adder_arch).
Importing module q0(q0_arch).
Importing module q1(q1_arch).

3.3.1. Analyzing design hierarchy..
Top module:  \twofish_whit_keysched192
Used module:     \pht(pht_arch)
Used module:         \adder(adder_arch)
Used module:     \h_192(h192_arch)
Used module:         \mds(mds_arch)
Used module:             \mul_5b(mul_5b_arch)
Used module:             \mul_ef(mul_ef_arch)
Used module:         \q0(q0_arch)
Used module:         \q1(q1_arch)

3.3.2. Analyzing design hierarchy..
Top module:  \twofish_whit_keysched192
Used module:     \pht(pht_arch)
Used module:         \adder(adder_arch)
Used module:     \h_192(h192_arch)
Used module:         \mds(mds_arch)
Used module:             \mul_5b(mul_5b_arch)
Used module:             \mul_ef(mul_ef_arch)
Used module:         \q0(q0_arch)
Used module:         \q1(q1_arch)
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module q1(q1_arch).
Optimizing module q0(q0_arch).
Optimizing module adder(adder_arch).
Optimizing module pht(pht_arch).
Optimizing module mul_ef(mul_ef_arch).
Optimizing module mul_5b(mul_5b_arch).
Optimizing module mds(mds_arch).
Optimizing module h_192(h192_arch).
Optimizing module twofish_whit_keysched192.
<suppressed ~8 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module q1(q1_arch).
Deleting now unused module q0(q0_arch).
Deleting now unused module adder(adder_arch).
Deleting now unused module pht(pht_arch).
Deleting now unused module mul_ef(mul_ef_arch).
Deleting now unused module mul_5b(mul_5b_arch).
Deleting now unused module mds(mds_arch).
Deleting now unused module h_192(h192_arch).
<suppressed ~101 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.
<suppressed ~288 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..
Removed 32 unused cells and 3759 unused wires.
<suppressed ~2440 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module twofish_whit_keysched192...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.
<suppressed ~24 debug messages>

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
<suppressed ~360 debug messages>
Removed a total of 120 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 32 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
<suppressed ~21 debug messages>
Removed a total of 7 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..
Removed 0 unused cells and 55 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.
<suppressed ~41 debug messages>

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 32 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..
Removed 0 unused cells and 12 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.11.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.11.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.11.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> opt_expr

3.11.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.11.23. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.13.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 32) from port A of cell twofish_whit_keysched192.$flatten\lower_h4.$verific$xor_3$twofish.vhd:1550$118 ($xor).
Removed top 1 bits (of 32) from port A of cell twofish_whit_keysched192.$flatten\lower_h1.$verific$xor_3$twofish.vhd:1550$118 ($xor).
Removed top 5 bits (of 32) from port A of cell twofish_whit_keysched192.$flatten\upper_h3.$verific$xor_3$twofish.vhd:1550$118 ($xor).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module twofish_whit_keysched192:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== twofish_whit_keysched192 ===

   Number of wires:               5443
   Number of wire bits:          20648
   Number of public wires:        3771
   Number of public wire bits:   17728
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3064
     $and                          488
     $bmux                         384
     $or                           240
     $xor                         1952


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.21.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> memory_share

3.21.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> memory_collect

3.21.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== twofish_whit_keysched192 ===

   Number of wires:               5443
   Number of wire bits:          20648
   Number of public wires:        3771
   Number of public wire bits:   17728
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3064
     $and                          488
     $bmux                         384
     $or                           240
     $xor                         1952


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> stat

3.24. Printing statistics.

=== twofish_whit_keysched192 ===

   Number of wires:               5443
   Number of wire bits:          20648
   Number of public wires:        3771
   Number of public wire bits:   17728
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3064
     $and                          488
     $bmux                         384
     $or                           240
     $xor                         1952


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $bmux.
No more expansions possible.
<suppressed ~3135 debug messages>

yosys> stat

3.26. Printing statistics.

=== twofish_whit_keysched192 ===

   Number of wires:               6979
   Number of wire bits:          43688
   Number of public wires:        3771
   Number of public wire bits:   17728
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              29536
     $_AND_                        488
     $_MUX_                      23040
     $_OR_                         240
     $_XOR_                       5768


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.
<suppressed ~11824 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
<suppressed ~13254 debug messages>
Removed a total of 4418 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..
Removed 0 unused cells and 566 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.
<suppressed ~332 debug messages>

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.27.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.27.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> opt_expr

3.27.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.27.23. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.
<suppressed ~1098 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.30.10. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt -sat

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.32.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  13114 cells in clk={ }, en={ }, arst={ }, srst={ }

3.33.2. Extracting gate netlist of module `\twofish_whit_keysched192' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 13114 gates and 13308 wires to a netlist network with 192 inputs and 256 outputs.

3.33.2.1. Executing ABC.

yosys> abc -dff

3.34. Executing ABC pass (technology mapping using ABC).

3.34.1. Summary of detected clock domains:
  12246 cells in clk={ }, en={ }, arst={ }, srst={ }

3.34.2. Extracting gate netlist of module `\twofish_whit_keysched192' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 12246 gates and 12438 wires to a netlist network with 192 inputs and 256 outputs.

3.34.2.1. Executing ABC.

yosys> abc -dff

3.35. Executing ABC pass (technology mapping using ABC).

3.35.1. Summary of detected clock domains:
  12363 cells in clk={ }, en={ }, arst={ }, srst={ }

3.35.2. Extracting gate netlist of module `\twofish_whit_keysched192' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 12363 gates and 12555 wires to a netlist network with 192 inputs and 256 outputs.

3.35.2.1. Executing ABC.

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  12399 cells in clk={ }, en={ }, arst={ }, srst={ }

3.36.2. Extracting gate netlist of module `\twofish_whit_keysched192' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 12399 gates and 12591 wires to a netlist network with 192 inputs and 256 outputs.

3.36.2.1. Executing ABC.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.
<suppressed ~11 debug messages>

yosys> opt_merge -nomux

3.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..
Removed 1 unused cells and 42717 unused wires.
<suppressed ~1890 debug messages>

yosys> opt_expr

3.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> opt_expr

3.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.38.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_se8S6c/abc_tmp_1.scr

3.39. Executing ABC pass (technology mapping using ABC).

3.39.1. Extracting gate netlist of module `\twofish_whit_keysched192' to `<abc-temp-dir>/input.blif'..
Extracted 12376 gates and 12568 wires to a netlist network with 192 inputs and 256 outputs.

3.39.1.1. Executing ABC.
DE:   #PIs = 192  #Luts =  3911  Max Lvl =  50  Avg Lvl =  34.89  [   0.62 sec. at Pass 0]
DE:   #PIs = 192  #Luts =  3676  Max Lvl =  38  Avg Lvl =  28.27  [ 131.24 sec. at Pass 1]
DE:   #PIs = 192  #Luts =  3295  Max Lvl =  39  Avg Lvl =  28.11  [   9.43 sec. at Pass 2]
DE:   #PIs = 192  #Luts =  3289  Max Lvl =  42  Avg Lvl =  28.69  [ 111.61 sec. at Pass 3]
DE:   #PIs = 192  #Luts =  3220  Max Lvl =  40  Avg Lvl =  27.62  [  10.15 sec. at Pass 4]
DE:   #PIs = 192  #Luts =  3220  Max Lvl =  40  Avg Lvl =  27.62  [ 150.48 sec. at Pass 5]
DE:   #PIs = 192  #Luts =  3218  Max Lvl =  41  Avg Lvl =  29.01  [  17.94 sec. at Pass 6]
DE:   #PIs = 192  #Luts =  3218  Max Lvl =  41  Avg Lvl =  29.01  [ 131.15 sec. at Pass 7]
DE:   #PIs = 192  #Luts =  3218  Max Lvl =  41  Avg Lvl =  29.01  [  15.01 sec. at Pass 8]
DE:   #PIs = 192  #Luts =  3218  Max Lvl =  41  Avg Lvl =  29.01  [ 179.18 sec. at Pass 9]
DE:   #PIs = 192  #Luts =  3218  Max Lvl =  41  Avg Lvl =  29.01  [   2.78 sec. at Pass 10]

yosys> opt

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..
Removed 0 unused cells and 12568 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.42. Printing statistics.

=== twofish_whit_keysched192 ===

   Number of wires:               4845
   Number of wire bits:          11210
   Number of public wires:        1883
   Number of public wire bits:    8248
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3218
     $lut                         3218


yosys> shregmap -minlen 8 -maxlen 20

3.43. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.45. Printing statistics.

=== twofish_whit_keysched192 ===

   Number of wires:               4845
   Number of wire bits:          11210
   Number of public wires:        1883
   Number of public wire bits:    8248
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3218
     $lut                         3218


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.46. Executing TECHMAP pass (map to technology primitives).

3.46.1. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.46.2. Executing Verilog-2005 frontend: /home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.46.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~3354 debug messages>

yosys> opt_expr -mux_undef

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.
<suppressed ~47381 debug messages>

yosys> simplemap

3.48. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

yosys> opt_merge

3.50. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
<suppressed ~85056 debug messages>
Removed a total of 28352 cells.

yosys> opt_dff -nodffe -nosdff

3.51. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..
Removed 0 unused cells and 6286 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.53. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.53.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.
<suppressed ~657 debug messages>

yosys> opt_merge -nomux

3.53.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
<suppressed ~114 debug messages>
Removed a total of 38 cells.

yosys> opt_muxtree

3.53.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.53.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..
Removed 0 unused cells and 99 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.53.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.53.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.53.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.53.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> opt_expr

3.53.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.53.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_se8S6c/abc_tmp_2.scr

3.54. Executing ABC pass (technology mapping using ABC).

3.54.1. Extracting gate netlist of module `\twofish_whit_keysched192' to `<abc-temp-dir>/input.blif'..
Extracted 23162 gates and 23356 wires to a netlist network with 192 inputs and 256 outputs.

3.54.1.1. Executing ABC.
DE:   #PIs = 192  #Luts =  3507  Max Lvl =  42  Avg Lvl =  29.11  [   2.09 sec. at Pass 0]
DE:   #PIs = 192  #Luts =  3507  Max Lvl =  42  Avg Lvl =  29.11  [ 207.38 sec. at Pass 1]
DE:   #PIs = 192  #Luts =  3226  Max Lvl =  42  Avg Lvl =  29.16  [  11.97 sec. at Pass 2]
DE:   #PIs = 192  #Luts =  3226  Max Lvl =  42  Avg Lvl =  29.16  [ 107.83 sec. at Pass 3]
DE:   #PIs = 192  #Luts =  3213  Max Lvl =  41  Avg Lvl =  27.79  [  10.60 sec. at Pass 4]
DE:   #PIs = 192  #Luts =  3213  Max Lvl =  41  Avg Lvl =  27.79  [ 126.18 sec. at Pass 5]
DE:   #PIs = 192  #Luts =  3213  Max Lvl =  41  Avg Lvl =  27.79  [  13.00 sec. at Pass 6]
DE:   #PIs = 192  #Luts =  3213  Max Lvl =  41  Avg Lvl =  27.79  [ 143.68 sec. at Pass 7]
DE:   #PIs = 192  #Luts =  3213  Max Lvl =  41  Avg Lvl =  27.79  [   1.27 sec. at Pass 8]

yosys> opt

3.55. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.55.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

yosys> opt_merge -nomux

3.55.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.55.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.55.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..
Removed 0 unused cells and 11703 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.55.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.55.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.55.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched192..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched192.
Performed a total of 0 changes.

yosys> opt_merge

3.55.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched192'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..

yosys> opt_expr

3.55.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched192.

3.55.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.56. Executing HIERARCHY pass (managing design hierarchy).

3.56.1. Analyzing design hierarchy..
Top module:  \twofish_whit_keysched192

3.56.2. Analyzing design hierarchy..
Top module:  \twofish_whit_keysched192
Removed 0 unused modules.

yosys> stat

3.57. Printing statistics.

=== twofish_whit_keysched192 ===

   Number of wires:               4840
   Number of wire bits:          11205
   Number of public wires:        1883
   Number of public wire bits:    8248
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3213
     $lut                         3213


yosys> opt_clean -purge

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched192..
Removed 0 unused cells and 1618 unused wires.
<suppressed ~1618 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.59. Executing Verilog backend.

yosys> bmuxmap

3.59.1. Executing BMUXMAP pass.

yosys> demuxmap

3.59.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\twofish_whit_keysched192'.

End of script. Logfile hash: 42032b3b18, CPU: user 63.29s system 0.85s, MEM: 202.89 MB peak
Yosys 0.16+65 (git sha1 7987105a9, gcc 9.1.0 -fPIC -Os)
Time spent: 99% 6x abc (9684 sec), 0% 33x opt_expr (27 sec), ...
real 1482.13
user 9547.96
sys 197.37
