
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.24
 Yosys 0.16+65 (git sha1 03bd62bb8, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl b04.vhd

yosys> verific -vhdl b04.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'b04.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_1164' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_1164.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.textio' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/textio.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_arith' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_arith.vdb'
VERIFIC-INFO [VHDL-1012] b04.vhd:5: analyzing entity 'b04'
VERIFIC-INFO [VHDL-1010] b04.vhd:16: analyzing architecture 'behav'

yosys> synth_rs -top b04 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v -carry no

3. Executing synth_rs pass: v0.4.47

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top b04

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] b04.vhd:5: processing 'b04(BEHAV)'
Importing module b04.

3.3.1. Analyzing design hierarchy..
Top module:  \b04

3.3.2. Analyzing design hierarchy..
Top module:  \b04
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.
<suppressed ~1 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.
<suppressed ~2 debug messages>

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..
Removed 0 unused cells and 27 unused wires.
<suppressed ~23 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module b04...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~4 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$stato_reg$b04.vhd:99$121 ($aldff) from module b04.
Changing const-value async load to async reset on $verific$RMIN_reg$b04.vhd:99$123 ($aldff) from module b04.
Changing const-value async load to async reset on $verific$RMAX_reg$b04.vhd:99$122 ($aldff) from module b04.
Changing const-value async load to async reset on $verific$RLAST_reg$b04.vhd:99$124 ($aldff) from module b04.
Changing const-value async load to async reset on $verific$REG4_reg$b04.vhd:99$128 ($aldff) from module b04.
Changing const-value async load to async reset on $verific$REG3_reg$b04.vhd:99$127 ($aldff) from module b04.
Changing const-value async load to async reset on $verific$REG2_reg$b04.vhd:99$126 ($aldff) from module b04.
Changing const-value async load to async reset on $verific$REG1_reg$b04.vhd:99$125 ($aldff) from module b04.
Changing const-value async load to async reset on $verific$DATA_OUT_reg$b04.vhd:99$129 ($aldff) from module b04.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~4 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~4 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.13.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 9) from port B of cell b04.$verific$LessThan_20$b04.vhd:67$77 ($le).
Removed top 1 bits (of 8) from port A of cell b04.$verific$unary_minus_22$b04.vhd:70$78 ($neg).
Removed top 1 bits (of 9) from port B of cell b04.$verific$LessThan_38$b04.vhd:79$91 ($le).
Removed top 1 bits (of 8) from port A of cell b04.$verific$unary_minus_40$b04.vhd:82$92 ($neg).
Removed top 1 bits (of 9) from FF cell b04.$verific$DATA_OUT_reg$b04.vhd:99$129 ($adff).
Removed top 1 bits (of 8) from wire b04.$verific$n112$22.
Removed top 1 bits (of 8) from wire b04.$verific$n218$33.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module b04:
  creating $macc model for $verific$add_14$b04.vhd:64$72 ($add).
  creating $macc model for $verific$add_25$b04.vhd:70$80 ($add).
  creating $macc model for $verific$add_32$b04.vhd:76$86 ($add).
  creating $macc model for $verific$add_43$b04.vhd:82$94 ($add).
  creating $macc model for $verific$unary_minus_22$b04.vhd:70$78 ($neg).
  creating $macc model for $verific$unary_minus_26$b04.vhd:70$83 ($neg).
  creating $macc model for $verific$unary_minus_40$b04.vhd:82$92 ($neg).
  creating $macc model for $verific$unary_minus_44$b04.vhd:82$97 ($neg).
  creating $alu model for $macc $verific$unary_minus_44$b04.vhd:82$97.
  creating $alu model for $macc $verific$unary_minus_40$b04.vhd:82$92.
  creating $alu model for $macc $verific$unary_minus_26$b04.vhd:70$83.
  creating $alu model for $macc $verific$unary_minus_22$b04.vhd:70$78.
  creating $alu model for $macc $verific$add_43$b04.vhd:82$94.
  creating $alu model for $macc $verific$add_32$b04.vhd:76$86.
  creating $alu model for $macc $verific$add_25$b04.vhd:70$80.
  creating $alu model for $macc $verific$add_14$b04.vhd:64$72.
  creating $alu model for $verific$LessThan_20$b04.vhd:67$77 ($le): new $alu
  creating $alu model for $verific$LessThan_38$b04.vhd:79$91 ($le): new $alu
  creating $alu model for $verific$LessThan_53$b04.vhd:88$104 ($lt): new $alu
  creating $alu model for $verific$LessThan_55$b04.vhd:90$105 ($lt): new $alu
  creating $alu cell for $verific$LessThan_55$b04.vhd:90$105: $auto$alumacc.cc:485:replace_alu$138
  creating $alu cell for $verific$LessThan_53$b04.vhd:88$104: $auto$alumacc.cc:485:replace_alu$149
  creating $alu cell for $verific$LessThan_38$b04.vhd:79$91: $auto$alumacc.cc:485:replace_alu$154
  creating $alu cell for $verific$LessThan_20$b04.vhd:67$77: $auto$alumacc.cc:485:replace_alu$167
  creating $alu cell for $verific$add_14$b04.vhd:64$72: $auto$alumacc.cc:485:replace_alu$180
  creating $alu cell for $verific$add_25$b04.vhd:70$80: $auto$alumacc.cc:485:replace_alu$183
  creating $alu cell for $verific$add_32$b04.vhd:76$86: $auto$alumacc.cc:485:replace_alu$186
  creating $alu cell for $verific$add_43$b04.vhd:82$94: $auto$alumacc.cc:485:replace_alu$189
  creating $alu cell for $verific$unary_minus_22$b04.vhd:70$78: $auto$alumacc.cc:485:replace_alu$192
  creating $alu cell for $verific$unary_minus_26$b04.vhd:70$83: $auto$alumacc.cc:485:replace_alu$195
  creating $alu cell for $verific$unary_minus_40$b04.vhd:82$92: $auto$alumacc.cc:485:replace_alu$198
  creating $alu cell for $verific$unary_minus_44$b04.vhd:82$97: $auto$alumacc.cc:485:replace_alu$201
  created 12 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.
<suppressed ~3 debug messages>

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~4 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..
Removed 2 unused cells and 6 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.19.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.19.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~4 debug messages>

yosys> opt_reduce

3.19.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.19.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> opt_expr

3.19.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.19.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== b04 ===

   Number of wires:                 94
   Number of wire bits:            561
   Number of public wires:          15
   Number of public wire bits:      79
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 58
     $adff                           9
     $alu                           12
     $and                            2
     $bmux                           9
     $mux                            9
     $not                            5
     $or                             3
     $reduce_and                     3
     $reduce_or                      2
     $xor                            4


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.21.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> memory_share

3.21.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> memory_collect

3.21.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== b04 ===

   Number of wires:                 94
   Number of wire bits:            561
   Number of public wires:          15
   Number of public wire bits:      79
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 58
     $adff                           9
     $alu                           12
     $and                            2
     $bmux                           9
     $mux                            9
     $not                            5
     $or                             3
     $reduce_and                     3
     $reduce_or                      2
     $xor                            4


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> stat

3.24. Printing statistics.

=== b04 ===

   Number of wires:                 94
   Number of wire bits:            561
   Number of public wires:          15
   Number of public wire bits:      79
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 58
     $adff                           9
     $alu                           12
     $and                            2
     $bmux                           9
     $mux                            9
     $not                            5
     $or                             3
     $reduce_and                     3
     $reduce_or                      2
     $xor                            4


yosys> techmap

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $reduce_and.
Using template $paramod$a1bc51c02ce12ac21eb18988e83292af48ed7d72\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $mux.
Using template $paramod$4ccbe221165818e15f326ddee3d1183c7924e12f\_90_alu for cells of type $alu.
Using template $paramod$c9d98d2d0793a6d8797b9c088dbedb26a7be7121\_90_alu for cells of type $alu.
Using template $paramod$103b4016182df467cceab67bcf3e18e6361ec0fd\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using template $paramod$fd7bfb1a4f3a7c2ac1a35670d0fa64ccc7b91841\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $and.
Using template $paramod$78464f9f65d57061f7490f3fe5dd257e4a61e2b7\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $adff.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001000 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000111 for cells of type $lcu.
No more expansions possible.
<suppressed ~1150 debug messages>

yosys> stat

3.26. Printing statistics.

=== b04 ===

   Number of wires:                655
   Number of wire bits:          15931
   Number of public wires:          15
   Number of public wire bits:      79
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1208
     $_AND_                        309
     $_DFF_PP0_                     66
     $_MUX_                        371
     $_NOT_                        103
     $_OR_                         147
     $_XOR_                        212


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.
<suppressed ~415 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
<suppressed ~168 debug messages>
Removed a total of 56 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..
Removed 86 unused cells and 492 unused wires.
<suppressed ~87 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$719 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$644 [8], Q = \DATA_OUT [7]).
Adding EN signal on $auto$ff.cc:262:slice$718 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$644 [6], Q = \DATA_OUT [6]).
Adding EN signal on $auto$ff.cc:262:slice$717 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$644 [5], Q = \DATA_OUT [5]).
Adding EN signal on $auto$ff.cc:262:slice$716 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$644 [4], Q = \DATA_OUT [4]).
Adding EN signal on $auto$ff.cc:262:slice$715 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$644 [3], Q = \DATA_OUT [3]).
Adding EN signal on $auto$ff.cc:262:slice$714 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$644 [2], Q = \DATA_OUT [2]).
Adding EN signal on $auto$ff.cc:262:slice$713 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$644 [1], Q = \DATA_OUT [1]).
Adding EN signal on $auto$ff.cc:262:slice$712 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$644 [0], Q = \DATA_OUT [0]).
Adding EN signal on $auto$ff.cc:262:slice$711 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$590 [7], Q = \REG4 [7]).
Adding EN signal on $auto$ff.cc:262:slice$710 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$590 [6], Q = \REG4 [6]).
Adding EN signal on $auto$ff.cc:262:slice$709 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$590 [5], Q = \REG4 [5]).
Adding EN signal on $auto$ff.cc:262:slice$708 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$590 [4], Q = \REG4 [4]).
Adding EN signal on $auto$ff.cc:262:slice$707 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$590 [3], Q = \REG4 [3]).
Adding EN signal on $auto$ff.cc:262:slice$706 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$590 [2], Q = \REG4 [2]).
Adding EN signal on $auto$ff.cc:262:slice$705 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$590 [1], Q = \REG4 [1]).
Adding EN signal on $auto$ff.cc:262:slice$704 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$590 [0], Q = \REG4 [0]).
Adding EN signal on $auto$ff.cc:262:slice$703 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$564 [7], Q = \REG3 [7]).
Adding EN signal on $auto$ff.cc:262:slice$702 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$564 [6], Q = \REG3 [6]).
Adding EN signal on $auto$ff.cc:262:slice$701 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$564 [5], Q = \REG3 [5]).
Adding EN signal on $auto$ff.cc:262:slice$700 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$564 [4], Q = \REG3 [4]).
Adding EN signal on $auto$ff.cc:262:slice$699 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$564 [3], Q = \REG3 [3]).
Adding EN signal on $auto$ff.cc:262:slice$698 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$564 [2], Q = \REG3 [2]).
Adding EN signal on $auto$ff.cc:262:slice$697 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$564 [1], Q = \REG3 [1]).
Adding EN signal on $auto$ff.cc:262:slice$696 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$564 [0], Q = \REG3 [0]).
Adding EN signal on $auto$ff.cc:262:slice$695 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$538 [7], Q = \REG2 [7]).
Adding EN signal on $auto$ff.cc:262:slice$694 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$538 [6], Q = \REG2 [6]).
Adding EN signal on $auto$ff.cc:262:slice$693 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$538 [5], Q = \REG2 [5]).
Adding EN signal on $auto$ff.cc:262:slice$692 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$538 [4], Q = \REG2 [4]).
Adding EN signal on $auto$ff.cc:262:slice$691 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$538 [3], Q = \REG2 [3]).
Adding EN signal on $auto$ff.cc:262:slice$690 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$538 [2], Q = \REG2 [2]).
Adding EN signal on $auto$ff.cc:262:slice$689 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$538 [1], Q = \REG2 [1]).
Adding EN signal on $auto$ff.cc:262:slice$688 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$538 [0], Q = \REG2 [0]).
Adding EN signal on $auto$ff.cc:262:slice$687 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$512 [7], Q = \REG1 [7]).
Adding EN signal on $auto$ff.cc:262:slice$686 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$512 [6], Q = \REG1 [6]).
Adding EN signal on $auto$ff.cc:262:slice$685 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$512 [5], Q = \REG1 [5]).
Adding EN signal on $auto$ff.cc:262:slice$684 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$512 [4], Q = \REG1 [4]).
Adding EN signal on $auto$ff.cc:262:slice$683 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$512 [3], Q = \REG1 [3]).
Adding EN signal on $auto$ff.cc:262:slice$682 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$512 [2], Q = \REG1 [2]).
Adding EN signal on $auto$ff.cc:262:slice$681 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$512 [1], Q = \REG1 [1]).
Adding EN signal on $auto$ff.cc:262:slice$680 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$512 [0], Q = \REG1 [0]).
Adding EN signal on $auto$ff.cc:262:slice$679 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$616 [7], Q = \RLAST [7]).
Adding EN signal on $auto$ff.cc:262:slice$678 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$616 [6], Q = \RLAST [6]).
Adding EN signal on $auto$ff.cc:262:slice$677 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$616 [5], Q = \RLAST [5]).
Adding EN signal on $auto$ff.cc:262:slice$676 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$616 [4], Q = \RLAST [4]).
Adding EN signal on $auto$ff.cc:262:slice$675 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$616 [3], Q = \RLAST [3]).
Adding EN signal on $auto$ff.cc:262:slice$674 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$616 [2], Q = \RLAST [2]).
Adding EN signal on $auto$ff.cc:262:slice$673 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$616 [1], Q = \RLAST [1]).
Adding EN signal on $auto$ff.cc:262:slice$672 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$616 [0], Q = \RLAST [0]).
Adding EN signal on $auto$ff.cc:262:slice$671 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$486 [7], Q = \RMIN [7]).
Adding EN signal on $auto$ff.cc:262:slice$670 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$486 [6], Q = \RMIN [6]).
Adding EN signal on $auto$ff.cc:262:slice$669 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$486 [5], Q = \RMIN [5]).
Adding EN signal on $auto$ff.cc:262:slice$668 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$486 [4], Q = \RMIN [4]).
Adding EN signal on $auto$ff.cc:262:slice$667 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$486 [3], Q = \RMIN [3]).
Adding EN signal on $auto$ff.cc:262:slice$666 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$486 [2], Q = \RMIN [2]).
Adding EN signal on $auto$ff.cc:262:slice$665 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$486 [1], Q = \RMIN [1]).
Adding EN signal on $auto$ff.cc:262:slice$664 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$486 [0], Q = \RMIN [0]).
Adding EN signal on $auto$ff.cc:262:slice$663 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$460 [7], Q = \RMAX [7]).
Adding EN signal on $auto$ff.cc:262:slice$662 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$460 [6], Q = \RMAX [6]).
Adding EN signal on $auto$ff.cc:262:slice$661 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$460 [5], Q = \RMAX [5]).
Adding EN signal on $auto$ff.cc:262:slice$660 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$460 [4], Q = \RMAX [4]).
Adding EN signal on $auto$ff.cc:262:slice$659 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$460 [3], Q = \RMAX [3]).
Adding EN signal on $auto$ff.cc:262:slice$658 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$460 [2], Q = \RMAX [2]).
Adding EN signal on $auto$ff.cc:262:slice$657 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$460 [1], Q = \RMAX [1]).
Adding EN signal on $auto$ff.cc:262:slice$656 ($_DFF_PP0_) from module b04 (D = $auto$simplemap.cc:309:simplemap_bmux$460 [0], Q = \RMAX [0]).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..
Removed 0 unused cells and 104 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.
<suppressed ~208 debug messages>

3.27.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.27.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
<suppressed ~705 debug messages>
Removed a total of 235 cells.

yosys> opt_dff

3.27.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..
Removed 0 unused cells and 261 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.27.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.27.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> opt_expr

3.27.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.27.30. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.
<suppressed ~115 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..
Removed 0 unused cells and 13 unused wires.
<suppressed ~1 debug messages>

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.
<suppressed ~49 debug messages>

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.30.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.31. Executing ABC pass (technology mapping using ABC).

3.31.1. Summary of detected clock domains:
  195 cells in clk=\CLOCK, en={ }, arst=\RESET, srst={ }
  42 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$2554, arst=\RESET, srst={ }
  83 cells in clk=\CLOCK, en=$auto$opt_dff.cc:219:make_patterns_logic$2232, arst=\RESET, srst={ }
  204 cells in clk=\CLOCK, en=$auto$opt_dff.cc:194:make_patterns_logic$1717, arst=\RESET, srst={ }

3.31.2. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, asynchronously reset by \RESET
Extracted 195 gates and 262 wires to a netlist network with 66 inputs and 50 outputs.

3.31.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               XOR cells:        4
ABC RESULTS:                OR cells:        8
ABC RESULTS:               MUX cells:        8
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              NAND cells:       17
ABC RESULTS:               AND cells:       51
ABC RESULTS:               NOT cells:        3
ABC RESULTS:        internal signals:      146
ABC RESULTS:           input signals:       66
ABC RESULTS:          output signals:       50
Removing temp directory.

3.31.3. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2554, asynchronously reset by \RESET
Extracted 42 gates and 68 wires to a netlist network with 26 inputs and 29 outputs.

3.31.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        8
ABC RESULTS:               NOT cells:        2
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               AND cells:       14
ABC RESULTS:               XOR cells:       13
ABC RESULTS:               BUF cells:        8
ABC RESULTS:        internal signals:       13
ABC RESULTS:           input signals:       26
ABC RESULTS:          output signals:       29
Removing temp directory.

3.31.4. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2232, asynchronously reset by \RESET
Extracted 83 gates and 109 wires to a netlist network with 26 inputs and 16 outputs.

3.31.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        8
ABC RESULTS:               NOT cells:        7
ABC RESULTS:               NOR cells:        1
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:             ORNOT cells:       12
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:              NAND cells:       13
ABC RESULTS:                OR cells:        9
ABC RESULTS:               AND cells:       22
ABC RESULTS:               BUF cells:       15
ABC RESULTS:        internal signals:       67
ABC RESULTS:           input signals:       26
ABC RESULTS:          output signals:       16
Removing temp directory.

3.31.5. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$2836$auto$opt_dff.cc:194:make_patterns_logic$1717, asynchronously reset by \RESET
Extracted 204 gates and 263 wires to a netlist network with 58 inputs and 48 outputs.

3.31.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       48
ABC RESULTS:               XOR cells:       10
ABC RESULTS:              NAND cells:       15
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               MUX cells:       14
ABC RESULTS:               AND cells:        3
ABC RESULTS:               BUF cells:       80
ABC RESULTS:        internal signals:      157
ABC RESULTS:           input signals:       58
ABC RESULTS:          output signals:       48
Removing temp directory.

yosys> abc -dff

3.32. Executing ABC pass (technology mapping using ABC).

3.32.1. Summary of detected clock domains:
  60 cells in clk=\CLOCK, en=$abc$2981$auto$opt_dff.cc:219:make_patterns_logic$2232, arst=\RESET, srst={ }
  65 cells in clk=\CLOCK, en={ }, arst=\RESET, srst={ }
  55 cells in clk=\CLOCK, en=$abc$2934$auto$opt_dff.cc:219:make_patterns_logic$2554, arst=\RESET, srst={ }
  124 cells in clk=\CLOCK, en=$abc$2836$auto$opt_dff.cc:194:make_patterns_logic$1717, arst=\RESET, srst={ }

3.32.2. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$2981$auto$opt_dff.cc:219:make_patterns_logic$2232, asynchronously reset by \RESET
Extracted 60 gates and 75 wires to a netlist network with 15 inputs and 10 outputs.

3.32.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        8
ABC RESULTS:            ANDNOT cells:        2
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:             ORNOT cells:       12
ABC RESULTS:               NOR cells:        1
ABC RESULTS:              NAND cells:       12
ABC RESULTS:                OR cells:        1
ABC RESULTS:               AND cells:       17
ABC RESULTS:               XOR cells:        3
ABC RESULTS:               BUF cells:       11
ABC RESULTS:        internal signals:       50
ABC RESULTS:           input signals:       15
ABC RESULTS:          output signals:       10
Removing temp directory.

3.32.3. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, asynchronously reset by \RESET
Extracted 65 gates and 115 wires to a netlist network with 50 inputs and 47 outputs.

3.32.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:                OR cells:        5
ABC RESULTS:               MUX cells:        2
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:              NAND cells:        5
ABC RESULTS:               AND cells:       46
ABC RESULTS:               NOT cells:        3
ABC RESULTS:        internal signals:       18
ABC RESULTS:           input signals:       50
ABC RESULTS:          output signals:       47
Removing temp directory.

3.32.4. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$2934$auto$opt_dff.cc:219:make_patterns_logic$2554, asynchronously reset by \RESET
Extracted 55 gates and 68 wires to a netlist network with 13 inputs and 12 outputs.

3.32.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        8
ABC RESULTS:              NAND cells:        8
ABC RESULTS:             ORNOT cells:       16
ABC RESULTS:               AND cells:       10
ABC RESULTS:               XOR cells:        3
ABC RESULTS:               BUF cells:       12
ABC RESULTS:        internal signals:       43
ABC RESULTS:           input signals:       13
ABC RESULTS:          output signals:       12
Removing temp directory.

3.32.5. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$2836$auto$opt_dff.cc:194:make_patterns_logic$1717, asynchronously reset by \RESET
Extracted 124 gates and 188 wires to a netlist network with 64 inputs and 44 outputs.

3.32.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       48
ABC RESULTS:               NOT cells:        1
ABC RESULTS:             ORNOT cells:        6
ABC RESULTS:              XNOR cells:        1
ABC RESULTS:               MUX cells:       10
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:                OR cells:        8
ABC RESULTS:               XOR cells:       13
ABC RESULTS:               AND cells:       12
ABC RESULTS:              NAND cells:       42
ABC RESULTS:               BUF cells:       74
ABC RESULTS:        internal signals:       80
ABC RESULTS:           input signals:       64
ABC RESULTS:          output signals:       44
Removing temp directory.

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  62 cells in clk=\CLOCK, en=$abc$3247$abc$2981$auto$opt_dff.cc:219:make_patterns_logic$2232, arst=\RESET, srst={ }
  41 cells in clk=\CLOCK, en=$abc$3384$abc$2934$auto$opt_dff.cc:219:make_patterns_logic$2554, arst=\RESET, srst={ }
  65 cells in clk=\CLOCK, en={ }, arst=\RESET, srst={ }
  143 cells in clk=\CLOCK, en=$abc$3442$abc$2836$auto$opt_dff.cc:194:make_patterns_logic$1717, arst=\RESET, srst={ }

3.33.2. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$3247$abc$2981$auto$opt_dff.cc:219:make_patterns_logic$2232, asynchronously reset by \RESET
Extracted 62 gates and 79 wires to a netlist network with 17 inputs and 12 outputs.

3.33.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        8
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:             ORNOT cells:       12
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:              NAND cells:       11
ABC RESULTS:                OR cells:        1
ABC RESULTS:               AND cells:       20
ABC RESULTS:               XOR cells:        5
ABC RESULTS:               BUF cells:        9
ABC RESULTS:        internal signals:       50
ABC RESULTS:           input signals:       17
ABC RESULTS:          output signals:       12
Removing temp directory.

3.33.3. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$3384$abc$2934$auto$opt_dff.cc:219:make_patterns_logic$2554, asynchronously reset by \RESET
Extracted 41 gates and 52 wires to a netlist network with 11 inputs and 10 outputs.

3.33.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        8
ABC RESULTS:              NAND cells:        8
ABC RESULTS:             ORNOT cells:       16
ABC RESULTS:               AND cells:        8
ABC RESULTS:               XOR cells:        1
ABC RESULTS:               BUF cells:       14
ABC RESULTS:        internal signals:       31
ABC RESULTS:           input signals:       11
ABC RESULTS:          output signals:       10
Removing temp directory.

3.33.4. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, asynchronously reset by \RESET
Extracted 65 gates and 115 wires to a netlist network with 50 inputs and 47 outputs.

3.33.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOR cells:        1
ABC RESULTS:               MUX cells:        2
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:                OR cells:        4
ABC RESULTS:              NAND cells:        5
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               AND cells:       46
ABC RESULTS:               NOT cells:        3
ABC RESULTS:        internal signals:       18
ABC RESULTS:           input signals:       50
ABC RESULTS:          output signals:       47
Removing temp directory.

3.33.5. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$3442$abc$2836$auto$opt_dff.cc:194:make_patterns_logic$1717, asynchronously reset by \RESET
Extracted 143 gates and 207 wires to a netlist network with 64 inputs and 44 outputs.

3.33.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       48
ABC RESULTS:             ORNOT cells:        6
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:               MUX cells:       10
ABC RESULTS:               XOR cells:        9
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:                OR cells:        9
ABC RESULTS:               AND cells:       14
ABC RESULTS:              NAND cells:       44
ABC RESULTS:               BUF cells:       75
ABC RESULTS:        internal signals:       99
ABC RESULTS:           input signals:       64
ABC RESULTS:          output signals:       44
Removing temp directory.

yosys> opt_ffinv

3.34. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.35. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.35.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.
<suppressed ~48 debug messages>

yosys> opt_merge -nomux

3.35.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.35.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.35.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.35.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.35.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.35.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..
Removed 0 unused cells and 1598 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.35.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.35.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.35.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.35.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.35.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.35.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.35.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> opt_expr

3.35.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.35.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  204 cells in clk=\CLOCK, en=!$abc$3787$li0_li0, arst=\RESET, srst={ }
  6 cells in clk=\CLOCK, en={ }, arst=\RESET, srst={ }
  51 cells in clk=\CLOCK, en=$abc$2934$auto$opt_dff.cc:219:make_patterns_logic$2554, arst=\RESET, srst={ }
  52 cells in clk=\CLOCK, en=$abc$2981$auto$opt_dff.cc:219:make_patterns_logic$2232, arst=\RESET, srst={ }

3.36.2. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by !$abc$3787$li0_li0, asynchronously reset by \RESET
Extracted 204 gates and 231 wires to a netlist network with 27 inputs and 9 outputs.

3.36.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       48
ABC RESULTS:               NOR cells:        3
ABC RESULTS:            ANDNOT cells:        4
ABC RESULTS:               XOR cells:       12
ABC RESULTS:             ORNOT cells:        7
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:              NAND cells:       51
ABC RESULTS:                OR cells:        9
ABC RESULTS:               MUX cells:        8
ABC RESULTS:               AND cells:       62
ABC RESULTS:               BUF cells:        8
ABC RESULTS:        internal signals:      195
ABC RESULTS:           input signals:       27
ABC RESULTS:          output signals:        9
Removing temp directory.

3.36.3. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, asynchronously reset by \RESET
Extracted 6 gates and 8 wires to a netlist network with 2 inputs and 6 outputs.

3.36.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:               AND cells:        1
ABC RESULTS:               BUF cells:        3
ABC RESULTS:               NOT cells:        3
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        2
ABC RESULTS:          output signals:        6
Removing temp directory.

3.36.4. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$2934$auto$opt_dff.cc:219:make_patterns_logic$2554, asynchronously reset by \RESET
Extracted 51 gates and 68 wires to a netlist network with 17 inputs and 14 outputs.

3.36.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        8
ABC RESULTS:              NAND cells:        8
ABC RESULTS:             ORNOT cells:       16
ABC RESULTS:               AND cells:       13
ABC RESULTS:               XOR cells:        6
ABC RESULTS:               BUF cells:        8
ABC RESULTS:        internal signals:       37
ABC RESULTS:           input signals:       17
ABC RESULTS:          output signals:       14
Removing temp directory.

3.36.5. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \CLOCK, enabled by $abc$2981$auto$opt_dff.cc:219:make_patterns_logic$2232, asynchronously reset by \RESET
Extracted 52 gates and 63 wires to a netlist network with 11 inputs and 8 outputs.

3.36.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.36.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        8
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:             ORNOT cells:       12
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:              NAND cells:       11
ABC RESULTS:                OR cells:        1
ABC RESULTS:               AND cells:       15
ABC RESULTS:               BUF cells:       15
ABC RESULTS:        internal signals:       44
ABC RESULTS:           input signals:       11
ABC RESULTS:          output signals:        8
Removing temp directory.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> abc -script /tmp/yosys_0QpY1B/abc_tmp_1.scr

3.38. Executing ABC pass (technology mapping using ABC).

3.38.1. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Extracted 250 gates and 319 wires to a netlist network with 69 inputs and 52 outputs.

3.38.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /tmp/yosys_0QpY1B/abc_tmp_1.scr 
ABC:   #PIs =  69  #Luts =    88  Max Lvl =   6  Avg Lvl =   1.50  [   0.05 sec. at Pass 0]
ABC:   #PIs =  69  #Luts =    76  Max Lvl =   5  Avg Lvl =   1.46  [   0.33 sec. at Pass 1]
ABC:   #PIs =  69  #Luts =    76  Max Lvl =   5  Avg Lvl =   1.46  [   0.11 sec. at Pass 2]
ABC:   #PIs =  69  #Luts =    76  Max Lvl =   5  Avg Lvl =   1.46  [   0.22 sec. at Pass 3]
ABC:   #PIs =  69  #Luts =    76  Max Lvl =   5  Avg Lvl =   1.46  [   0.15 sec. at Pass 4]
ABC:   #PIs =  69  #Luts =    76  Max Lvl =   5  Avg Lvl =   1.46  [   0.21 sec. at Pass 5]
ABC:   #PIs =  69  #Luts =    76  Max Lvl =   5  Avg Lvl =   1.46  [   1.13 sec. at Pass 6]
ABC:   #PIs =  69  #Luts =    76  Max Lvl =   5  Avg Lvl =   1.46  [   0.12 sec. at Pass 7]
ABC:   [DE total time =    2.55 sec. ]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.38.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:       76
ABC RESULTS:        internal signals:      198
ABC RESULTS:           input signals:       69
ABC RESULTS:          output signals:       52
Removing temp directory.

yosys> opt

3.39. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.39.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

yosys> opt_merge -nomux

3.39.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.39.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.39.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.39.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff

3.39.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..
Removed 0 unused cells and 693 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.39.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.39.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.39.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.39.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.39.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff

3.39.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> opt_expr

3.39.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.39.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.40. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 1 inverters.

yosys> stat

3.41. Printing statistics.

=== b04 ===

   Number of wires:                141
   Number of wire bits:            162
   Number of public wires:           8
   Number of public wire bits:      29
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                142
     $_DFFE_PP0N_                   48
     $_DFFE_PP0P_                   16
     $_DFF_PP0_                      1
     $_DFF_PP1_                      1
     $lut                           76


yosys> shregmap -minlen 8 -maxlen 20

3.42. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.43. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.44. Printing statistics.

=== b04 ===

   Number of wires:                141
   Number of wire bits:            162
   Number of public wires:           8
   Number of public wire bits:      29
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                142
     $_DFFE_PP0N_                   48
     $_DFFE_PP0P_                   16
     $_DFF_PP0_                      1
     $_DFF_PP1_                      1
     $lut                           76


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.45. Executing TECHMAP pass (map to technology primitives).

3.45.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.45.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.45.3. Continuing TECHMAP pass.
Using template \$_DFFE_PP0N_ for cells of type $_DFFE_PP0N_.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_PP1_ for cells of type $_DFF_PP1_.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~392 debug messages>

yosys> opt_expr -mux_undef

3.46. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.
<suppressed ~1071 debug messages>

yosys> simplemap

3.47. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

yosys> opt_merge

3.49. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
<suppressed ~1092 debug messages>
Removed a total of 364 cells.

yosys> opt_dff -nodffe -nosdff

3.50. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.51. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..
Removed 0 unused cells and 595 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.52. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.52.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.
<suppressed ~20 debug messages>

yosys> opt_merge -nomux

3.52.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.52.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.52.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.52.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.52.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.52.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.52.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.52.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.52.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.52.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.52.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> opt_expr

3.52.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.52.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_0QpY1B/abc_tmp_2.scr

3.53. Executing ABC pass (technology mapping using ABC).

3.53.1. Extracting gate netlist of module `\b04' to `<abc-temp-dir>/input.blif'..
Extracted 297 gates and 369 wires to a netlist network with 70 inputs and 53 outputs.

3.53.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /tmp/yosys_0QpY1B/abc_tmp_2.scr 
ABC:   #PIs =  70  #Luts =    77  Max Lvl =   6  Avg Lvl =   1.45  [   0.06 sec. at Pass 0]
ABC:   #PIs =  70  #Luts =    77  Max Lvl =   5  Avg Lvl =   1.36  [   0.35 sec. at Pass 1]
ABC:   #PIs =  70  #Luts =    77  Max Lvl =   5  Avg Lvl =   1.36  [   0.11 sec. at Pass 2]
ABC:   #PIs =  70  #Luts =    77  Max Lvl =   5  Avg Lvl =   1.36  [   0.19 sec. at Pass 3]
ABC:   #PIs =  70  #Luts =    77  Max Lvl =   5  Avg Lvl =   1.36  [   0.15 sec. at Pass 4]
ABC:   #PIs =  70  #Luts =    77  Max Lvl =   5  Avg Lvl =   1.36  [   0.22 sec. at Pass 5]
ABC:   #PIs =  70  #Luts =    77  Max Lvl =   5  Avg Lvl =   1.36  [   0.47 sec. at Pass 6]
ABC:   #PIs =  70  #Luts =    77  Max Lvl =   5  Avg Lvl =   1.36  [   0.12 sec. at Pass 7]
ABC:   [DE total time =    1.93 sec. ]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.53.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:       77
ABC RESULTS:        internal signals:      246
ABC RESULTS:           input signals:       70
ABC RESULTS:          output signals:       53
Removing temp directory.

yosys> opt

3.54. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.54.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

yosys> opt_merge -nomux

3.54.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.54.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.54.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff

3.54.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..
Removed 0 unused cells and 263 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.54.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.54.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.54.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \b04..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \b04.
Performed a total of 0 changes.

yosys> opt_merge

3.54.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\b04'.
Removed a total of 0 cells.

yosys> opt_dff

3.54.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> opt_expr

3.54.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module b04.

3.54.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.55. Executing HIERARCHY pass (managing design hierarchy).

3.55.1. Analyzing design hierarchy..
Top module:  \b04

3.55.2. Analyzing design hierarchy..
Top module:  \b04
Removed 0 unused modules.

yosys> stat

3.56. Printing statistics.

=== b04 ===

   Number of wires:                142
   Number of wire bits:            163
   Number of public wires:           8
   Number of public wire bits:      29
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                143
     $lut                           77
     dffsre                         66


yosys> opt_clean -purge

3.57. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \b04..

yosys> write_verilog -noattr -nohex synthesized.v

3.58. Executing Verilog backend.

yosys> bmuxmap

3.58.1. Executing BMUXMAP pass.

yosys> demuxmap

3.58.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\b04'.

End of script. Logfile hash: ef7e70d372, CPU: user 1.89s system 0.07s, MEM: 25.41 MB peak
Yosys 0.16+65 (git sha1 03bd62bb8, gcc 9.1.0 -fPIC -Os)
Time spent: 95% 6x abc (38 sec), 1% 38x opt_expr (0 sec), ...
real 11.92
user 34.70
sys 5.98
