
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.32
 Yosys 0.16+65 (git sha1 7987105a9, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k AddRoundKey.v KeyExpantion.v MixColumns.v RoundKeyGen.v SBox.v ShiftRows.v SubBytes.v wrapper_KeyExpantion.v

yosys> verific -vlog2k AddRoundKey.v KeyExpantion.v MixColumns.v RoundKeyGen.v SBox.v ShiftRows.v SubBytes.v wrapper_KeyExpantion.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Apr22_SW_Release, released at Thu Apr 28 20:08:21 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'AddRoundKey.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'KeyExpantion.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'MixColumns.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'RoundKeyGen.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'SBox.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'ShiftRows.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'SubBytes.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wrapper_KeyExpantion.v'

yosys> synth_rs -top wrapper_KeyExpantion -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.50

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top wrapper_KeyExpantion

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-WARNING [VERI-1229] wrapper_KeyExpantion.v:27: module instantiation should have an instance name
VERIFIC-WARNING [VERI-1229] wrapper_KeyExpantion.v:28: module instantiation should have an instance name
VERIFIC-INFO [VERI-1018] wrapper_KeyExpantion.v:5: compiling module 'wrapper_KeyExpantion'
VERIFIC-INFO [VERI-1018] KeyExpantion.v:16: compiling module 'KeyExpantion'
VERIFIC-INFO [VERI-1018] RoundKeyGen.v:16: compiling module 'RoundKeyGen'
VERIFIC-INFO [VERI-1018] SubBytes.v:14: compiling module 'SubBytes(DATA_W=32)'
VERIFIC-INFO [VERI-1018] SBox.v:15: compiling module 'SBox'
VERIFIC-INFO [VERI-1018] wrapper_KeyExpantion.v:32: compiling module 'mux_16x1'
VERIFIC-INFO [VERI-1018] wrapper_KeyExpantion.v:45: compiling module 'mux_8x1'
VERIFIC-INFO [VERI-1018] wrapper_KeyExpantion.v:63: compiling module 'mux_4x1'
VERIFIC-INFO [VERI-1018] wrapper_KeyExpantion.v:78: compiling module 'mux_2x1'
Importing module wrapper_KeyExpantion.
Importing module KeyExpantion.
Importing module RoundKeyGen.
Importing module SubBytes(DATA_W=32).
Importing module SBox.
Importing module mux_16x1.
Importing module mux_2x1.
Importing module mux_8x1.
Importing module mux_4x1.

3.3.1. Analyzing design hierarchy..
Top module:  \wrapper_KeyExpantion
Used module:     \mux_16x1
Used module:         \mux_2x1
Used module:         \mux_8x1
Used module:             \mux_4x1
Used module:     \KeyExpantion
Used module:         \RoundKeyGen
Used module:             \SubBytes(DATA_W=32)
Used module:                 \SBox

3.3.2. Analyzing design hierarchy..
Top module:  \wrapper_KeyExpantion
Used module:     \mux_16x1
Used module:         \mux_2x1
Used module:         \mux_8x1
Used module:             \mux_4x1
Used module:     \KeyExpantion
Used module:         \RoundKeyGen
Used module:             \SubBytes(DATA_W=32)
Used module:                 \SBox
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module mux_4x1.
Optimizing module mux_8x1.
Optimizing module mux_2x1.
Optimizing module mux_16x1.
Optimizing module SBox.
<suppressed ~3 debug messages>
Optimizing module SubBytes(DATA_W=32).
<suppressed ~1 debug messages>
Optimizing module RoundKeyGen.
<suppressed ~8 debug messages>
Optimizing module KeyExpantion.
<suppressed ~10 debug messages>
Optimizing module wrapper_KeyExpantion.

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module mux_4x1.
Deleting now unused module mux_8x1.
Deleting now unused module mux_2x1.
Deleting now unused module mux_16x1.
Deleting now unused module SBox.
Deleting now unused module SubBytes(DATA_W=32).
Deleting now unused module RoundKeyGen.
Deleting now unused module KeyExpantion.
<suppressed ~26 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 60 unused cells and 24442 unused wires.
<suppressed ~219 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module wrapper_KeyExpantion...
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.RKGEN_U0.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key [99]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [100]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [101]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [102]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [103]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [104]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [105]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [106]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [107]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [108]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [109]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [110]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [111]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [112]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [113]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [114]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [115]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [116]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [117]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [118]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [119]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [120]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [121]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [122]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [123]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [124]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [125]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [126]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [127]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [32]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [33]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [34]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [35]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [36]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [37]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [38]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [39]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [40]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [41]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [42]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [43]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [44]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [45]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [46]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [47]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [48]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [49]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [50]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [51]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [52]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [53]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [54]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [55]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [56]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [57]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [58]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [59]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [60]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [61]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [62]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [63]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [64]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [65]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [66]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [67]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [68]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [69]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [70]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [71]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [72]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [73]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [74]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [75]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [76]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [77]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [78]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [79]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [80]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [81]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [82]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [83]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [84]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [85]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [86]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [87]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [88]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [89]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [90]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [91]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [92]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [93]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [94]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [95]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [96]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [97]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [98]
Warning: found logic loop in module wrapper_KeyExpantion:
    cell $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor)
    wire \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key [99]
Found and reported 960 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~81 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
<suppressed ~21 debug messages>
Removed a total of 7 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.\SUB_U.$verific$valid_out_reg$SubBytes.v:42$5920 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$valid_round_key_reg$RoundKeyGen.v:88$5829 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$valid_out_reg$RoundKeyGen.v:99$5833 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$valid_FirstStage_reg$RoundKeyGen.v:55$5749 ($aldff) from module wrapper_KeyExpantion.
Changing const-value async load to async reset on $flatten\i4.\RKGEN_U0.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($aldff) from module wrapper_KeyExpantion.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~1 debug messages>

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~81 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~81 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[9].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[9].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[9].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[8].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[9].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[8].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[8].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[8].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[7].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[8].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[7].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[7].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[7].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[7].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[6].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[7].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[6].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[6].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[6].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[5].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[6].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[5].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[5].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[5].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[4].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[5].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[4].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[4].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[4].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[3].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[4].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[3].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[3].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[3].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[2].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[3].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[2].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[2].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[2].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[1].RKGEN_U.round_key, Q = \i4.ROUND_KEY_GEN[2].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[1].RKGEN_U.round_key_delayed, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.round_key).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[1].RKGEN_U.temp_round_key, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.round_key_delayed).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.ROUND_KEY_GEN[1].RKGEN_U.Key_FirstStage, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.Key_SecondStage).
Adding EN signal on $flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \i4.RKGEN_U0.round_key, Q = \i4.ROUND_KEY_GEN[1].RKGEN_U.Key_FirstStage).
Adding EN signal on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[3].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[3].ROM.$verific$n2320$6181, Q = \i4.RKGEN_U0.SUB_U.ROM[3].ROM.dout).
Adding EN signal on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[2].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[2].ROM.$verific$n2320$6181, Q = \i4.RKGEN_U0.SUB_U.ROM[2].ROM.dout).
Adding EN signal on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[1].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[1].ROM.$verific$n2320$6181, Q = \i4.RKGEN_U0.SUB_U.ROM[1].ROM.dout).
Adding EN signal on $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[0].ROM.$verific$dout_reg$SBox.v:306$6189 ($adff) from module wrapper_KeyExpantion (D = $flatten\i4.\RKGEN_U0.\SUB_U.\ROM[0].ROM.$verific$n2320$6181, Q = \i4.RKGEN_U0.SUB_U.ROM[0].ROM.dout).
Adding EN signal on $flatten\i4.\RKGEN_U0.$verific$round_key_reg$RoundKeyGen.v:99$5834 ($adff) from module wrapper_KeyExpantion (D = \i4.RKGEN_U0.round_key_delayed, Q = \i4.RKGEN_U0.round_key).
Adding EN signal on $flatten\i4.\RKGEN_U0.$verific$round_key_delayed_reg$RoundKeyGen.v:88$5828 ($adff) from module wrapper_KeyExpantion (D = \i4.RKGEN_U0.temp_round_key, Q = \i4.RKGEN_U0.round_key_delayed).
Adding EN signal on $flatten\i4.\RKGEN_U0.$verific$Key_SecondStage_reg$RoundKeyGen.v:64$5753 ($adff) from module wrapper_KeyExpantion (D = \i4.RKGEN_U0.Key_FirstStage, Q = \i4.RKGEN_U0.Key_SecondStage).
Adding EN signal on $flatten\i4.\RKGEN_U0.$verific$Key_FirstStage_reg$RoundKeyGen.v:55$5750 ($adff) from module wrapper_KeyExpantion (D = \cipher_key, Q = \i4.RKGEN_U0.Key_FirstStage).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 80 unused cells and 80 unused wires.
<suppressed ~81 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.13.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 6 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[1].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 7 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\RKGEN_U0.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 5 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[2].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 4 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[3].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 3 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[4].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 2 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[5].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 1 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[6].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 3 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[8].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).
Removed top 2 bits (of 128) from port B of cell wrapper_KeyExpantion.$flatten\i4.\ROUND_KEY_GEN[9].RKGEN_U.$verific$xor_51$RoundKeyGen.v:73$5824 ($xor).

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module wrapper_KeyExpantion:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== wrapper_KeyExpantion ===

   Number of wires:                641
   Number of wire bits:          24479
   Number of public wires:         591
   Number of public wire bits:   23839
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                187
     $adff                          40
     $adffe                         80
     $bmux                          40
     $mux                            7
     $xor                           20


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.21.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> memory_share

3.21.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> memory_collect

3.21.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== wrapper_KeyExpantion ===

   Number of wires:                641
   Number of wire bits:          24479
   Number of public wires:         591
   Number of public wire bits:   23839
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                187
     $adff                          40
     $adffe                         80
     $bmux                          40
     $mux                            7
     $xor                           20


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> stat

3.24. Printing statistics.

=== wrapper_KeyExpantion ===

   Number of wires:                641
   Number of wire bits:          24479
   Number of public wires:         591
   Number of public wire bits:   23839
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                187
     $adff                          40
     $adffe                         80
     $bmux                          40
     $mux                            7
     $xor                           20


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $mux.
No more expansions possible.
<suppressed ~258 debug messages>

yosys> stat

3.26. Printing statistics.

=== wrapper_KeyExpantion ===

   Number of wires:                961
   Number of wire bits:         106079
   Number of public wires:         591
   Number of public wire bits:   23839
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              89240
     $_DFFE_PN0P_                 5440
     $_DFF_PN0_                     40
     $_MUX_                      82160
     $_XOR_                       1600


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~38160 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
<suppressed ~81720 debug messages>
Removed a total of 27240 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 0 unused cells and 56 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~200 debug messages>

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.27.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~1000 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$12232 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$12039
        $auto$simplemap.cc:312:simplemap_bmux$12031

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$14288 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$14095
        $auto$simplemap.cc:312:simplemap_bmux$14087

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$16344 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$16151
        $auto$simplemap.cc:312:simplemap_bmux$16143

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$18520 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$18327
        $auto$simplemap.cc:312:simplemap_bmux$18319

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$21124 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$20931
        $auto$simplemap.cc:312:simplemap_bmux$20923

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$23180 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$22987
        $auto$simplemap.cc:312:simplemap_bmux$22979

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$25236 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$25043
        $auto$simplemap.cc:312:simplemap_bmux$25035

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$27412 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$27219
        $auto$simplemap.cc:312:simplemap_bmux$27211

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$30024 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$29831
        $auto$simplemap.cc:312:simplemap_bmux$29823

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$32080 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$31887
        $auto$simplemap.cc:312:simplemap_bmux$31879

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$34136 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$33943
        $auto$simplemap.cc:312:simplemap_bmux$33935

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$36312 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$36119
        $auto$simplemap.cc:312:simplemap_bmux$36111

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$38924 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$38731
        $auto$simplemap.cc:312:simplemap_bmux$38723

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$40980 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$40787
        $auto$simplemap.cc:312:simplemap_bmux$40779

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$43036 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$42843
        $auto$simplemap.cc:312:simplemap_bmux$42835

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$45212 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$45019
        $auto$simplemap.cc:312:simplemap_bmux$45011

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$47824 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$47631
        $auto$simplemap.cc:312:simplemap_bmux$47623

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$49880 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$49687
        $auto$simplemap.cc:312:simplemap_bmux$49679

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$51936 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$51743
        $auto$simplemap.cc:312:simplemap_bmux$51735

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$54112 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$53919
        $auto$simplemap.cc:312:simplemap_bmux$53911

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$56724 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$56531
        $auto$simplemap.cc:312:simplemap_bmux$56523

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$58780 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$58587
        $auto$simplemap.cc:312:simplemap_bmux$58579

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$60836 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$60643
        $auto$simplemap.cc:312:simplemap_bmux$60635

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$63012 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$62819
        $auto$simplemap.cc:312:simplemap_bmux$62811

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$65624 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$65431
        $auto$simplemap.cc:312:simplemap_bmux$65423

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$67680 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$67487
        $auto$simplemap.cc:312:simplemap_bmux$67479

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$69736 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$69543
        $auto$simplemap.cc:312:simplemap_bmux$69535

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$71912 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$71719
        $auto$simplemap.cc:312:simplemap_bmux$71711

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$74524 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$74331
        $auto$simplemap.cc:312:simplemap_bmux$74323

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$76580 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$76387
        $auto$simplemap.cc:312:simplemap_bmux$76379

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$78636 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$78443
        $auto$simplemap.cc:312:simplemap_bmux$78435

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$80812 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$80619
        $auto$simplemap.cc:312:simplemap_bmux$80611

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$83424 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$83231
        $auto$simplemap.cc:312:simplemap_bmux$83223

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$85480 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$85287
        $auto$simplemap.cc:312:simplemap_bmux$85279

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$87536 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$87343
        $auto$simplemap.cc:312:simplemap_bmux$87335

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$89712 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$89519
        $auto$simplemap.cc:312:simplemap_bmux$89511

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$92324 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$92131
        $auto$simplemap.cc:312:simplemap_bmux$92123

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$94380 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$94187
        $auto$simplemap.cc:312:simplemap_bmux$94179

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$96436 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$96243
        $auto$simplemap.cc:312:simplemap_bmux$96235

    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:312:simplemap_bmux$98612 in front of them:
        $auto$simplemap.cc:312:simplemap_bmux$98419
        $auto$simplemap.cc:312:simplemap_bmux$98411


yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~40 debug messages>

3.30.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~40 debug messages>

yosys> opt_reduce -full

3.30.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.30.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_share

3.30.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr -full

3.30.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.30.18. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map +/techmap.v

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
No more expansions possible.
<suppressed ~111 debug messages>

yosys> opt -sat

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.32.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Summary of detected clock domains:
  1756 cells in clk=\clk, en=\i4.RKGEN_U0.valid_out, arst=!\reset, srst={ }
  208 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[9].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  228 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[9].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[9].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[8].RKGEN_U.valid_out, arst=!\reset, srst={ }
  368 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[8].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  228 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[8].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[8].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[7].RKGEN_U.valid_out, arst=!\reset, srst={ }
  192 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[7].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[7].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[7].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[6].RKGEN_U.valid_out, arst=!\reset, srst={ }
  208 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[6].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[6].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[6].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[5].RKGEN_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[5].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[5].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[5].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[4].RKGEN_U.valid_out, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[4].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[4].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[4].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[3].RKGEN_U.valid_out, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[3].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[3].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[3].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[2].RKGEN_U.valid_out, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[2].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[2].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[2].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[1].RKGEN_U.valid_out, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=\i4.RKGEN_U0.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.RKGEN_U0.SUB_U.valid_out, arst=!\reset, srst={ }
  224 cells in clk=\clk, en=\i4.RKGEN_U0.valid_FirstStage, arst=!\reset, srst={ }
  1724 cells in clk=\clk, en=\valid_in, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[1].RKGEN_U.valid_round_key, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[1].RKGEN_U.SUB_U.valid_out, arst=!\reset, srst={ }
  40 cells in clk=\clk, en={ }, arst=!\reset, srst={ }
  192 cells in clk=\clk, en=\i4.ROUND_KEY_GEN[1].RKGEN_U.valid_FirstStage, arst=!\reset, srst={ }

3.33.2. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.RKGEN_U0.valid_out, asynchronously reset by !\reset
Extracted 1756 gates and 1886 wires to a netlist network with 128 inputs and 160 outputs.

3.33.2.1. Executing ABC.

3.33.3. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[9].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 208 gates and 369 wires to a netlist network with 161 inputs and 80 outputs.

3.33.3.1. Executing ABC.

3.33.4. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[9].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 228 gates and 356 wires to a netlist network with 128 inputs and 128 outputs.

3.33.4.1. Executing ABC.

3.33.5. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[9].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.33.5.1. Executing ABC.

3.33.6. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[8].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1724 gates and 1854 wires to a netlist network with 128 inputs and 192 outputs.

3.33.6.1. Executing ABC.

3.33.7. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[8].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 368 gates and 723 wires to a netlist network with 355 inputs and 208 outputs.

3.33.7.1. Executing ABC.

3.33.8. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[8].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 228 gates and 356 wires to a netlist network with 128 inputs and 128 outputs.

3.33.8.1. Executing ABC.

3.33.9. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[8].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.33.9.1. Executing ABC.

3.33.10. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[7].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1724 gates and 1854 wires to a netlist network with 128 inputs and 192 outputs.

3.33.10.1. Executing ABC.

3.33.11. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[7].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 192 gates and 385 wires to a netlist network with 193 inputs and 192 outputs.

3.33.11.1. Executing ABC.

3.33.12. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[7].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.33.12.1. Executing ABC.

3.33.13. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[7].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.33.13.1. Executing ABC.

3.33.14. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[6].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1724 gates and 1854 wires to a netlist network with 128 inputs and 192 outputs.

3.33.14.1. Executing ABC.

3.33.15. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[6].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 208 gates and 402 wires to a netlist network with 194 inputs and 176 outputs.

3.33.15.1. Executing ABC.

3.33.16. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[6].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.33.16.1. Executing ABC.

3.33.17. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[6].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.33.17.1. Executing ABC.

3.33.18. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[5].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1724 gates and 1854 wires to a netlist network with 128 inputs and 192 outputs.

3.33.18.1. Executing ABC.

3.33.19. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[5].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 224 gates and 402 wires to a netlist network with 178 inputs and 176 outputs.

3.33.19.1. Executing ABC.

3.33.20. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[5].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.33.20.1. Executing ABC.

3.33.21. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[5].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.33.21.1. Executing ABC.

3.33.22. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[4].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1724 gates and 1854 wires to a netlist network with 128 inputs and 192 outputs.

3.33.22.1. Executing ABC.

3.33.23. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[4].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.33.23.1. Executing ABC.

3.33.24. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[4].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.33.24.1. Executing ABC.

3.33.25. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[4].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.33.25.1. Executing ABC.

3.33.26. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[3].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1724 gates and 1854 wires to a netlist network with 128 inputs and 192 outputs.

3.33.26.1. Executing ABC.

3.33.27. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[3].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.33.27.1. Executing ABC.

3.33.28. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[3].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.33.28.1. Executing ABC.

3.33.29. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[3].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.33.29.1. Executing ABC.

3.33.30. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[2].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1724 gates and 1854 wires to a netlist network with 128 inputs and 192 outputs.

3.33.30.1. Executing ABC.

3.33.31. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[2].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.33.31.1. Executing ABC.

3.33.32. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[2].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.33.32.1. Executing ABC.

3.33.33. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[2].RKGEN_U.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.33.33.1. Executing ABC.

3.33.34. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[1].RKGEN_U.valid_out, asynchronously reset by !\reset
Extracted 1724 gates and 1854 wires to a netlist network with 128 inputs and 192 outputs.

3.33.34.1. Executing ABC.

3.33.35. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.RKGEN_U0.valid_round_key, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.33.35.1. Executing ABC.

3.33.36. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.RKGEN_U0.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.33.36.1. Executing ABC.

3.33.37. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.RKGEN_U0.valid_FirstStage, asynchronously reset by !\reset
Extracted 224 gates and 416 wires to a netlist network with 192 inputs and 128 outputs.

3.33.37.1. Executing ABC.

3.33.38. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \valid_in, asynchronously reset by !\reset
Extracted 1724 gates and 1854 wires to a netlist network with 128 inputs and 192 outputs.

3.33.38.1. Executing ABC.

3.33.39. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[1].RKGEN_U.valid_round_key, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.33.39.1. Executing ABC.

3.33.40. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \i4.ROUND_KEY_GEN[1].RKGEN_U.SUB_U.valid_out, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.33.40.1. Executing ABC.

3.33.41. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by !\reset
Extracted 40 gates and 41 wires to a netlist network with 1 inputs and 40 outputs.

3.33.41.1. Executing ABC.

3.33.42. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$140167$lo03, asynchronously reset by !\reset
Extracted 192 gates and 352 wires to a netlist network with 160 inputs and 128 outputs.

3.33.42.1. Executing ABC.

yosys> abc -dff

3.34. Executing ABC pass (technology mapping using ABC).

3.34.1. Summary of detected clock domains:
  128 cells in clk=\clk, en=$abc$140167$lo01, arst=!\reset, srst={ }
  2639 cells in clk=\clk, en=$abc$140167$lo11, arst=!\reset, srst={ }
  249 cells in clk=\clk, en=$abc$140167$lo08, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$140167$lo10, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$140167$lo04, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$140167$lo05, arst=!\reset, srst={ }
  2615 cells in clk=\clk, en=$abc$140167$lo02, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$140167$lo06, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$140167$lo09, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$140167$lo12, arst=!\reset, srst={ }
  2639 cells in clk=\clk, en=\valid_in, arst=!\reset, srst={ }
  40 cells in clk=\clk, en={ }, arst=!\reset, srst={ }
  2607 cells in clk=\clk, en=$abc$140167$lo07, arst=!\reset, srst={ }
  368 cells in clk=\clk, en=$abc$140167$lo38, arst=!\reset, srst={ }
  228 cells in clk=\clk, en=$abc$140167$lo37, arst=!\reset, srst={ }
  160 cells in clk=\clk, en=$abc$140167$lo36, arst=!\reset, srst={ }
  2607 cells in clk=\clk, en=$abc$140167$lo35, arst=!\reset, srst={ }
  368 cells in clk=\clk, en=$abc$140167$lo34, arst=!\reset, srst={ }
  228 cells in clk=\clk, en=$abc$140167$lo33, arst=!\reset, srst={ }
  160 cells in clk=\clk, en=$abc$140167$lo32, arst=!\reset, srst={ }
  2607 cells in clk=\clk, en=$abc$140167$lo31, arst=!\reset, srst={ }
  192 cells in clk=\clk, en=$abc$140167$lo30, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$140167$lo29, arst=!\reset, srst={ }
  160 cells in clk=\clk, en=$abc$140167$lo28, arst=!\reset, srst={ }
  2607 cells in clk=\clk, en=$abc$140167$lo27, arst=!\reset, srst={ }
  272 cells in clk=\clk, en=$abc$140167$lo26, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$140167$lo25, arst=!\reset, srst={ }
  160 cells in clk=\clk, en=$abc$140167$lo24, arst=!\reset, srst={ }
  2607 cells in clk=\clk, en=$abc$140167$lo23, arst=!\reset, srst={ }
  320 cells in clk=\clk, en=$abc$140167$lo22, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$140167$lo21, arst=!\reset, srst={ }
  160 cells in clk=\clk, en=$abc$140167$lo20, arst=!\reset, srst={ }
  2607 cells in clk=\clk, en=$abc$140167$lo19, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$140167$lo18, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$140167$lo17, arst=!\reset, srst={ }
  160 cells in clk=\clk, en=$abc$140167$lo16, arst=!\reset, srst={ }
  2607 cells in clk=\clk, en=$abc$140167$lo15, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$140167$lo14, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$140167$lo00, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$140167$lo13, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$140167$lo03, arst=!\reset, srst={ }

3.34.2. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$140167$lo01, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.34.2.1. Executing ABC.

3.34.3. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$140167$lo11, asynchronously reset by !\reset
Extracted 2639 gates and 2767 wires to a netlist network with 128 inputs and 128 outputs.

3.34.3.1. Executing ABC.

3.34.4. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$140167$lo08, asynchronously reset by !\reset
Extracted 249 gates and 401 wires to a netlist network with 152 inputs and 128 outputs.

3.34.4.1. Executing ABC.

3.34.5. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$140167$lo10, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.34.5.1. Executing ABC.

3.34.6. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$140167$lo04, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.34.6.1. Executing ABC.

3.34.7. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$140167$lo05, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.34.7.1. Executing ABC.

3.34.8. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$140167$lo02, asynchronously reset by !\reset
Extracted 2615 gates and 2743 wires to a netlist network with 128 inputs and 152 outputs.

3.34.8.1. Executing ABC.

3.34.9. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$140167$lo06, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.34.9.1. Executing ABC.

3.34.10. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$140167$lo09, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.34.10.1. Executing ABC.

3.34.11. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$140167$lo12, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.34.11.1. Executing ABC.

3.34.12. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \valid_in, asynchronously reset by !\reset
Extracted 2639 gates and 2767 wires to a netlist network with 128 inputs and 128 outputs.

3.34.12.1. Executing ABC.

3.34.13. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by !\reset
Extracted 40 gates and 41 wires to a netlist network with 1 inputs and 40 outputs.

3.34.13.1. Executing ABC.

3.34.14. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo04, asynchronously reset by !\reset
Extracted 2607 gates and 2735 wires to a netlist network with 128 inputs and 128 outputs.

3.34.14.1. Executing ABC.

3.34.15. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo38, asynchronously reset by !\reset
Extracted 368 gates and 531 wires to a netlist network with 163 inputs and 80 outputs.

3.34.15.1. Executing ABC.

3.34.16. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo37, asynchronously reset by !\reset
Extracted 228 gates and 356 wires to a netlist network with 128 inputs and 128 outputs.

3.34.16.1. Executing ABC.

3.34.17. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo36, asynchronously reset by !\reset
Extracted 160 gates and 320 wires to a netlist network with 160 inputs and 128 outputs.

3.34.17.1. Executing ABC.

3.34.18. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo35, asynchronously reset by !\reset
Extracted 2607 gates and 2735 wires to a netlist network with 128 inputs and 160 outputs.

3.34.18.1. Executing ABC.

3.34.19. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo34, asynchronously reset by !\reset
Extracted 368 gates and 642 wires to a netlist network with 274 inputs and 208 outputs.

3.34.19.1. Executing ABC.

3.34.20. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo33, asynchronously reset by !\reset
Extracted 228 gates and 356 wires to a netlist network with 128 inputs and 128 outputs.

3.34.20.1. Executing ABC.

3.34.21. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo32, asynchronously reset by !\reset
Extracted 160 gates and 320 wires to a netlist network with 160 inputs and 128 outputs.

3.34.21.1. Executing ABC.

3.34.22. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo31, asynchronously reset by !\reset
Extracted 2607 gates and 2735 wires to a netlist network with 128 inputs and 160 outputs.

3.34.22.1. Executing ABC.

3.34.23. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo30, asynchronously reset by !\reset
Extracted 192 gates and 385 wires to a netlist network with 193 inputs and 192 outputs.

3.34.23.1. Executing ABC.

3.34.24. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo29, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.34.24.1. Executing ABC.

3.34.25. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo28, asynchronously reset by !\reset
Extracted 160 gates and 320 wires to a netlist network with 160 inputs and 128 outputs.

3.34.25.1. Executing ABC.

3.34.26. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo27, asynchronously reset by !\reset
Extracted 2607 gates and 2735 wires to a netlist network with 128 inputs and 160 outputs.

3.34.26.1. Executing ABC.

3.34.27. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo26, asynchronously reset by !\reset
Extracted 272 gates and 499 wires to a netlist network with 227 inputs and 176 outputs.

3.34.27.1. Executing ABC.

3.34.28. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo25, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.34.28.1. Executing ABC.

3.34.29. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo24, asynchronously reset by !\reset
Extracted 160 gates and 320 wires to a netlist network with 160 inputs and 128 outputs.

3.34.29.1. Executing ABC.

3.34.30. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo23, asynchronously reset by !\reset
Extracted 2607 gates and 2735 wires to a netlist network with 128 inputs and 160 outputs.

3.34.30.1. Executing ABC.

3.34.31. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo22, asynchronously reset by !\reset
Extracted 320 gates and 547 wires to a netlist network with 227 inputs and 176 outputs.

3.34.31.1. Executing ABC.

3.34.32. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo21, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.34.32.1. Executing ABC.

3.34.33. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo20, asynchronously reset by !\reset
Extracted 160 gates and 320 wires to a netlist network with 160 inputs and 128 outputs.

3.34.33.1. Executing ABC.

3.34.34. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo19, asynchronously reset by !\reset
Extracted 2607 gates and 2735 wires to a netlist network with 128 inputs and 160 outputs.

3.34.34.1. Executing ABC.

3.34.35. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo18, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.34.35.1. Executing ABC.

3.34.36. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo17, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.34.36.1. Executing ABC.

3.34.37. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo16, asynchronously reset by !\reset
Extracted 160 gates and 320 wires to a netlist network with 160 inputs and 128 outputs.

3.34.37.1. Executing ABC.

3.34.38. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo15, asynchronously reset by !\reset
Extracted 2607 gates and 2735 wires to a netlist network with 128 inputs and 160 outputs.

3.34.38.1. Executing ABC.

3.34.39. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo14, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.34.39.1. Executing ABC.

3.34.40. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo01, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.34.40.1. Executing ABC.

3.34.41. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo13, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.34.41.1. Executing ABC.

3.34.42. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo00, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.34.42.1. Executing ABC.

yosys> abc -dff

3.35. Executing ABC pass (technology mapping using ABC).

3.35.1. Summary of detected clock domains:
  225 cells in clk=\clk, en=$abc$152331$lo13, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$152331$lo02, arst=!\reset, srst={ }
  2572 cells in clk=\clk, en=$abc$152331$lo11, arst=!\reset, srst={ }
  192 cells in clk=\clk, en=$abc$152331$lo08, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$152331$lo10, arst=!\reset, srst={ }
  278 cells in clk=\clk, en=$abc$152331$lo05, arst=!\reset, srst={ }
  136 cells in clk=\clk, en=$abc$152331$lo06, arst=!\reset, srst={ }
  2573 cells in clk=\clk, en=$abc$152331$lo03, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$152331$lo07, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$152331$lo09, arst=!\reset, srst={ }
  189 cells in clk=\clk, en=$abc$152331$lo12, arst=!\reset, srst={ }
  2572 cells in clk=\clk, en=\valid_in, arst=!\reset, srst={ }
  40 cells in clk=\clk, en={ }, arst=!\reset, srst={ }
  2589 cells in clk=\clk, en=$abc$152331$lo04, arst=!\reset, srst={ }
  368 cells in clk=\clk, en=$abc$152331$lo38, arst=!\reset, srst={ }
  228 cells in clk=\clk, en=$abc$152331$lo37, arst=!\reset, srst={ }
  200 cells in clk=\clk, en=$abc$152331$lo36, arst=!\reset, srst={ }
  2576 cells in clk=\clk, en=$abc$152331$lo35, arst=!\reset, srst={ }
  400 cells in clk=\clk, en=$abc$152331$lo34, arst=!\reset, srst={ }
  228 cells in clk=\clk, en=$abc$152331$lo33, arst=!\reset, srst={ }
  200 cells in clk=\clk, en=$abc$152331$lo32, arst=!\reset, srst={ }
  2576 cells in clk=\clk, en=$abc$152331$lo31, arst=!\reset, srst={ }
  320 cells in clk=\clk, en=$abc$152331$lo30, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$152331$lo29, arst=!\reset, srst={ }
  200 cells in clk=\clk, en=$abc$152331$lo28, arst=!\reset, srst={ }
  2576 cells in clk=\clk, en=$abc$152331$lo27, arst=!\reset, srst={ }
  272 cells in clk=\clk, en=$abc$152331$lo26, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$152331$lo25, arst=!\reset, srst={ }
  200 cells in clk=\clk, en=$abc$152331$lo24, arst=!\reset, srst={ }
  2576 cells in clk=\clk, en=$abc$152331$lo23, arst=!\reset, srst={ }
  320 cells in clk=\clk, en=$abc$152331$lo22, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$152331$lo21, arst=!\reset, srst={ }
  200 cells in clk=\clk, en=$abc$152331$lo20, arst=!\reset, srst={ }
  2576 cells in clk=\clk, en=$abc$152331$lo19, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$152331$lo18, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$152331$lo17, arst=!\reset, srst={ }
  200 cells in clk=\clk, en=$abc$152331$lo16, arst=!\reset, srst={ }
  2576 cells in clk=\clk, en=$abc$152331$lo15, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$152331$lo14, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$152331$lo01, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$152331$lo00, arst=!\reset, srst={ }

3.35.2. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo13, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.35.2.1. Executing ABC.

3.35.3. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo02, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.35.3.1. Executing ABC.

3.35.4. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo11, asynchronously reset by !\reset
Extracted 2572 gates and 2700 wires to a netlist network with 128 inputs and 188 outputs.

3.35.4.1. Executing ABC.

3.35.5. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo08, asynchronously reset by !\reset
Extracted 192 gates and 384 wires to a netlist network with 192 inputs and 128 outputs.

3.35.5.1. Executing ABC.

3.35.6. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo10, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.35.6.1. Executing ABC.

3.35.7. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo05, asynchronously reset by !\reset
Extracted 278 gates and 466 wires to a netlist network with 188 inputs and 128 outputs.

3.35.7.1. Executing ABC.

3.35.8. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo06, asynchronously reset by !\reset
Extracted 136 gates and 264 wires to a netlist network with 128 inputs and 128 outputs.

3.35.8.1. Executing ABC.

3.35.9. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo03, asynchronously reset by !\reset
Extracted 2573 gates and 2701 wires to a netlist network with 128 inputs and 192 outputs.

3.35.9.1. Executing ABC.

3.35.10. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo07, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.35.10.1. Executing ABC.

3.35.11. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo09, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.35.11.1. Executing ABC.

3.35.12. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$152331$lo12, asynchronously reset by !\reset
Extracted 189 gates and 377 wires to a netlist network with 188 inputs and 128 outputs.

3.35.12.1. Executing ABC.

3.35.13. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \valid_in, asynchronously reset by !\reset
Extracted 2572 gates and 2700 wires to a netlist network with 128 inputs and 188 outputs.

3.35.13.1. Executing ABC.

3.35.14. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by !\reset
Extracted 40 gates and 41 wires to a netlist network with 1 inputs and 40 outputs.

3.35.14.1. Executing ABC.

3.35.15. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo00, asynchronously reset by !\reset
Extracted 2589 gates and 2717 wires to a netlist network with 128 inputs and 128 outputs.

3.35.15.1. Executing ABC.

3.35.16. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo38, asynchronously reset by !\reset
Extracted 368 gates and 531 wires to a netlist network with 163 inputs and 80 outputs.

3.35.16.1. Executing ABC.

3.35.17. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo37, asynchronously reset by !\reset
Extracted 228 gates and 356 wires to a netlist network with 128 inputs and 128 outputs.

3.35.17.1. Executing ABC.

3.35.18. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo36, asynchronously reset by !\reset
Extracted 200 gates and 399 wires to a netlist network with 199 inputs and 128 outputs.

3.35.18.1. Executing ABC.

3.35.19. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo35, asynchronously reset by !\reset
Extracted 2576 gates and 2704 wires to a netlist network with 128 inputs and 199 outputs.

3.35.19.1. Executing ABC.

3.35.20. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo34, asynchronously reset by !\reset
Extracted 400 gates and 674 wires to a netlist network with 274 inputs and 208 outputs.

3.35.20.1. Executing ABC.

3.35.21. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo33, asynchronously reset by !\reset
Extracted 228 gates and 356 wires to a netlist network with 128 inputs and 128 outputs.

3.35.21.1. Executing ABC.

3.35.22. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo32, asynchronously reset by !\reset
Extracted 200 gates and 399 wires to a netlist network with 199 inputs and 128 outputs.

3.35.22.1. Executing ABC.

3.35.23. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo31, asynchronously reset by !\reset
Extracted 2576 gates and 2704 wires to a netlist network with 128 inputs and 199 outputs.

3.35.23.1. Executing ABC.

3.35.24. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo30, asynchronously reset by !\reset
Extracted 320 gates and 514 wires to a netlist network with 194 inputs and 256 outputs.

3.35.24.1. Executing ABC.

3.35.25. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo29, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.35.25.1. Executing ABC.

3.35.26. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo28, asynchronously reset by !\reset
Extracted 200 gates and 399 wires to a netlist network with 199 inputs and 128 outputs.

3.35.26.1. Executing ABC.

3.35.27. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo27, asynchronously reset by !\reset
Extracted 2576 gates and 2704 wires to a netlist network with 128 inputs and 199 outputs.

3.35.27.1. Executing ABC.

3.35.28. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo26, asynchronously reset by !\reset
Extracted 272 gates and 499 wires to a netlist network with 227 inputs and 176 outputs.

3.35.28.1. Executing ABC.

3.35.29. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo25, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.35.29.1. Executing ABC.

3.35.30. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo24, asynchronously reset by !\reset
Extracted 200 gates and 399 wires to a netlist network with 199 inputs and 128 outputs.

3.35.30.1. Executing ABC.

3.35.31. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo23, asynchronously reset by !\reset
Extracted 2576 gates and 2704 wires to a netlist network with 128 inputs and 199 outputs.

3.35.31.1. Executing ABC.

3.35.32. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo22, asynchronously reset by !\reset
Extracted 320 gates and 547 wires to a netlist network with 227 inputs and 176 outputs.

3.35.32.1. Executing ABC.

3.35.33. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo21, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.35.33.1. Executing ABC.

3.35.34. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo20, asynchronously reset by !\reset
Extracted 200 gates and 399 wires to a netlist network with 199 inputs and 128 outputs.

3.35.34.1. Executing ABC.

3.35.35. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo19, asynchronously reset by !\reset
Extracted 2576 gates and 2704 wires to a netlist network with 128 inputs and 199 outputs.

3.35.35.1. Executing ABC.

3.35.36. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo18, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.35.36.1. Executing ABC.

3.35.37. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo17, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.35.37.1. Executing ABC.

3.35.38. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo16, asynchronously reset by !\reset
Extracted 200 gates and 399 wires to a netlist network with 199 inputs and 128 outputs.

3.35.38.1. Executing ABC.

3.35.39. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo15, asynchronously reset by !\reset
Extracted 2576 gates and 2704 wires to a netlist network with 128 inputs and 199 outputs.

3.35.39.1. Executing ABC.

3.35.40. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo14, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.35.40.1. Executing ABC.

3.35.41. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo02, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.35.41.1. Executing ABC.

3.35.42. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo01, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.35.42.1. Executing ABC.

yosys> abc -dff

3.36. Executing ABC pass (technology mapping using ABC).

3.36.1. Summary of detected clock domains:
  225 cells in clk=\clk, en=$abc$193974$lo02, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$193974$lo13, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$193974$lo03, arst=!\reset, srst={ }
  2622 cells in clk=\clk, en=$abc$193974$lo11, arst=!\reset, srst={ }
  248 cells in clk=\clk, en=$abc$193974$lo08, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$193974$lo10, arst=!\reset, srst={ }
  241 cells in clk=\clk, en=$abc$193974$lo06, arst=!\reset, srst={ }
  217 cells in clk=\clk, en=$abc$193974$lo07, arst=!\reset, srst={ }
  2574 cells in clk=\clk, en=$abc$193974$lo04, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$193974$lo05, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$193974$lo09, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$193974$lo12, arst=!\reset, srst={ }
  2527 cells in clk=\clk, en=\valid_in, arst=!\reset, srst={ }
  40 cells in clk=\clk, en={ }, arst=!\reset, srst={ }
  2625 cells in clk=\clk, en=$abc$193974$lo00, arst=!\reset, srst={ }
  368 cells in clk=\clk, en=$abc$193974$lo38, arst=!\reset, srst={ }
  228 cells in clk=\clk, en=$abc$193974$lo37, arst=!\reset, srst={ }
  257 cells in clk=\clk, en=$abc$193974$lo36, arst=!\reset, srst={ }
  2536 cells in clk=\clk, en=$abc$193974$lo35, arst=!\reset, srst={ }
  400 cells in clk=\clk, en=$abc$193974$lo34, arst=!\reset, srst={ }
  228 cells in clk=\clk, en=$abc$193974$lo33, arst=!\reset, srst={ }
  317 cells in clk=\clk, en=$abc$193974$lo32, arst=!\reset, srst={ }
  2497 cells in clk=\clk, en=$abc$193974$lo31, arst=!\reset, srst={ }
  320 cells in clk=\clk, en=$abc$193974$lo30, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$193974$lo29, arst=!\reset, srst={ }
  252 cells in clk=\clk, en=$abc$193974$lo28, arst=!\reset, srst={ }
  2546 cells in clk=\clk, en=$abc$193974$lo27, arst=!\reset, srst={ }
  272 cells in clk=\clk, en=$abc$193974$lo26, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$193974$lo25, arst=!\reset, srst={ }
  263 cells in clk=\clk, en=$abc$193974$lo24, arst=!\reset, srst={ }
  2534 cells in clk=\clk, en=$abc$193974$lo23, arst=!\reset, srst={ }
  320 cells in clk=\clk, en=$abc$193974$lo22, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$193974$lo21, arst=!\reset, srst={ }
  263 cells in clk=\clk, en=$abc$193974$lo20, arst=!\reset, srst={ }
  2534 cells in clk=\clk, en=$abc$193974$lo19, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$193974$lo18, arst=!\reset, srst={ }
  225 cells in clk=\clk, en=$abc$193974$lo17, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$193974$lo16, arst=!\reset, srst={ }
  2684 cells in clk=\clk, en=$abc$193974$lo15, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$193974$lo14, arst=!\reset, srst={ }
  128 cells in clk=\clk, en=$abc$193974$lo01, arst=!\reset, srst={ }

3.36.2. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo02, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.36.2.1. Executing ABC.

3.36.3. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo13, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.36.3.1. Executing ABC.

3.36.4. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo03, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.36.4.1. Executing ABC.

3.36.5. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo11, asynchronously reset by !\reset
Extracted 2622 gates and 2750 wires to a netlist network with 128 inputs and 128 outputs.

3.36.5.1. Executing ABC.

3.36.6. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo08, asynchronously reset by !\reset
Extracted 248 gates and 492 wires to a netlist network with 244 inputs and 128 outputs.

3.36.6.1. Executing ABC.

3.36.7. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo10, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.36.7.1. Executing ABC.

3.36.8. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo06, asynchronously reset by !\reset
Extracted 241 gates and 476 wires to a netlist network with 235 inputs and 129 outputs.

3.36.8.1. Executing ABC.

3.36.9. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo07, asynchronously reset by !\reset
Extracted 217 gates and 345 wires to a netlist network with 128 inputs and 136 outputs.

3.36.9.1. Executing ABC.

3.36.10. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo04, asynchronously reset by !\reset
Extracted 2574 gates and 2702 wires to a netlist network with 128 inputs and 244 outputs.

3.36.10.1. Executing ABC.

3.36.11. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo05, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.36.11.1. Executing ABC.

3.36.12. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo09, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.36.12.1. Executing ABC.

3.36.13. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$193974$lo12, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.36.13.1. Executing ABC.

3.36.14. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \valid_in, asynchronously reset by !\reset
Extracted 2527 gates and 2656 wires to a netlist network with 129 inputs and 227 outputs.

3.36.14.1. Executing ABC.

3.36.15. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by !\reset
Extracted 40 gates and 41 wires to a netlist network with 1 inputs and 40 outputs.

3.36.15.1. Executing ABC.

3.36.16. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo01, asynchronously reset by !\reset
Extracted 2625 gates and 2753 wires to a netlist network with 128 inputs and 128 outputs.

3.36.16.1. Executing ABC.

3.36.17. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo38, asynchronously reset by !\reset
Extracted 368 gates and 531 wires to a netlist network with 163 inputs and 80 outputs.

3.36.17.1. Executing ABC.

3.36.18. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo37, asynchronously reset by !\reset
Extracted 228 gates and 356 wires to a netlist network with 128 inputs and 128 outputs.

3.36.18.1. Executing ABC.

3.36.19. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo36, asynchronously reset by !\reset
Extracted 257 gates and 505 wires to a netlist network with 248 inputs and 128 outputs.

3.36.19.1. Executing ABC.

3.36.20. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo35, asynchronously reset by !\reset
Extracted 2536 gates and 2664 wires to a netlist network with 128 inputs and 248 outputs.

3.36.20.1. Executing ABC.

3.36.21. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo34, asynchronously reset by !\reset
Extracted 400 gates and 674 wires to a netlist network with 274 inputs and 208 outputs.

3.36.21.1. Executing ABC.

3.36.22. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo33, asynchronously reset by !\reset
Extracted 228 gates and 356 wires to a netlist network with 128 inputs and 128 outputs.

3.36.22.1. Executing ABC.

3.36.23. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo32, asynchronously reset by !\reset
Extracted 317 gates and 616 wires to a netlist network with 299 inputs and 128 outputs.

3.36.23.1. Executing ABC.

3.36.24. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo31, asynchronously reset by !\reset
Extracted 2497 gates and 2625 wires to a netlist network with 128 inputs and 299 outputs.

3.36.24.1. Executing ABC.

3.36.25. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo30, asynchronously reset by !\reset
Extracted 320 gates and 514 wires to a netlist network with 194 inputs and 256 outputs.

3.36.25.1. Executing ABC.

3.36.26. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo29, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.36.26.1. Executing ABC.

3.36.27. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo28, asynchronously reset by !\reset
Extracted 252 gates and 497 wires to a netlist network with 245 inputs and 128 outputs.

3.36.27.1. Executing ABC.

3.36.28. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo27, asynchronously reset by !\reset
Extracted 2546 gates and 2674 wires to a netlist network with 128 inputs and 245 outputs.

3.36.28.1. Executing ABC.

3.36.29. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo26, asynchronously reset by !\reset
Extracted 272 gates and 499 wires to a netlist network with 227 inputs and 176 outputs.

3.36.29.1. Executing ABC.

3.36.30. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo25, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.36.30.1. Executing ABC.

3.36.31. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo24, asynchronously reset by !\reset
Extracted 263 gates and 516 wires to a netlist network with 253 inputs and 128 outputs.

3.36.31.1. Executing ABC.

3.36.32. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo23, asynchronously reset by !\reset
Extracted 2534 gates and 2662 wires to a netlist network with 128 inputs and 253 outputs.

3.36.32.1. Executing ABC.

3.36.33. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo22, asynchronously reset by !\reset
Extracted 320 gates and 547 wires to a netlist network with 227 inputs and 176 outputs.

3.36.33.1. Executing ABC.

3.36.34. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo21, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.36.34.1. Executing ABC.

3.36.35. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo20, asynchronously reset by !\reset
Extracted 263 gates and 516 wires to a netlist network with 253 inputs and 128 outputs.

3.36.35.1. Executing ABC.

3.36.36. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo19, asynchronously reset by !\reset
Extracted 2534 gates and 2662 wires to a netlist network with 128 inputs and 253 outputs.

3.36.36.1. Executing ABC.

3.36.37. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo18, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.36.37.1. Executing ABC.

3.36.38. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo17, asynchronously reset by !\reset
Extracted 225 gates and 353 wires to a netlist network with 128 inputs and 128 outputs.

3.36.38.1. Executing ABC.

3.36.39. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo16, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.36.39.1. Executing ABC.

3.36.40. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo15, asynchronously reset by !\reset
Extracted 2684 gates and 2812 wires to a netlist network with 128 inputs and 128 outputs.

3.36.40.1. Executing ABC.

3.36.41. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo14, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.36.41.1. Executing ABC.

3.36.42. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$235824$lo02, asynchronously reset by !\reset
Extracted 128 gates and 256 wires to a netlist network with 128 inputs and 128 outputs.

3.36.42.1. Executing ABC.

yosys> opt_ffinv

3.37. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.38. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.38.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~102 debug messages>

yosys> opt_merge -nomux

3.38.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
<suppressed ~27 debug messages>
Removed a total of 9 cells.

yosys> opt_muxtree

3.38.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.38.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 0 unused cells and 162313 unused wires.
<suppressed ~107 debug messages>

yosys> opt_expr

3.38.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.38.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.38.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.38.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.38.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.38.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.38.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.38.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_8Q2bRH/abc_tmp_1.scr

3.39. Executing ABC pass (technology mapping using ABC).

3.39.1. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Extracted 27336 gates and 29899 wires to a netlist network with 2563 inputs and 1376 outputs.

3.39.1.1. Executing ABC.
DE:   #PIs = 2563  #Luts =  4633  Max Lvl =   7  Avg Lvl =   2.51  [   0.87 sec. at Pass 0]
DE:   #PIs = 2563  #Luts =  3152  Max Lvl =   3  Avg Lvl =   2.21  [  54.64 sec. at Pass 1]
DE:   #PIs = 2563  #Luts =  3149  Max Lvl =   3  Avg Lvl =   2.21  [  10.62 sec. at Pass 2]
DE:   #PIs = 2563  #Luts =  3140  Max Lvl =   3  Avg Lvl =   2.21  [  14.14 sec. at Pass 3]
DE:   #PIs = 2563  #Luts =  3140  Max Lvl =   3  Avg Lvl =   2.21  [  12.44 sec. at Pass 4]
DE:   #PIs = 2563  #Luts =  3138  Max Lvl =   3  Avg Lvl =   2.21  [  18.46 sec. at Pass 5]
DE:   #PIs = 2563  #Luts =  3138  Max Lvl =   3  Avg Lvl =   2.21  [  16.16 sec. at Pass 6]
DE:   #PIs = 2563  #Luts =  3138  Max Lvl =   3  Avg Lvl =   2.21  [  21.10 sec. at Pass 7]
DE:   #PIs = 2563  #Luts =  3138  Max Lvl =   3  Avg Lvl =   2.21  [  20.28 sec. at Pass 8]
DE:   #PIs = 2563  #Luts =  3138  Max Lvl =   3  Avg Lvl =   2.21  [   1.27 sec. at Pass 9]

yosys> opt

3.40. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.40.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge -nomux

3.40.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.40.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.40.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 0 unused cells and 29825 unused wires.
<suppressed ~7 debug messages>

yosys> opt_expr

3.40.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.40.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.40.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.40.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.40.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.40.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.40.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.40.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt_ffinv

3.41. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.42. Printing statistics.

=== wrapper_KeyExpantion ===

   Number of wires:               4110
   Number of wire bits:          22110
   Number of public wires:         479
   Number of public wire bits:   18479
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               8298
     $_DFFE_PN0P_                 5120
     $_DFF_PN0_                     40
     $lut                         3138


yosys> shregmap -minlen 8 -maxlen 20

3.43. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.44. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.45. Printing statistics.

=== wrapper_KeyExpantion ===

   Number of wires:               4110
   Number of wire bits:          22110
   Number of public wires:         479
   Number of public wire bits:   18479
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               8298
     $_DFFE_PN0P_                 5120
     $_DFF_PN0_                     40
     $lut                         3138


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.46. Executing TECHMAP pass (map to technology primitives).

3.46.1. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.46.2. Executing Verilog-2005 frontend: /home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/meri/Documents/workspace/de-issue/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.46.3. Continuing TECHMAP pass.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~8434 debug messages>

yosys> opt_expr -mux_undef

3.47. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~66973 debug messages>

yosys> simplemap

3.48. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge

3.50. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
<suppressed ~56040 debug messages>
Removed a total of 18680 cells.

yosys> opt_dff -nodffe -nosdff

3.51. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.52. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 0 unused cells and 30703 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.53. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.53.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.
<suppressed ~1842 debug messages>

yosys> opt_merge -nomux

3.53.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
<suppressed ~345 debug messages>
Removed a total of 115 cells.

yosys> opt_muxtree

3.53.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.53.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 0 unused cells and 35 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.53.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.53.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.53.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.53.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.53.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.53.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.53.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_8Q2bRH/abc_tmp_2.scr

3.54. Executing ABC pass (technology mapping using ABC).

3.54.1. Extracting gate netlist of module `\wrapper_KeyExpantion' to `<abc-temp-dir>/input.blif'..
Extracted 32132 gates and 34697 wires to a netlist network with 2563 inputs and 1376 outputs.

3.54.1.1. Executing ABC.
DE:   #PIs = 2563  #Luts =  3138  Max Lvl =   3  Avg Lvl =   2.21  [   2.51 sec. at Pass 0]
DE:   #PIs = 2563  #Luts =  3138  Max Lvl =   3  Avg Lvl =   2.21  [  72.38 sec. at Pass 1]
DE:   #PIs = 2563  #Luts =  3138  Max Lvl =   3  Avg Lvl =   2.21  [  13.40 sec. at Pass 2]
DE:   #PIs = 2563  #Luts =  3138  Max Lvl =   3  Avg Lvl =   2.21  [  15.71 sec. at Pass 3]
DE:   #PIs = 2563  #Luts =  3138  Max Lvl =   3  Avg Lvl =   2.21  [  14.17 sec. at Pass 4]
DE:   #PIs = 2563  #Luts =  3138  Max Lvl =   3  Avg Lvl =   2.21  [  16.89 sec. at Pass 5]
DE:   #PIs = 2563  #Luts =  3138  Max Lvl =   3  Avg Lvl =   2.21  [   0.89 sec. at Pass 6]

yosys> opt

3.55. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.55.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

yosys> opt_merge -nomux

3.55.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.55.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.55.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 0 unused cells and 14771 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.55.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.55.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.55.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \wrapper_KeyExpantion..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \wrapper_KeyExpantion.
Performed a total of 0 changes.

yosys> opt_merge

3.55.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\wrapper_KeyExpantion'.
Removed a total of 0 cells.

yosys> opt_dff

3.55.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..

yosys> opt_expr

3.55.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module wrapper_KeyExpantion.

3.55.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.56. Executing HIERARCHY pass (managing design hierarchy).

3.56.1. Analyzing design hierarchy..
Top module:  \wrapper_KeyExpantion

3.56.2. Analyzing design hierarchy..
Top module:  \wrapper_KeyExpantion
Removed 0 unused modules.

yosys> stat

3.57. Printing statistics.

=== wrapper_KeyExpantion ===

   Number of wires:               4110
   Number of wire bits:          22110
   Number of public wires:         479
   Number of public wire bits:   18479
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               8298
     $lut                         3138
     dffsre                       5160


yosys> opt_clean -purge

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \wrapper_KeyExpantion..
Removed 0 unused cells and 386 unused wires.
<suppressed ~386 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.59. Executing Verilog backend.

yosys> bmuxmap

3.59.1. Executing BMUXMAP pass.

yosys> demuxmap

3.59.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\wrapper_KeyExpantion'.

Warnings: 962 unique messages, 962 total
End of script. Logfile hash: fc656ced9b, CPU: user 140.65s system 4.21s, MEM: 312.05 MB peak
Yosys 0.16+65 (git sha1 7987105a9, gcc 9.1.0 -fPIC -Os)
Time spent: 93% 6x abc (1685 sec), 2% 33x opt_expr (40 sec), ...
real 507.28
user 1643.73
sys 153.58
