
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.19
 Yosys 0.16+65 (git sha1 91803ad5c, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl key_schedule.vhd round_f.vhd xtea.vhd

yosys> verific -vhdl key_schedule.vhd round_f.vhd xtea.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'key_schedule.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_1164' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_1164.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.textio' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/textio.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.numeric_std' from file '/home/users/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/numeric_std.vdb'
VERIFIC-INFO [VHDL-1012] key_schedule.vhd:22: analyzing entity 'key_schedule'
VERIFIC-INFO [VHDL-1010] key_schedule.vhd:31: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'round_f.vhd'
VERIFIC-INFO [VHDL-1012] round_f.vhd:21: analyzing entity 'round_f'
VERIFIC-INFO [VHDL-1010] round_f.vhd:27: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'xtea.vhd'
VERIFIC-INFO [VHDL-1012] xtea.vhd:20: analyzing entity 'xtea'
VERIFIC-INFO [VHDL-1010] xtea.vhd:30: analyzing architecture 'behavioral'

yosys> synth_rs -top xtea -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.44

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top xtea

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] xtea.vhd:20: processing 'xtea(Behavioral)'
VERIFIC-INFO [VHDL-1067] key_schedule.vhd:22: processing 'key_schedule(Behavioral)'
VERIFIC-INFO [VHDL-1067] round_f.vhd:21: processing 'round_f(Behavioral)'
Importing module xtea.
Importing module key_schedule(Behavioral).
Importing module round_f(Behavioral).

3.3.1. Analyzing design hierarchy..
Top module:  \xtea
Used module:     \round_f(Behavioral)
Used module:     \key_schedule(Behavioral)

3.3.2. Analyzing design hierarchy..
Top module:  \xtea
Used module:     \round_f(Behavioral)
Used module:     \key_schedule(Behavioral)
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module round_f(Behavioral).
Optimizing module key_schedule(Behavioral).
<suppressed ~4 debug messages>
Optimizing module xtea.
<suppressed ~3 debug messages>

yosys> flatten

3.5. Executing FLATTEN pass (flatten design).
Deleting now unused module round_f(Behavioral).
Deleting now unused module key_schedule(Behavioral).
<suppressed ~2 debug messages>

yosys> tribuf -logic

3.6. Executing TRIBUF pass.

yosys> deminout

3.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

yosys> opt_clean

3.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..
Removed 1 unused cells and 47 unused wires.
<suppressed ~29 debug messages>

yosys> check

3.10. Executing CHECK pass (checking for obvious problems).
Checking module xtea...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$v_1_s_reg$xtea.vhd:102$87 ($aldff) from module xtea.
Removing never-active async load on $verific$v_0_s_reg$xtea.vhd:102$88 ($aldff) from module xtea.
Removing never-active async load on $verific$input_a_s_reg$xtea.vhd:102$89 ($aldff) from module xtea.
Removing never-active async load on $verific$cnt_s_reg$xtea.vhd:67$53 ($aldff) from module xtea.
Removing never-active async load on $flatten\KEY_SCHEDULE_0.$verific$sum_s_reg$key_schedule.vhd:80$162 ($aldff) from module xtea.
Removing never-active async load on $flatten\KEY_SCHEDULE_0.$verific$subkey_reg$key_schedule.vhd:80$163 ($aldff) from module xtea.

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..

yosys> fsm_opt

3.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

yosys> opt_merge -nomux

3.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

3.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$v_1_s_reg$xtea.vhd:102$87 ($dff) from module xtea (D = $verific$n1155$38, Q = \v_1_s).
Adding EN signal on $verific$v_0_s_reg$xtea.vhd:102$88 ($dff) from module xtea (D = $verific$n1188$39, Q = \v_0_s).
Adding EN signal on $verific$input_a_s_reg$xtea.vhd:102$89 ($dff) from module xtea (D = $verific$n957$32, Q = \input_a_s).
Adding SRST signal on $verific$cnt_s_reg$xtea.vhd:67$53 ($dff) from module xtea (D = $verific$n176$9, Q = \cnt_s, rval = 2'00).
Adding EN signal on $flatten\KEY_SCHEDULE_0.$verific$sum_s_reg$key_schedule.vhd:80$162 ($dff) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1302$124, Q = \KEY_SCHEDULE_0.sum_s).
Adding SRST signal on $flatten\KEY_SCHEDULE_0.$verific$subkey_reg$key_schedule.vhd:80$163 ($dff) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1236$122, Q = \KEY_SCHEDULE_0.subkey, rval = 0).
Adding EN signal on $auto$ff.cc:262:slice$207 ($sdff) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1236$122, Q = \KEY_SCHEDULE_0.subkey).

yosys> opt_clean

3.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..
Removed 3 unused cells and 3 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.
<suppressed ~4 debug messages>

3.13.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce

3.13.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.13.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_dff -sat

3.13.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.13.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

3.13.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.13.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce

3.13.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.13.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.13.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.13.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..

yosys> opt_expr

3.13.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

3.13.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.14. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 2) from port B of cell xtea.$verific$add_7$../vhdl_packages/vhdl_2008/src/numeric_std-body.vhdl:482$50 ($add).
Removed top 1 bits (of 2) from port B of cell xtea.$verific$equal_23$xtea.vhd:86$63 ($eq).
Removed top 1 bits (of 33) from port A of cell xtea.$verific$sub_27$xtea.vhd:90$65 ($sub).
Removed top 1 bits (of 33) from port B of cell xtea.$verific$sub_27$xtea.vhd:90$65 ($sub).
Removed top 1 bits (of 33) from port Y of cell xtea.$verific$sub_27$xtea.vhd:90$65 ($sub).
Removed top 1 bits (of 33) from port A of cell xtea.$verific$sub_35$xtea.vhd:98$72 ($sub).
Removed top 1 bits (of 33) from port B of cell xtea.$verific$sub_35$xtea.vhd:98$72 ($sub).
Removed top 1 bits (of 33) from port Y of cell xtea.$verific$sub_35$xtea.vhd:98$72 ($sub).
Removed top 1 bits (of 2) from port B of cell xtea.$auto$opt_dff.cc:195:make_patterns_logic$198 ($ne).
Removed top 1 bits (of 3) from port B of cell xtea.$auto$opt_dff.cc:195:make_patterns_logic$182 ($ne).
Removed top 30 bits (of 32) from port B of cell xtea.$flatten\KEY_SCHEDULE_0.$verific$and_23$../vhdl_packages/vhdl_2008/src/numeric_std-body.vhdl:3512$144 ($and).
Removed top 30 bits (of 32) from port Y of cell xtea.$flatten\KEY_SCHEDULE_0.$verific$and_23$../vhdl_packages/vhdl_2008/src/numeric_std-body.vhdl:3512$144 ($and).
Removed top 30 bits (of 32) from port A of cell xtea.$flatten\KEY_SCHEDULE_0.$verific$and_23$../vhdl_packages/vhdl_2008/src/numeric_std-body.vhdl:3512$144 ($and).
Removed top 1 bits (of 33) from port A of cell xtea.$flatten\KEY_SCHEDULE_0.$verific$sub_21$key_schedule.vhd:67$142 ($sub).
Removed top 1 bits (of 33) from port B of cell xtea.$flatten\KEY_SCHEDULE_0.$verific$sub_21$key_schedule.vhd:67$142 ($sub).
Removed top 1 bits (of 33) from port Y of cell xtea.$flatten\KEY_SCHEDULE_0.$verific$sub_21$key_schedule.vhd:67$142 ($sub).
Removed top 1 bits (of 22) from port A of cell xtea.$flatten\KEY_SCHEDULE_0.$verific$and_55$../vhdl_packages/vhdl_2008/src/numeric_std-body.vhdl:3512$134 ($and).
Removed top 20 bits (of 22) from port B of cell xtea.$flatten\KEY_SCHEDULE_0.$verific$and_55$../vhdl_packages/vhdl_2008/src/numeric_std-body.vhdl:3512$134 ($and).
Removed top 20 bits (of 22) from port Y of cell xtea.$flatten\KEY_SCHEDULE_0.$verific$and_55$../vhdl_packages/vhdl_2008/src/numeric_std-body.vhdl:3512$134 ($and).
Removed top 19 bits (of 21) from port A of cell xtea.$flatten\KEY_SCHEDULE_0.$verific$and_55$../vhdl_packages/vhdl_2008/src/numeric_std-body.vhdl:3512$134 ($and).
Removed top 1 bits (of 4) from port B of cell xtea.$auto$opt_dff.cc:195:make_patterns_logic$180 ($ne).
Removed top 5 bits (of 32) from port B of cell xtea.$flatten\ROUND_F_0.$verific$xor_5$round_f.vhd:38$172 ($xor).
Removed top 30 bits (of 32) from wire xtea.$flatten\KEY_SCHEDULE_0.$verific$n305$102.
Removed top 1 bits (of 33) from wire xtea.$flatten\KEY_SCHEDULE_0.$verific$n471$107.
Removed top 30 bits (of 32) from wire xtea.$flatten\KEY_SCHEDULE_0.$verific$n538$109.
Removed top 1 bits (of 32) from wire xtea.$flatten\KEY_SCHEDULE_0.$verific$n604$111.
Removed top 9 bits (of 32) from wire xtea.$flatten\KEY_SCHEDULE_0.$verific$n638$112.
Removed top 1 bits (of 33) from wire xtea.$verific$n589$21.
Removed top 1 bits (of 33) from wire xtea.$verific$n791$27.

yosys> peepopt

3.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.16. Executing PMUXTREE pass.

yosys> opt_clean

3.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..
Removed 0 unused cells and 12 unused wires.
<suppressed ~1 debug messages>

yosys> alumacc

3.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module xtea:
  creating $macc model for $flatten\KEY_SCHEDULE_0.$verific$add_19$key_schedule.vhd:66$141 ($add).
  creating $macc model for $flatten\KEY_SCHEDULE_0.$verific$add_26$key_schedule.vhd:69$148 ($add).
  creating $macc model for $flatten\KEY_SCHEDULE_0.$verific$add_28$key_schedule.vhd:70$150 ($add).
  creating $macc model for $flatten\KEY_SCHEDULE_0.$verific$sub_21$key_schedule.vhd:67$142 ($sub).
  creating $macc model for $flatten\ROUND_F_0.$verific$add_7$round_f.vhd:39$174 ($add).
  creating $macc model for $verific$add_25$xtea.vhd:88$64 ($add).
  creating $macc model for $verific$add_33$xtea.vhd:96$71 ($add).
  creating $macc model for $verific$add_7$../vhdl_packages/vhdl_2008/src/numeric_std-body.vhdl:482$50 ($add).
  creating $macc model for $verific$sub_27$xtea.vhd:90$65 ($sub).
  creating $macc model for $verific$sub_35$xtea.vhd:98$72 ($sub).
  creating $alu model for $macc $verific$sub_35$xtea.vhd:98$72.
  creating $alu model for $macc $verific$sub_27$xtea.vhd:90$65.
  creating $alu model for $macc $verific$add_7$../vhdl_packages/vhdl_2008/src/numeric_std-body.vhdl:482$50.
  creating $alu model for $macc $verific$add_33$xtea.vhd:96$71.
  creating $alu model for $macc $verific$add_25$xtea.vhd:88$64.
  creating $alu model for $macc $flatten\ROUND_F_0.$verific$add_7$round_f.vhd:39$174.
  creating $alu model for $macc $flatten\KEY_SCHEDULE_0.$verific$sub_21$key_schedule.vhd:67$142.
  creating $alu model for $macc $flatten\KEY_SCHEDULE_0.$verific$add_28$key_schedule.vhd:70$150.
  creating $alu model for $macc $flatten\KEY_SCHEDULE_0.$verific$add_26$key_schedule.vhd:69$148.
  creating $alu model for $macc $flatten\KEY_SCHEDULE_0.$verific$add_19$key_schedule.vhd:66$141.
  creating $alu cell for $flatten\KEY_SCHEDULE_0.$verific$add_19$key_schedule.vhd:66$141: $auto$alumacc.cc:485:replace_alu$218
  creating $alu cell for $flatten\KEY_SCHEDULE_0.$verific$add_26$key_schedule.vhd:69$148: $auto$alumacc.cc:485:replace_alu$221
  creating $alu cell for $flatten\KEY_SCHEDULE_0.$verific$add_28$key_schedule.vhd:70$150: $auto$alumacc.cc:485:replace_alu$224
  creating $alu cell for $flatten\KEY_SCHEDULE_0.$verific$sub_21$key_schedule.vhd:67$142: $auto$alumacc.cc:485:replace_alu$227
  creating $alu cell for $flatten\ROUND_F_0.$verific$add_7$round_f.vhd:39$174: $auto$alumacc.cc:485:replace_alu$230
  creating $alu cell for $verific$add_7$../vhdl_packages/vhdl_2008/src/numeric_std-body.vhdl:482$50: $auto$alumacc.cc:485:replace_alu$233
  creating $alu cell for $verific$add_25$xtea.vhd:88$64: $auto$alumacc.cc:485:replace_alu$236
  creating $alu cell for $verific$sub_27$xtea.vhd:90$65: $auto$alumacc.cc:485:replace_alu$239
  creating $alu cell for $verific$add_33$xtea.vhd:96$71: $auto$alumacc.cc:485:replace_alu$242
  creating $alu cell for $verific$sub_35$xtea.vhd:98$72: $auto$alumacc.cc:485:replace_alu$245
  created 10 $alu and 0 $macc cells.

yosys> opt

3.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

yosys> opt_merge -nomux

3.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce

3.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff

3.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..

yosys> opt_expr

3.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

3.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.20. Printing statistics.

=== xtea ===

   Number of wires:                103
   Number of wire bits:           2691
   Number of public wires:          32
   Number of public wire bits:    1002
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 60
     $alu                           10
     $and                            2
     $bmux                           2
     $dffe                           4
     $eq                             3
     $logic_not                      1
     $mux                           22
     $ne                             4
     $not                            1
     $reduce_and                     3
     $reduce_bool                    4
     $sdff                           1
     $sdffe                          1
     $xor                            2


yosys> memory -nomap

3.21. Executing MEMORY pass.

yosys> opt_mem

3.21.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.21.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.21.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.21.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.21.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..

yosys> memory_share

3.21.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.21.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.21.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..

yosys> memory_collect

3.21.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.22. Printing statistics.

=== xtea ===

   Number of wires:                103
   Number of wire bits:           2691
   Number of public wires:          32
   Number of public wire bits:    1002
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 60
     $alu                           10
     $and                            2
     $bmux                           2
     $dffe                           4
     $eq                             3
     $logic_not                      1
     $mux                           22
     $ne                             4
     $not                            1
     $reduce_and                     3
     $reduce_bool                    4
     $sdff                           1
     $sdffe                          1
     $xor                            2


yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..

yosys> stat

3.24. Printing statistics.

=== xtea ===

   Number of wires:                103
   Number of wire bits:           2691
   Number of public wires:          32
   Number of public wire bits:    1002
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 60
     $alu                           10
     $and                            2
     $bmux                           2
     $dffe                           4
     $eq                             3
     $logic_not                      1
     $mux                           22
     $ne                             4
     $not                            1
     $reduce_and                     3
     $reduce_bool                    4
     $sdff                           1
     $sdffe                          1
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.25. Executing TECHMAP pass (map to technology primitives).

3.25.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.25.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.25.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $dffe.
Using template $paramod$be80489e44a49c29884f59fd81c31ed03229cfc1\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $eq.
Using template $paramod$79fc87901d7fd8aaad689b5406671422f5fa25b9\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $sdff.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $sdffe.
Using template $paramod$fbc7873bff55778c0b3173955b7e4bce1d9d6834\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $xor.
Using template $paramod$175e67c02b86e96b1288b9dc100122520d7240d8\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~1092 debug messages>

yosys> stat

3.26. Printing statistics.

=== xtea ===

   Number of wires:                589
   Number of wire bits:          10875
   Number of public wires:          32
   Number of public wire bits:    1002
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2715
     $_AND_                        245
     $_DFFE_PP_                    128
     $_MUX_                       1200
     $_NOT_                        295
     $_OR_                         135
     $_SDFFE_PP0P_                  32
     $_SDFF_PP0_                     2
     $_XOR_                        454
     adder_carry                   224


yosys> opt

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.
<suppressed ~986 debug messages>

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
<suppressed ~408 debug messages>
Removed a total of 136 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $auto$ff.cc:262:slice$373 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [0], Q = \KEY_SCHEDULE_0.sum_s [0], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$374 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [1], Q = \KEY_SCHEDULE_0.sum_s [1], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$375 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [2], Q = \KEY_SCHEDULE_0.sum_s [2], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$376 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [3], Q = \KEY_SCHEDULE_0.sum_s [3], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$377 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [4], Q = \KEY_SCHEDULE_0.sum_s [4], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$378 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [5], Q = \KEY_SCHEDULE_0.sum_s [5], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$380 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [7], Q = \KEY_SCHEDULE_0.sum_s [7], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$381 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [8], Q = \KEY_SCHEDULE_0.sum_s [8], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$385 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [12], Q = \KEY_SCHEDULE_0.sum_s [12], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$388 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [15], Q = \KEY_SCHEDULE_0.sum_s [15], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$389 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [16], Q = \KEY_SCHEDULE_0.sum_s [16], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$394 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [21], Q = \KEY_SCHEDULE_0.sum_s [21], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$398 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [25], Q = \KEY_SCHEDULE_0.sum_s [25], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$401 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [28], Q = \KEY_SCHEDULE_0.sum_s [28], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$402 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [29], Q = \KEY_SCHEDULE_0.sum_s [29], rval = 1'0).
Adding SRST signal on $auto$ff.cc:262:slice$403 ($_DFFE_PP_) from module xtea (D = $flatten\KEY_SCHEDULE_0.$verific$n1269$123 [30], Q = \KEY_SCHEDULE_0.sum_s [30], rval = 1'0).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..
Removed 113 unused cells and 388 unused wires.
<suppressed ~114 debug messages>

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.
<suppressed ~1 debug messages>

3.27.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.27.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.27.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff

3.27.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..

yosys> opt_expr

3.27.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

3.27.16. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.
<suppressed ~288 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..
Removed 0 unused cells and 9 unused wires.
<suppressed ~1 debug messages>

3.28.5. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $auto$simplemap.cc:278:simplemap_mux$1162 in front of them:
        $auto$simplemap.cc:86:simplemap_bitop$2100
        $auto$simplemap.cc:86:simplemap_bitop$2435


yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.
<suppressed ~1 debug messages>

3.30.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.30.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1 debug messages>

yosys> opt_reduce -full

3.30.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.30.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_share

3.30.14. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.15. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..

yosys> opt_expr -full

3.30.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

3.30.18. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.31. Executing ABC pass (technology mapping using ABC).

3.31.1. Summary of detected clock domains:
  8 cells in clk=\clk, en={ }, arst={ }, srst=\rst
  135 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$201, arst={ }, srst={ }
  266 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$192, arst={ }, srst={ }
  305 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$205, arst={ }, srst={ }
  301 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$185, arst={ }, srst={ }
  343 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$205, arst={ }, srst=\rst
  225 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$209, arst={ }, srst=\rst

3.31.2. Extracting gate netlist of module `\xtea' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, synchronously reset by \rst
Extracted 8 gates and 8 wires to a netlist network with 0 inputs and 3 outputs.

3.31.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.2.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:        2
ABC RESULTS:               NOT cells:        1
ABC RESULTS:                OR cells:        1
ABC RESULTS:             ORNOT cells:        2
ABC RESULTS:               XOR cells:        1
ABC RESULTS:        internal signals:        5
ABC RESULTS:           input signals:        0
ABC RESULTS:          output signals:        3
Removing temp directory.

3.31.3. Extracting gate netlist of module `\xtea' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$201
Extracted 126 gates and 197 wires to a netlist network with 71 inputs and 64 outputs.

3.31.3.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: Warning: 32 registers in this network have don't-care init values.
ABC: The don't-care are assumed to be 0. The result may not verify.
ABC: Use command "print_latch" to see the init values of registers.
ABC: Use command "zero" to convert or "init" to change the values.
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.3.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       32
ABC RESULTS:               NOR cells:        2
ABC RESULTS:                OR cells:        2
ABC RESULTS:               AND cells:        2
ABC RESULTS:              NAND cells:        3
ABC RESULTS:               XOR cells:       54
ABC RESULTS:               MUX cells:       32
ABC RESULTS:               BUF cells:        7
ABC RESULTS:        internal signals:       62
ABC RESULTS:           input signals:       71
ABC RESULTS:          output signals:       64
Removing temp directory.

3.31.4. Extracting gate netlist of module `\xtea' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$192
Extracted 202 gates and 397 wires to a netlist network with 195 inputs and 95 outputs.

3.31.4.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: Warning: 32 registers in this network have don't-care init values.
ABC: The don't-care are assumed to be 0. The result may not verify.
ABC: Use command "print_latch" to see the init values of registers.
ABC: Use command "zero" to convert or "init" to change the values.
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.4.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       32
ABC RESULTS:               NOT cells:        1
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:               XOR cells:       64
ABC RESULTS:               NOR cells:        2
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:                OR cells:        2
ABC RESULTS:               AND cells:        4
ABC RESULTS:              NAND cells:        9
ABC RESULTS:               MUX cells:       95
ABC RESULTS:               BUF cells:       32
ABC RESULTS:        internal signals:      107
ABC RESULTS:           input signals:      195
ABC RESULTS:          output signals:       95
Removing temp directory.

3.31.5. Extracting gate netlist of module `\xtea' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$205
Extracted 290 gates and 493 wires to a netlist network with 203 inputs and 149 outputs.

3.31.5.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: Warning: 16 registers in this network have don't-care init values.
ABC: The don't-care are assumed to be 0. The result may not verify.
ABC: Use command "print_latch" to see the init values of registers.
ABC: Use command "zero" to convert or "init" to change the values.
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.5.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       16
ABC RESULTS:               NOT cells:       14
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:            ANDNOT cells:        8
ABC RESULTS:               NOR cells:        6
ABC RESULTS:               XOR cells:       35
ABC RESULTS:                OR cells:       13
ABC RESULTS:              NAND cells:        7
ABC RESULTS:               AND cells:       33
ABC RESULTS:              XNOR cells:       13
ABC RESULTS:               MUX cells:       93
ABC RESULTS:               BUF cells:       15
ABC RESULTS:        internal signals:      141
ABC RESULTS:           input signals:      203
ABC RESULTS:          output signals:      149
Removing temp directory.

3.31.6. Extracting gate netlist of module `\xtea' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$185
Extracted 237 gates and 402 wires to a netlist network with 165 inputs and 126 outputs.

3.31.6.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: Warning: 32 registers in this network have don't-care init values.
ABC: The don't-care are assumed to be 0. The result may not verify.
ABC: Use command "print_latch" to see the init values of registers.
ABC: Use command "zero" to convert or "init" to change the values.
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.6.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       32
ABC RESULTS:               NOT cells:       63
ABC RESULTS:             ORNOT cells:        1
ABC RESULTS:            ANDNOT cells:        1
ABC RESULTS:              XNOR cells:        2
ABC RESULTS:                OR cells:        6
ABC RESULTS:               AND cells:        5
ABC RESULTS:               XOR cells:       31
ABC RESULTS:               NOR cells:        2
ABC RESULTS:               MUX cells:       95
ABC RESULTS:              NAND cells:        5
ABC RESULTS:               BUF cells:       32
ABC RESULTS:        internal signals:      111
ABC RESULTS:           input signals:      165
ABC RESULTS:          output signals:      126
Removing temp directory.

3.31.7. Extracting gate netlist of module `\xtea' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$3589$auto$opt_dff.cc:194:make_patterns_logic$205, synchronously reset by \rst
Extracted 325 gates and 557 wires to a netlist network with 232 inputs and 130 outputs.

3.31.7.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.7.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       16
ABC RESULTS:               NOT cells:       23
ABC RESULTS:               XOR cells:       10
ABC RESULTS:            ANDNOT cells:        3
ABC RESULTS:               NOR cells:        2
ABC RESULTS:              NAND cells:       13
ABC RESULTS:                OR cells:       20
ABC RESULTS:               AND cells:       29
ABC RESULTS:               MUX cells:      141
ABC RESULTS:              XNOR cells:       33
ABC RESULTS:               BUF cells:       15
ABC RESULTS:        internal signals:      195
ABC RESULTS:           input signals:      232
ABC RESULTS:          output signals:      130
Removing temp directory.

3.31.8. Extracting gate netlist of module `\xtea' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$209, synchronously reset by \rst
Extracted 170 gates and 275 wires to a netlist network with 105 inputs and 35 outputs.

3.31.8.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

3.31.8.2. Re-integrating ABC results.
ABC RESULTS:               DFF cells:       32
ABC RESULTS:               NOT cells:        2
ABC RESULTS:              NAND cells:        1
ABC RESULTS:              XNOR cells:        5
ABC RESULTS:               XOR cells:       34
ABC RESULTS:               MUX cells:       33
ABC RESULTS:        internal signals:      135
ABC RESULTS:           input signals:      105
ABC RESULTS:          output signals:       35
Removing temp directory.

yosys> abc -script /tmp/yosys_jQiVUM/abc_tmp_1.scr

3.32. Executing ABC pass (technology mapping using ABC).

3.32.1. Extracting gate netlist of module `\xtea' to `<abc-temp-dir>/input.blif'..
Extracted 1063 gates and 1637 wires to a netlist network with 574 inputs and 431 outputs.

3.32.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /tmp/yosys_jQiVUM/abc_tmp_1.scr 
ABC:   #Luts =   501  Max Lvl =  10  Avg Lvl =   1.57  [   0.30 sec. at Pass 0]
ABC:   #Luts =   501  Max Lvl =  10  Avg Lvl =   1.57  [   3.15 sec. at Pass 1]
ABC:   #Luts =   500  Max Lvl =  11  Avg Lvl =   1.59  [   0.87 sec. at Pass 2]
ABC:   #Luts =   495  Max Lvl =  10  Avg Lvl =   1.58  [   2.12 sec. at Pass 3]
ABC:   #Luts =   495  Max Lvl =  10  Avg Lvl =   1.58  [   1.20 sec. at Pass 4]
ABC:   #Luts =   492  Max Lvl =  10  Avg Lvl =   1.57  [   3.33 sec. at Pass 5]
ABC:   #Luts =   491  Max Lvl =   9  Avg Lvl =   1.54  [   1.74 sec. at Pass 6]
ABC:   #Luts =   491  Max Lvl =   9  Avg Lvl =   1.54  [   4.47 sec. at Pass 7]
ABC:   #Luts =   491  Max Lvl =   9  Avg Lvl =   1.54  [   1.78 sec. at Pass 8]
ABC:   #Luts =   491  Max Lvl =   9  Avg Lvl =   1.54  [   4.15 sec. at Pass 9]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.32.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      491
ABC RESULTS:        internal signals:      632
ABC RESULTS:           input signals:      574
ABC RESULTS:          output signals:      431
Removing temp directory.

yosys> opt

3.33. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.33.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

yosys> opt_merge -nomux

3.33.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.33.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1 debug messages>

yosys> opt_reduce

3.33.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.33.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff

3.33.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.33.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..
Removed 0 unused cells and 3256 unused wires.
<suppressed ~8 debug messages>

yosys> opt_expr

3.33.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

3.33.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.33.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1 debug messages>

yosys> opt_reduce

3.33.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.33.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff

3.33.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.33.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..

yosys> opt_expr

3.33.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

3.33.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

3.34. Printing statistics.

=== xtea ===

   Number of wires:                342
   Number of wire bits:           1844
   Number of public wires:          25
   Number of public wire bits:     838
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                877
     $_DFFE_PP_                    112
     $_SDFFE_PP0P_                  48
     $_SDFF_PP0_                     2
     $lut                          490
     $mux                            1
     adder_carry                   224


yosys> shregmap -minlen 8 -maxlen 20

3.35. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.36. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.37. Printing statistics.

=== xtea ===

   Number of wires:                440
   Number of wire bits:           1942
   Number of public wires:          25
   Number of public wire bits:     838
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                975
     $_DFFE_PP0P_                  112
     $_DFF_P_                       50
     $_MUX_                         98
     $lut                          490
     $mux                            1
     adder_carry                   224


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.38. Executing TECHMAP pass (map to technology primitives).

3.38.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.38.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.38.3. Continuing TECHMAP pass.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $mux.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using extmapper simplemap for cells of type $lut.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~901 debug messages>

yosys> opt_expr -mux_undef

3.39. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.
<suppressed ~10286 debug messages>

yosys> simplemap

3.40. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

yosys> opt_merge

3.42. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
<suppressed ~825 debug messages>
Removed a total of 275 cells.

yosys> opt_dff -nodffe -nosdff

3.43. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.44. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..
Removed 0 unused cells and 1997 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.45. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.45.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.
<suppressed ~29 debug messages>

yosys> opt_merge -nomux

3.45.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_muxtree

3.45.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.45.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.45.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..
Removed 0 unused cells and 8 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.45.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

3.45.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.45.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.45.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.45.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.45.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.45.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..

yosys> opt_expr

3.45.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

3.45.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /tmp/yosys_jQiVUM/abc_tmp_2.scr

3.46. Executing ABC pass (technology mapping using ABC).

3.46.1. Extracting gate netlist of module `\xtea' to `<abc-temp-dir>/input.blif'..
Extracted 1565 gates and 2140 wires to a netlist network with 573 inputs and 429 outputs.

3.46.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /tmp/yosys_jQiVUM/abc_tmp_2.scr 
ABC:   #Luts =   502  Max Lvl =  10  Avg Lvl =   1.61  [   0.29 sec. at Pass 0]
ABC:   #Luts =   500  Max Lvl =   9  Avg Lvl =   1.74  [   2.81 sec. at Pass 1]
ABC:   #Luts =   500  Max Lvl =   9  Avg Lvl =   1.74  [   0.87 sec. at Pass 2]
ABC:   #Luts =   500  Max Lvl =   9  Avg Lvl =   1.74  [   3.63 sec. at Pass 3]
ABC:   #Luts =   499  Max Lvl =   9  Avg Lvl =   1.74  [   1.21 sec. at Pass 4]
ABC:   #Luts =   499  Max Lvl =   9  Avg Lvl =   1.74  [   2.73 sec. at Pass 5]
ABC:   #Luts =   497  Max Lvl =   8  Avg Lvl =   1.72  [   1.27 sec. at Pass 6]
ABC:   #Luts =   497  Max Lvl =   8  Avg Lvl =   1.72  [   2.69 sec. at Pass 7]
ABC:   #Luts =   497  Max Lvl =   8  Avg Lvl =   1.72  [   1.57 sec. at Pass 8]
ABC:   #Luts =   496  Max Lvl =   8  Avg Lvl =   1.71  [   5.09 sec. at Pass 9]
ABC:   #Luts =   496  Max Lvl =   8  Avg Lvl =   1.71  [   1.58 sec. at Pass 10]
ABC:   #Luts =   496  Max Lvl =   8  Avg Lvl =   1.71  [   4.07 sec. at Pass 11]
ABC:   #Luts =   496  Max Lvl =   8  Avg Lvl =   1.71  [   1.45 sec. at Pass 12]
ABC: + write_blif <abc-temp-dir>/output.blif 

3.46.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:      496
ABC RESULTS:        internal signals:     1138
ABC RESULTS:           input signals:      573
ABC RESULTS:          output signals:      429
Removing temp directory.

yosys> opt

3.47. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.47.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

yosys> opt_merge -nomux

3.47.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.47.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.47.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.47.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff

3.47.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..
Removed 0 unused cells and 1745 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.47.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

3.47.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.47.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xtea..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.47.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xtea.
Performed a total of 0 changes.

yosys> opt_merge

3.47.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xtea'.
Removed a total of 0 cells.

yosys> opt_dff

3.47.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..

yosys> opt_expr

3.47.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module xtea.

3.47.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.48. Executing HIERARCHY pass (managing design hierarchy).

3.48.1. Analyzing design hierarchy..
Top module:  \xtea

3.48.2. Analyzing design hierarchy..
Top module:  \xtea
Removed 0 unused modules.

yosys> stat

3.49. Printing statistics.

=== xtea ===

   Number of wires:                346
   Number of wire bits:           1817
   Number of public wires:          25
   Number of public wire bits:     838
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                881
     $lut                          495
     adder_carry                   224
     dffsre                        162


yosys> opt_clean -purge

3.50. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xtea..
Removed 0 unused cells and 14 unused wires.
<suppressed ~14 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.51. Executing Verilog backend.

yosys> bmuxmap

3.51.1. Executing BMUXMAP pass.

yosys> demuxmap

3.51.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\xtea'.

End of script. Logfile hash: af9b0b15b7, CPU: user 6.15s system 0.13s, MEM: 42.52 MB peak
Yosys 0.16+65 (git sha1 91803ad5c, gcc 9.1.0 -fPIC -Os)
Time spent: 97% 3x abc (260 sec), 0% 33x opt_expr (2 sec), ...
real 72.87
user 231.25
sys 34.99
