
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.140
 Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl AsyncMux.vhd counter.vhd keyupd.vhd kody.vhd pLayer.vhd Reg.vhd slayer.vhd PresentEnc.vhd PresentStateMachine.vhd

yosys> verific -vhdl AsyncMux.vhd counter.vhd keyupd.vhd kody.vhd pLayer.vhd Reg.vhd slayer.vhd PresentEnc.vhd PresentStateMachine.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Sep22_SW_Release, released at Fri Sep 30 20:01:32 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'AsyncMux.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_1164' from file '/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_1164.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.textio' from file '/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/textio.vdb'
VERIFIC-INFO [VHDL-1012] AsyncMux.vhd:55: analyzing entity 'asyncmux'
VERIFIC-INFO [VHDL-1010] AsyncMux.vhd:67: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'counter.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_unsigned' from file '/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_unsigned.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_arith' from file '/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_arith.vdb'
VERIFIC-INFO [VHDL-1012] counter.vhd:48: analyzing entity 'counter'
VERIFIC-INFO [VHDL-1010] counter.vhd:58: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'keyupd.vhd'
VERIFIC-INFO [VHDL-1012] keyupd.vhd:52: analyzing entity 'keyupd'
VERIFIC-INFO [VHDL-1010] keyupd.vhd:64: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'kody.vhd'
VERIFIC-INFO [VHDL-1014] kody.vhd:52: analyzing package 'kody'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'pLayer.vhd'
VERIFIC-INFO [VHDL-1012] pLayer.vhd:51: analyzing entity 'player'
VERIFIC-INFO [VHDL-1010] pLayer.vhd:59: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'Reg.vhd'
VERIFIC-INFO [VHDL-1012] Reg.vhd:55: analyzing entity 'reg'
VERIFIC-INFO [VHDL-1010] Reg.vhd:66: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'slayer.vhd'
VERIFIC-INFO [VHDL-1012] slayer.vhd:51: analyzing entity 'slayer'
VERIFIC-INFO [VHDL-1010] slayer.vhd:61: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'PresentEnc.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.numeric_std' from file '/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/numeric_std.vdb'
VERIFIC-INFO [VHDL-1012] PresentEnc.vhd:51: analyzing entity 'presentenc'
VERIFIC-INFO [VHDL-1010] PresentEnc.vhd:69: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'PresentStateMachine.vhd'
VERIFIC-INFO [VHDL-1012] PresentStateMachine.vhd:51: analyzing entity 'presentstatemachine'
VERIFIC-INFO [VHDL-1010] PresentStateMachine.vhd:62: analyzing architecture 'behavioral'

yosys> synth_rs -top PresentEnc -tech genesis2 -goal area -de -verilog synthesized.v

3. Executing synth_rs pass: v0.4.116

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis2/cells_sim.v +/rapidsilicon/genesis2/dsp_sim.v +/rapidsilicon/genesis2/brams_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dff'.
Generating RTLIL representation for module `\dffn'.
Generating RTLIL representation for module `\sdff'.
Generating RTLIL representation for module `\sdffn'.
Generating RTLIL representation for module `\dffr'.
Generating RTLIL representation for module `\dffnr'.
Generating RTLIL representation for module `\dffe'.
Generating RTLIL representation for module `\dffne'.
Generating RTLIL representation for module `\sdffre'.
Generating RTLIL representation for module `\sdffnre'.
Generating RTLIL representation for module `\dffre'.
Generating RTLIL representation for module `\dffnre'.
Generating RTLIL representation for module `\latch'.
Generating RTLIL representation for module `\latchn'.
Generating RTLIL representation for module `\latchr'.
Generating RTLIL representation for module `\latchnr'.
Generating RTLIL representation for module `\fa_1bit'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP'.
Generating RTLIL representation for module `\RS_DSP_MULT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Successfully finished Verilog frontend.

3.4. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_sim.v' to AST representation.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\RS_TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top PresentEnc

3.5. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] PresentEnc.vhd:51: processing 'PresentEnc(Behavioral)'
VERIFIC-INFO [VHDL-1067] AsyncMux.vhd:55: processing 'AsyncMux(Behavioral)'
VERIFIC-INFO [VHDL-1067] Reg.vhd:55: processing 'Reg(Behavioral)'
VERIFIC-INFO [VHDL-1067] AsyncMux.vhd:55: processing 'AsyncMux(width=80)(Behavioral)'
VERIFIC-INFO [VHDL-1067] Reg.vhd:55: processing 'Reg(width=80)(Behavioral)'
VERIFIC-INFO [VHDL-1067] slayer.vhd:51: processing 'slayer(Behavioral)'
VERIFIC-INFO [VHDL-1067] pLayer.vhd:51: processing 'pLayer(Behavioral)'
VERIFIC-INFO [VHDL-1067] keyupd.vhd:52: processing 'keyupd(Behavioral)'
VERIFIC-INFO [VHDL-1067] PresentStateMachine.vhd:51: processing 'PresentStateMachine(Behavioral)'
VERIFIC-INFO [VHDL-1067] counter.vhd:48: processing 'counter(Behavioral)'
Importing module PresentEnc.
Importing module AsyncMux(Behavioral).
Importing module AsyncMux(width=80)(Behavioral).
Importing module PresentStateMachine(Behavioral).
Importing module Reg(Behavioral).
Importing module Reg(width=80)(Behavioral).
Importing module counter(Behavioral).
Importing module keyupd(Behavioral).
Importing module pLayer(Behavioral).
Importing module slayer(Behavioral).

3.5.1. Analyzing design hierarchy..
Top module:  \PresentEnc
Used module:     \counter(Behavioral)
Used module:     \PresentStateMachine(Behavioral)
Used module:     \keyupd(Behavioral)
Used module:         \slayer(Behavioral)
Used module:     \pLayer(Behavioral)
Used module:     \Reg(width=80)(Behavioral)
Used module:     \AsyncMux(width=80)(Behavioral)
Used module:     \Reg(Behavioral)
Used module:     \AsyncMux(Behavioral)

3.5.2. Analyzing design hierarchy..
Top module:  \PresentEnc
Used module:     \counter(Behavioral)
Used module:     \PresentStateMachine(Behavioral)
Used module:     \keyupd(Behavioral)
Used module:         \slayer(Behavioral)
Used module:     \pLayer(Behavioral)
Used module:     \Reg(width=80)(Behavioral)
Used module:     \AsyncMux(width=80)(Behavioral)
Used module:     \Reg(Behavioral)
Used module:     \AsyncMux(Behavioral)
Removed 0 unused modules.

yosys> proc

3.6. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.6.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.6.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.6.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.6.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.6.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.6.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.6.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.6.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.6.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.6.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.6.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.6.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module slayer(Behavioral).
<suppressed ~1 debug messages>
Optimizing module pLayer(Behavioral).
Optimizing module keyupd(Behavioral).
Optimizing module counter(Behavioral).
<suppressed ~1 debug messages>
Optimizing module Reg(width=80)(Behavioral).
<suppressed ~1 debug messages>
Optimizing module Reg(Behavioral).
<suppressed ~1 debug messages>
Optimizing module PresentStateMachine(Behavioral).
<suppressed ~5 debug messages>
Optimizing module AsyncMux(width=80)(Behavioral).
Optimizing module AsyncMux(Behavioral).
Optimizing module PresentEnc.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module AsyncMux(Behavioral).
Deleting now unused module AsyncMux(width=80)(Behavioral).
Deleting now unused module PresentStateMachine(Behavioral).
Deleting now unused module Reg(Behavioral).
Deleting now unused module Reg(width=80)(Behavioral).
Deleting now unused module counter(Behavioral).
Deleting now unused module keyupd(Behavioral).
Deleting now unused module pLayer(Behavioral).
Deleting now unused module slayer(Behavioral).
<suppressed ~25 debug messages>

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 272 unused cells and 540 unused wires.
<suppressed ~359 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module PresentEnc...
Found and reported 0 problems.

yosys> opt_expr

3.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge -nomux

3.16. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

3.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.20. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.21. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\regText.$verific$reg_reg$Reg.vhd:79$136 ($aldff) from module PresentEnc.
Changing const-value async load to async reset on $flatten\regKey.$verific$reg_reg$Reg.vhd:79$146 ($aldff) from module PresentEnc.
Changing const-value async load to async reset on $flatten\count.$verific$cnt_reg$counter.vhd:69$160 ($aldff) from module PresentEnc.
Changing const-value async load to async reset on $flatten\SM.$verific$state_reg$PresentStateMachine.vhd:126$126 ($aldff) from module PresentEnc.

yosys> opt_clean

3.22. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.24. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.24.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.24.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.24.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> fsm_opt

3.24.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.24.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.24.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.24.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge -nomux

3.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

3.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.30. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.31. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\regText.$verific$reg_reg$Reg.vhd:79$136 ($adff) from module PresentEnc (D = \mux_64.output, Q = \regText.reg).
Adding EN signal on $flatten\regKey.$verific$reg_reg$Reg.vhd:79$146 ($adff) from module PresentEnc (D = \mux_80.output, Q = \regKey.reg).
Adding EN signal on $flatten\count.$verific$cnt_reg$counter.vhd:69$160 ($adff) from module PresentEnc (D = $flatten\count.$verific$n11$151, Q = \count.cnt).

yosys> opt_clean

3.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 3 unused cells and 3 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_muxtree

3.34. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce

3.35. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.36. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.37. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.38. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.39. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> opt_expr

3.40. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 2

yosys> wreduce -keepdc

3.41. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 4 bits (of 5) from port B of cell PresentEnc.$flatten\count.$verific$add_4$counter.vhd:67$157 ($add).

yosys> peepopt

3.42. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.43. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> demuxmap

3.44. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> stat

3.45. Printing statistics.

=== PresentEnc ===

   Number of wires:               1196
   Number of wire bits:           3307
   Number of public wires:          97
   Number of public wire bits:    2199
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1177
     $add                            1
     $adff                           1
     $adffe                          3
     $bmux                           4
     $eq                           239
     $logic_not                     18
     $mux                          892
     $not                           17
     $xor                            2


yosys> wreduce t:$mul

3.46. Executing WREDUCE pass (reducing word size of cells).

yosys> rs_dsp_macc -genesis2 -max_dsp 154

3.47. Executing RS_DSP_MACC pass.

yosys> techmap -map +/mul2dsp_check_maxwidth.v -D DSP_A_MAXWIDTH=20 -D DSP_B_MAXWIDTH=18 -D DSP_A_MINWIDTH=11 -D DSP_B_MINWIDTH=10 -D DSP_NAME=$__RS_MUL20X18 a:valid_map

3.48. Executing TECHMAP pass (map to technology primitives).

3.48.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp_check_maxwidth.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

3.48.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> stat

3.49. Printing statistics.

=== PresentEnc ===

   Number of wires:               1196
   Number of wire bits:           3307
   Number of public wires:          97
   Number of public wire bits:    2199
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1177
     $add                            1
     $adff                           1
     $adffe                          3
     $bmux                           4
     $eq                           239
     $logic_not                     18
     $mux                          892
     $not                           17
     $xor                            2


yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/rapidsilicon/genesis2/dsp_map.v -D USE_DSP_CFG_PARAMS=0

3.50. Executing TECHMAP pass (map to technology primitives).

3.50.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_MUL20X18'.
Successfully finished Verilog frontend.

3.50.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/dsp_final_map.v

3.51. Executing TECHMAP pass (map to technology primitives).

3.51.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/dsp_final_map.v' to AST representation.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Successfully finished Verilog frontend.

3.51.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> rs-pack-dsp-regs

3.52. Executing rs_pack_dsp_regs pass.

yosys> rs_dsp_io_regs

3.53. Executing RS_DSP_IO_REGS pass.

yosys> alumacc

3.54. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module PresentEnc:
  creating $macc model for $flatten\count.$verific$add_4$counter.vhd:67$157 ($add).
  creating $alu model for $macc $flatten\count.$verific$add_4$counter.vhd:67$157.
  creating $alu cell for $flatten\count.$verific$add_4$counter.vhd:67$157: $auto$alumacc.cc:485:replace_alu$354
  created 1 $alu and 0 $macc cells.

yosys> opt_expr

3.55. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge -nomux

3.56. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.57. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce

3.58. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.59. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.60. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.61. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.62. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> opt_expr

3.63. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 1

yosys> stat

3.64. Printing statistics.

=== PresentEnc ===

   Number of wires:               1198
   Number of wire bits:           3317
   Number of public wires:          97
   Number of public wire bits:    2199
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1177
     $adff                           1
     $adffe                          3
     $alu                            1
     $bmux                           4
     $eq                           239
     $logic_not                     18
     $mux                          892
     $not                           17
     $xor                            2


yosys> memory -nomap

3.65. Executing MEMORY pass.

yosys> opt_mem

3.65.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.65.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.65.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.65.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.65.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.65.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> memory_share

3.65.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.65.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.65.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> memory_collect

3.65.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.66. Printing statistics.

=== PresentEnc ===

   Number of wires:               1198
   Number of wire bits:           3317
   Number of public wires:          97
   Number of public wire bits:    2199
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1177
     $adff                           1
     $adffe                          3
     $alu                            1
     $bmux                           4
     $eq                           239
     $logic_not                     18
     $mux                          892
     $not                           17
     $xor                            2


yosys> muxpack

3.67. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting PresentEnc.$flatten\SM.$verific$mux_23$PresentStateMachine.vhd:100$113 ... PresentEnc.$flatten\SM.$verific$mux_24$PresentStateMachine.vhd:100$114 to a pmux with 2 cases.
Converting PresentEnc.$flatten\mixer.\s1.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\mixer.\s1.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\mixer.\s1.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\mixer.\s1.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\mixer.\s1.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\mixer.\s1.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\mixer.\s1.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\mixer.\s1.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[0].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[0].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[0].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[0].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[0].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[0].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[0].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[0].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[10].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[10].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[10].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[10].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[10].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[10].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[10].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[10].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[11].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[11].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[11].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[11].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[11].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[11].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[11].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[11].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[12].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[12].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[12].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[12].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[12].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[12].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[12].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[12].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[13].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[13].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[13].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[13].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[13].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[13].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[13].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[13].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[14].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[14].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[14].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[14].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[14].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[14].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[14].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[14].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[15].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[15].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[15].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[15].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[15].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[15].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[15].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[15].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[1].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[1].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[1].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[1].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[1].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[1].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[1].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[1].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[2].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[2].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[2].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[2].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[2].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[2].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[2].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[2].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[3].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[3].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[3].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[3].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[3].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[3].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[3].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[3].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[4].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[4].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[4].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[4].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[4].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[4].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[4].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[4].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[5].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[5].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[5].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[5].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[5].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[5].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[5].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[5].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[6].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[6].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[6].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[6].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[6].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[6].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[6].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[6].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[7].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[7].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[7].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[7].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[7].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[7].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[7].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[7].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[8].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[8].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[8].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[8].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[8].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[8].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[8].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[8].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[9].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[9].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[9].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[9].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[9].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[9].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[9].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[9].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converted 886 (p)mux cells into 69 pmux cells.
<suppressed ~891 debug messages>

yosys> opt_clean

3.68. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 817 unused wires.
<suppressed ~1 debug messages>

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new_swap.txt -limit 150 a:read_swapped

3.69. Executing MEMORY_LIBMAP pass (mapping memories to cells).

yosys> memory_libmap -lib +/rapidsilicon/genesis2/brams_new.txt -limit 150

3.70. Executing MEMORY_LIBMAP pass (mapping memories to cells).

yosys> rs_bram_split -new_mapping

3.71. Executing Rs_BRAM_Split pass.

yosys> techmap -autoproc -map +/rapidsilicon/genesis2/brams_map_new.v

3.72. Executing TECHMAP pass (map to technology primitives).

3.72.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_map_new.v' to AST representation.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_SDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_SDP'.
Successfully finished Verilog frontend.

3.72.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~6 debug messages>

yosys> techmap -map +/rapidsilicon/genesis2/brams_final_map_new.v

3.73. Executing TECHMAP pass (map to technology primitives).

3.73.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/brams_final_map_new.v' to AST representation.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Successfully finished Verilog frontend.

3.73.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> pmuxtree

3.74. Executing PMUXTREE pass.

yosys> muxpack

3.75. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$3049 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$3051 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2889 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2891 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2729 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2731 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2569 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2571 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2409 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2411 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2249 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2251 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2089 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2091 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1929 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1931 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1769 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1771 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1609 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1611 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1449 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1451 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1289 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1291 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1129 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1131 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$969 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$971 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$809 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$811 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$649 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$651 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$489 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$491 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$377 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$379 to a pmux with 2 cases.
Converted 36 (p)mux cells into 18 pmux cells.
<suppressed ~550 debug messages>

yosys> memory_map

3.76. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.77. Printing statistics.

=== PresentEnc ===

   Number of wires:               1745
   Number of wire bits:           3865
   Number of public wires:          97
   Number of public wire bits:    2199
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1637
     $adff                           1
     $adffe                          3
     $alu                            1
     $bmux                           4
     $eq                           239
     $logic_not                     18
     $mux                          856
     $not                           86
     $or                           136
     $pmux                          18
     $reduce_or                    273
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/arith_map.v

3.78. Executing TECHMAP pass (map to technology primitives).

3.78.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.78.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.78.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $reduce_or.
Using template $paramod$c5c783b17ab1d780abfad8cfe6563a0a7b47a3b0\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $logic_not.
Using template $paramod$521ce43182eecb9f60c72393a788160d2c356bf5\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $adffe.
Using template $paramod$672a140277c71df8314410f22acc08d55222c3c7\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $bmux.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $and.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000101 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
No more expansions possible.
<suppressed ~2062 debug messages>

yosys> stat

3.79. Printing statistics.

=== PresentEnc ===

   Number of wires:               3716
   Number of wire bits:           8671
   Number of public wires:          97
   Number of public wire bits:    2199
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               4873
     $_AND_                         50
     $_DFFE_PP0P_                  149
     $_DFF_PP0_                      2
     $_MUX_                       1042
     $_NOT_                        348
     $_OR_                        2245
     $_XOR_                       1037


yosys> opt_expr

3.80. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
<suppressed ~1779 debug messages>

yosys> opt_merge -nomux

3.81. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
<suppressed ~5229 debug messages>
Removed a total of 1743 cells.

yosys> opt_muxtree

3.82. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.83. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.84. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.85. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.86. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.87. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 359 unused cells and 2643 unused wires.
<suppressed ~360 debug messages>

yosys> opt_expr

3.88. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_muxtree

3.89. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.90. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.91. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.92. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.93. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.94. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> opt_expr

3.95. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.96. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
<suppressed ~78 debug messages>

yosys> techmap -map +/techmap.v

3.97. Executing TECHMAP pass (map to technology primitives).

3.97.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.97.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> stat

3.98. Printing statistics.

=== PresentEnc ===

   Number of wires:               1555
   Number of wire bits:           4025
   Number of public wires:          97
   Number of public wire bits:    2199
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1981
     $_AND_                         44
     $_DFFE_PP0P_                  149
     $_DFF_PP0_                      2
     $_MUX_                        541
     $_NOT_                        347
     $_OR_                         825
     $_XOR_                         73


yosys> dfflegalize -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 t:$_SDFFCE_*

3.99. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.100. Printing statistics.

=== PresentEnc ===

   Number of wires:               1555
   Number of wire bits:           4025
   Number of public wires:          97
   Number of public wire bits:    2199
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1981
     $_AND_                         44
     $_DFFE_PP0P_                  149
     $_DFF_PP0_                      2
     $_MUX_                        541
     $_NOT_                        347
     $_OR_                         825
     $_XOR_                         73


yosys> opt_expr

3.101. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge -nomux

3.102. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.103. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.104. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.105. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -sat

3.106. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.107. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 2 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.108. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 1

yosys> abc -dff -keepff

3.109. Executing ABC pass (technology mapping using ABC).

3.109.1. Summary of detected clock domains:
  20 cells in clk=\clk, en={ }, arst=\reset, srst={ }
  1961 cells in clk=\clk, en=\SM.RegEn, arst=\reset, srst={ }

3.109.2. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 20 gates and 29 wires to a netlist network with 7 inputs and 3 outputs.

3.109.2.1. Executing ABC.

3.109.3. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \SM.RegEn, asynchronously reset by \reset
Extracted 1961 gates and 2110 wires to a netlist network with 147 inputs and 220 outputs.

3.109.3.1. Executing ABC.

yosys> abc -dff -keepff

3.110. Executing ABC pass (technology mapping using ABC).

3.110.1. Summary of detected clock domains:
  17 cells in clk=\clk, en={ }, arst=\reset, srst={ }
  949 cells in clk=\clk, en=$abc$11593$SM.RegEn, arst=\reset, srst={ }

3.110.2. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 17 gates and 25 wires to a netlist network with 8 inputs and 4 outputs.

3.110.2.1. Executing ABC.

3.110.3. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12545$abc$11577$SM.state[0], asynchronously reset by \reset
Extracted 949 gates and 1095 wires to a netlist network with 146 inputs and 220 outputs.

3.110.3.1. Executing ABC.

yosys> abc -dff -keepff

3.111. Executing ABC pass (technology mapping using ABC).

3.111.1. Summary of detected clock domains:
  14 cells in clk=\clk, en={ }, arst=\reset, srst={ }
  888 cells in clk=\clk, en=$abc$12545$abc$11577$SM.state[0], arst=\reset, srst={ }

3.111.2. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 14 gates and 22 wires to a netlist network with 8 inputs and 3 outputs.

3.111.2.1. Executing ABC.

3.111.3. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$13450$abc$12545$abc$11577$SM.state[0], asynchronously reset by \reset
Extracted 888 gates and 1034 wires to a netlist network with 146 inputs and 220 outputs.

3.111.3.1. Executing ABC.

yosys> abc -dff -keepff

3.112. Executing ABC pass (technology mapping using ABC).

3.112.1. Summary of detected clock domains:
  14 cells in clk=\clk, en={ }, arst=\reset, srst={ }
  930 cells in clk=\clk, en=$abc$13450$abc$12545$abc$11577$SM.state[0], arst=\reset, srst={ }

3.112.2. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 14 gates and 22 wires to a netlist network with 8 inputs and 3 outputs.

3.112.2.1. Executing ABC.

3.112.3. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$14396$abc$13450$abc$12545$abc$11577$SM.state[0], asynchronously reset by \reset
Extracted 930 gates and 1076 wires to a netlist network with 146 inputs and 220 outputs.

3.112.3.1. Executing ABC.

yosys> opt_ffinv

3.113. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
<suppressed ~13 debug messages>

yosys> opt_merge -nomux

3.115. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.116. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.117. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.118. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.119. Executing OPT_SHARE pass.

yosys> opt_dff -sat

3.120. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.121. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 4656 unused wires.
<suppressed ~9 debug messages>

yosys> opt_expr

3.122. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.123. Executing BMUXMAP pass.

yosys> demuxmap

3.124. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_lCw1Wt/abc_tmp_1.scr

3.125. Executing ABC pass (technology mapping using ABC).

3.125.1. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Extracted 802 gates and 1098 wires to a netlist network with 296 inputs and 215 outputs.

3.125.1.1. Executing ABC.
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   1.07 sec. at Pass 0]{firstMap}[1]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.95 sec. at Pass 1]{initMapFlow}[2]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.28 sec. at Pass 2]{map}[2]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.47 sec. at Pass 3]{postMap}[6]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.60 sec. at Pass 4]{map}[12]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.37 sec. at Pass 5]{postMap}[16]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.41 sec. at Pass 6]{pushMap}[16]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.47 sec. at Pass 7]{finalMap}[16]

yosys> opt_expr

3.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge -nomux

3.127. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.128. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.129. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.130. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.131. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.132. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.133. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 1098 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.134. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.135. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.136. Printing statistics.

=== PresentEnc ===

   Number of wires:                696
   Number of wire bits:           2612
   Number of public wires:          89
   Number of public wire bits:    2001
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                369
     $_DFFE_PP0P_                  149
     $_DFF_PP0_                      2
     $lut                          218


yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFFE_??_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_SDFF_???_ 0 -cell $_SDFFE_????_ 0 -cell $_DLATCH_?_ 0 -cell $_DLATCH_???_ 0

3.137. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.138. Printing statistics.

=== PresentEnc ===

   Number of wires:                696
   Number of wire bits:           2612
   Number of public wires:          89
   Number of public wire bits:    2001
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                369
     $_DFFE_PP0P_                  149
     $_DFF_PP0_                      2
     $lut                          218


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis2/ffs_map.v

3.139. Executing TECHMAP pass (map to technology primitives).

3.139.1. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.139.2. Executing Verilog-2005 frontend: /nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v
Parsing Verilog input from `/nfs_project/github_runner/yosys_verific_rs_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis2/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Generating RTLIL representation for module `\$_SDFFE_PP0P_'.
Generating RTLIL representation for module `\$_SDFFE_PP0N_'.
Generating RTLIL representation for module `\$_SDFFE_PN0P_'.
Generating RTLIL representation for module `\$_SDFFE_PN0N_'.
Generating RTLIL representation for module `\$_SDFFE_PP1P_'.
Generating RTLIL representation for module `\$_SDFFE_PP1N_'.
Generating RTLIL representation for module `\$_SDFFE_PN1P_'.
Generating RTLIL representation for module `\$_SDFFE_PN1N_'.
Generating RTLIL representation for module `\$_SDFFE_NP0P_'.
Generating RTLIL representation for module `\$_SDFFE_NP0N_'.
Generating RTLIL representation for module `\$_SDFFE_NN0P_'.
Generating RTLIL representation for module `\$_SDFFE_NN0N_'.
Generating RTLIL representation for module `\$_SDFFE_NP1P_'.
Generating RTLIL representation for module `\$_SDFFE_NP1N_'.
Generating RTLIL representation for module `\$_SDFFE_NN1P_'.
Generating RTLIL representation for module `\$_SDFFE_NN1N_'.
Generating RTLIL representation for module `\$_DLATCH_P_'.
Generating RTLIL representation for module `\$_DLATCH_N_'.
Generating RTLIL representation for module `\$_DLATCH_PP0_'.
Generating RTLIL representation for module `\$_DLATCH_NP0_'.
Generating RTLIL representation for module `\$_DLATCH_PN0_'.
Generating RTLIL representation for module `\$_DLATCH_NN0_'.
Generating RTLIL representation for module `\$_DLATCH_PP1_'.
Generating RTLIL representation for module `\$_DLATCH_NP1_'.
Generating RTLIL representation for module `\$_DLATCH_PN1_'.
Generating RTLIL representation for module `\$_DLATCH_NN1_'.
Successfully finished Verilog frontend.

3.139.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
No more expansions possible.
<suppressed ~504 debug messages>

yosys> opt_expr -mux_undef

3.140. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
<suppressed ~5881 debug messages>

yosys> simplemap

3.141. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.142. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge

3.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
<suppressed ~762 debug messages>
Removed a total of 254 cells.

yosys> opt_dff -nodffe -nosdff

3.144. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.145. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 1151 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.146. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
<suppressed ~17 debug messages>

yosys> opt_merge -nomux

3.147. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.148. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.149. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.151. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.152. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.153. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> opt_expr

3.154. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_lCw1Wt/abc_tmp_2.scr

3.155. Executing ABC pass (technology mapping using ABC).

3.155.1. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Extracted 1044 gates and 1342 wires to a netlist network with 296 inputs and 215 outputs.

3.155.1.1. Executing ABC.
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.31 sec. at Pass 0]{firstMap}[1]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   1.73 sec. at Pass 1]{initMapFlow}[2]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.48 sec. at Pass 2]{map}[2]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.38 sec. at Pass 3]{postMap}[6]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.73 sec. at Pass 4]{map}[12]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.69 sec. at Pass 5]{postMap}[16]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   1.06 sec. at Pass 6]{pushMap}[16]
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.58 sec. at Pass 7]{finalMap}[16]

yosys> opt_expr

3.156. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge -nomux

3.157. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.158. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.159. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.160. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.161. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe

3.162. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.163. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 1073 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.164. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.165. Executing HIERARCHY pass (managing design hierarchy).

3.165.1. Analyzing design hierarchy..
Top module:  \PresentEnc

3.165.2. Analyzing design hierarchy..
Top module:  \PresentEnc
Removed 0 unused modules.

yosys> stat

3.166. Printing statistics.

=== PresentEnc ===

   Number of wires:                696
   Number of wire bits:           2612
   Number of public wires:          89
   Number of public wire bits:    2001
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                369
     $lut                          218
     dffr                            2
     dffre                         149


yosys> opt_clean -purge

3.167. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 77 unused wires.
<suppressed ~77 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.168. Executing Verilog backend.
Dumping module `\PresentEnc'.

End of script. Logfile hash: f95f1a6b47, CPU: user 4.71s system 0.09s, MEM: 40.89 MB peak
Yosys 0.18+10 (git sha1 92b23013e, gcc 11.2.0 -fPIC -Os)
Time spent: 90% 6x abc (40 sec), 2% 27x opt_expr (1 sec), ...
real 24.57
user 35.24
sys 9.25
