
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.14+36 (git sha1 15a4e900b, gcc 7.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k cf_rca_16.v

yosys> verific -vlog2k cf_rca_16.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Jan22_SW_Release, released at Sat Jan 29 02:42:49 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'cf_rca_16.v'

yosys> synth_rs -top top -tech generic -goal area -no_dsp -no_bram -verilog top.verilog

3. Executing synth_rs pass.

yosys> hierarchy -check -top top

3.1. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] cf_rca_16.v:75: compiling module 'top'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:100: compiling module 'cf_rca_16_1'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5965: compiling module 'cf_rca_16_38'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5646: compiling module 'cf_rca_16_32'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5701: compiling module 'cf_rca_16_33'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5756: compiling module 'cf_rca_16_34'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5811: compiling module 'cf_rca_16_35'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5866: compiling module 'cf_rca_16_36'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5916: compiling module 'cf_rca_16_37'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:165: compiling module 'cf_rca_16_2'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3129: compiling module 'cf_rca_16_22'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3273: compiling module 'cf_rca_16_23'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3405: compiling module 'cf_rca_16_24'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3525: compiling module 'cf_rca_16_25'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3633: compiling module 'cf_rca_16_26'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3729: compiling module 'cf_rca_16_27'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3813: compiling module 'cf_rca_16_28'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:4745: compiling module 'cf_rca_16_30'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:5599: compiling module 'cf_rca_16_31'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:3891: compiling module 'cf_rca_16_29'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:342: compiling module 'cf_rca_16_3'
VERIFIC-INFO [VERI-1018] cf_rca_16.v:516: compiling module 'cf_rca_16_4'
VERIFIC-WARNING [VDB-1002] cf_rca_16.v:576: net 's23_1[15]' does not have a driver
VERIFIC-WARNING [VDB-1002] cf_rca_16.v:577: net 's23_2[15]' does not have a driver
VERIFIC-WARNING [VDB-1002] cf_rca_16.v:578: net 's23_3[12]' does not have a driver
VERIFIC-WARNING [VDB-1002] cf_rca_16.v:579: net 's23_4[12]' does not have a driver
Importing module top.
Importing module cf_rca_16_1.
Importing module cf_rca_16_38.
Importing module cf_rca_16_32.
Importing module cf_rca_16_2.
Importing module cf_rca_16_33.
Importing module cf_rca_16_34.
Importing module cf_rca_16_35.
Importing module cf_rca_16_36.
Importing module cf_rca_16_37.
Importing module cf_rca_16_22.
Importing module cf_rca_16_23.
Importing module cf_rca_16_3.
Importing module cf_rca_16_24.
Importing module cf_rca_16_25.
Importing module cf_rca_16_26.
Importing module cf_rca_16_27.
Importing module cf_rca_16_28.
Importing module cf_rca_16_30.
Importing module cf_rca_16_29.
Importing module cf_rca_16_31.
Importing module cf_rca_16_4.

3.1.1. Analyzing design hierarchy..
Top module:  \top
Used module:     \cf_rca_16_1
Used module:         \cf_rca_16_2
Used module:             \cf_rca_16_3
Used module:                 \cf_rca_16_4
Used module:                     \cf_rca_16_29
Used module:                         \cf_rca_16_31
Used module:                     \cf_rca_16_22
Used module:                         \cf_rca_16_23
Used module:                             \cf_rca_16_24
Used module:                                 \cf_rca_16_25
Used module:                                     \cf_rca_16_26
Used module:                                         \cf_rca_16_27
Used module:                                             \cf_rca_16_28
Used module:                                                 \cf_rca_16_30
Used module:                     \cf_rca_16_32
Used module:                         \cf_rca_16_33
Used module:                             \cf_rca_16_34
Used module:                                 \cf_rca_16_35
Used module:                                     \cf_rca_16_36
Used module:                                         \cf_rca_16_37
Used module:                     \cf_rca_16_38

3.1.2. Analyzing design hierarchy..
Top module:  \top
Used module:     \cf_rca_16_1
Used module:         \cf_rca_16_2
Used module:             \cf_rca_16_3
Used module:                 \cf_rca_16_4
Used module:                     \cf_rca_16_29
Used module:                         \cf_rca_16_31
Used module:                     \cf_rca_16_22
Used module:                         \cf_rca_16_23
Used module:                             \cf_rca_16_24
Used module:                                 \cf_rca_16_25
Used module:                                     \cf_rca_16_26
Used module:                                         \cf_rca_16_27
Used module:                                             \cf_rca_16_28
Used module:                                                 \cf_rca_16_30
Used module:                     \cf_rca_16_32
Used module:                         \cf_rca_16_33
Used module:                             \cf_rca_16_34
Used module:                                 \cf_rca_16_35
Used module:                                     \cf_rca_16_36
Used module:                                         \cf_rca_16_37
Used module:                     \cf_rca_16_38
Removed 0 unused modules.

yosys> proc

3.2. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.2.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.2.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.2.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.2.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.2.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

3.2.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.2.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.2.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.2.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.2.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.2.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_rca_16_4.
<suppressed ~1 debug messages>
Optimizing module cf_rca_16_31.
<suppressed ~6 debug messages>
Optimizing module cf_rca_16_29.
<suppressed ~8 debug messages>
Optimizing module cf_rca_16_30.
<suppressed ~8 debug messages>
Optimizing module cf_rca_16_28.
Optimizing module cf_rca_16_27.
Optimizing module cf_rca_16_26.
Optimizing module cf_rca_16_25.
Optimizing module cf_rca_16_24.
Optimizing module cf_rca_16_3.
<suppressed ~1 debug messages>
Optimizing module cf_rca_16_23.
Optimizing module cf_rca_16_22.
Optimizing module cf_rca_16_37.
<suppressed ~6 debug messages>
Optimizing module cf_rca_16_36.
<suppressed ~5 debug messages>
Optimizing module cf_rca_16_35.
<suppressed ~5 debug messages>
Optimizing module cf_rca_16_34.
<suppressed ~5 debug messages>
Optimizing module cf_rca_16_33.
<suppressed ~5 debug messages>
Optimizing module cf_rca_16_2.
<suppressed ~1 debug messages>
Optimizing module cf_rca_16_32.
<suppressed ~6 debug messages>
Optimizing module cf_rca_16_38.
<suppressed ~32 debug messages>
Optimizing module cf_rca_16_1.
<suppressed ~1 debug messages>
Optimizing module top.

yosys> flatten

3.3. Executing FLATTEN pass (flatten design).
Deleting now unused module cf_rca_16_4.
Deleting now unused module cf_rca_16_31.
Deleting now unused module cf_rca_16_29.
Deleting now unused module cf_rca_16_30.
Deleting now unused module cf_rca_16_28.
Deleting now unused module cf_rca_16_27.
Deleting now unused module cf_rca_16_26.
Deleting now unused module cf_rca_16_25.
Deleting now unused module cf_rca_16_24.
Deleting now unused module cf_rca_16_3.
Deleting now unused module cf_rca_16_23.
Deleting now unused module cf_rca_16_22.
Deleting now unused module cf_rca_16_37.
Deleting now unused module cf_rca_16_36.
Deleting now unused module cf_rca_16_35.
Deleting now unused module cf_rca_16_34.
Deleting now unused module cf_rca_16_33.
Deleting now unused module cf_rca_16_2.
Deleting now unused module cf_rca_16_32.
Deleting now unused module cf_rca_16_38.
Deleting now unused module cf_rca_16_1.
<suppressed ~46 debug messages>

yosys> tribuf -logic

3.4. Executing TRIBUF pass.

yosys> opt_expr

3.5. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_clean

3.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 16 unused cells and 19486 unused wires.
<suppressed ~16059 debug messages>

yosys> check

3.7. Executing CHECK pass (checking for obvious problems).
Checking module top...
Warning: Wire top.\west_o [15] is used but has no driver.
Warning: Wire top.\west_o [14] is used but has no driver.
Warning: Wire top.\west_o [13] is used but has no driver.
Warning: Wire top.\west_o [12] is used but has no driver.
Warning: Wire top.\west_o [11] is used but has no driver.
Warning: Wire top.\west_o [10] is used but has no driver.
Warning: Wire top.\west_o [9] is used but has no driver.
Warning: Wire top.\west_o [8] is used but has no driver.
Warning: Wire top.\west_o [7] is used but has no driver.
Warning: Wire top.\west_o [6] is used but has no driver.
Warning: Wire top.\west_o [5] is used but has no driver.
Warning: Wire top.\west_o [4] is used but has no driver.
Warning: Wire top.\west_o [3] is used but has no driver.
Warning: Wire top.\south_o [15] is used but has no driver.
Warning: Wire top.\south_o [14] is used but has no driver.
Warning: Wire top.\south_o [13] is used but has no driver.
Warning: Wire top.\south_o [12] is used but has no driver.
Warning: Wire top.\south_o [11] is used but has no driver.
Warning: Wire top.\south_o [10] is used but has no driver.
Warning: Wire top.\south_o [9] is used but has no driver.
Warning: Wire top.\south_o [8] is used but has no driver.
Warning: Wire top.\south_o [7] is used but has no driver.
Warning: Wire top.\south_o [6] is used but has no driver.
Warning: Wire top.\south_o [5] is used but has no driver.
Warning: Wire top.\south_o [4] is used but has no driver.
Warning: Wire top.\south_o [3] is used but has no driver.
Warning: Wire top.\south_o [2] is used but has no driver.
Warning: Wire top.\south_o [1] is used but has no driver.
Warning: Wire top.\south_o [0] is used but has no driver.
Warning: Wire top.\east_o [15] is used but has no driver.
Warning: Wire top.\east_o [14] is used but has no driver.
Warning: Wire top.\east_o [13] is used but has no driver.
Warning: Wire top.\east_o [12] is used but has no driver.
Warning: Wire top.\east_o [11] is used but has no driver.
Warning: Wire top.\east_o [10] is used but has no driver.
Warning: Wire top.\east_o [9] is used but has no driver.
Warning: Wire top.\east_o [8] is used but has no driver.
Warning: Wire top.\east_o [7] is used but has no driver.
Warning: Wire top.\east_o [6] is used but has no driver.
Warning: Wire top.\east_o [5] is used but has no driver.
Warning: Wire top.\east_o [4] is used but has no driver.
Warning: Wire top.\east_o [3] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n15 is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [0] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [1] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [2] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [3] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [4] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [5] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [6] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [7] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [8] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [9] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [10] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [11] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [12] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [13] is used but has no driver.
Warning: Wire top.\s1.s10.s23.s23.n16 [14] is used but has no driver.
Found and reported 58 problems.

yosys> deminout

3.8. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt -nodffe -nosdff

3.9. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.9.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~960 debug messages>

yosys> opt_merge -nomux

3.9.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.9.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1188 debug messages>

yosys> opt_reduce

3.9.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.9.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.9.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n32_reg$cf_rca_16.v:5161$5403 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n25_reg$cf_rca_16.v:5136$5394 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n18_reg$cf_rca_16.v:5111$5385 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n11_reg$cf_rca_16.v:5086$5376 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s22.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s22.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s22.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s22.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n32_reg$cf_rca_16.v:5161$5403 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n11_reg$cf_rca_16.v:5086$5376 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n25_reg$cf_rca_16.v:5136$5394 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n18_reg$cf_rca_16.v:5111$5385 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n32_reg$cf_rca_16.v:5161$5403 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n25_reg$cf_rca_16.v:5136$5394 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n18_reg$cf_rca_16.v:5111$5385 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n11_reg$cf_rca_16.v:5086$5376 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s22.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s22.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s22.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s22.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($aldff) from module top.
Removing never-active async load on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($aldff) from module top.

yosys> opt_clean

3.9.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 1037 unused wires.
<suppressed ~78 debug messages>

yosys> opt_expr

3.9.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.9.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.9.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1188 debug messages>

yosys> opt_reduce

3.9.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.9.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.9.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.9.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.9.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.9.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

3.10. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.10.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.10.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.10.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.10.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> fsm_opt

3.10.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode

3.10.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.10.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.10.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1188 debug messages>

yosys> opt_reduce

3.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.11.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s22.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s22.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s22.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s22.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s22.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s22.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s22.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s22.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s22.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s21.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s21.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s21.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s21.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n32_reg$cf_rca_16.v:5161$5403 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s20.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n25_reg$cf_rca_16.v:5136$5394 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s20.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n18_reg$cf_rca_16.v:5111$5385 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s20.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n11_reg$cf_rca_16.v:5086$5376 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s23.s21.s17.s17.s17.s17.s17.s17.s20.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s22.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s22.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s22.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s22.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s22.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s22.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s22.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s22.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s22.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s22.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s22.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s22.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s21.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s21.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s21.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s21.n11).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n32_reg$cf_rca_16.v:5161$5403 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s20.n32).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n25_reg$cf_rca_16.v:5136$5394 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s20.n25).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n18_reg$cf_rca_16.v:5111$5385 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s20.n18).
Adding EN signal on $flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n11_reg$cf_rca_16.v:5086$5376 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s23.s21.s17.s17.s17.s17.s17.s17.s20.n11).
Adding EN signal on $flatten\s1.\s10.\s22.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s22.n32).
Adding EN signal on $flatten\s1.\s10.\s22.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s22.n25).
Adding EN signal on $flatten\s1.\s10.\s22.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s22.n18).
Adding EN signal on $flatten\s1.\s10.\s22.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s22.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s19.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s19.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s19.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s19.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s18.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s18.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s18.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s18.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s22.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s22.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s22.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s22.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n32_reg$cf_rca_16.v:4307$6055 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s21.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n25_reg$cf_rca_16.v:4282$6046 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s21.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n18_reg$cf_rca_16.v:4257$6037 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s21.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.$verific$n11_reg$cf_rca_16.v:4232$6028 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s21.n11).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n32_reg$cf_rca_16.v:5161$5403 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s20.n32).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n25_reg$cf_rca_16.v:5136$5394 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s20.n25).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n18_reg$cf_rca_16.v:5111$5385 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s20.n18).
Adding EN signal on $flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.$verific$n11_reg$cf_rca_16.v:5086$5376 ($dff) from module top (D = \config_data_i, Q = \s1.s10.s21.s17.s17.s17.s17.s17.s17.s20.n11).

yosys> opt_clean

3.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 192 unused cells and 192 unused wires.
<suppressed ~193 debug messages>

yosys> opt_expr

3.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.11.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~996 debug messages>

yosys> opt_reduce

3.11.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.11.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.11.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.11.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.11.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.11.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.12. Executing WREDUCE pass (reducing word size of cells).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.$verific$equal_4$cf_rca_16.v:5738$2160 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.$verific$equal_7$cf_rca_16.v:5740$2163 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.$verific$equal_10$cf_rca_16.v:5742$2166 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.$verific$equal_13$cf_rca_16.v:5744$2169 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.$verific$equal_16$cf_rca_16.v:5746$2172 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.\s16.\s16.$verific$equal_4$cf_rca_16.v:5848$2826 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.\s16.$verific$equal_16$cf_rca_16.v:5801$2505 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.\s16.$verific$equal_13$cf_rca_16.v:5799$2502 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.\s16.$verific$equal_10$cf_rca_16.v:5797$2499 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.\s16.$verific$equal_7$cf_rca_16.v:5795$2496 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.\s16.\s16.$verific$equal_4$cf_rca_16.v:5793$2493 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.$verific$equal_16$cf_rca_16.v:5691$963 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.$verific$equal_13$cf_rca_16.v:5689$960 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.$verific$equal_10$cf_rca_16.v:5687$957 ($eq).
Removed top 4 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s20.$verific$equal_7$cf_rca_16.v:5685$954 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s21.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s22.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s22.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s22.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.$verific$equal_4$cf_rca_16.v:5738$2160 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.$verific$equal_7$cf_rca_16.v:5740$2163 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.$verific$equal_10$cf_rca_16.v:5742$2166 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.$verific$equal_13$cf_rca_16.v:5744$2169 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.$verific$equal_16$cf_rca_16.v:5746$2172 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.\s16.\s16.$verific$equal_4$cf_rca_16.v:5848$2826 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.\s16.$verific$equal_16$cf_rca_16.v:5801$2505 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.\s16.$verific$equal_13$cf_rca_16.v:5799$2502 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.\s16.$verific$equal_10$cf_rca_16.v:5797$2499 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.\s16.$verific$equal_7$cf_rca_16.v:5795$2496 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.\s16.\s16.$verific$equal_4$cf_rca_16.v:5793$2493 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.$verific$equal_16$cf_rca_16.v:5691$963 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.$verific$equal_13$cf_rca_16.v:5689$960 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.$verific$equal_10$cf_rca_16.v:5687$957 ($eq).
Removed top 4 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s20.$verific$equal_7$cf_rca_16.v:5685$954 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7267 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7271 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7283 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7287 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7299 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7303 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7315 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7319 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7323 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7311 ($dffe).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7307 ($dffe).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7295 ($dffe).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7291 ($dffe).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7279 ($dffe).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s21.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7275 ($dffe).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s22.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s22.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s23.\s22.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 18) from FF cell top.$auto$ff.cc:262:slice$7263 ($dffe).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s22.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s22.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s22.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s20.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s21.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s17.\s17.\s22.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s17.\s17.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s18.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s18.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s18.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 2 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s19.\s310.$verific$equal_4$cf_rca_16.v:5626$6522 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s19.\s310.$verific$equal_7$cf_rca_16.v:5628$6525 ($eq).
Removed top 1 bits (of 3) from port B of cell top.$flatten\s1.\s10.\s23.\s21.\s19.\s310.$verific$equal_10$cf_rca_16.v:5630$6528 ($eq).
Removed top 4 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.$verific$equal_7$cf_rca_16.v:5685$954 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.$verific$equal_10$cf_rca_16.v:5687$957 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.$verific$equal_13$cf_rca_16.v:5689$960 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.$verific$equal_16$cf_rca_16.v:5691$963 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.\s16.$verific$equal_4$cf_rca_16.v:5793$2493 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.\s16.$verific$equal_7$cf_rca_16.v:5795$2496 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.\s16.$verific$equal_10$cf_rca_16.v:5797$2499 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.\s16.$verific$equal_13$cf_rca_16.v:5799$2502 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.\s16.$verific$equal_16$cf_rca_16.v:5801$2505 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.\s16.\s16.$verific$equal_4$cf_rca_16.v:5848$2826 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.$verific$equal_16$cf_rca_16.v:5746$2172 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.$verific$equal_13$cf_rca_16.v:5744$2169 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.$verific$equal_10$cf_rca_16.v:5742$2166 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.$verific$equal_7$cf_rca_16.v:5740$2163 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s10.\s23.\s20.\s16.$verific$equal_4$cf_rca_16.v:5738$2160 ($eq).
Removed top 4 bits (of 5) from port B of cell top.$flatten\s1.\s9.$verific$equal_7$cf_rca_16.v:5685$954 ($eq).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s9.$verific$equal_10$cf_rca_16.v:5687$957 ($eq).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.$verific$mux_26$cf_rca_16.v:5696$973 ($mux).
Removed top 3 bits (of 5) from port B of cell top.$flatten\s1.\s9.$verific$equal_13$cf_rca_16.v:5689$960 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s9.$verific$equal_16$cf_rca_16.v:5691$963 ($eq).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.$verific$mux_24$cf_rca_16.v:5695$971 ($mux).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.\s16.$verific$equal_4$cf_rca_16.v:5793$2493 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.\s16.$verific$equal_7$cf_rca_16.v:5795$2496 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.\s16.$verific$equal_10$cf_rca_16.v:5797$2499 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.\s16.$verific$equal_13$cf_rca_16.v:5799$2502 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.\s16.$verific$equal_16$cf_rca_16.v:5801$2505 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.\s16.\s16.$verific$equal_4$cf_rca_16.v:5848$2826 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.$verific$equal_16$cf_rca_16.v:5746$2172 ($eq).
Removed top 1 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.$verific$equal_13$cf_rca_16.v:5744$2169 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.$verific$equal_10$cf_rca_16.v:5742$2166 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.$verific$equal_7$cf_rca_16.v:5740$2163 ($eq).
Removed top 2 bits (of 5) from port B of cell top.$flatten\s1.\s9.\s16.$verific$equal_4$cf_rca_16.v:5738$2160 ($eq).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.$verific$mux_22$cf_rca_16.v:5694$969 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.$verific$mux_20$cf_rca_16.v:5693$967 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.$verific$mux_18$cf_rca_16.v:5692$965 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.$verific$mux_26$cf_rca_16.v:5751$2182 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.$verific$mux_24$cf_rca_16.v:5750$2180 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.$verific$mux_22$cf_rca_16.v:5749$2178 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.$verific$mux_20$cf_rca_16.v:5748$2176 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.$verific$mux_18$cf_rca_16.v:5747$2174 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.$verific$mux_26$cf_rca_16.v:5806$2515 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.$verific$mux_24$cf_rca_16.v:5805$2513 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.$verific$mux_22$cf_rca_16.v:5804$2511 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.$verific$mux_20$cf_rca_16.v:5803$2509 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.$verific$mux_18$cf_rca_16.v:5802$2507 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.$verific$mux_26$cf_rca_16.v:5861$2848 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.$verific$mux_24$cf_rca_16.v:5860$2846 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.$verific$mux_22$cf_rca_16.v:5859$2844 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.$verific$mux_20$cf_rca_16.v:5858$2842 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.$verific$mux_18$cf_rca_16.v:5857$2840 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.$verific$mux_26$cf_rca_16.v:5911$3101 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.$verific$mux_24$cf_rca_16.v:5910$3099 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.$verific$mux_22$cf_rca_16.v:5909$3097 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.$verific$mux_20$cf_rca_16.v:5908$3095 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.$verific$mux_18$cf_rca_16.v:5907$3093 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.\s16.$verific$mux_31$cf_rca_16.v:5961$3281 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.\s16.$verific$mux_29$cf_rca_16.v:5960$3279 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.\s16.$verific$mux_27$cf_rca_16.v:5959$3277 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.\s16.$verific$mux_25$cf_rca_16.v:5958$3275 ($mux).
Removed top 13 bits (of 16) from mux cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.\s16.$verific$mux_23$cf_rca_16.v:5957$3273 ($mux).
Removed cell top.$flatten\s1.\s9.\s16.\s16.\s16.\s16.\s16.$verific$mux_21$cf_rca_16.v:5956$3271 ($mux).

yosys> peepopt

3.13. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

3.14. Executing PMUXTREE pass.

yosys> opt_clean

3.15. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 1 unused cells and 1 unused wires.
<suppressed ~2 debug messages>

yosys> techmap

3.16. Executing TECHMAP pass (map to technology primitives).

3.16.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.16.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $dff.
No more expansions possible.
<suppressed ~7117 debug messages>

yosys> alumacc

3.17. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module top:
  created 0 $alu and 0 $macc cells.

yosys> opt

3.18. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.18.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~4927 debug messages>

yosys> opt_merge -nomux

3.18.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~4533 debug messages>
Removed a total of 1511 cells.

yosys> opt_muxtree

3.18.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.18.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.18.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.18.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 278 unused cells and 2343 unused wires.
<suppressed ~546 debug messages>

yosys> opt_expr

3.18.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.18.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.18.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.18.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.18.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.18.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.18.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.18.16. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

3.19. Executing MEMORY pass.

yosys> opt_mem

3.19.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.19.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.19.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

3.19.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.19.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_share

3.19.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.19.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.19.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_collect

3.19.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

3.20. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr -mux_undef

3.21. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> simplemap

3.22. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.24. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.25. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.26. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt -nodffe -nosdff

3.27. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.27.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.27.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.27.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.27.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.27.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.27.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.27.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.27.9. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

3.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~2257 debug messages>

yosys> opt_merge

3.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~45 debug messages>
Removed a total of 15 cells.

yosys> opt_dff

3.28.3. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$14530 ($_DFF_P_) from module top.

yosys> opt_clean

3.28.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

3.28.5. Rerunning OPT passes. (Removed registers in this run.)

yosys> opt_expr -full

3.28.6. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.28.7. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.28.8. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.28.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

3.28.10. Finished fast OPT passes.

yosys> memory_map

3.29. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

3.30. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.30.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.30.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.30.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

3.30.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.30.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.30.6. Executing OPT_SHARE pass.

yosys> opt_dff

3.30.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr -full

3.30.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.30.10. Finished OPT passes. (There is nothing left to do.)

yosys> techmap

3.31. Executing TECHMAP pass (map to technology primitives).

3.31.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.31.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt

3.32. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.32.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.32.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.32.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.32.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.32.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.32.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.32.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.32.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

3.33. Executing ABC pass (technology mapping using ABC).

3.33.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 8490 gates and 12310 wires to a netlist network with 3819 inputs and 560 outputs.

3.33.1.1. Executing ABC.
Running ABC command: /home/users/aram/Workspace/yosys_verific_rs/logic_synthesis-rs/abc-rs/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/yosys_verific_rs/result_09-03-2022T20-36-44/All_lut_synth_rs_area.json/cf_rca_16/abc_tmp.scr 
ABC: netlist  : i/o =   3819/    560  and =   17824  lev =   14 (10.87)  mem = 0.33 MB
ABC: Mapping (K=6)  :  lut =   2487  edge =   12839  lev =    5 (3.63)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17824  lev =   14 (10.86)  mem = 0.33 MB
ABC: Mapping (K=6)  :  lut =   2487  edge =   12839  lev =    5 (3.63)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17440  lev =   14 (10.86)  mem = 0.32 MB
ABC: Mapping (K=6)  :  lut =   2743  edge =   13223  lev =    5 (3.63)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17248  lev =   14 (10.11)  mem = 0.32 MB
ABC: Mapping (K=6)  :  lut =   2541  edge =   12920  lev =    5 (3.63)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17824  lev =   14 (10.86)  mem = 0.33 MB
ABC: Mapping (K=6)  :  lut =   2487  edge =   12839  lev =    5 (3.63)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17359  lev =   14 (10.86)  mem = 0.40 MB
ABC: Mapping (K=6)  :  lut =   2507  edge =   12925  lev =    6 (3.66)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17572  lev =   14 (10.86)  mem = 0.41 MB
ABC: Mapping (K=6)  :  lut =   2497  edge =   12895  lev =    6 (3.64)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17353  lev =   14 (10.86)  mem = 0.40 MB
ABC: Mapping (K=6)  :  lut =   2505  edge =   12925  lev =    6 (3.65)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17248  lev =   14 (10.32)  mem = 0.40 MB
ABC: Mapping (K=6)  :  lut =   2487  edge =   12839  lev =    5 (3.63)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17296  lev =   14 (10.86)  mem = 0.40 MB
ABC: Mapping (K=6)  :  lut =   2506  edge =   12933  lev =    6 (3.65)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17425  lev =   14 (10.86)  mem = 0.41 MB
ABC: Mapping (K=6)  :  lut =   2495  edge =   12894  lev =    6 (3.63)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17824  lev =   14 (10.86)  mem = 0.41 MB
ABC: Mapping (K=6)  :  lut =   2487  edge =   12839  lev =    5 (3.63)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17824  lev =   14 (10.86)  mem = 0.41 MB
ABC: Mapping (K=6)  :  lut =   2487  edge =   12839  lev =    5 (3.63)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17824  lev =   14 (10.87)  mem = 0.33 MB
ABC: Mapping (K=6)  :  lut =   2487  edge =   12839  lev =    5 (3.63)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17824  lev =   14 (10.87)  mem = 0.41 MB
ABC: Mapping (K=6)  :  lut =   2487  edge =   12839  lev =    5 (3.63)  mem = 0.15 MB
ABC: netlist  : i/o =   3819/    560  and =   17824  lev =   14 (10.87)  mem = 0.33 MB
ABC: Mapping (K=6)  :  lut =   2487  edge =   12839  lev =    5 (3.63)  mem = 0.15 MB
ABC: + write_blif <abc-temp-dir>/output.blif 

3.33.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:     2487
ABC RESULTS:        internal signals:     7931
ABC RESULTS:           input signals:     3819
ABC RESULTS:          output signals:      560
Removing temp directory.

yosys> opt

3.34. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.34.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.34.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.34.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.34.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.34.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.34.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.34.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 12098 unused wires.
<suppressed ~7213 debug messages>

yosys> opt_expr

3.34.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.34.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.34.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.34.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.34.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff

3.34.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.34.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.34.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

3.34.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

3.35. Executing HIERARCHY pass (managing design hierarchy).

3.35.1. Analyzing design hierarchy..
Top module:  \top

3.35.2. Analyzing design hierarchy..
Top module:  \top
Removed 0 unused modules.

yosys> stat

3.36. Printing statistics.

=== top ===

   Number of wires:              13245
   Number of wire bits:          41181
   Number of public wires:       11318
   Number of public wire bits:   39254
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               6295
     $_DFFE_PP_                   3440
     $_DFF_P_                      368
     $lut                         2487


yosys> opt_clean -purge

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 6937 unused wires.
<suppressed ~6937 debug messages>

yosys> write_verilog -noattr -nohex top.verilog

3.38. Executing Verilog backend.

yosys> bmuxmap

3.38.1. Executing BMUXMAP pass.

yosys> demuxmap

3.38.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\top'.

Warnings: 62 unique messages, 62 total
End of script. Logfile hash: 9a9b0c7aee, CPU: user 42.82s system 0.58s, MEM: 277.24 MB peak
Yosys 0.14+36 (git sha1 15a4e900b, gcc 7.1.0 -fPIC -Os)
Time spent: 45% 1x abc (36 sec), 14% 21x opt_clean (11 sec), ...
